{"entries":[{"date":{"d":1,"m":12,"y":1995},"datev":19951201,"first":{"value":null},"images":3,"info":{"content":"<p>Work required someone to be a doctor and patient. Luckily for them I had that in my locker. Bit weird having pictures taken of you on an operating table!<\/p><img src='images\\years\\1995\\1995_12_XX-01-MartinArmstrongs.jpg' class='diaryImage' alt='Doctor Gay' \/><p class='diaryImageCaption'>Doctor Gay<\/p><img src='images\\years\\1995\\1995_XX_XX-02-ArmstrongPatient.jpg' class='diaryImage' alt='See the problem in my leg' \/><p class='diaryImageCaption'>See the problem in my leg<\/p><img src='images\\years\\1995\\1995_XX_XX-01-ArmstrongPatient.jpg' class='diaryImage' alt='I have patients' \/><p class='diaryImageCaption'>I have patients<\/p>","images":false},"title":{"value":"Armstrong Modelling"},"version":1},{"date":{"d":1,"m":11,"y":1995},"datev":19951101,"images":2,"info":{"content":"<img src='images\/years\/1995\/1995_XX_XX-01-IsteadRiseKitchen.jpg' class='diaryImage' alt='In Laura's Kitchen' \/><p class='diaryImageCaption'>In Laura's Kitchen<\/p><img src='images\/years\/1995\/1995_XX_XX-01-LauraBedroom.jpg' class='diaryImage' alt='Laura getting ready in her bedroom' \/><p class='diaryImageCaption'>Laura getting ready in her bedroom<\/p>","images":false},"title":{"value":"Other pictures"},"version":1},{"date":{"d":2,"m":10,"y":1995},"datev":19951002,"first":{"value":null},"images":1,"info":{"content":"<p>Lawrie, and fellow student, top of the year got married to Julliet. I was invited for the evening do. It was held at the end of Bournemouth Pier. I stayed at Chris's house in Lulworth Cove. I had football in the morning, so raced back. Made it over 100mph down the hill at Stoney Cross!<\/p><img src='images\\years\\1995\\1995_10_02-LawrieJullietWedding.jpg' class='diaryImage' alt='Lawrie and Julliet' \/><p class='diaryImageCaption'>Lawrie and Julliet<\/p>","images":false},"title":{"value":"Lawrie and Julliet's Wedding"},"version":1},{"date":{"d":8,"m":9,"y":1995},"datev":19950908,"info":{"content":"<p>Got directions from the dawg Barnett to go and pick Laura up from her house in Istead Rise. First time in Gravesend, so I was totally in Laura's hand as for a place to hang out. She choose the Railway Tavern!!! Mmmm. Still I wasn't there for the surroundings. Can't remember what we talked about, but I know it wouldn't have been easy from both sides. The enthusiasm or connection for each other outweighed any negative thoughts of stilted conversation, or rough surroundings. I believe we ended the night with Laura taking my hand, so although I asked her out, she made the first move on the affection front. We walked down to the river's edge, close to the pub and had a little kiss, before returning Laura on my chariot back to her house. I then made the 70 miles journey back home.<\/p><p>Going over to see Laura at the weekend was a regular occurrence for about 4 months.<\/p>","images":false},"title":{"value":"!! First Date !!"},"version":1},{"date":{"d":5,"m":9,"y":1995},"datev":19950905,"info":{"content":"<p>I can't remember quite how it happened, but the fact that Laura travelled back in the car with myself and Patsy from Alton Towers gave me confidence that she was interested in me a little bit. She was great fun to be with.<\/p><p>For some reason I had enough bottle to want to ask her out. I don't understand if this was confidence or whether I was desperate to continue meeting up. Anyhow, I asked Stevey what I planned to do. He rated my chances of success to be 40 \/ 60 against. Thanks to my best mate. Thing is I didn't believe I had such bad chances. Perhaps he was trying to protect me.<\/p><p>I remember I was at work (Armstrong’s, High Wycombe) and waited for a quiet time in the afternoon in the office. I went into the Marketing Director's office (who wasn't there at the time) and phoned Laura up to see if we could go out on a date. I remembered not to do a Rodney and sound all wet and unconfident. Anyway Laura said yes and had agreed to meet up on Friday at her house.<\/p><p>I was ecstatic. I remember phoning to tell dad straight away. Also I phoned Steve up to give me directions.<\/p>","images":false},"title":{"value":"Asking Laura Out"},"version":1},{"date":{"d":2,"m":9,"y":1995},"datev":19950902,"images":1,"info":{"content":"<p>Mum and Dad's 25th Wedding Anniversary wasn't actually until next week, however, they had arranged a big party at the house. Lise and Jørgen and Mormor were staying over at the time, so it was quite hectic in the days preceding it.<\/p><p>A barrel of Hogs Back Tea was bought and placed in the marquee that we erected in the back garden. A lot of dad's work friends were there, as well as some family and mum's playschool friends.<\/p><p>I had invited Steve, Laura and Bazza over. Gary and his parents were also invited. Anyway I got quite drunk... offended Mums friend Suzanne (luckily without her hearing, calling her a big raspberry), and almost put my fist through Steve's car (mini) windscreen when I thought I was giving the car an affection pat goodbye!<\/p><p>After that performance, goodness knows why I had the confidence to ask Laura out the week after!<\/p><img src='images\\years\\1995\\1995_09_12-25Aniversary06-ChrisJette.jpg' class='diaryImage' alt='Mum and Dad' \/><p class='diaryImageCaption'>Mum and Dad<\/p>","images":false},"title":{"value":"Mum and Dad’s - 25th Wedding Anniversary"},"version":1},{"date":{"d":11,"m":8,"y":1995},"datev":19950811,"info":{"content":"<p>I was out for another night with Stevey, Stevey's girlfriend, Patsy, a wild child American who he was dating, Patsy's mate, Christie, another American and of course Laura who I last saw six months previous at Stevey's family boxing day do, who at the time was going out with Phil Rowe. This must have been the first time that I had gone out, where there were more women than blokes, and come to think about it, Steve and Patsy were a bit involved with each other at the time, so it was a bit like me going out with two girls, both very nice, not the usual quality talent that is associated with me. In fact this was so new to me, it was going to be an experience whatever happened. the venue was Ricks Bar, Bracknell, a pub come club type place, mainly used as a starting place before going into the adjoining Masquerades night club.<\/p><p>Now you could view this position in a number of ways. The 'blokes' view would be, no problemo, great opportunity to pull, two attractive single, free girls and me who were coerced to talk with each other. My predicted view would be, I've got no chance, I'm not even going to try, I shall sit in the corner. However, this was not my view for the evening.<\/p><p>I remember the first round of drinks , Steve bought for Patsy and Christie, I think, so a great opportunity to buy Laura a drink. Having bought a lager and bitter and thinking Christie was speaking with her best mate. I thought it a great chance to speak to Laura. Now I know Laura seemed a very outgoing person, which usually scares me, because I'm quiet and boring. However, I was asked about my recent holiday. I was glad to talk about that, it may be a subject that I could actually sound interesting. Ten countries in ten days, explained in 10 minutes. I'd ran out of steam. She seemed to take an interest. I felt so at ease as if we knew each other for a while.<\/p><p>Then as per norm Steve was all over Patsy which left Christie no other choice but to meander her way between Laura and I. I was disappointed and was sure to blow my 'ease' out of the water. I only wanted one girl around and had negative thoughts to an American who seemed just like another teenage girl. Our discussion revolved around the differences with America. I was hoping to continue the flow of the conversation , but the first seeds of my passion to Laura had been sown. Laura did not seem to have minded this intrusion from the foreigner, not that she should have, but I wish she had shown some visual, down cast feelings. The evening flowed on for about 3 hours I suppose, which I had enjoyed immensely, although a little dejected at the end, but I didn't show what qualities I thought I possessed. We left and dropped the Americans off and then finally myself.<\/p><p>Laura sailed off with Steve in his mini, whilst I wished she could of cruised with me for a chat and a laugh. I made Laura my most wanted girl. She had made a mark on me. I assumed it would be another six months before I next saw Laura. I did not have the bottle to ask her out because I thought she would think I was just a nice friend of Stevey's and no more. I had heard of the interest from Laura had created amongst blokes in Brighton. The inexperienced me would not have a chance. However, the Alton Towers trip was arranged later, time to gain my bottle. Little had I expected the outcome of that trip, which has led to my extreme happiness.<\/p>","images":false},"title":{"value":"Out with Laura"},"version":1},{"date":{"m":7,"y":1995},"datev":19950700,"info":{"content":"<p>When I got back from my European trip we had an Austrian exchange student staying as part of Susan's German course.<\/p><p>Anyway she made it known she was interested... which is the first time any girl has shown interest! Sad eh! Anyway I remember one night in a Camberley night club when she snogged me. Fantastic. We never spoke after she returned back home to Austria.<\/p>","images":false},"title":{"name":"martin","value":"Martina Propenter"},"version":1},{"date":{"m":7,"y":1995},"datev":19950700,"images":1,"info":{"content":"<p>My first car was bought in Deepcut, at Kosters. A red, Vauxhall Astra 1.3, 5 door hatchback, at a cost of £2000. It had done about 90,000 miles and was about 9 years old.<\/p><img src='images\/years\/1995\/1995_07_XX-SusanMartinFirstDayAtArmstrongs.jpg' class='diaryImage' alt='Me and Susan in front of my Astra' \/><p class='diaryImageCaption'>Me and Susan in front of my Astra<\/p>","images":false},"title":{"value":"First Car"},"version":1},{"date":{"m":7,"y":1995},"datev":19950700,"info":{"content":"<p>Passed my interview with Patrick Finlay, the managing director of Armstrong’s. This was regarded as a good placement from those lecturers from university and was part of my work placement - part of my sandwich course. The company were expanding fast and recently moved to High Wycombe. My role was IT odd bod, mainly getting emails down, getting laptops to work and work on an Access 2.0 for production of medical robots.<\/p><p>My annual salary was something like £800. It equated to something like £650 a month. It was a 37.5 hour week. The journey used to take about 1 hour.<\/p><p>Work colleagues were Phil Shepherd (previous student), Nick Dowler, Steve and Simon. All graduates, all very nice people.<\/p>","images":false},"title":{"value":"Start Work At Armstrong’s"},"version":1},{"date":{"d":23,"m":6,"y":1995},"datev":19950623,"first":{"value":null},"images":2,"info":{"content":"<p>Arrived in Rome. This was a vibrant, great city. The traffic was mad, topped by the roman driving! Wow. Your car wouldn't survive without dinks here and there.<\/p><p>I went to the Coliseum and toured inside. It was strange as the floor of the main arena had troughs in it.<\/p><p>I walked from there to the impressive Victor Emmanuel building.<\/p><p>I went to the Vatican. I was refused entry into St Peters Basilica.<\/p><p>I then went in search of the Olympic stadium. I went to try and get in like in Berlin and Vienna. A security guard got very shirty with me. I was resigned to the fact I couldn't get in, and went to their training ground which was close by and sat and had a rest.<\/p><p>Time was marching on, and I headed back towards the stadium. There were some street stalls where fake, cheap football shirts were sold. I bought three! A great, but warring day.<\/p><img src='images\\years\\1995\\1995_06_23-Rome01.jpg' class='diaryImage' alt='Trevi Fountain' \/><p class='diaryImageCaption'>Trevi Fountain<\/p><img src='images\\years\\1995\\1995_06_23-Rome05.jpg' class='diaryImage' alt='Colloseum' \/><p class='diaryImageCaption'>Colloseum<\/p>","images":false},"title":{"name":"martin","value":"Inter Railing - Day 7 - Rome and the Vatican"},"version":2},{"date":{"d":22,"m":6,"y":1995},"datev":19950622,"first":{"value":null},"images":2,"info":{"content":"<p>In the afternoon I ventured to the famous Prater fairground and went on the big wheel, the same one as James Bond had done. It had great views of the city.<\/p><img src='images\\years\\1995\\1995_06_22-Vienna03.jpg' class='diaryImage' alt='View from the ferris wheel in Prater fairground' \/><p class='diaryImageCaption'>View from the ferris wheel in Prater fairground<\/p><p>It was a hot day and I spent the afternoon strolling through the adjacent park. I reached Rapid Wien's, Ernst Happel stadium. It was strange as it seemed circular, rather than oval. I managed to walk right in.<\/p><img src='images\\years\\1995\\1995_06_22-Vienna04.jpg' class='diaryImage' alt='Ernst Happel stadium' \/><p class='diaryImageCaption'>Ernst Happel stadium<\/p>","images":false},"title":{"name":"martin","value":"Inter Railing - Day 6 - Vienna"},"version":2},{"date":{"d":21,"m":6,"y":1995},"datev":19950621,"first":{"value":null},"images":3,"info":{"content":"<p>\u000a        Left on the overnight train to Berlin at about 10:30pm. Lise, Jørgen and Mormor all came to wave me off. Did not sleep too well on the way to Berlin. Woke in the middle of the night for the Rostock-&gt;Gedser ferry. It was too hot and uncomfortable and I had chronic hayfever. I woke up at 4:40am and then officially at 6am. I waited for the other four to start showing some life before I dared clamber down from the top bunk. I waited until 6:25 and decided to be brave and be the first to move. I went for a wash... well as much as you can in a train toilet. I did not go back in the cabin. I stayed to look at East Germany for the first time ever. It looked a bit ram shackled and untidy, otherwise it was not too bad. I did see a few\u000a        \u000a    <a href=\"http:\/\/www.trabant.org.uk\/\">\u000a          'trabies'\u000a        <\/a>\u000a        abandoned in back gardens. The trabies looked even worse than I can remember. If Dad were here we would be having a good old laugh. Arr the Minder episode where Arthur imports one. Fantastic.\u000a      <img src='images\\years\\1995\\1995_06_21-Berlin02.jpg' class='diaryImage' alt='Traubie' \/><p class='diaryImageCaption'>Traubie<\/p><\/p><p>At 6:50am we suddenly hit Berlin. No nice suburbia area, just straight from farmland to an estate of flats. Not very pretty flats at that. The train arrived a few minutes late. I waited for everyone to get out of the cabin so that I could sort my baggage out alone. Thirty seconds later, the SS guard barked at me to get out. Alright calm down I thought. Got out of the train, found a locker for the big red bag and paid my 2DM. Now try and find how to get to the Zoological Garten station so that I can follow the guide in the book.<\/p><p>My hay fever is really affecting me and my right eye is all red. Not a pretty sight. Have not got a clue where I am going and finally after 30 minutes I go and ask at the info desk for what to do. He points me in the right direction. Buy a ticket for 3.70DM but do not know what that entitles me to.<\/p><p>Travelling on the S-Bahn westwards I notice that the train doors are not electronic and can be opened at anytime. Also those German do like to graffiti everything within reach. Arrive at the 'Zoo' in the rush hour. A busy place at the best of times anyway. I did not notice the change from east to west Berlin. From Zoo I follow the guide book. I turn left and make my way towards Tiergartenstraße. On the way there are about 20-30 police motorcycles gathered outside a hotel along with 5-6 police vans. Flashing lights and sirens. There escorting somebody important but I don't know who.<\/p><p>Get to the quieter area near the woodlands (Tiergarten) and eat some of yesterdays sandwiches. Continue another kilometre to Potsdammer Platz which was supposed to be Berlin's Piccadilly Circus before the war. All there is now is just construction sites, a bit disappointing.<\/p><p>By this time, 9:00am, it is very, very humid. I carry along northwards along 'no man’s land', which is a 75m strip of desolate grassland which is about to be constructed on. Continue to the Brandenburg gate. I have a rest, getting a bit tired and drink and eat some sandwiches. Although there are no gates and no wall to be seen, quite a nice site. To cap it all there was a 'trabi' that stopped underneath the archway. The sad thing was I could not get my camera out in time. Around the Brandenburg gate there were street salesmen selling all sorts of East German memorabilia from bits of wall to the guards hats. Bought a matchbox 'trabie' car for about 5DM.<\/p><p>After the 'gate' I headed towards the Reichstag, the old parliamentary building. It was very busy there and plenty of TV crews. They were covering it up with a silvery colour cloth to protect it. didn't get to see much of that. Had a look at the market stalls just opposite and saw another matchbox 'trabie' for sale at 10DM! Walked east towards the old Eastern side down Unter Den Linden. This is where dear old Adolf used to have his marches. Again this street is under heavy re-development and so was a bit disappointing. Saw the place where the 'book burning' was done and saw 'Bebel Plate'. I needed another rest and sat down to eat and play on the 'Gameboy'. then it started to rain. This was around midday, 1 o'clock. then it started to thunder and lightning. It sounded like the blitz in Berlin with each roll of thunder.<\/p><p>I took relief at the strange , Neue Wache for half an hour. Even though it rained hard it dried off just a bit and I decided to walk to 'Platz de Akademe'. Moral was lower, see all those old buildings and it was raining. I decided a change of scenery so went up the telecommunications tower. A massive tower shadowing East Berlin. Went up it costing me 13DM and had an 8DM pot of hot chocolate in spinning cafe. It completes one revolution every half an hour. The problem was that it was very cloudy and I couldn’t see very far. For my £10 pot of hot chocolate I decided to stay for 45 minutes. This tower is situated right next to Alexander Platz.<\/p><p>At last I found some shops just by the tower. Could I get a bargain at the presumable cheaper German shops. No! CD's were 33DM (£15), computer games 100DM, Trainers and jeans were £20 more expensive. Caps were up to 40DM.<\/p><p>About 4:00pm now. Got on a crowded bus to 'Zoo'. I almost got away without paying, but an honest chap like myself went and paid the conductor. The traffic was bad and the weather poor. Saw one of the stadiums and 'Siegeßade großer stern'. A large, impressive statue in the middle of a roundabout. Got off at Zoo and made way for the main shopping street, Kurtustendamm. Not very impressed. Decided to go to the Olympic stadium. So went up Knesebeck Straße and get on a train at 'Savigny Platz'.<\/p><p>\u000a        Finally get to the quiet station of 'Olympia Stadia' and made the five minute walk to the\u000a        \u000a    <a href=\"http:\/\/www.olympiastadion-berlin.de\/\">\u000a          Olympic stadium\u000a        <\/a>\u000a        itself. It looked quite impressive. I paid the 1DM at the gate and went inside. Two light roofs at both sides of the straight, and seating all the way around. I went on to the track and field. Would this be allowed at Wembley? From the hub of the city it was nice to be in the peace and quiet. I sat down in the VIP seats, took my shirt off because of the blazing sun, and listened to the world service on my radio, wrote this and played on the Gameboy. I was there for around two hours I really enjoyed it. I was imagining what the 1936 Olympics would have been like with Hitler there. I had not realized that there was an equestrian and swimming centre within the grounds as well. Walked back to the station and took almost the entire length of the U2 U-Bahn line to AlexanderPlatz. Back at Lichtenberg, where I paid 3DM for a can of coke. I telephoned home to say I was still alive. Waited for 2 hours for my train.<\/p><img src='images\\years\\1995\\1995_06_21-Berlin05.jpg' class='diaryImage' alt='Olympic Stdium' \/><p class='diaryImageCaption'>Olympic Stdium<\/p><p>On the train with four other German speaking men and a women. Wear shorts to bed this time. Learnt from Yesterday night. Knackered. Lights out after an hour’s travelling at 11:30pm<\/p><img src='images\\years\\1995\\1995_06_21-Berlin03.jpg' class='diaryImage' alt='Brandenberg Gate' \/><p class='diaryImageCaption'>Brandenberg Gate<\/p>","images":false},"title":{"name":"martin","value":"Inter Railing - Day 5 - Berlin"},"version":2},{"date":{"d":18,"m":6,"y":1995},"datev":19950618,"first":{"value":null},"images":1,"info":{"content":"<p>I wake up in Denmark crossing on the train ferry from Germany. I arrive at Copenhagen station with Lise, Jørgen and Mormor waiting for me at 8:30 in the morning. I spend three days with Mormor.<\/p><img src='images\\years\\1995\\1995_06_20-Copenhagen01.jpg' class='diaryImage' alt='Copenhagen Railway Station. Saying goodbye to Mormor' \/><p class='diaryImageCaption'>Copenhagen Railway Station. Saying goodbye to Mormor<\/p>","images":false},"title":{"name":"martin","value":"Inter Railing - Day 2 - Copenhagen"},"version":2},{"date":{"d":17,"m":6,"y":1995},"datev":19950617,"first":{"value":null},"images":1,"info":{"content":"<p>Woke up at 7:45 with my dancing alarm clock. A bit tired, I first have a bath which is cut short with worry if I will pack everything in time.<\/p><p>Finish packing well within the time for once. As usual I am confident that everything is packed and as usual mum is fussing.<\/p><p>Caught the 10:44 Farnborough express to arrive in tonnes of time for the 12:27. At Waterloo I try and find something typically English for when I need it much later in the trip. Got the Daily Telegraph also check the exchange rate out.<\/p><p>Down the escalators to the international station and got confused on what to do. Make final check on tickets and passport. That isn't as easy as it sounds. I am not inter-railing in the traditional sense. Because Dad gets discounts on tickets I have got at least 9 sets of tickets for each leg of my journey. I think normally you'd have one ticket to travel where you like around Europe. All my stops have been planned and booked, so I must catch the right trains.<\/p><p>Departure lounge is swish and businessy. Loads of Japs there with video cameras and other big boys toys. Get on to the coach first, leave my bags there. They won't get stolen. I walk to the front of the train. There are 25 approximately. coaches. Wow.<\/p><p>Curse at dad, probably unjustifiably in getting an aisle seat, next to the large window frame. Can't see much very well.<\/p><p>Young gothic girl, about 20 years old, turns up and sits in the window seat. Not attractive. Dressed all in black. Leaving London the seats behind are free. The coach is only half full. Tell her 'Nothing personal'. Move behind, only to see it is raining outside. Typical. Start reading Theme Park computer game manual.<\/p><p>The train winds its way for 3 hours to Brussels. I have two hours to kill so decide to go for a walk out of the station. Can't say I am that impressed, although I didn't know where I was going.<\/p><p>The overnight train from Brussels Midi will take me through Holland and Germany. There were a couple of other blokes who came from Coulsden that were also inter-railing.<\/p><img src='images\\years\\1995\\1995_06_XX-EuropeTripItenary.jpg' class='diaryImage' alt='Itenary' \/><p class='diaryImageCaption'>Itenary<\/p>","images":false},"title":{"name":"martin","value":"Inter Railing - Day 1 - London and the Low Countries"},"version":2},{"date":{"m":6,"y":1995},"datev":19950600,"info":{"content":"<p>Took the overnight sleeper from Copenhagen to Berlin. Very exciting. Woke up in Berlin and from the Zoo station I walked ages following a suggested walk in the book. I reached the Brandenburg gate eventually and saw the Reichstag (Parliament) which seemed to be a part of some art exhibition and had loads of cloth draped over it. I walked on to the East side, went in some shops and went up the tall communications tower which towers above the city. It was pretty cloudy so I didn't see as much as I hoped. I ventured back into the west and eventually went to the Olympic stadium. The one used for the 1938 Olympics. I sat in the VIP seat listening to the World Service. I got back to the station and got the overnight train to Vienna, passing Prague in the middle of the night.<\/p><p>In Vienna I used the small underground system to get to the famous fairground. This was at the edge of a huge park which I cruised to get to the national football stadium (Swarzenegger stadium).<\/p><p>From Vienna I again caught the overnight train and passed through the gorgeous Alps down through Italy to Rome and the Vatican.<\/p><p>Rome was wicked. I remember buying three football shirts for £15. I saw the Coliseum and went to the Vatican. I was refused entry into St Peters because I was wearing shorts on this boiling hot day.<\/p><p>Again I caught the overnight train to Montpellier, going through the most spectacular costal scenery. Cannes, Monte Carlo, Nice beautiful.<\/p><p>I stayed with Eva, Frank and Nicholas for a few days, before catching the TGV back to Paris and Eurostar home!<\/p>","images":false},"title":{"name":"martin","value":"Europe Trip - 11 countries in 11 days"},"version":1},{"date":{"d":20,"m":5,"y":1995},"datev":19950520,"first":{"value":null},"images":1,"info":{"content":"<p>Went with Dad up to Wembley. Everton won 1-0 in a drab match. Great experience to be at Wembley for the first time<\/p><img src='images\\years\\1995\\1995_05_20-FACupFinal.jpg' class='diaryImage' alt='Cup Final ticket' \/><p class='diaryImageCaption'>Cup Final ticket<\/p>","images":false},"title":{"value":"FA Cup Final - Man Utd V Everton "},"version":2},{"date":{"m":5,"y":1995},"datev":19950500,"first":{"value":null},"images":1,"info":{"content":"<p>Went to Theale buggying with Steve and his family. Laura was there. I managed to snap an axel on my buggy and I think Matt managed to roll his.<\/p><img src='images\\years\\1995\\1995_05_XX-ThealeBuggying.jpg' class='diaryImage' alt='It Broke' \/><p class='diaryImageCaption'>It Broke<\/p>","images":false},"title":{"value":"Theale Buggying"},"version":2}],"version":-823030805}