{"entries":[{"date":{"d":26,"m":12,"y":1997},"datev":19971226,"info":{"content":"<p>Auntie Grace died today at the age of 90. I hadn't realized that she was ill. Auntie Grace to me had always been such a funny, kind lady for whom I'll take away so many fond memories. We used to visit her down in Deal at least once a year. Susan and I would find it boring all the talking she did with dad about family history and what not. Stuff I'd absolutely loved to hear about now. Times in the war. Sadly too young too appreciate. Anyway, Susan and I used to play hockey and golf with the Dixon's walking sticks. Another memory was the outside toilet. The only house I remember with an outside loo.<\/p><p>I can remember the smallest kitchen in the world, the shaking hands when pouring the tea (something Susan suffers with now) and the 'Do you want anymore duck?'. The Dixon's had a chair lift up and down the stairs in their later years which for kids like us provided more entertainment. Those stairs were quite steep though I seem to remember. Grace was a little lady, with a smiley face, white hair and had a great character. First time she saw mum, the first thing she said to her was 'Do you want a bath duck?'. She held quite some knowledge of the family tree. I remember once watching a cine film from the 1930's with Grace and Norman. The event of watching it with them was really funny. Plumes of dust billowed from the projector, Norman not hearing Grace's command to stop and the noise that the projector made was really loud. This is more Norman, but years back we went for a drive with Norman, and he drove so slowly that there was a queue irrate traffic behind him. He continued unflapped and seemingly oblivious to the modern need to rush about. Grace and Norman, I miss you so much. With the inheritance money passed, I bought a picture of two Hurricane's flying over your native London to remind me of you. It has hung above the fireplaces in both our homes for the past 10 years.<\/p>","images":false},"title":{"value":"Auntie Grace Dies"},"version":1},{"date":{"d":24,"m":12,"y":1997},"datev":19971224,"info":{"content":"<p>Laura came over for a traditional Danish Christmas meal.<\/p>","images":false},"title":{"value":"Xmas Eve Meal"},"version":1},{"date":{"d":23,"m":12,"y":1997},"datev":19971223,"info":{"content":"<p>Went to the Dominion Theatre with Laura.<\/p>","images":false},"title":{"value":"Theatre - Beauty And The Beast"},"version":1},{"date":{"d":21,"m":12,"y":1997},"datev":19971221,"images":1,"info":{"content":"<p>Tore ligaments in my left knee I think. It was done at Cove green. Great for Christmas! The plaster lasted a month on my leg.<\/p><img src='images\/years\/1997\/1998_01_27-MonthOfCast01.jpg' class='diaryImage' alt='Mmmm nice leg' \/><p class='diaryImageCaption'>Mmmm nice leg<\/p>","images":false},"title":{"value":"Leg In Plaster"},"version":1},{"date":{"d":13,"m":12,"y":1997},"datev":19971213,"info":{"content":"<p>Went to see James Bond - Tomorrow Never Dies at Rochester cinema.<\/p>","images":false},"title":{"value":"Tomorrow Never Dies - Cinema"},"version":1},{"date":{"d":8,"m":12,"y":1997},"datev":19971208,"info":{"content":"<p>Went to see Alien Resurrection at Bracknell cinema.<\/p>","images":false},"title":{"value":"Cinema"},"version":1},{"date":{"d":28,"m":11,"y":1997},"datev":19971128,"images":4,"info":{"content":"<p>Grad Ball was held at the BIC. Everyone was dolled up. Last time seeing many of my course colleagues.<\/p><img src='images\/years\/1997\/1997_11_28-GraduationBall01.jpg' class='diaryImage' alt='Graduation Ball at the BIC' \/><p class='diaryImageCaption'>Graduation Ball at the BIC<\/p><img src='images\/years\/1997\/1997_11_28-GraduationBall03.jpg' class='diaryImage' alt='Graduation Ball at the BIC' \/><p class='diaryImageCaption'>Graduation Ball at the BIC<\/p><img src='images\/years\/1997\/1997_11_28-GraduationBall04.jpg' class='diaryImage' alt='Graduation Ball at the BIC' \/><p class='diaryImageCaption'>Graduation Ball at the BIC<\/p><img src='images\/years\/1997\/1997_11_28-GraduationBall08.jpg' class='diaryImage' alt='Graduation Ball at the BIC' \/><p class='diaryImageCaption'>Graduation Ball at the BIC<\/p>","images":false},"title":{"value":"Graduation Ball"},"version":1},{"date":{"d":27,"m":11,"y":1997},"datev":19971127,"images":3,"info":{"content":"<p>Returned back to Bournemouth for the first time since leaving university. Met up with Claire. Mum, Dad and Laura came to watch the rather long (and boring) ceremony. I was all cloaked up!!<\/p><img src='images\/years\/1997\/1997_11_27-Graduation01.jpg' class='diaryImage' alt='Graduation at the BIC' \/><p class='diaryImageCaption'>Graduation at the BIC<\/p><img src='images\/years\/1997\/1997_11_27-Graduation02.jpg' class='diaryImage' alt='Graduation at the BIC' \/><p class='diaryImageCaption'>Graduation at the BIC<\/p><img src='images\/years\/1997\/1997_11_27-Graduation04.jpg' class='diaryImage' alt='Graduation at the BIC' \/><p class='diaryImageCaption'>Graduation at the BIC<\/p>","images":false},"title":{"value":"Martin Graduation"},"version":1},{"date":{"d":23,"m":11,"y":1997},"datev":19971123,"info":{"content":"<p>Had an early start. Had breakfast at a Happy Chef before moving on to Blenheim Palace for the morning's racing. Was very good, very noisy and a lot of popping of un-burnt fuel. On the way I took inspiration and decided to do a few of my 'moves' on the sodden, grassy car parks. The 360's went down well with the passengers I think, until the point they thought the car was going to roll!<\/p><p>We then moved on and in the afternoon arrived at the special stages at Millbrook, a purpose built car test track. Steep hills and hairpin bends. A good, but exhausting days racing.<\/p>","images":false},"title":{"value":"Network Q Rally"},"version":1},{"date":{"d":22,"m":11,"y":1997},"datev":19971122,"images":1,"info":{"content":"<woops rating=\"8\" woopstitle=\"Almost Mowed Down An OAP\"><p>Went to Cheltenham with Nick and Martin to the pre-rally show. I drove back to Oxford where we had a pub crawl. I almost knocked off an elderly gentleman off his 'old' mobility scooter thingy. It was dark, and he was cleaning his headlight as he was going along. This obscured his light. I didn't see the vehicle therefore until really late and swerved to miss it.<\/p><img src='images\/years\/1997\/1997_11_22-MobilityScooterHitAndRun.jpg' class='diaryImage' alt='Hit And Run?' \/><p class='diaryImageCaption'>Hit And Run?<\/p><p>Later that night, I also managed to tread in some dog poo and unkowingly walked it into the guest house we were staying in.<\/p><\/woops>","images":false},"title":{"value":"Network Q Rally"},"version":1},{"date":{"d":16,"m":11,"y":1997},"datev":19971116,"info":{"content":"<p>Had to go in and help with the office move.<\/p>","images":false},"title":{"value":"Office Move to Fleet"},"version":1},{"date":{"d":15,"m":11,"y":1997},"datev":19971115,"info":{"content":"<p>Me and Laura went Dog racing with Chertsey Town Football Club at Brighton and Hove stadium.<\/p>","images":false},"title":{"value":"Brighton Dog Racing"},"version":1},{"date":{"d":14,"m":11,"y":1997},"datev":19971114,"info":{"content":"<p>We went to the Exchange Bar and Diner and had a nice meal.<\/p>","images":false},"title":{"value":"Guildford"},"version":1},{"date":{"d":12,"m":11,"y":1997},"datev":19971112,"info":{"content":"<p>Went up to London to meet with Claire.<\/p>","images":false},"title":{"value":"Capital Cafe"},"version":1},{"date":{"d":7,"m":11,"y":1997},"datev":19971107,"info":{"content":"<p>We went round Susan's (who was living at Lee and Louisa's at Paddock Hill) to a fireworks party. There were some excellent, loud fireworks. We got a guided tour of Susan's new abode before we saw Pulp Fiction and Shooting Stars. The party of nine of us went down to the One Oak pub where I had a nice chat with Susan. I got refused to get served as well as I didn't look 18!! I am 22.<\/p>","images":false},"title":{"value":"Susan's Fireworks Night"},"version":1},{"date":{"d":5,"m":11,"y":1997},"datev":19971105,"info":{"content":"<p>Went after work to Laura's house to see their family firework's night. My £8 rocket went up well. Helen and Nigel were there. We had an early night as I had a dodgy stomach. I set off for work early Thursday morning.<\/p>","images":false},"title":{"value":"Weston's Fireworks Night"},"version":1},{"date":{"d":1,"m":11,"y":1997},"datev":19971101,"info":{"content":"<p>Got up late with a hangover. We went round Camberley and I got some clothes which was nice and relaxing. We went to the Hogs Back Brewery to get some bottles of beer for Laura's dad's birthday.<\/p><p>Went to Farnborough Leisure centre for the Casuals olds 40th birthday celebration. Capped when Craig set alight to his pocket with some matches!<\/p>","images":false},"title":{"value":"Mike, Age, Bonzy's 40th Birthday Party"},"version":1},{"date":{"d":31,"m":10,"y":1997},"datev":19971031,"info":{"content":"<p>Laura came to see AFP's, not so impressive Knaphill offices. She was impressed! After a quick tour we went back to get some wine and went off to Woking to participate in a quiz. All Laura's family were there including Ellie and Michael. The quiz was difficult with boring questions. We had drank 3 bottles of red between us and a strong curry.<\/p><woops rating=\"6\" woopstitle=\"Sick in grandparents-in-law car twice\"><p>As we were travelling home I leant out of the moving car and threw up, which was a bit embarrassing seeing that I was in Laura's grandparents car. The sick splattered the back wing of the car! We stopped, I caught some fresh air, and sat on the other side of the car. Then.... it happened again as we travelled along Gole Road!<\/p><p>I was also sick during the night (but didn't remember it). Laura's granddad got the hose pipe out the morning after to slosh down any residue!<\/p><\/woops>","images":false},"title":{"value":"Woking Curry-Quiz Night"},"version":1},{"date":{"d":30,"m":10,"y":1997},"datev":19971030,"info":{"content":"<p>Laura was home when I arrived late in from work. After dinner we went down the One Oak pub for a swift pint, before I had to go football training.<\/p>","images":false},"title":{"value":"One Oak"},"version":1},{"date":{"d":26,"m":10,"y":1997},"datev":19971026,"info":{"content":"<p>We rushed back so I could play football, forgetting that the clocks go back an hour. Meaning I was at football too early... and a bit tired after a long drive so early in the morning. We pottered around in the afternoon, watched the Grand Prix, cooked ourselves Sunday Lunch and watching Michael Palin's, Full Circle. Laura left on Monday morning for her shift a Chailey.<\/p>","images":false},"title":{"value":"Brighton Move"},"version":1},{"date":{"d":25,"m":10,"y":1997},"datev":19971025,"info":{"content":"<p>After getting up late, we wondered around in Brighton. We played some American Pool, had some scrummy lunch at the Sussex Yeoman, before returning to Laura's room and began to pack her stuff up. It was sad in a way because that was our home, where we could spend time to ourselves. We played yet more risk.<\/p>","images":false},"title":{"value":"Brighton Move Out"},"version":1},{"date":{"d":24,"m":10,"y":1997},"datev":19971024,"info":{"content":"<p>I arrived a little late in Brighton where Laura had been studying all day. We went into town and had dinner in a Spanish Tapas bar. We were impressed by the hospitality and lively atmosphere but not by the quality or quantity of food. We then found a p b in The Lanes for a bevy.<\/p>","images":false},"title":{"value":"Brighton Tapas"},"version":1},{"date":{"d":18,"m":10,"y":1997},"datev":19971018,"info":{"content":"<p>We done more Essay work, which was frustrating as I couldn't get my way!!! In the afternoon we went to Hever Castle. It was pretty, romantic and very English. Somewhere I'd like to return to. In the evening we had a family dinner with Steve's Mum and Dad and then down to a quiz at the local community centre. We came third which wasn't bad.<\/p>","images":false},"title":{"value":"Hever Castle"},"version":1},{"date":{"d":17,"m":10,"y":1997},"datev":19971017,"info":{"content":"<p>Stayed after work for a few drinks as it was Mark Pepper's (my boss) leaving do. Rushed over to Istead Rise and we went to another Fireman's Party with Helen and Nigel. The music was too loud and I couldn't hear what anyone else was saying.<\/p>","images":false},"title":{"value":"Fireman's Party"},"version":1},{"date":{"d":16,"m":10,"y":1997},"datev":19971016,"info":{"content":"<p>Went over to Istead Rise after work to help with Laura's essay.<\/p>","images":false},"title":{"value":"Help with Laura's Essay"},"version":1},{"date":{"d":12,"m":10,"y":1997},"datev":19971012,"info":{"content":"<p>I was still having troubles with my leg after I twinged some ligaments\/muscle in my knee. During the night it was really hurting so we popped down to the County hospital. It was a Sunday, and I was low priority and the queue was already 3 hours. We eventually gave up waiting after 1.5 hours as it became evident that I was not going to be seen to. We done a bit more filming around Brighton, then went to the Sussex Yeoman for its sausage meals. They were gorgeous. We played 3 games of risk in the afternoon and went back to Istead Rise to have a quiet night in. I left Monday morning to go to work. The alarm didn't go off, so I was a bit late.<\/p>","images":false},"title":{"value":"Brighton County Hospital"},"version":1},{"date":{"d":11,"m":10,"y":1997},"datev":19971011,"info":{"content":"<p>We were going to go cycling, but the weather wasn't good, so we drove to Steyning near Brighton. Went along the seafront and down to the Marina. We are planning to go to Australia travelling around, so we decided to make a video and send it over to mainly introduce ourselves. We saw that Uncle Bob had done something similar over in Aus, which was quite interesting to see his way of life. In the evening we had our usual pasta meal, then went down to Brighton pier to watch the final qualifier for the World Cup, England V France. Great game. We outclassed the Italians.<\/p>","images":false},"title":{"value":"Steyning"},"version":1},{"date":{"d":4,"m":10,"y":1997},"datev":19971004,"info":{"content":"<p>In the morning we went to Bromley for a spot of shopping. In the afternoon we went to Swanley for a swim and had a go on the flumes. I also realized I am not quite as brave as I thought on the diving board. I belly flopped twice. Ouch!! In the evening we went to a pub called the Trocadero, then watched the Full Monty afterwards.<\/p>","images":false},"title":{"value":"Swanley Swim, Bromley Shop"},"version":1},{"date":{"d":3,"m":10,"y":1997},"datev":19971003,"info":{"content":"<p>We went out with Helen and Andrew to the Windmill Tavern and Black Lion.<\/p>","images":false},"title":{"value":"Gravesend Pubbing"},"version":1},{"date":{"d":27,"m":9,"y":1997},"datev":19970927,"info":{"content":"<p>We went to Olympia to see the London Home Show. We were in there for ages. We then caught a bus to Piccadilly and went in the Trocadero, and Rock Circus.<\/p>","images":false},"title":{"value":"Kensington Olympia, Rock Circus"},"version":1},{"date":{"d":26,"m":9,"y":1997},"datev":19970926,"info":{"content":"<p>We went to the Hogshead at the top of the High Street in Guildford. We met up with Susan, Gary, Lee and Louisa and went clubbing in Bojanglez.<\/p>","images":false},"title":{"value":"Guildford pubbing"},"version":1},{"date":{"d":21,"m":9,"y":1997},"datev":19970921,"info":{"content":"<p>Went first to Windlesham and met at the Sun pub, then off to Lightwater Country Park for some fun and games with the Barnett family.<\/p>","images":false},"title":{"value":"Barnett Family Picnic"},"version":1},{"date":{"d":20,"m":9,"y":1997},"datev":19970920,"images":1,"info":{"content":"<p>We went out for Susan's birthday to Fleet. Went to the Emporium and then ended up clubbing in the Warehouse. There was a cool Sumo game, with loads of padding and soft flooring. Took the dawg down a treat.<\/p><img src='images\/years\/1997\/1997_09_20-ClubbingInFleet02.jpg' class='diaryImage' alt='Going out to Fleet' \/><p class='diaryImageCaption'>Going out to Fleet<\/p>","images":false},"title":{"value":"Susan's 20th Birthday"},"version":1},{"date":{"d":19,"m":9,"y":1997},"datev":19970919,"info":{"content":"<p>In the evening we went to Woking to see Austin Powers.<\/p>","images":false},"title":{"value":"Woking"},"version":1},{"date":{"d":13,"m":9,"y":1997},"datev":19970913,"images":3,"info":{"content":"<p>We went up to London. Caught a train to Baker Street and went to the Planetarium. We walked up Oxford Street, passed Marble Arch to Hyde Park. We walked through to the Kensington end and saw the many flowers for Princess Diana. We popped over to Harrods, where there were flowers for Dodi also. We went into the food halls, but didn't get anything.<\/p><img src='images\/years\/1997\/1997_09_13-Kensington.jpg' class='diaryImage' alt='Kensington' \/><p class='diaryImageCaption'>Kensington<\/p><img src='images\/years\/1997\/1997_09_13-KensingtonDianasFlowers.jpg' class='diaryImage' alt='Diana's Flowers' \/><p class='diaryImageCaption'>Diana's Flowers<\/p><img src='images\/years\/1997\/1997_09_13-MarbleArch01.jpg' class='diaryImage' alt='Laura at Marble Arch' \/><p class='diaryImageCaption'>Laura at Marble Arch<\/p>","images":false},"title":{"value":"Planetarium, Hyde Park"},"version":1},{"date":{"d":12,"m":9,"y":1997},"datev":19970912,"info":{"content":"<p>We went to the raucous pub, the Central for a few pints.<\/p>","images":false},"title":{"value":"Central pub"},"version":1},{"date":{"d":8,"m":9,"y":1997},"datev":19970908,"images":1,"info":{"content":"<p>We went out in the evening for a lovely meal at Bluebeckers in Odiham.<\/p><img src='images\/years\/1997\/1997_09_08-2ndAniversary-BluebeckersOdiham.jpg' class='diaryImage' alt='2nd Anniversary' \/><p class='diaryImageCaption'>2nd Anniversary<\/p>","images":false},"title":{"value":"2nd Going Out Anniversary - Bluebeckers"},"version":1},{"date":{"d":6,"m":9,"y":1997},"datev":19970906,"info":{"content":"<p>Went on annual Barnett trip to the fair. This year was Chessington. The memorable thing about this day was that the weather was almost monsoon like. So much so they had to shut the park for a couple of hours. It was torrential rain and thunder storms. My car wouldn't start for ages as it was too wet.<\/p><p>In the evening we went to watch Event Horizon at Bracknell. It was very scary.<\/p>","images":false},"title":{"value":"Chessington World Of Adventures"},"version":1},{"date":{"d":5,"m":9,"y":1997},"datev":19970905,"info":{"content":"<p>Went to see the two Steve's down in Bournemouth.<\/p>","images":false},"title":{"value":"Bournemouth to see Steve"},"version":1},{"date":{"d":2,"m":9,"y":1997},"datev":19970902,"images":1,"info":{"content":"<p>My first proper paid job. I think I was on a starting salary of about £14K. The company was then called AFP and I was employed as a ...... not sure really. Under the impression that I was to develop a database application to bring together and link internal systems. However, my role was more of an Internal Support person. I.e. When someone had a problem with their computer, I'd go and sort them out.<\/p><img src='images\/years\/1997\/1997_09_02-FirstDayAtAFP.jpg' class='diaryImage' alt='First Day at AFP' \/><p class='diaryImageCaption'>First Day at AFP<\/p>","images":false},"title":{"value":"Martin - First Day at Work"},"version":1},{"date":{"d":31,"m":8,"y":1997},"datev":19970831,"info":{"content":"<p>Laura's first trip to Denmark and today was the day we were leaving. We awoke to the sad news of Lady Diana's death. It really hit us.<\/p><p>We drove back to Esbjerg and caught the boat back to Harwich.<\/p>","images":false},"title":{"value":"Returning back from Denmark"},"version":1},{"date":{"d":30,"m":8,"y":1997},"datev":19970830,"info":{"content":"<p>In the evening we went and celebrated Lise's 50th birthday. It was a very long meal with many songs and beers. Traditional Lise and Jørgen high spirited party.<\/p>","images":false},"title":{"value":"Denmark Holiday - Lise's 50th"},"version":1},{"date":{"d":29,"m":8,"y":1997},"datev":19970829,"info":{"content":"<p>We went to Jørgen’s Salon and got my haircut done.<\/p><p>In the evening we went to try some traditional Danish food at a restaurant. However, they struggled to get anything vegetarian for Laura which was a bit embarrassing.<\/p>","images":false},"title":{"value":"Denmark Holiday - Haircut and Johanna's"},"version":1},{"date":{"d":28,"m":8,"y":1997},"datev":19970828,"info":{"content":"<p>In the evening we went to a really small theatre where we were a part of a dozen or so audience, watching a 2 man show about the life and time of HC Andersen. It was absolute class. So different. At half time they came round with jars of real coffee and made a real effort to make us welcome.<\/p><p>We made an evening of it and went drinking in Copenhagen afterwards.<\/p>","images":false},"title":{"value":"Denmark Holiday - Mermaid Theatre"},"version":1},{"date":{"d":27,"m":8,"y":1997},"datev":19970827,"info":{"content":"<p>We went on a walking guided tour around some of Copenhagen, including Christiana. It was very interesting. We went into the Hard Rock Cafe.<\/p><p>In the evening we went into Tivoli with Mum and Dad.<\/p>","images":false},"title":{"value":"Denmark Holiday - Copenhagen Tour and Tivoli"},"version":1},{"date":{"d":26,"m":8,"y":1997},"datev":19970826,"info":{"content":"<p>We ventured back into Copenhagen and went to see boiled sweets being made. We also went to the Royal Copenhagen pottery place and watched them paint plates!<\/p>","images":false},"title":{"value":"Denmark Holiday - Royal Copenhagen and Sweet Factory"},"version":1},{"date":{"d":25,"m":8,"y":1997},"datev":19970825,"info":{"content":"<p>We caught the train to one of Denmark's largest cities, Odense. Here we cruised the streets and went to visit H C Andersen's home.<\/p>","images":false},"title":{"value":"Denmark Holiday - Odense"},"version":1},{"date":{"d":24,"m":8,"y":1997},"datev":19970824,"info":{"content":"<p>We went to Danish church in the morning, with Lise, Jørgen, Mum and Dad.<\/p><p>The weather again was superb. We made our way to the local beach in Amager.<\/p>","images":false},"title":{"value":"Denmark Holiday - Danish Church and Beach"},"version":1},{"date":{"d":23,"m":8,"y":1997},"datev":19970823,"info":{"content":"<p>We went to Roskilde to look around the town and the impressive Viking museum.<\/p><p>In the evening we went to Lise and Jørgen’s summer house for dinner.<\/p>","images":false},"title":{"value":"Denmark Holiday - Roskilde"},"version":1},{"date":{"d":22,"m":8,"y":1997},"datev":19970822,"info":{"content":"<p>We went to go around the Carlsberg brewery. There was a free tour and sample testing at the end. Mmmm. very nice.<\/p><p>In the evening we went to Jensen’s Beef House to celebrate Dads 51st birthday.<\/p>","images":false},"title":{"value":"Denmark Holiday - Carlsberg and Dads Birthday"},"version":1},{"date":{"d":21,"m":8,"y":1997},"datev":19970821,"info":{"content":"<p>We went to City II to have a look. I bought Laura and a new dress, because I thought she looked dead gorgeous in it. We all met up and went to see Rasmus in the evening.<\/p>","images":false},"title":{"value":"Denmark Holiday - City2 and Rasmus"},"version":1},{"date":{"d":20,"m":8,"y":1997},"datev":19970820,"info":{"content":"<p>Laura’s first time to Copenhagen. We went off to the city centre to see the sights. It was a scorching day. We went to see the Little Mermaid, the changing of the guard at the Royal Palace, the Danish Church fountain and the Roundtower. We went for a walk back to the Town hall square.<\/p>","images":false},"title":{"value":"Denmark Holiday - Copenhagen"},"version":1},{"date":{"d":19,"m":8,"y":1997},"datev":19970819,"info":{"content":"<p>We drove through to Ejstrupholm and saw where my ancestors were christened and buried. We stopped off for something to eat. Later on we went to the place where steam engines run. I remember being there when I was a child. We stopped off for tea and cakes. We were preciously short of time as Dad decided to take the scenic route! We made it to Abeltoft with seconds to spare to catch the Sea Cat over to Zealand from Ebeltoft to Sjællands Odde!<\/p>","images":false},"title":{"value":"Denmark Holiday - Ejstrupholm - Jutland"},"version":1},{"date":{"d":18,"m":8,"y":1997},"datev":19970818,"info":{"content":"<p>We drove with Mum and Dad to Harwich. We caught the overnight boat to Esbjerg. We all shared a cabin, even with Dads snoring!<\/p>","images":false},"title":{"value":"Denmark Holiday - Setting Off"},"version":1},{"date":{"d":16,"m":8,"y":1997},"datev":19970816,"info":{"content":"<p>Got rather drunk. Remember Craig throwing the plates into the woods outside, me and Craig having a play fight which almost resulted in us going in a pond, for getting told off for having a cushion fight and smashing a vase at the expensive hotel. On the way home, got dropped off by the taxi outside St Peter's church, Frimley, dropped Mum and Dad's camera as I got out of the taxi, the taxi drove off and ran over the camera. I paid for a replacement!<\/p>","images":false},"title":{"value":"Phil Clennel's Wedding - The Bew Mill, Eversley"},"version":1},{"date":{"d":6,"m":8,"y":1997},"datev":19970806,"info":{"content":"<p>We spent the day at Chessington World Of Adventures..<\/p>","images":false},"title":{"value":"Chessington World Of Adventures"},"version":1},{"date":{"d":1,"m":8,"y":1997},"datev":19970801,"info":{"content":"<p>Went over to see the Warembourg's for a week. Very chilled.<\/p>","images":false},"title":{"value":"Holiday To France"},"version":1},{"date":{"m":8,"y":1997},"datev":19970800,"images":1,"info":{"content":"<img src='images\/years\/1997\/1997_08_XX-IsteadRise02.jpg' class='diaryImage' alt='Me in dining room of Laura's' \/><p class='diaryImageCaption'>Me in dining room of Laura's<\/p>","images":false},"title":{"value":"Photo"},"version":1},{"date":{"m":8,"y":1997},"datev":19970800,"images":3,"info":{"content":"<p>Went to Greenwich for the day. Cruised the markets. Very nice day.<\/p><img src='images\/years\/1997\/1997_08_XX-Greenwich01.jpg' class='diaryImage' alt='Greenwich' \/><p class='diaryImageCaption'>Greenwich<\/p><img src='images\/years\/1997\/1997_08_XX-Greenwich02.jpg' class='diaryImage' alt='Greenwich' \/><p class='diaryImageCaption'>Greenwich<\/p><img src='images\/years\/1997\/1997_08_XX-Greenwich04.jpg' class='diaryImage' alt='Greenwich' \/><p class='diaryImageCaption'>Greenwich<\/p>","images":false},"title":{"value":"Greenwich"},"version":1},{"date":{"m":8,"y":1997},"datev":19970800,"images":2,"info":{"content":"<p>Went to Kew Gardens for the day. Very nice day.<\/p><img src='images\/years\/1997\/1997_08_XX-KewGardens02.jpg' class='diaryImage' alt='Kew Gardens' \/><p class='diaryImageCaption'>Kew Gardens<\/p><img src='images\/years\/1997\/1997_08_XX-KewGardens03.jpg' class='diaryImage' alt='Kew Gardens' \/><p class='diaryImageCaption'>Kew Gardens<\/p>","images":false},"title":{"value":"Kew Gardens"},"version":1},{"date":{"d":17,"m":7,"y":1997},"datev":19970717,"info":{"content":"<p>Had lots of job interviews this week. SHL on Monday, Saladins on Tuesday, Seiko on Wednesday, AFP and Mile 33 today, and a second interview of Seiko on Friday.<\/p><p>I remember the interview took place in the cramped Mark Pepper's office. I believe Mick Weight and Keith Bloodworth also interviewed me. I mentioned my enthusiasm for database applications which I had done for Armstrongs's. This and my overall enthusiasm, rather than any technical know how, seem to have won them over.<\/p><p>I went for a second interview on Monday 21st.<\/p><p>In the meantime I was working for Roger Hipperson who had a number of projects that required doing. One was a stock system written using BTrieve. Another was a VB app which showed a user inteface for a fighter plane!<\/p>","images":false},"title":{"value":"AFP - Job Interview"},"version":1},{"date":{"d":12,"m":7,"y":1997},"datev":19970712,"info":{"content":"<woops rating=\"5\" woopstitle=\"Waking Up With No Tent Over Us\"><p>We borrowed a tent from Laura's parents. Camping overnight on our holiday the two man tent developed a little tear which overnight with the help of the wind, got bigger and bigger. By the morning we had no cover! Totally open to the elements. The morning after Laura pleaded with her parents to buy a new one because we thought we shouldn't have to and we were really strapped for cash.<\/p><p>Thinking back this was very cheeky of us.<\/p><\/woops><p>On this Holiday we heard plenty about Laura's past holidays!<\/p>","images":false},"title":{"value":"Gower Camping Holiday - Swansea"},"version":1},{"date":{"d":4,"m":7,"y":1997},"datev":19970704,"title":{"value":"Hayling Island - Haven"},"version":1},{"date":{"d":29,"m":6,"y":1997},"datev":19970629,"info":{"content":"<p>Not much planned this weekend. Went to Trosley Country Park.<\/p>","images":false},"title":{"value":"Trosley Country Park"},"version":1},{"date":{"d":25,"m":6,"y":1997},"datev":19970625,"info":{"content":"<p>The night before we camped over at in the queue at Wimbledon. However, I forgot the tent poles. I blame Susan really, as it is her tent, and she packed it away last. So we had to make do using the tent as a large sleeping bag. But the condensation during the night was awful. During the middle of the night, whilst it was lightly raining, I went out to get a big stick to use as the mast for the tent. I kind of worked. I think that nights experience was exactly what I hate about camping. Cold, rainy, condensation, bad night’s sleep.<\/p><p>We made our way to Dad's office in Blackfriars for a cup of tea and a bit of warmth and rest bite. I had to salvage Laura's birthday which wasn't going to well up to now.<\/p><p>We ventured to the old operating theatre where there was a presentation. I fell asleep during this, but Laura assures me that it was very interesting.<\/p><p>We went over to Covent Garden and mooched around a bit there.<\/p><p>We managed to get tickets to see the matinee performance of Miss Saigon at Drury Lane. I must admit I wasn't that gripped, and found it hard to stay awake. In fact I spent more time asleep and I couldn't tell you the story line. Laura on the other hand was involved! She loved it.<\/p><p>In the evening we went out for a nice meal at an Italian, Donatello's<\/p>","images":false},"title":{"value":"Laura's 21st Birthday - Wimbledon Tennis - Sleep Over"},"version":1},{"date":{"d":16,"m":6,"y":1997},"datev":19970616,"info":{"content":"<p>Worked as a security person in the main stand for a week. Saw some footballers. Went up in the posh area where Robbie Fowler and Jamie Redknapp were. David Platt was in the commoners area.<\/p><p>I trained and biked it to the race course each day.<\/p><p>Had a disastrous interview over in Reading for KPMG. I wasn't sure what the job role was. It certainly wasn't a developers role.<\/p>","images":false},"title":{"value":"Royal Ascot Week - Security Guard"},"version":1},{"date":{"d":23,"m":5,"y":1997},"datev":19970523,"images":1,"info":{"content":"<p>During the day Laura and I went to visit Weymouth and went around Portland Bill. Beach was lovely. Got my haircut seem to remember as well.<\/p><p>In the evening we went to the Firestation (which had only just opened) to celebrate the end of our exams with the rest of the course and even some of the lecturers turned up.<\/p><woops rating=\"8\" woopstitle=\"Unbelievably Not Mown Down By Car\"><p>We met at the Firefly and Firkin at 6pm... and then moved on to the Firestation I think.... All gets a bit blurry. I think Susan and Gary came down, and Laura played the part of frogger after exiting the nightclub! Still not sure how one of the cars had actually hit her.<\/p><p>I remember chasing her down into the town, but she was running completely scared. I didn't want her going around the centre of Bournemouth on her own at that time of night. However, I didn't want her to do something stupid like run in front of a car again. Eventually we caught up with each other.<\/p><\/woops><img src='images\/years\/1997\/1997_05_24-Weymouth03.jpg' class='diaryImage' alt='Weymouth' \/><p class='diaryImageCaption'>Weymouth<\/p>","images":false},"title":{"value":"Finals Celebration - Weymouth"},"version":1},{"date":{"d":21,"m":5,"y":1997},"datev":19970521,"info":{"content":"<p>Remember this one I was the least confident about and least enjoyed. I also recollect that Claire was absolutely mortified about this exam, in tears and all sorts. It wasn't as bad as she thought it was going to be as she passed.<\/p>","images":false},"title":{"value":"Finals - Artificial Intelligence Exam"},"version":1},{"date":{"d":20,"m":5,"y":1997},"datev":19970520,"info":{"content":"<p>Felt fairly OK with this one.<\/p>","images":false},"title":{"value":"Finals - Object Orientated Software Engineering Exam"},"version":1},{"date":{"d":19,"m":5,"y":1997},"datev":19970519,"info":{"content":"<p>Felt fairly OK with this one.<\/p>","images":false},"title":{"value":"Finals - Software Engineering Management Exam"},"version":1},{"date":{"d":17,"m":5,"y":1997},"datev":19970517,"info":{"content":"<p>Revision for my finals has gone as well as can be expected. I was very happy that I had kept to my schedule and that I actually have learnt stuff. I figured what subject areas are going to be brought up, and just try and remember each side of the argument on that subject. I had learnt everything that I wanted to for the exams. Written condensed versions for the days leading to the exams.<\/p><p>I had been working so hard towards them, and felt fully prepared. So much so, I decided that going home to mum and dad and having as relaxing a time as possible at home was the best thing for me. I remember doing gardening out the front.<\/p><p>My exam schedule was tough. Whereas others had gaps between their exams, mine were one day after the other. I was glad because the pressure for me would be over quicker!<\/p>","images":false},"title":{"value":"Chill Out Before Finals"},"version":1},{"date":{"d":23,"m":4,"y":1997},"datev":19970423,"info":{"content":"<p>I can't begin to tell you the extreme highs and lows of my dissertation. The dissertation analyzed the software developer, Michael Jackson's, new way of describing Software Requirements in a structured method. My dissertation has consumed my life for a year or more. I can only describe it to be similar to a best man's speech, where no matter how hard you work at it, it sometimes doesn't come out as intended. It's something that eats at you every spare moment you have. Given the extra pressure of it determining the grade you get and therefore how you are set for the job market, the amount of money you can command, etc. etc.<\/p><p>My vow at the start of the academic year was twofold. One - was to understand everything being taught to me at the time it was taught. This way I would relieve myself of pressure at the end of the year when exams came around. Every other previous academic year I've ever been through, relied on me learning stuff in revision. Revision should be for topping up and refreshing arguments to put into answers, not to try and understand something taught 6 months previous, or for you to rote learn stuff.<\/p><p>Two - Was to work hard at the dissertation early on and not to leave it to the last minute. Unfortunately, I done both. Worked extremely hard at it and left it to the last minute. I remember in the last month or two, just working 12+ hours a day in front of the computer, pruning, adding, adjusting, researching, reading. I think it came to about the week before where I had all the content, but absolutely no structure, or putting my point across to the reader. I panicked severely. I think I was taken to the edge. I remember crying on the phone to Laura one evening whilst she was back in Gravesend, and she drove down (with Charlotte who she was babysitting so to speak) all the way to Bournemouth just for a few hours. I needed her so badly then. I don't think I've needed someone there for me so badly. She was a godsend at the time.<\/p><p>I remember I also poured out to dad my dissertation woes. I went home and he tried to help me sort it out. He even arranged to go and meet his friend from the railway. Although they did not really help directly, I realised I was making things so much more complicated than they were or needed to be. I decided to make it an introduction into Michael Jackson's ideas. My first step was to impose a structure almost a contents page, writing the conclusion first, and leading the reader to that conclusion. I continued by putting a bit more detail into the headings, stating what each paragraph was attempting to relay to the reader.<\/p><ul><li>It taught me a great lesson in methodically going through a relatively complicated topic.<\/li><li>It taught me that without an initial goal, a project can have no direction. As I was writing it through the early, middle months, I just thought 'oh it will just all fall into place'. However, it didn't.<\/li><li>It showed me that my family and Laura really cared about me. It was very warming to know this<\/li><\/ul>","images":false},"title":{"value":"Dissertation Hand In"},"version":1},{"date":{"d":10,"m":4,"y":1997},"datev":19970410,"info":{"content":"<p>I started to look for jobs for when I finished Uni. This company near Shalford was my first interview. I flumped, and lowered my confidence even more and my hopes of getting a job after this.<\/p>","images":false},"title":{"value":"Novus Job Interview"},"version":1},{"date":{"d":5,"m":4,"y":1997},"datev":19970405,"info":{"content":"<p>In the evening we went out for a nice meal at an Italian, Donatello's<\/p>","images":false},"title":{"value":"Brighton"},"version":1},{"date":{"m":4,"y":1997},"datev":19970400,"images":1,"info":{"content":"<img src='images\/years\/1997\/1997_04_XX-WellingtonCountryPark.jpg' class='diaryImage' alt='Wellington Country Park' \/><p class='diaryImageCaption'>Wellington Country Park<\/p>","images":false},"title":{"value":"Wellington Country Park"},"version":1},{"date":{"d":15,"m":3,"y":1997},"datev":19970315,"info":{"content":"<p>During the day we went to London. We done the city area and walked up the Monument.<\/p><p>Laura treated me to go and see Ben Elton doing stand up at the Central theatre, Chatham. He was very funny. Still my favourite comedian.<\/p>","images":false},"title":{"value":"Ben Elton Live and Monument"},"version":1},{"date":{"d":5,"m":3,"y":1997},"datev":19970305,"images":1,"info":{"content":"<woops rating=\"7\" woopstitle=\"Gassing, Blowing up House Mates\"><p>Whilst I was a student at Bournemouth Uni, I shared a house with 3 mates. Today I left the gas cooker on all day. Renaud (House mate) entered the house, but fortunately he didn't light up this time. I think he smelt it straight away. Could have been Danish Dynamite.<\/p><img src='images\/years\/1997\/1997_05_XX-GillRenMartinAndy.jpg' class='diaryImage' alt='The housemates who are still alive' \/><p class='diaryImageCaption'>The housemates who are still alive<\/p><\/woops>","images":false},"title":{"value":"The \"Final Solution\""},"version":1},{"date":{"d":19,"m":2,"y":1997},"datev":19970219,"info":{"content":"<p>Handed in Artificial Intelligence and Object Oriented Software Engineering assignments<\/p>","images":false},"title":{"value":"AI and OOSE Assignment"},"version":1},{"date":{"d":14,"m":2,"y":1997},"datev":19970214,"images":1,"info":{"content":"<p>I think we had a Valentines meal in the restaurant below me in Charminster<\/p><img src='images\/years\/1997\/1997_02_14-ValentinesDay.jpg' class='diaryImage' alt='Valentines Meal' \/><p class='diaryImageCaption'>Valentines Meal<\/p>","images":false},"title":{"value":"Valentine’s Day"},"version":1},{"date":{"d":12,"m":2,"y":1997},"datev":19970212,"info":{"content":"<p>Handed in the Software Engineering Management essay<\/p>","images":false},"title":{"value":"SEM Assignment"},"version":1},{"date":{"d":3,"m":2,"y":1997},"datev":19970203,"info":{"content":"<p>Toured and walked around Islington.<\/p>","images":false},"title":{"value":"Angel Islington"},"version":1},{"date":{"d":11,"m":1,"y":1997},"datev":19970111,"info":{"content":"<p>Down in Brighton for the weekend. I even went to the main church, St Peters.<\/p>","images":false},"title":{"value":"Brighton"},"version":1},{"date":{"y":1997},"datev":19970000,"images":1,"info":{"content":"<img src='images\/years\/1997\/1997_XX_XX-01-CharminsterMeal.jpg' class='diaryImage' alt='Meal in Charminster' \/><p class='diaryImageCaption'>Meal in Charminster<\/p>","images":false},"title":{"value":"Special Meal by Laura"},"version":1},{"date":{"y":1997},"datev":19970000,"info":{"content":"<p>Was late in going to see Laura in Brighton. 2 reasons. 1-I stopped off for a drink with work, 2-I ran out of Petrol in the sticks and had to do some walking. Anyway I finally got there and went down the pub where a band was playing. On the way home I think I had my first Indian takeaway!!<\/p>","images":false},"title":{"value":"Down to Brighton"},"version":1},{"date":{"y":1997},"datev":19970000,"info":{"content":"<p>With our free cinema tickets we went to see Daylight. Can't remember anything about the film, so didn't really have a great effect one way or the other!<\/p>","images":false},"title":{"value":"Daylight"},"version":1},{"date":{"y":1997},"datev":19970000,"info":{"content":"<p>I went over to Brighton for the weekend. We travelled up Devil's dyke, went to Newick to help Laura with her assignment.<\/p>","images":false},"title":{"value":"Brighton"},"version":1}],"version":-383667828}