{"entries":[{"date":{"d":31,"m":12,"y":1998},"datev":19981231,"info":{"content":"<p>We were hosting the party at Farnborough, again with Laura's mums family attending. We had prepared with games, drinks and setting up of the room. 23 people came to join the celebrations. It was a fun evening which everyone enjoyed.<\/p>","images":false},"title":{"value":"New Years Eve - Farnborough"},"version":1},{"date":{"d":26,"m":12,"y":1998},"datev":19981226,"info":{"content":"<p>Boxing day party with Laura's mum side of the family. I had almost a pint of Bailey's, before Laura hid my glass. We had lots of games and fun. I spent the next few days there.<\/p>","images":false},"title":{"value":"Boxing Day"},"version":1},{"date":{"d":25,"m":12,"y":1998},"datev":19981225,"info":{"content":"<p>Laura popped round in the morning quickly. We had breakfast then opened some more presents. Had turkey for Lunch and relaxed for most of the day.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":1998},"datev":19981224,"info":{"content":"<p>I worked till 12:30 when I went for a swift drink with work. It was Christmas Presents time! I was worrying what I got Laura and Laura what she got me. I'd bought her the set of 20 Winnie The Pooh books, a knickerbox and M+S underwear set, a yellow fleece and a dress. I know I liked her presents but I thought I should get something she really wants. I'd done a couple of picture frames which I hadn't quite managed to finish.<\/p><p>I got a video recorder which was excellent. It seems quite a good one, some boxer shorts, a car cleaning kit and other bits and bobs. She spent far too much on me. She's also giving me that New York Trip.<\/p><ul><li>Flight = 170 * 2 = 340<\/li><li>Accommodation = 60 * 5 = 300<\/li><li>Laura Other Savings = 400<\/li><li>My Contribution (if needed) = 200<\/li><\/ul><p>We had a nice meal, then opened presents, then Laura had to work the night shift on Christmas Eve.<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":20,"m":12,"y":1998},"datev":19981220,"info":{"content":"<p>I was supposed to play football in the morning, but having a cold and stomach feeling a little dickey, so decided not to go.<\/p><p>We went to Istead Rise therefore and prepared for the party. One by one people called off. We ended up with Helen, Nigel, Robert, Ellie and Michael and Charlotte. During the afternoon I felt ill. I threw up every hour from one till seven. Blood came out of the last lot. Getting worried Laura called the 'on call doctor'. She eventually suggested to call an ambulance which seemed a bit OTT. I was also getting short of breathe. Once the ambulance pulled up, I was injected, oxygen'ed masked and asked a series of questions. After 10 minutes we drove off to Joyce Green hospital, Dartford. Laura came along and was crying. I would have hated to see her if it was something serious. After a lot of waiting and lying around, we eventually go out at 2am. Laura's dad came to pick us up. Laura was fantastic, being very patient and very supportive. It was something I appreciated loads. I lost a subsequent 3 days from it!<\/p>","images":false},"title":{"value":"Laura's Christmas Party Hospital"},"version":1},{"date":{"d":18,"m":12,"y":1998},"datev":19981218,"info":{"content":"<p>Went to Kingston Christmas shopping.<\/p><p>In the evening we went to Guildford to watch Rush Hour at the Odeon. It was very good.<\/p>","images":false},"title":{"value":"Christmas Shopping"},"version":1},{"date":{"d":13,"m":12,"y":1998},"datev":19981213,"info":{"content":"<woops rating=\"7\" woopstitle=\"Almost In A Punch Up With Two Mad Glaswegian\"><p>I played football in the morning against Mytchett Centre Reserves. We comfortably won and I was taken off at half timed despite playing well, which was a shame because dad turned up at half time to watch me play. However, he almost got us into a fight.<\/p><p>We had a free kick and one of their players kicked the ball away. Dad made a sarcastic remark, to which their player bit back on. They eventually called dad and 'old c-word' and I replied 'That's better than being a fat c-word'.<\/p><p>At which a couple of their players started running towards to me. So I turned and begun to run 10 yards or so. They stopped. The rest of the match was very edgy and it had shaken me up. Me and dad left early from the game to avoid any trouble.<\/p><\/woops><p>In the afternoon I went to Gravesend. Laura's Grandma and Grand ad were there. We had a large Sunday lunch, put Christmas decorations up, watched  the football, went to a carol service at Laura's old primary school in Bean, watched Sports Personality of the year which Michael Owen won, then went home last in the night.<\/p>","images":false},"title":{"value":"Mytchett, Scottish, Loons"},"version":1},{"date":{"d":12,"m":12,"y":1998},"datev":19981212,"info":{"content":"<p>In the morning I slept and slept. Dad woke me at 10 o'clock. I was supposed to be sleeping over at Laura's where she was going to me there at 9.15. Ooops. She eventually came round, although none too happy. I made some sausage and bacon sandwiches before setting out to Reading, Christmas shopping. The weather was dull, I was tired and hung over and Laura still not happy from the mornings grump. We weren't very impressed by Reading. All I got was some tacky stuff from a pound shop. I just couldn't be bothered. We came home late afternoon, then went to the football club to see 'Bill Posters Will Be' Band and meet up with the family, including Ann and Mark. It was nice to see Ann again. It was an enjoyable evening, although I've seen the act too many times now.<\/p>","images":false},"title":{"value":"Reading and Bill Posters"},"version":1},{"date":{"d":11,"m":12,"y":1998},"datev":19981211,"info":{"content":"<p>Laura was back in Gravesend with Ellie making a surprise early return from Germany. I on the other hand had the Casuals Christmas Do down at Tracco. It was a great laugh with plenty of cheap beer (1.50 a pint) flowing. Me and Michael were pitched together in the table football and lost 8-0! However, my guess work in the scratch card came to fruition. Last week I predicted Dundee just before it was scratched off and it was! Tonight I said Notts County, and hey presto it was! Everyone thought I cheated. I don't know how I done it. I played a couple of games of pool as well. A great evening with all the boys there.<\/p>","images":false},"title":{"value":"Casuals Christmas Do"},"version":1},{"date":{"d":10,"m":12,"y":1998},"datev":19981210,"info":{"content":"<p>This year’s Christmas Party was held at the Hilton Hotel, Bracknell. Both Lau and I were quite excited by it. We met up with Lau's friend, Kelly's flat. I'd never seen any of Laura's nurse friends before. I think there are about 5 or 6 on her ward. After meeting up with another couple in the mini bus which drove us there. We had a few drinks at the bar before making our way to the tables for the food. Laura was modelling her new shortened haircut, a 'graduated bob', very stunning she looked as well.<\/p><p>Steve was a good laugh as ever. He had another mate which I chatted to a bit. He reminded me of a typical Sandhurst, army officer, student type person. A bit of a mouth. Amanda, Lau's boss, was quite drunk but nice. Many of the elder nurses rated themselves a bit. We sat down at one of the 20 or so tables. There were other companies there as well. The food was OK and there was a real party atmosphere. Laura doing what she does best, saying how sad and dappy she is! Everyone laughs.<\/p><p>After the meal Steve invited me to snort some Whiskey. I hate Whiskey at the best of times. However, I'll try anything new. First attempt was a bit lame, the second not so bad. Not the greatest method of drinking? The mini bus home was hilarious with one of Laura's stories about her grandpop being a chip shop owner in Wales for the army!<\/p>","images":false},"title":{"value":"Laura's Ward Christmas Party"},"version":1},{"date":{"d":6,"m":12,"y":1998},"datev":19981206,"info":{"content":"<p>We won 3-1 (Casuals) in the morning. We were both fairly tired for the remainder of the day.<\/p><p>In the evening we went to Camberley Bowls club for Auntie Sue's and Uncle Richard's 25th Wedding Anniversary. We had a fish and chip supper. Gerry made a speech which he cocked up because he had too much to drink and couldn't read his prepared speech. Carol took over! Quite funny at the time.<\/p>","images":false},"title":{"value":"Auntie Sue's and Uncle Richard's 25th Wedding Anniversary"},"version":1},{"date":{"d":5,"m":12,"y":1998},"datev":19981205,"info":{"content":"<p>We had a busy schedule. We went with Charlotte over to Bracknell to see the premiere of the remade Parent Trap. A film made for Laura I think. Charlotte seemed to be growing very fast. She seemed quieter than usual. We rushed back for the traditional fry-up before linking up with Barrie to go to watch Chertsey beat Leatherhead 1-0. It was cold, grim and raining.<\/p><p>We rushed back again to get ready for my works Christmas party which is to be held on a boat on the Thames. The boat is going to sail to Windsor and back (from Maidenhead). I had my dinner jacket, well actually Dads, and Laura looked beautiful in her short blue number. I didn't know many socially. I suppose there was Rachel, James and James but no one I could go and have a long conversation with. Rachel was getting a bit too friendly. We distanced ourselves and Laura and I had a laugh on our own. The bar was free so I continually knocked back the red wine. Laura was driving unfortunately. There was a roulette wheel, a black jack table, and later on a disco and a very small dance floor. It was something different which I think we both enjoyed.<\/p>","images":false},"title":{"value":"Charlotte, Bazza and Works Xmas Party"},"version":1},{"date":{"d":27,"m":11,"y":1998},"datev":19981127,"info":{"content":"<p>I surprisingly received a work bonus. Not as much as I'd expected, about £700. This coupled with our old Australia money, now house money, can pay off the rest of Laura's bank loan she took out to live down here. Between us we will only have my student loan, which is planned to be paid off by April time. From then on we'll have at least £400 a month to put away.<\/p><p>Laura was working a late so we got to the Kings Head for last knockings. We met up with Nick and Martin.<\/p>","images":false},"title":{"value":"Work"},"version":1},{"date":{"d":22,"m":11,"y":1998},"datev":19981122,"first":{"value":null},"images":1,"info":{"content":"<p>We woke at 6:30am with a hangover. The other two, especially Nick wanted to be back in bed. After breakfast we left for a longish journey to Cornbury Park, near Chipping Norton, for stage 2. We managed to see the leading cars for once. I think No.51 was from Chertsey! There were 160 odd cars in all. We stayed until 130 went past before heading off to Donnington. We didn't see anything spectacular. There was a cock-up somewhere as Donnington was up by Derby. A nice long journey. I stayed in the back and slept quite a bit. We arrived early and saw the Classic Rally. We spectated from one of the two manmade jumps. However, most cars took it as a speed hump and slowed right down. We had a couple of hours to kill, so went down the village and had a swift pint down the pub. We returned to the dark skies of the circuit to watch an entertaining double stage. We saw a car catch light and a roll-over. We headed back cold and not looking forward to the long journey home.<\/p><p>We broke down on the way home as well. Martin said he had AA cover, then realized he hadn't. Lucky Nick somehow got the car going again. He was tired and fell asleep at the wheel for a split second as he smacked into a curb going along the road! A good, long weekend.<\/p><img src='images\\years\\1998\\1998_11_22-RallyTicket.jpg' class='diaryImage' alt='Cornbury Ticket' \/><p class='diaryImageCaption'>Cornbury Ticket<\/p>","images":false},"title":{"value":"Network Q Rally - Cornbury Park"},"version":2},{"date":{"d":21,"m":11,"y":1998},"datev":19981121,"info":{"content":"<p>Left at 9:30am with Nick and Martin to go and see the Network Q Rally. Nick reluctantly drove us to the pre rally show at Cheltenham. It was bitterly cold and not as good as last year. The highlight was getting 2 free Ford Focus hats! We left at about 2pm to go back towards Oxford where we were staying the night. The room was nicer than last year and fairly central. After getting changed we left at 6ish and headed for town. We stopped at various pubs, eating at one of them. I was a good evening and at times felt like throwing up. Couldn't handle the pace these boys were setting. I struggled to make it past 6 pints in 4 or 5 hours.<\/p>","images":false},"title":{"value":"Network Q Rally - Cheltenham"},"version":1},{"date":{"d":20,"m":11,"y":1998},"datev":19981120,"info":{"content":"<p>Totally addicted to this at the moment. Noticing I'm becoming stressed\/short and it's down to this. Played from 9-15pm, when Laura started her night shift, till 4-15am! In the morning I had a headache and I knew I had a hectic weekend in front of me. Not a great move!<\/p>","images":false},"title":{"value":"Civilization II"},"version":1},{"date":{"d":15,"m":11,"y":1998},"datev":19981115,"info":{"content":"<p>I played football in the morning and won 2-0 playing a full match, whilst the others went to church and made lunch. In the evening we went to the world banger finals at Wimbledon. There were some good races, although the evening was too drawn out. It got a bit boring and cold and at the end willing the thing to finish. I hope Helen and Nigel enjoyed themselves. I think they did.<\/p>","images":false},"title":{"value":"Banger Racing"},"version":1},{"date":{"d":14,"m":11,"y":1998},"datev":19981114,"info":{"content":"<p>We had an early-ish start. We caught the train from Woking to Waterloo. We walked to the Royal Festival Hall where we saw the press photography exhibition. It was good to see and inspires me further to take up black and white still photography. However, I need money to buy a camera first! One day perhaps.<\/p><p>We walked to Carnaby Street where we looked for the New York Visitors Centre which had just opened. We couldn't find it at first, then realised it was a flat address and wasn't open! Carnaby Street was disappointing considering its history. It wasn't very busy. The shops weren't anything special. We then decided to venture into Hamley's which was particularly packed. We were both getting tired and decided next to take a bus ride to Peckham. Every other person was black and every other shop was either a butcher or fishmonger. There seemed to be some trouble at Netto where they had closed the shop, with Police and customers inside and a gathering of people outside protesting in not being able to get in! We then took a further bus to Clapham Junction where we caught the train home.<\/p><p>We went shopping at Asda where we bought stuff for the evening's pasta meal. After we had tidied the house up and eaten, Helen and Nigel arrived. They were staying for the weekend. They had announced their secret engagement to us. Nigel hadn't asked Helen's Dad yet, and wasn't planning to do so for a few months yet. Laura got very excited and kept going on about me and her getting married, and about being a bridesmaid. Barrie was at a loose end and so came along with us to the Litten Tree. Laura got drunk which was quite funny and told Barrie to get his best man's speech ready. The evening was nice and relaxed and I enjoyed having Barrie there to chat to. After we returned home we had a much needed bacon sandwich and Laura for entertainment.<\/p>","images":false},"title":{"value":"Carnaby Street, Festival Hall, Peckham"},"version":1},{"date":{"d":8,"m":11,"y":1998},"datev":19981108,"info":{"content":"<p>We played away in Medstead near Alton in the Hampshire Cup. We won 3-2 and I played a full game. I don't think I played my best. I felt a bit unfit and realised I needed to get into shape. On the way back we stopped in the Chicken Inn or something on the A31. Laura was working late, whilst I played on the computer.<\/p>","images":false},"title":{"value":"Footie"},"version":1},{"date":{"d":7,"m":11,"y":1998},"datev":19981107,"info":{"content":"<p>Laura was working an early, whilst I was mainly playing Civilization II again.<\/p><p>We left mid afternoon to go and see the big firework display at Blackheath. First we visited Laura's grandparents in Lee. They cooked us a really nice meal. The source was scrumptious. I was full up and could quite have easily fallen asleep. They seemed in reasonable health, spirits high. They told us lots of stories, mainly about the war or sports turf.<\/p><p>We left about six-ish for the fireworks. Spectacular. The bangers were really loud. Laura said she was afraid. It lasted about 15 or 20 minutes. The only thing was that they didn't have a bonfire this time around. Never mind. We reminisced how we got stuck in traffic the previous year. On the way back, we found that Blackheath was packed. We decided to stop off at the Northbrook pub in Lee. One that Gerry used to frequently frequent.<\/p>","images":false},"title":{"value":"Fireworks at Blackheath"},"version":1},{"date":{"d":6,"m":11,"y":1998},"datev":19981106,"info":{"content":"<p>Laura was working, so went around Susan's for her (now annual) fireworks party. Straight after I went down the Kings Head and met up with Nick and Martin. Laura joined us a little later. Sounded as though she had a traumatic day at work as a patient fitted in front of her and was close to dying by all accounts.<\/p>","images":false},"title":{"value":"Fireworks around Susan's"},"version":1},{"date":{"d":5,"m":11,"y":1998},"datev":19981105,"info":{"content":"<p>Having just received my pay rise to 18.5K. This how I've been spending it.<\/p><ul><li>1007 income<\/li><li>100 rent<\/li><li>100 pension<\/li><li>100 joint account for spending<\/li><li>100 holiday (Australia)<\/li><li>75  Tessa (savings)<\/li><li>100 student loan repayment<\/li><li>200 short term savings<\/li><li>232 general spending\/living<\/li><\/ul><p>These are other assets I have got<\/p><ul><li>1000 Man Utd shares<\/li><li>1400 Holiday account<\/li><li>3000 Laura's TSB savings<\/li><li>1500 Annual bonus<\/li><li>10000 Tessa when it matures in 2003<\/li><li>500 Laura's house deposit<\/li><\/ul>","images":false},"title":{"value":"Money Matters"},"version":1},{"date":{"d":2,"m":11,"y":1998},"datev":19981102,"info":{"content":"<p>I got early the next morning to find that Trevor had spilt beer all over Jon's nice carpet and David wanting a return lift. I had to rush back for football in Aldershot. There wasn't a cloud in the sky and I had a hangover. I'd never played a game of football like Sunday's game. The opposition turned up late and eventually only with 8 men. I had been picked for the first time to play left midfield from the start for the season. I scored the best ever goal from outside the box from a corner. I put the ball in the top right hand corner of the goal. There was even a man on the post that couldn't stop it. The game was a complete farce in the end. They played the offside trap successfully first, but soon we started beating it regularly. At time it was 3 or 4 against the keeper. The score ended up 11 or 12 nil.<\/p><p>As the game began late, we had to rush off to Gravesend, as we had Sunday lunch waiting for us. It was Laura's dad's 47th birthday. The house seemed mad as ever. There was 6 of us around the small kitchen table. After tea we headed back home.<\/p>","images":false},"title":{"value":"Football and Gerry's birthday"},"version":1},{"date":{"d":1,"m":11,"y":1998},"datev":19981101,"info":{"content":"<p>There was torrential rain Saturday which put pay to Chertsey's fixture. We went to the Hogs Back brewery in Tongham to get Laura's dad some beer for his birthday. We then went and had a look at Tracco, Casuals new home ground.<\/p><p>We returned back to the house for a fry up, and spent the afternoon playing a borrowed game of Civilization II. I had a boys night planned with work, whilst Laura went out with Steve, Emma, Nick, Martin, Barrie and James to the Litten Tree and Joe Bananas. I however, went to pick David up in Bracknell, then go on to Jon's in Leatherhead.<\/p><p>We were the first to arrive at Jon's small, but nice, one bedroom flat. We played playstation until Trevor turned up. We took a taxi to Sutton. We got a pizza, then on to a place called Chicago's which was busy. We tried a club called Zoots which was practically empty so came straight back out. It was still raining and queued for 20 minutes to get into Legends night club, only to be turned away because of lack of ID!!! It was the first time I've been embarrassed about being refused entry. I was 23 trying to get into an over 21's. We trudged back to Zoots and went upstairs. There wasn't any atmosphere, no nice looking girls and everyone was on a bit of a downer. Jon and I left an hour later, leaving David and Trevor chatting up some women. I'd spent £50 on a not so brilliant evening.<\/p>","images":false},"title":{"value":"Sutton night out"},"version":1},{"date":{"d":30,"m":10,"y":1998},"datev":19981030,"info":{"content":"<p>Charlotte had come over to stay with Laura earlier on in the week. She come over to my house and played Monopoly. She thought Susan was posh! and couldn't believe how I got away with winding my dad up.<\/p><p>On Friday I went over to Laura's for a surprise evening. She had dressed up and looked gorgeous in her black dress. She had prepared a lamb dinner which was nice and rhubarb and custard (which was inedible burnt!!). She had made her makeup table into a dining table in her room and gave me a present and a card. Because I had already guessed the destination of my surprise trip away treat, she made a booklet of what we'd be doing in New York. It was all very exciting. The place where I've really wanted to go to. After the meal we went to see Small Solders at the Robins cinema. It was entertaining, but not much more than that. We went back to Lau's to finish off the wine.<\/p><p>We also went to see Small Soldiers at Robins.<\/p>","images":false},"title":{"value":"Laura's Special Dinner - cinema"},"version":1},{"date":{"d":25,"m":10,"y":1998},"datev":19981025,"info":{"content":"<p>We got caught out with the clocks again and Laura went to church an hour early.<\/p><p>Football this week was at Crondall Celtic and there were five substitutes including me. I was upset not getting a game.<\/p><p>Steve invited us out to watch a film about Elizabeth I over at Bracknell. We went with Laura and Emma and was a good film.<\/p>","images":false},"title":{"value":"Casuals, cinema"},"version":1},{"date":{"d":24,"m":10,"y":1998},"datev":19981024,"info":{"content":"<p>On Thursday of this week I was told by Mick Weight that my pay will rise from 16K to 17.5K. I was quite surprised to hear that other developers were on similar salaries.<\/p><p>Today I went to Camberley to buy something with Auntie Grace's inheritance money. I wanted to get something related to remember her by. I managed to get a picture of three spitfires flying over London. I was pleased with my purchase, as Grace was from London and she liked talking about the war years.<\/p><p>I went to watch Chertsey get thrashed by Gloucester City. In the evening we went down to the White Hart with Barrie, James, Nick and Martin then on to the Litten Tree, Camberley. It was buzzing there.<\/p>","images":false},"title":{"value":"Pay Rise, Chertsey, Out with the boys"},"version":1},{"date":{"d":18,"m":10,"y":1998},"datev":19981018,"info":{"content":"<p>A bit annoyed that I missed football again, to go and play croquet at Surbiton. My 'bad luck charm' also came along and true to form I wasn't playing very well. However, Laura had to leave to go to work and my fortunes picked up and I could have won in the end... but didn't. I got home mid-afternoon and relaxed for the rest of the day.<\/p>","images":false},"title":{"value":"Croquet"},"version":1},{"date":{"d":17,"m":10,"y":1998},"datev":19981017,"images":2,"info":{"content":"<p>We drove to Shoreditch tube station where we caught the underground to Camden Town. We walked the streets, smelt the funny smells, and looked around the market stalls. I bought some underground boxer shorts and socks. We then caught a bus to Islington where we had a look around Angel. We had a drink in the Australian theme pub, Walkabout, which wetted my travelling dreams. Then walked towards Highbury... Boo.<\/p><p>We caught the underground back to the car and drove straight to the Spectrum where we saw the Guildford Flames play the Kingston Hawks. We went with Phil and Emma, Lau's grandparents and Susan and Mark. I think Bracknell is a better team\/atmosphere to watch<\/p><img src='images\/years\/1998\/1998_10_17-Camden1.jpg' class='diaryImage' alt='Camden Market' \/><p class='diaryImageCaption'>Camden Market<\/p><img src='images\/years\/1998\/1998_10_17-Camden2.jpg' class='diaryImage' alt='Camden Market' \/><p class='diaryImageCaption'>Camden Market<\/p>","images":false},"title":{"value":"Camden Market, Guildford Ice Hockey"},"version":1},{"date":{"d":11,"m":10,"y":1998},"datev":19981011,"images":1,"info":{"content":"<p>We went to Brentwood to see the first ever Fools and Horses convention. Both Boycie and Mike made an appearance. It was held in a marquee by the Nags Head pub. Was a bit disappointed as it was mainly an excuse to sell souvenirs to the punters. The M\/C didn't quite know what to say next sometimes. It was nice to see and sit inside both the three wheeled van and the capri-gear. We queued up for 2 hours for Ken McDonald's and John Challis's autographs.<\/p><p>We made our way home through central London which took ages. doh!<\/p><img src='images\/years\/1998\/1998_10_11-OFAHConventoin-BoycieMike.jpg' class='diaryImage' alt='Us with Boycie and Mike at the OFAH Convention' \/><p class='diaryImageCaption'>Us with Boycie and Mike at the OFAH Convention<\/p>","images":false},"title":{"value":"Only Fools And Horses Convention"},"version":1},{"date":{"d":10,"m":10,"y":1998},"datev":19981010,"info":{"content":"<p>Got up late after a we went down the Kings Head the night before. I had a nice relaxed morning then went to watch Chertsey draw in a dull 0-0 draw.<\/p><p>I treated Susan to a nice Italian meal with me, Lau and Mark. Altico's in Eton was the destination. The food was good. I had a lovely crab for starter that I could really taste, then a slightly tougher than expected veal in a creamy sauce for main. After 2 hours and £107, we finished and went for a drink in a nearby pub.<\/p>","images":false},"title":{"value":"Susan’s 21st Birthday treat"},"version":1},{"date":{"d":4,"m":10,"y":1998},"datev":19981004,"info":{"content":"<p>I had early start as the mighty Casuals were playing down in Eastleigh. However, I was on the bench and was disappointed only to get a 2 minute run out.<\/p><p>I rushed back to play Andrew Dutton in the B class level singles, which I won. However, I only reached there because Lionel had retired due to his leg. Laura had joined me and watched. She said she was \"proud\" of me!! We went down for a short while where dad was laying a floor down for our newly fitted kitchen. Lau went to even-song, while I had a long overdue bath.<\/p><p>We went to Emma and Phil's in the evening where we had take away Pizza, played chess and chatted, which was nice.<\/p>","images":false},"title":{"value":"Croquet"},"version":1},{"date":{"d":3,"m":10,"y":1998},"datev":19981003,"info":{"content":"<p>This weekend was very much a croquet weekend. It was the last weekend that the Woking lawns were open until next spring. I woke in the morning a bit worse for wear after my trip to the football club o see 'Bill Poster Will be Band'. It was the first time in years I sat down with Hedgehog to watch it\/ They were very good.<\/p><p>Laura came to watch me beat Andy Davies, who had played in the All England National Finals the week before. Laura was on a late shift, while I went down with Dad to watch Chertsey lose to Bognor. Their club was very nice. Seemed like they had a good setup there. The evening was spent playing Championship Manager 2.<\/p>","images":false},"title":{"value":"Croquet"},"version":1},{"date":{"d":30,"m":9,"y":1998},"datev":19980930,"info":{"content":"<p>I asked Susan to help me look for an engagement ring in Farnham today. All really too expensive though.<\/p>","images":false},"title":{"value":"Wedding Ring Shopping"},"version":1},{"date":{"d":27,"m":9,"y":1998},"datev":19980927,"images":1,"info":{"content":"<p>I left at 5:50am to meet Paul Maynard by the motorway. It took 50 minutes to get to Havant where we started our ride. We met up with Jon Cooper. This charity event had about 120 riders of which 90% seemed serious or club riders. We departed at 7:50. After 3 or 4 miles I decided that I wanted to push away from the other 2 as I fancied keeping up with the club riders, which I did for a few miles.... then my chain looped in a couple of places and had to stop to my extreme annoyance for 3 or 4 minutes. I expected the other 2 to pass me, but they didn't. I continued solely but got lost from West Meon. I ended up close to Droxford. Having gone 5 or 6 miles out of my way I met up with Jon (who was on his way back) and Paul at the half way stage. I took on some much needed food and drink. I was determined to try and catch Jon up, although I went with Paul for the first 3 or 4 miles, which meant walking up some hills. Jon must have been 45 minutes ahead by now and so gave up hope passing him. I cycled on my own for all the way back, only passed by 3 or 4 club riders who were going impressively fast. My bike was a cheap wreck. I couldn't get to the bottom 7 or 8 gears nor the top 3 or 4. As a result I really struggled up the hills. I also struggled down them with less than adequate brakes! The hill at Exton was memorable, not only for its size, but because I had climbed it when I went wrong the first time round! One I would like to re-visit.<\/p><p>Quatre past two, I ambled back to the finish line. I was starving. I was surprised not to see Jon. Both he and Paul got lost and so all ended up doing closer to 70 miles. I waited half an hour for Jon and one and a half hours for Paul. I felt surprisingly fit after the ride. An hour later and I could do everything again.<\/p><img src='images\/years\/1998\/1998_09_27-Laura.jpg' class='diaryImage' alt='Laura in my bedroom' \/><p class='diaryImageCaption'>Laura in my bedroom<\/p>","images":false},"title":{"value":"100km Bike Ride - Havant"},"version":1},{"date":{"d":26,"m":9,"y":1998},"datev":19980926,"info":{"content":"<p>We had a lie in, before retrieving our cars from Fleet. We took Barrie along to watch Chertsey draw 2-2 with Romford. He enjoyed it and wanted to go next week. I didn't think we played very good football.<\/p><p>In the evening we went out with Susan and some of her friends to the 'Three Mariners' in Bagshot. We didn't follow on Pantiles because I needed an early night for Sunday's exploits.<\/p>","images":false},"title":{"value":"Chertsey with Barrie and Out With Susan"},"version":1},{"date":{"d":25,"m":9,"y":1998},"datev":19980925,"info":{"content":"<p>David was leaving AFP to go to another job. We had a few drinks down the Flying Goose where Laura and 20 or so others joined us. We then went to an Indian (Rajput) then on to The Old Emporium. At the end, we walked to Fleet station, got a train to Farnborough and walked home from there!!<\/p>","images":false},"title":{"value":"David's leaving do"},"version":1},{"date":{"d":20,"m":9,"y":1998},"datev":19980920,"info":{"content":"<p>On Sunday I played football and enjoyed my left midfield position. I then went to the Barnett family picnic at Frimley Lodge Park, then had another croquet match against Geoff Cuttle.<\/p><p>In the evening me, Lau, Susan, Mark (Susan's boyfriend), mum and dad went to Elstead Mill for a meal. The location was lovely, the food ordinary. We were all tired by the end of the evening<\/p>","images":false},"title":{"value":"Susan's 21st Birthday"},"version":1},{"date":{"d":18,"m":9,"y":1998},"datev":19980918,"info":{"content":"<p>Me and Lau decided to treat her family as a thanks for their help and support, and to say goodbye to Ellie who was off to Germany for her placement year. We took them to a hotel by the river front in Gravesend. It was a really good evening. I want to claim this as the largest amount I have eaten in one course. It was a huge mixed grill.<\/p>","images":false},"title":{"value":"Thank You Meal"},"version":1},{"date":{"d":16,"m":9,"y":1998},"datev":19980916,"info":{"content":"<p>I told mum about my wanting to marry Laura. It seems all of a sudden as if something had clicked which had made me decide that I wanted to make a serious proposal.<\/p>","images":false},"title":{"value":"Wanting to marry Laura"},"version":1},{"date":{"d":13,"m":9,"y":1998},"datev":19980913,"info":{"content":"<p>Laura went to Haven (Hayling Island) in the morning, whilst I had my first full game since the injury and didn't play that well in defence. I felt my muscles ache days afterwards. The evening was spent playing a long game of Risk.<\/p>","images":false},"title":{"value":"Football"},"version":1},{"date":{"d":12,"m":9,"y":1998},"datev":19980912,"info":{"content":"<p>The weather was on off-ish all day for Kieron's wedding. A family occasion. However, it showed to me how detached we were to this part of the family. I think we only exchanged a few words with them. I blame dad for that. The service was performed by the Archer hotel, Shepperton, the reception at the Runnymede Hotel. It was nice to catch up with Susan again.<\/p>","images":false},"title":{"value":"Kieron's Wedding"},"version":1},{"date":{"d":8,"m":9,"y":1998},"datev":19980908,"images":2,"info":{"content":"<p>The Mongolian restaurant (Jolly Farmer Roundabout) was a choice we both wanted to do, as our list of different kinds of food has grown. We taxied down in the dark, miserable weather. We weren't quite sure what to expect:- An Indian or a Chinese style meal? Since I've converted Laura to meat, the range of restaurants we have to choose from is much larger. Anyway this was a buffet type affair where you choose which foods you wanted and could keep going back for more. Anyway an enjoyable night.<\/p><img src='images\/years\/1998\/1998_09_08-GoingOutAnniversary-1.jpg' class='diaryImage' alt='3rd Going Out Anniversary' \/><p class='diaryImageCaption'>3rd Going Out Anniversary<\/p><img src='images\/years\/1998\/1998_09_08-GoingOutAnniversary-3.jpg' class='diaryImage' alt='3rd Going Out Anniversary' \/><p class='diaryImageCaption'>3rd Going Out Anniversary<\/p>","images":false},"title":{"value":"3rd Going Out Anniversary"},"version":1},{"date":{"d":6,"m":9,"y":1998},"datev":19980906,"info":{"content":"<p>Played my first competitive game since my injury at Christmas. I came on as sub and enjoyed it. The afternoon was spent relaxing as Laura worked.<\/p>","images":false},"title":{"value":"First competitive game for Casuals since my injury"},"version":1},{"date":{"d":5,"m":9,"y":1998},"datev":19980905,"info":{"content":"<p>I went to see Chertsey beat Leatherhead to go top of the table. It wasn't the best I've seen them play, but they played intelligent, attractive, keep-ball football. In the evening we were supposed to meet up for Jas's birthday in Bar Mambo, Guildford. However, as we arrived a little later we seemed to miss them.<\/p>","images":false},"title":{"value":"Bar Mambo"},"version":1},{"date":{"d":4,"m":9,"y":1998},"datev":19980904,"info":{"content":"<p>It's been several weeks since I've been out with my friends. Me, Nick, Martin and James went down the Kings Head for a few bevies. That evening I had a phone call from Laura's grandma reporting that she was picture in the Camberley News. Laura had lost her graduation picture, someone had picked it up and given it to the paper, appealing for the owner to collect it. Only would happen to Laura :) Anyway I bought 4 copies of the paper and took it down the pub for the lads to see. Laura came down a little later and made a big scene and got all embarrassed. We all had a laugh in the end.<\/p>","images":false},"title":{"value":"Lau in the Paper"},"version":1},{"date":{"m":9,"y":1998},"datev":19980900,"images":2,"info":{"content":"<img src='images\/years\/1998\/1998_XX_XX-01-Summer.jpg' class='diaryImage' alt='Summer' \/><p class='diaryImageCaption'>Summer<\/p><img src='images\/years\/1998\/1998_XX_XX-04-Summer.jpg' class='diaryImage' alt='Summer' \/><p class='diaryImageCaption'>Summer<\/p>","images":false},"title":{"value":"Photos"},"version":1},{"date":{"d":30,"m":8,"y":1998},"datev":19980830,"info":{"content":"<p>We drove to Ramsgate to meet up with the Weston's and Michael who were yachting. However they were about to sail back towards Gillingham, so we took Charlotte and spent half a day at Margate beach and Dreamworld before heading on to Queenborough. We then made it back to my place that Night. Total mileage for the 8 days was about 1200 miles!!<\/p>","images":false},"title":{"value":"Yachting in Ramsgate"},"version":1},{"date":{"d":29,"m":8,"y":1998},"datev":19980829,"info":{"content":"<p>We unpacked, went into Camberley to do some banking, then went to watch Chertsey win 2-0 against Whyteleafe. We relaxed that evening in Gravesend, watching a weird sci-fi, Bladerunner.<\/p>","images":false},"title":{"value":"Chertsey, Gravesend"},"version":1},{"date":{"d":28,"m":8,"y":1998},"datev":19980828,"info":{"content":"<p>We drove to Lizard lighthouse in the morning, before making our way to Penzance where we again looked around the town. We finally made it to Lands End where there was an enclosed village area for tourists. We relaxed there for a while. Our mission was reach there and so it didn't seem important to stay on travelling any further. It was about 5pm and proposed to go home and try do the whole journey along the A30! This is what we done, however going via St. Ives. We made it back by 11pm!<\/p>","images":false},"title":{"value":"West Country Holiday - Penzance, Lands End, Home"},"version":1},{"date":{"d":27,"m":8,"y":1998},"datev":19980827,"info":{"content":"<p>In the morning Laura swum in the sea for 15 minutes in Lusty Cove just by Newquay. I was too chicken and not one to usually to shy away from these challenges, but Laura beat me fair and square with this one. It was bloody cold for an early morning swim.<\/p><p>We then looked around Truro, then onto a Cider farm which was quite nice.<\/p><p>We went to Falmouth where we promenaded and circle the Falmouth AFC ground where I had been 10 years previous. We drove through the back roads to Lizards Point where we had a nice meal and evening stroll along the cliff tops. The campsite was nice and for once I had a good nights' sleep.<\/p>","images":false},"title":{"value":"West Country Holiday - Truro, Falmouth, Lizards Point"},"version":1},{"date":{"d":26,"m":8,"y":1998},"datev":19980826,"info":{"content":"<woops rating=\"8\" woopstitle=\"Knocked Over OAP In Car\"><p>The weather was just about OK today. We were tipped to go to Polperro on the south coast. I managed to knock an old man over whilst driving really slowly in the narrow streets. I got out srtaight away. He was OK thankfully. Not sure how I managed it.<\/p><\/woops><p>After a lot of walking we made our way to St Austell where we went to a boring shipwreck museum, then to a brewery.<\/p><p>We moved on to Newquay, which was buzzing with holiday makers. The campsite was an expensive £11! We looked around the town in the evening before watching Man Utd playing in a European Cup prelim round.<\/p>","images":false},"title":{"value":"West Country Holiday - Polperro, St Austell, Newquay"},"version":1},{"date":{"d":25,"m":8,"y":1998},"datev":19980825,"info":{"content":"<p>The weather turned for the worse as we made our way through the Dartmoor hills. I felt sorry for the ice cream van in a car park with no punters. We reached Plymouth for lunch. In town there was a YHA shop which had lots of information about holidaying in Australia, especially for those who wanted to travel around. Plymouth seemed out of character to the south west. I suppose being a big navel town it was a little different anyway. It wasn't pretty, filled with 60's and 70's style buildings. After looking around the shops, we scooted to Bodmin. Due to the worsening weather we decided to stay in a B+B. This B+B was in fact someone's house, where we stayed as guests. A bit weird but quite nice really. We had a pub meal, watched Bodmin get beat by Penzance in water polo, then I done 500m of swimming, a record for me I think!<\/p>","images":false},"title":{"value":"West Country Holiday - Dartmoor, Plymouth, Bodmin"},"version":1},{"date":{"d":24,"m":8,"y":1998},"datev":19980824,"info":{"content":"<p>We left early on Monday morning to look around Exeter swiftly, then shifted on to the Torbay area. The weather at last was good. We walked to the beach in Paignton where we saw Matthew Marsden and Bewitched on the radio 1 road show.<\/p><p>In the afternoon we went to Goodrington Sands where there was a water slide park. This was ace! 7 slides all of which were brilliant. I went go-karting afterwards, then drove to see Brixham, before spending ages finding a campsite in Torquay.<\/p><p>Torquay in the evening had almost a Mediterranean feel to it.<\/p>","images":false},"title":{"value":"West Country Holiday - Torbay"},"version":1},{"date":{"d":23,"m":8,"y":1998},"datev":19980823,"info":{"content":"<p>We woke in the tent to rain! Everything damp with nothing to dry it with. We went to a Cheddar church (not one made from cheese:), before going to the gorge where it tipped down, and went to the expensive Wookey Hole.<\/p><p>We then made our way to meet my old University friend, Dan Snell, in Crediton. We went to pub in Exeter with his girlie Karen. We had a good laugh and stayed the night at his nice parents house.<\/p>","images":false},"title":{"value":"West Country Holiday - Cheddar and Meet up with Dan"},"version":1},{"date":{"d":22,"m":8,"y":1998},"datev":19980822,"info":{"content":"<p>Laura was working an early on the day we were to leave for our summer holiday, so I had to do a lot of the packing. I was looking forward to getting away, but wasn't ecstatic as we weren't going abroad. Still a cheap holiday means more money for Australia.<\/p><p>We drove down and stopped off at Millfield school where I had been on 2 previous holidays, and Weston Super Mare, which was lively. It reminded us of Southport a bit. We camped close by for the night.<\/p>","images":false},"title":{"value":"West Country Holiday - Setting Off"},"version":1},{"date":{"d":16,"m":8,"y":1998},"datev":19980816,"info":{"content":"<p>We spent today sailing back towards Dover. I realize I'm not a sailor as my stomach didn't feel particularly stable at the end of it. We moored mid afternoon and Laura and I looked around the town. Nothing special really. We had a meal in the pub before venturing home via Gravesend.<\/p>","images":false},"title":{"value":"Sailed back to Dover"},"version":1},{"date":{"d":15,"m":8,"y":1998},"datev":19980815,"info":{"content":"<p>We set off early in the morning in the drizzling rain towards Dover. We dumped the car and began our trek to Deal via the cliff top route. At first it was a difficult ride, with hills and awkward terrain. It became easier and the weather brightened. The scenery was good and you could quite easily go over the top so to speak. We approached St. Margaret Bay (where Auntie Ada used to live) when Laura screamed out. She'd been stung by a wasp. It had taken us a while to reach this point, so we decided we had to get a move on and took the road route to Deal.<\/p><p>We got to Linda and Alan's and was told we were going to Linda's family BBQ. David and girlfriend, Alison, were also there and we chatted quite well. After spending a couple of hours there we both cycled on to Sandwich along the toll road. It was really nice. Laura then took the train to Ramsgate, whilst I cycled. I managed to beat her there! We spent ages trying to find Gerry's boat, who was moored in the marina area. There were loads of boats. After we found it and met up, we went for fish and chips and a few drinks down the pub.<\/p>","images":false},"title":{"value":"Dover to Ramsgate bike ride via Linda and Alan's"},"version":1},{"date":{"d":14,"m":8,"y":1998},"datev":19980814,"info":{"content":"<p>We went into Gravesend in the evening to meet up with Helen, Nigel and William. We met in the Weatherspoons pub.<\/p>","images":false},"title":{"value":"Gravesend pubbing"},"version":1},{"date":{"d":11,"m":8,"y":1998},"datev":19980811,"title":{"value":"Lau moved in to Farnborough"},"version":1},{"date":{"d":10,"m":8,"y":1998},"datev":19980810,"info":{"content":"<p>We left at 5:30am, taking Howard up to Alton Towers. Me and Howard chatted for 2 hours before our first resting spot. The day was good. The new 'Oblivion' ride was very quick, able to feel the G-Force on your face. However, for pure exhilaration, Nemesis is still the top ride. We managed it home by midnight after a short excursion for Chips and half Fish!<\/p>","images":false},"title":{"value":"Alton Towers"},"version":1},{"date":{"d":9,"m":8,"y":1998},"datev":19980809,"info":{"content":"<p>Another early shift for Laura. I went to the first training session of the season for Casuals. I thought I'd done reasonable well. After post match drinks I went round to Barrie's to watch Man Utd get thrashed by Arsenal in the Charity Shield.<\/p><p>Later in the afternoon we showed Laura's parents her new place in North Camp \/ Farnborough. You could see right down the runway of Farnborough airfield. We then went to Chiquitto's, a Mexican restaurant, for Emma Barnett's 30th birthday. I wasn't impressed by the food, but it was a good laugh.<\/p>","images":false},"title":{"value":"Chiquitos"},"version":1},{"date":{"d":8,"m":8,"y":1998},"datev":19980808,"info":{"content":"<p>Laura had an early, so it gave me a chance to do some bits and pieces, such as car and bike stuff and shopping for the BBQ. It was the hottest day of the year. When Laura returned we went for a bike ride from St John’s to Byfleet along the Basingstoke Canal. Laura done very well, keeping up the pace. It was a lovely ride and I now want to do the River Wey from Weybridge to Guildford. I have now ridden the length of the Basingstoke Canal (in chunks).<\/p><p>We rushed home as we hosted our first dinner party. Well not really a dinner party, more of an informal BBQ. The guests were David and Rachel from work. It flowed quite well, although the dinner was slightly burnt and Lau was very nervous. We sat in the back garden, and had a laugh. It was nice and something I would like to try again. We left the washing up and carried over the evening to Bracknell to watch 'Lost In Space', a sci-fi about a family and crew in space. It wasn't really up to much. 5 out of 10, so said everyone.<\/p>","images":false},"title":{"value":"Canal Bike Ride - David and Rachel for BBQ"},"version":1},{"date":{"d":2,"m":8,"y":1998},"datev":19980802,"info":{"content":"<p>Sunday was much the same activities and scorching weather. We eventually made it home in the evening. Exhausted!<\/p>","images":false},"title":{"value":"Mill Rythe"},"version":1},{"date":{"d":1,"m":8,"y":1998},"datev":19980801,"info":{"content":"<p>We checked out Sinah Warren where Laura and her family used to spend many a holiday when she was a lot younger. It was higher quality than Mill Rythe, but all the holiday makers were over 50! We sunbathed and even swam on the main beech whilst waiting for Lau's parents. They eventually arrived, and after a fry up, made our way to Haven. The temperature was quite hot. We challenged Lau's parents to all of the games. Laura is defiantly not a sportswoman.<\/p>","images":false},"title":{"value":"Mill Rythe"},"version":1},{"date":{"d":31,"m":7,"y":1998},"datev":19980731,"info":{"content":"<p>Mum and Dad went on holiday yesterday to see Mormor for 12 days, so Laura came over to stay with me. Steve Laidlaw also moved out today from Susan's old room.<\/p><p>We left at 8:30am to go to Brighton for Laura's graduation at the Brighton Centre. Once I dropped her off, Dad's car over heated! arrgggghhh. I still had to meet up with Laura's parents and Charlotte. I managed it, just about. The ceremony was 2.5 hours and was OK. Laura was quite nervous. After lunch by the marina, Lau's parents went home and we went to get Lau's photo's done. The pier was a nice resting place, but the fine weather turned to slight drizzle. We went back to the 'old sausage pub', by the station, but it had changed owners and was no longer. :( However, we did eat here, although I did get asked for ID!!! I'm 23!!<\/p><p>We made our way to Hayling Island where we camped on a 'Ancell Estate' camp site. As the weather was good, I enjoyed the night and got me enthusiastic for camping again.<\/p>","images":false},"title":{"value":"Lau Graduation Ceremony and Hayling Island"},"version":1},{"date":{"d":25,"m":7,"y":1998},"datev":19980725,"info":{"content":"<p>Went to Guildford shopping I think then on to Farnham for a meal.<\/p>","images":false},"title":{"value":"Day Out With Richard and Karen"},"version":1},{"date":{"d":24,"m":7,"y":1998},"datev":19980724,"info":{"content":"<p>What can I say. Talked into it.<\/p>","images":false},"title":{"value":"Cinema - Grease"},"version":1},{"date":{"d":19,"m":7,"y":1998},"datev":19980719,"info":{"content":"<p>Left early in the morning to go paint balling with James, Barrie, Duncan and Martyn B. Laura went to church, then work. It was great fun and cost about £40 or £50. We played 5 different games, each of them twice. I started off well and tailed off to OK-ish.<\/p><p>The evening was spent having 'Sunday lunch' then going round to sort Barrie's dad out with his computer. Then played Championship Manager with Steve.<\/p>","images":false},"title":{"value":"Paint Balling"},"version":1},{"date":{"d":18,"m":7,"y":1998},"datev":19980718,"images":2,"info":{"content":"<p>Laura had an early shift, so I got up with her to make sure she got off OK. I then slept in for a while, as I was so tired. I transferred the graduation and Prague holiday onto video tape. Steve Laidlaw and I went to watch Chertsey get beat in a pre-season friendly in front of 615 spectators. Laura joined us later.<\/p><p>Me and Lau went straight after the match to catch a train from Chiswick Park to get up to Piccadilly Circus. This evening was my birthday treat. Laura had seen a restaurant from previous trips to London and planned to take me there... However, she couldn't find it. We walked down Haymarket to Trafalgar Square and back to Piccadilly Circus. Arrgghh. We eventually found it on Rupert Street. It was Cafe Fish. I had smoked salmon for starter and the biggest platter you wished to see. It contained crab, three king prawns, normal prawns, oysters, cockles and muscles. It took me about 45 minutes and I still couldn't finish it. It was quite expensive, but very enjoyable. We planned to see the re-release of Grease, but we couldn't find anywhere suitable to watch it, so we made the long trip home and went to bed.<\/p><img src='images\/years\/1998\/1998_07_18-CafeFish23rdBdaySurprise.jpg' class='diaryImage' alt='My birthday treat at Cafe Fish' \/><p class='diaryImageCaption'>My birthday treat at Cafe Fish<\/p><img src='images\/years\/1998\/1998_07_18-CafeFish-CoventryStreet1.jpg' class='diaryImage' alt='My birthday treat at Cafe Fish' \/><p class='diaryImageCaption'>My birthday treat at Cafe Fish<\/p>","images":false},"title":{"value":"23rd Birthday surprise"},"version":1},{"date":{"d":17,"m":7,"y":1998},"datev":19980717,"title":{"value":"Cinema - Godzilla"},"version":1},{"date":{"d":17,"m":7,"y":1998},"datev":19980717,"info":{"content":"<p>After a very hectic week, I had a hectic weekend planned. We went with Steve Laidlaw to view a house in Cove and in Aldershot. The first property assumed Steve and Laura were going to share a bed together :), so that was out of the question. The other was in Aldershot town centre, small and wasn't available until late August. In between the 2 visits we went to Uncle Peter and Aunty Lindey's house. I've never seen anything like it. It was so untidy and filled with boxes, books and goodness knows what. It was chaos. The front room was no more, instead we had a cup of tea in Peter's office. We all had a laugh and stayed for about half an hour. A really unique and charming place.<\/p><p>We went to get some fish and chips for dinner and stood over the railway bridge in Frimley Green to eat them.<\/p><p>Bracknell was next on our tour, to watch the first showing of Godzilla with David, and the 2 Steve's. The film wasn't very hot but it was nice to see the film with some of my work friends and home friends.<\/p>","images":false},"title":{"value":"House Searching for Laura"},"version":1},{"date":{"d":13,"m":7,"y":1998},"datev":19980713,"info":{"content":"<p>Monday it was glorious weather again, but it was the end of our long weekend :( We booked out, played a little tennis and went home. We done things around the house before we had to go to work. I played croquet in the evening and I spoke to Steve Laidlaw who moved in temporarily. Laura came round to sleep and we watched the film Trading Places.<\/p>","images":false},"title":{"value":"Haven"},"version":1},{"date":{"d":12,"m":7,"y":1998},"datev":19980712,"info":{"content":"<p>I failed to make breakfast today. I was dead to the world. Apparently Steve had woken his Mum and Dad up at 3am in the morning, asking for an alarm clock. He had to leave for bowls early! :) The weather was beginning to spoil things. It was still raining. For most of the day we done quizzes. In the morning we done bowls, croquet and curling, table tennis and trivial pursuit. We had our swimming and sauna competitions as usual which I won. We watched the World Cup final in the evening before the comic show and an early night.<\/p>","images":false},"title":{"value":"Haven"},"version":1},{"date":{"d":11,"m":7,"y":1998},"datev":19980711,"info":{"content":"<p>I got up late and just got breakfast in time. We played uni hock, bowls, boules and skittles before all of us went to the greasy spoon on the sea front. After the amusements and a look around the fairground, where I lost a 'lads punching competition', the heavens opened and it began to rain and rain. We done some quizzes in the afternoon, along with a hilarious game of snooker.<\/p><p>After dinner, We played this wicked drinking game.... Laura's mum interrupted the game and said we had to watch the cabaret. A disco followed and pressure was put on me when a Haven mate asked me to dance. Everyone was very drunk by the end of the evening, especially Steven. We played 21's, a drinking game which was very funny. Will always be remembered for Takazumi Katayama.<\/p>","images":false},"title":{"value":"Haven"},"version":1},{"date":{"d":10,"m":7,"y":1998},"datev":19980710,"images":1,"info":{"content":"<p>Friday began at 6:30am with present opening before Laura and Dad had to go off to work. I got some 1831 aftershave, a radio, Only Fools and Horses (series 2) and The Spy Who Loved Me. A pair of shorts, and the 'Best Anthems In The World' album, a cocktail shaker, a glass, some chocolates, an Eric Cantona book, a tennis racket and some other nik-naks. I got around a dozen cards. We went to work as usual, but I had a half day.<\/p><p>We headed down towards Hayling Island and met up with Helen and Nigel in a pub. Spent the evening down at Haven.<\/p><p>After dinner we went to Helen and Nigel's chalet and had birthday cake and presents from Laura's family. They all sang happy birthday, which was nice. We went off to play snooker, whilst having quite a few bevies. The cabaret, after, we had another 7 odd pints. Finally I tried to down half a pint which I succeeded for 5 seconds ...... but then threw back up into the pint glass it had just came out of. I then tried to drink this!!! but luckily was stopped. I then placed the glass strategically where Laura's mum was. She wasn't looking and picked the glass up thinking it was her drink. Again luckily it didn't go any further, but she wasn't too happy. What a great son-in-law I am. We then went to Hudson's for a bit more drinking and dancing.<\/p><img src='images\/years\/1998\/1998_07_10-Haven02.jpg' class='diaryImage' alt='At Haven, Hayling Island' \/><p class='diaryImageCaption'>At Haven, Hayling Island<\/p>","images":false},"title":{"value":"My 23rd Birthday - Haven"},"version":1},{"date":{"d":5,"m":7,"y":1998},"datev":19980705,"images":1,"info":{"content":"<p>Laura and Steve had another appointment to see a house in Cove again. This house was in contrast to the other one. It was very neat and tidy, but the main their laid a lot of rules down which Laura did not like. We then rushed over to Gillingham to go yachting with Laura's parents. Steve and Mat came along. This was good fun. Laura slept a lot of the time whilst me and Steve went swimming in the 'med' as Laura called it. The water was green and both of us took a few mouthfuls. Although it was overcast, it was quite warm. Some boatman came along and just as we were getting aboard, he accused of us of being ship vandals!! I had a headache when I came out and didn't feel too good. We must have been in their in half an hour. I thoroughly had a good laugh and enjoyed the cruise. We made it back home by 10 o'clock.<\/p><img src='images\/years\/1998\/1998_07_05-MedwaySwim.jpg' class='diaryImage' alt='Me at Horse Guards Parade' \/><p class='diaryImageCaption'>Me at Horse Guards Parade<\/p>","images":false},"title":{"value":"Babar - Swim"},"version":1},{"date":{"d":4,"m":7,"y":1998},"datev":19980704,"info":{"content":"<p>We went shopping in the morning with Laura £120 clothes allowance. 3 hours later we eventually finished. I deserve a medal! We then out with Emma and Steve Laidlaw to look for a place for both of them to live. Emma came along to. We went to look at a place in Prospect Road in Farnborough. Rough. It really wasn't very nice and the other lodger looked really dodgy. I was a bit down after five minutes. I didn't want Laura moving into a place like that. I felt at the time that I wanted to move in with her and care for her. We went home and Steve came round to watch the end of the Holland V Argentina game. Mathew and his friend Mark also came round later on. Mum had set aside this evening as an 'American Evening'. We had an American meal which was a refreshing change. We also tried to play American dominos but Mum and Dad had forgotten what the rules were. We spent the evening playing Risk, watching the Germans get beat, One Foot in the Grave and License To Kill.<\/p>","images":false},"title":{"value":"House Search"},"version":1},{"date":{"d":3,"m":7,"y":1998},"datev":19980703,"info":{"content":"<p>It was the quatre finals of the World Cup. It was a night to saver. Steve Laidlaw and Barnett's Emma came over to watch it with me. Laura, mum and dad. It was the first time either had come round to my house. The match was very gripping and Denmark even took the lead. The atmosphere was nice, tense and exciting. Laura and Emma seemed to get along fine. Brazil won 3-2 in the end. After the match we dropped Emma back, as she was tired, and me, Lau and Steve went down the White Hart for a drink.<\/p>","images":false},"title":{"value":"Denmark V Brazil"},"version":1},{"date":{"d":28,"m":6,"y":1998},"datev":19980628,"info":{"content":"<p>Laura went to church and I played football in the morning. After lunch we went to Windlesham with our bikes. We rode round the picturesque fields on this typical summers day. We relaxed and watched the village cricket as well.<\/p><p>Laura's officially now got a certificate from Brighton University for a diploma in Children's Nursing.<\/p>","images":false},"title":{"value":"Windlesham Bike Ride and Nursing Diploma"},"version":1},{"date":{"d":27,"m":6,"y":1998},"datev":19980627,"images":1,"info":{"content":"<p>From lasts nights disastrous Wimbledon sleep over, I drove back home, got a few hours kip and returned We returned to London and went to see the Horse Guards Parade and the Cabinet War Rooms. We then walked to Covent Garden where it started to rain hard. Lightening was also seen. We eventually entered a pizza parlour at the edge of Trafalgar Square and Whitehall (after running out of one restaurant because it was too expensive). We made it back home for an early evening where we got ready to go out to David and Rachel's.<\/p><p>We arrived there about 10pm. The flat was large. James Anderson was there and two others, who were David's friends. However we weren't best pleased what was going on and felt very uncomfortable. Topic of conversation wasn't that uplifting either. We left at 2am.<\/p><img src='images\/years\/1998\/1998_06_27-HorseGaurdsParade01.jpg' class='diaryImage' alt='Me at Horse Guards Parade' \/><p class='diaryImageCaption'>Me at Horse Guards Parade<\/p>","images":false},"title":{"value":"Cabinet War Rooms and David-Rachel party"},"version":1},{"date":{"d":26,"m":6,"y":1998},"datev":19980626,"images":1,"info":{"content":"<p>It has become tradition that we go to see the tennis at Wimbledon each year. It would have been nice for Laura's birthday, but instead we planned to camp over a day late. It was also England V Colombia in the final group game in the World Cup. Needed a result in order to make sure we're in the knock out phases. We watched the game with the boys in North Camp. The atmosphere was brilliant, especially as we turned in a good result and performance.<\/p><p>We then rushed up to Wimbledon in Laura's car.<\/p><woops rating=\"5\" woopstitle=\"Forgot To Bring The Tent! Slept In Car. Then Abandoned Anyway\"><p>We went to Wimbledon Tennis and planned to camp and queue on the pavement. Last year we forgot the tent poles so had to make the tent into a glorified large sleeping bag.<\/p><p>This year we forgot the tent all together, instead we slept in the car in a residential street in Wimbledon. When we woke it was tipping with rain, therefore rather than get out and queue we decided to drive home!<\/p><img src='images\/years\/1998\/1998_06_26-RainyWimbledon.jpg' class='diaryImage' alt='Wimbledon Rain' \/><p class='diaryImageCaption'>Wimbledon Rain<\/p><\/woops>","images":false},"title":{"value":"Wimbledon Tennis - Sleep Over"},"version":1},{"date":{"d":25,"m":6,"y":1998},"datev":19980625,"images":4,"info":{"content":"<p>Because we had just started in new positions, I'm now a C++\/MFC developer now, we thought it a bit too much to take time off work. Instead we met after I finished work. I met her around her Grandparents where Laura opened her cards and presents. Laura asked for money this year as her present, and she managed to accumulate about £90. I gave her a booklet that I had spent two days making, and Evita on video. Anyway we got the train and tube to Leicester Square, walked through China town and made it to the Rain Forest Cafe, Shaftsbury Avenue. The interior was superb. The restaurant was in the basement and it had lots of trees (fake of course), a waterfall, smell of a forest and of course some animal noises. Lightening, flashing lights went off every 20 minutes. The food was good, if a little expensive. We had cocktails first which made it feel a special evening, a good evening.<\/p><p>After the meal we popped to the IMax theatre at the Troc to see New York In 3D. I fell asleep as usual.<\/p><img src='images\/years\/1998\/1998_06_25-GaysBackgarden02.jpg' class='diaryImage' alt='Laura's Birthday - Our back garden' \/><p class='diaryImageCaption'>Laura's Birthday - Our back garden<\/p><img src='images\/years\/1998\/1998_06_25-RainForestCafe02.jpg' class='diaryImage' alt='Laura's Birthday - Rain Forest Cafe' \/><p class='diaryImageCaption'>Laura's Birthday - Rain Forest Cafe<\/p><img src='images\/years\/1998\/1998_06_25-RainForestCafe03.jpg' class='diaryImage' alt='Laura's Birthday - Rain Forest Cafe' \/><p class='diaryImageCaption'>Laura's Birthday - Rain Forest Cafe<\/p><img src='images\/years\/1998\/1998_06_25-Tube.jpg' class='diaryImage' alt='Laura's Birthday - On Tube Station' \/><p class='diaryImageCaption'>Laura's Birthday - On Tube Station<\/p>","images":false},"title":{"value":"Laura's 22nd Birthday"},"version":1},{"date":{"d":17,"m":6,"y":1998},"datev":19980617,"info":{"content":"<p>Laura has finally finished officially her time in Brighton.<\/p>","images":false},"title":{"value":"Lau Finished University"},"version":1},{"date":{"d":7,"m":6,"y":1998},"datev":19980607,"info":{"content":"<p>I drove back from the Summer Ball..... and was supposed to be in Bracknell at 8:45am for a 50 mile bike ride. We got home about 7am and we fell asleep and missed the bike ride, which I was glad about on the one half, but felt like letting people down on the other. Laura went to church. The rest of Sunday was spent relaxing and recovering after a hard night's partying. Laura left Monday morning to go health visiting in Brighton.<\/p>","images":false},"title":{"value":"Recovery"},"version":1},{"date":{"d":7,"m":6,"y":1998},"datev":19980607,"info":{"content":"<p>I remember see just 2 minutes of this film before falling asleep. I was so tired. Laura thought it was a great film.<\/p>","images":false},"title":{"value":"Cinema - Sliding Doors"},"version":1},{"date":{"d":6,"m":6,"y":1998},"datev":19980606,"images":1,"info":{"content":"<p>I had just received my PII 300Mhz machine which I was busy setting up. Laura was reading her Coming Home book which she was equally enthused about. After lunch we went to watch Steve play bowls in Cranleigh.<\/p><p>The three of us then went from thereto Bournemouth to eat and get ready for the Summer Ball. However, it didn't feel very summery with the mild, wet weather. We got to the ball about 9:30pm. It was situated near Hurn Airport. We were first frisked, even checking the contents of our wallets. It was still semi-light. We headed towards the bar (drinks) marquee, which was extremely busy. We then headed towards the big top which was huge, circus sized. It had the atmosphere of a night club. Many were wearing fancy dress which I thought was excellent and really in the spirit of the party. We danced the night away. Me and Lau didn't really know anyone else there. Later on we all went around the fairground bit and had a laugh. We continued to dance until around 3am, when it was time to depart for the bus back to the beach for the 'survivors' photo. Crushing, long queues for the buses. Must have been an hour. It was light again by the time we got one. We were still in good spirits. We made it to the pier, many were playing football, drunk and falling over, bumping into Laura. We waited and waited and eventually gave up at 4:45am on the photograph as we didn't think it was worth being a dot on a photograph.<\/p><img src='images\/years\/1998\/1998_09_XX-BournmouthSummerBall01.jpg' class='diaryImage' alt='Bournemouth Summer Ball' \/><p class='diaryImageCaption'>Bournemouth Summer Ball<\/p>","images":false},"title":{"value":"Bournemouth University - Summer Ball"},"version":1},{"date":{"d":5,"m":6,"y":1998},"datev":19980605,"info":{"content":"<p>Laura has just got her third job offer, this time from the prized Frimley Park Hospital. I thought it would be nice to go out and celebrate by going out for a meal, and getting a well done present, perfume, and card. We went to the Windmill in Windlesham. It was quite busy and the food reasonable. We were both starving and gagging for a pint. We then went to the White Hart and talked about Laura moving down this way. We also talked about plans for going to Australia in May 2000 and moving into together eventually.<\/p>","images":false},"title":{"value":"Laura Job Offer"},"version":1},{"date":{"d":30,"m":5,"y":1998},"datev":19980530,"info":{"content":"<p>We went to see Deep Impact at Robins cinema.<\/p>","images":false},"title":{"value":"Cinema - Deep Impact"},"version":1},{"date":{"d":21,"m":5,"y":1998},"datev":19980521,"info":{"content":"<p>After handing in my resignation yesterday, Mick Weight and Paul Maynard had come to allow me my wishes and join the development department. I thank both of these people as it would have been easy to let me go.<\/p><p>So now I was thrown in the real deep in, attempting to learn C++ (properly) and Visual Studio. I was out of my depth initially, for quite some time, but fortunately no one seem to either care or realize.<\/p>","images":false},"title":{"value":"Software Developer Role"},"version":1},{"date":{"d":11,"m":5,"y":1998},"datev":19980511,"info":{"content":"<p>Currently looking around for a new job, as internal support is not really my bag. Looking for more of a development job.<\/p><p>The interview wasn't great. The company looked old, using technology, rubbish premises. Wasn't going to take it.<\/p>","images":false},"title":{"value":"Wimbledon - Job Interview"},"version":1},{"date":{"d":9,"m":5,"y":1998},"datev":19980509,"title":{"value":"Casuals - Old Boys Game and End Of Season Do"},"version":1},{"date":{"d":7,"m":5,"y":1998},"datev":19980507,"title":{"value":"Scream 2 - Cinema"},"version":1},{"date":{"d":2,"m":5,"y":1998},"datev":19980502,"title":{"value":"Norfolk Camping Weekend"},"version":1},{"date":{"d":26,"m":4,"y":1998},"datev":19980426,"images":1,"info":{"content":"<p>We all went to the Frimley Hall hotel for a lovely meal for Mums 50th birthday<\/p><img src='images\/years\/1998\/1998_04_26-FrimleyHallMum50.jpg' class='diaryImage' alt='Mums 50th' \/><p class='diaryImageCaption'>Mums 50th<\/p>","images":false},"title":{"value":"Mums 50th"},"version":1},{"date":{"d":13,"m":4,"y":1998},"datev":19980413,"info":{"content":"<p>We made the long journey home, stopping in a bar in Ostend. The same bar as the boys went to last year. I remember Bonsey nicking my passport and getting me all worried. Knackered by the time we got home.<\/p>","images":false},"title":{"value":"Amsterdam - Casuals Tour"},"version":1},{"date":{"d":12,"m":4,"y":1998},"datev":19980412,"info":{"content":"<p>We went to the Amsterdam Arena and watch an American Football match the Admirals against the Scottish Claymores. the stadium was half empty. I quite enjoyed it as it was a break for the usual drinking was getting a bit same-ish after a while.<\/p><p>I remember going to a Belgium beer bar where we met up with the old boys. Phil Clennel was wasted. They were serious drinkers. I remember coming out of there and seeing some man shouting out of the window. Can't remember if he was shouting at us. I retorted by shouting 'Ajax Pall' to him. Don't think he knew what to make of it.<\/p>","images":false},"title":{"value":"Amsterdam - Casuals Tour"},"version":1},{"date":{"d":11,"m":4,"y":1998},"datev":19980411,"info":{"content":"<p>We went off to play a team from somewhere near Schipol airport. Anyway I wasn't playing because of recovering from my leg injury. I remember Phil Rowe scoring goals. One whilst he was still smoking.<\/p>","images":false},"title":{"value":"Amsterdam - Casuals Tour"},"version":1},{"date":{"d":10,"m":4,"y":1998},"datev":19980410,"info":{"content":"<p>Woke up to hear that our knackered mini-bus had been bricked in, and my bottles of Stock had gone. The bus driver had to drive it back to England and get a replacement for us! Poor man.<\/p><p>Beers, beers, beers. Mr. Avez wasn't feeling too good after the yellow stuff the day before. We wondered around a bit. I think I ended up on top of a car that had a massive clog with flowers in it. Sounds weird, but I didn't imagine it.<\/p><p>On one of the evenings there was an almighty commotion. After returning back after a skinful of beers a few of the boys were smoking inside the hostel. I was mucking around and moved a wardrobe in front of the 'old boys' room, I then got hold of a fire hose and unreeled it and tied up to the wardrobe. Basically there was no chance of them getting out of their room.<\/p><p>Unknown to us were smoke detectors, and of course before long the smoke alarm bells went off for the whole building at about 3am in the morning. We all scampered back into our rooms and pretended to be asleep. Then we heard a rushing of footsteps coming up the steep stairs. It was a bit like a headmaster rushing up to see the naughty boys at a boarding school. We all lay really still in bed, and pretended to be asleep. The woman opened the door, and shouted who has been smoking? No one answered. She asked 3 or 4 times, and Phil spoke softly. Again unknown to us there was a flashing light going off above our door to say where the source of the smoke came from so it was very difficult for us to deny what had happened. That coupled with the moved wardrobe, I don't think we were flavour of the month. I don't think the old boys were very impressed either. You had to be there, so funny.<\/p>","images":false},"title":{"value":"Amsterdam - Casuals Tour"},"version":1},{"date":{"d":9,"m":4,"y":1998},"datev":19980409,"info":{"content":"<p>We left from Farnborough at 7am in the morning on a Whippet type bus. There must have been about 10 of us, including a couple of non football players. We drove to Dover and caught a ferry over to Ostend. The poor bus was absolutely being hammered at 70mph, and it took its toll in Belgium somewhere, as the engine was overheating. The driver eventually just left the radiator cap off the bus and we continued on for another 20 minutes, stopped, filled up with water, and so on.<\/p><p>The extra time gave us plenty of time to drink some of my special concoctions bought back from Prague. The disgusting bottle of 'Stock' was legendary as well as the yellow stodgy stuff that wiped Mr. Avez out.<\/p><p>We eventually arrived in Amsterdam, and after getting lost, we found 'The International Budget Hostel' or something like that. Mr. Aves offered to pay the bus driver his digs, as he didn't bring any money.<\/p>","images":false},"title":{"value":"Amsterdam - Casuals Tour"},"version":1},{"date":{"d":1,"m":4,"y":1998},"datev":19980401,"info":{"content":"<p>The last day came round quickly, which we started off with a massage. I was hoping for a nice, fit girl, instead 9 foot, hulk massaged us for 15 minutes each. We used the swimming complex everyday and it only cost £1 for an hour. We packed up and checked out all our luggage, but still had 7 or 8 hours before our flight. We made our way to Nadr Holesevice station where we based all our travel around. I tried to find where we could go by train for a short excursion. The booking clerk officer was quite unhelpful and unfriendly. This was the general perception I have with the Czech people. It was quite a shock. However, we laughed it off and got help from a foreign exchange cashier. We went out to some remote town village, that had a castle at the top of the hill. We didn't make it that far, but it was nice to get out of the city. The train journey was a bit weird. The train pulled out of the station for about 100 yards. Then stopped, broke down. We all had to get out and walk back down the tracks to the platform. Can't imagine that happening at Waterloo.<\/p>","images":false},"title":{"value":"Prague - Coming Home"},"version":1},{"date":{"d":31,"m":3,"y":1998},"datev":19980331,"info":{"content":"<p>We walked around each of the quatres of the city, trying to follow the guided walks from our book.<\/p>","images":false},"title":{"value":"Prague - Walk"},"version":1},{"date":{"d":30,"m":3,"y":1998},"datev":19980330,"info":{"content":"<p>We went to see Slavia Prague, play Sparta Prague, which happened to be the top match of the whole season. We also went to the Olympic stadium to swim and to the national ice hockey stadium.<\/p><p>In the evening we looked around the town<\/p>","images":false},"title":{"value":"Prague - Sparta V Slavia and Olympic and Ice Hockey Stadium"},"version":1},{"date":{"d":29,"m":3,"y":1998},"datev":19980329,"info":{"content":"<p>Went on a 3 hour tour. It was on a funny 16 seater bus which was very colourful. We went through the old town square, the Jewish quatre, and spent half the tour at the castle. I was getting tired at this point and the weather was very good. We collapsed in a park back at St. Wenceslas Square, where we wrote some postcards out. We eventually made it back to the hotel, got changed and refreshed ourselves before going back for the 8pm performance of Vivaldi's concert. We arrived a little late and got told off for trying to film to musicians. It was a new experience. I imagined this is what a concert to be like 200 years ago. The four seasons were played along with some other pieces which I did not recognise.<\/p><p>After the hour's performance we trundled across Charles bridge, and found a little restaurant to eat in. This is where Laura was almost sick on some caraway seeds.<\/p>","images":false},"title":{"value":"Prague - City Tour"},"version":1},{"date":{"d":28,"m":3,"y":1998},"datev":19980328,"info":{"content":"<p>This was going to be Laura's first ever flight. At 7:20am she was quite nervous. Mum and Dad took us to the airport and we were free to look around the duty free. Laura was quite excited. I was looking forward to seeing the culture out in Prague. How much of the effects of communism could you still see? How did a city look with many of its buildings still intact after 600 years. What were the shops and people like? How cheap was it, how big is Prague and what was the food like?<\/p><p>The flight across was good. However, it was a little cloudy, so difficult to see much out of the window. Laura squealed as we took off and crushed my right hand at the same time! She didn't take her seat belt off for the whole journey. After an hour and a half we landed at Ruzyne airport which was about 25 miles north west of the city. We were advised not to take a taxi, so we took a bus to Dejvicka which is the end stop on the metro. At this point we didn't know where the hotel was. We eventually found it after talking to a tourist information girl. The big 3 star hotel was 6 or 7 miles north east of the city and placed on the edge of a large estate of flats which lined a long straight road. The flats were grey and ugly and seemed very tatty. Hotel Duo (Teplicka 17), was lilac in colour, with a sports centre, bar and restaurant. We gathered our keys and went to our room on the fifth floor. The room was again lilac with an en-suite. Two beds were joined together to make a double.<\/p><p>After unpacking, we went back into town and landed at St. Wenceslas square. We didn't know that at the time though. We looked around the market, which in the end was tedious as everything being sold was the same. We ate out and the waitress was overcome when I gave her a £2 tip for a £20 meal.<\/p>","images":false},"title":{"value":"Prague - Getting There"},"version":1},{"date":{"d":21,"m":3,"y":1998},"datev":19980321,"info":{"content":"<p>Went up with Laura to Derby for the weekend. I think it was the time we went to a nightclub and we saw people go onto stage and eat dog food! Not big and not very clever.<\/p>","images":false},"title":{"value":"Derby"},"version":1},{"date":{"d":15,"m":3,"y":1998},"datev":19980315,"info":{"content":"<p>Managed to get tickets to watch the vital match between Charlton and Sunderland at the Valley. I think Sunderland ended up the victorious team. They had both Phillips and Quinn playing for them.<\/p>","images":false},"title":{"value":"Charlton V Sunderland"},"version":1},{"date":{"d":14,"m":3,"y":1998},"datev":19980314,"info":{"content":"<p>Apollo Theatre. Absolutely brilliant.<\/p>","images":false},"title":{"value":"Ben Elton - Popcorn"},"version":1},{"date":{"d":5,"m":3,"y":1998},"datev":19980305,"info":{"content":"<p>Remember hanging off the newsagents sign, trying to get back into Steve's house one night after being at the Opera House.<\/p><p>Also remember staying over a Steve Laidlaw's house and we playing musical sleeping bags, or jumping beans.... It got a bit out of hand and I managed to career into the dining room chairs and broke a leg clean off. We left rather early next morning. Managed to run into a bush that night as well trying to charge the Steve's down.<\/p>","images":false},"title":{"value":"Steve in Bournemouth"},"version":1},{"date":{"d":4,"m":3,"y":1998},"datev":19980304,"info":{"content":"<p>Went down to stay with Steve for a couple of days in Bournemouth to celebrate his 23rd birthday.<\/p><p>Remember playing ball games with Laidlaw as well, and throwing this ball so hard when Barnett wasn't looking and missed his face by a matter of inches. Also managed to get hold of a spare wheel and obliterated the patio table and chairs when I threw this wheel over their back fence.<\/p>","images":false},"title":{"value":"Steve in Bournemouth"},"version":1},{"date":{"d":2,"m":3,"y":1998},"datev":19980302,"info":{"content":"<p>Went to see the Titanic.<\/p>","images":false},"title":{"value":"Cinema - Titanic"},"version":1},{"date":{"d":1,"m":3,"y":1998},"datev":19980301,"info":{"content":"<p>We went to London to see the Destinations Exhibition. It is a travel exhibition really. We were thinking about a trip to Australia<\/p>","images":false},"title":{"value":"Destinations '98"},"version":1},{"date":{"d":28,"m":2,"y":1998},"datev":19980228,"info":{"content":"<p>I had to go into work and do some work on Sage. Laura came in as well.<\/p>","images":false},"title":{"value":"Work"},"version":1},{"date":{"d":28,"m":2,"y":1998},"datev":19980228,"images":2,"info":{"content":"<p>There was a Weston family celebration at Pine Ridge bowling<\/p><img src='images\/years\/1998\/1998_02_28-PineRidgeBowl04.jpg' class='diaryImage' alt='Pine Ridge Bowl' \/><p class='diaryImageCaption'>Pine Ridge Bowl<\/p><img src='images\/years\/1998\/1998_02_28-PineRidgeBowl05.jpg' class='diaryImage' alt='Pine Ridge Bowl' \/><p class='diaryImageCaption'>Pine Ridge Bowl<\/p>","images":false},"title":{"value":"Pine Ridge Bowl"},"version":1},{"date":{"d":24,"m":2,"y":1998},"datev":19980224,"title":{"value":"Bath Trip"},"version":1},{"date":{"d":23,"m":2,"y":1998},"datev":19980223,"info":{"content":"<p>We went to Bath and stayed overnight. We had a lovely romantic time.<\/p>","images":false},"title":{"value":"Bath Trip"},"version":1},{"date":{"d":22,"m":2,"y":1998},"datev":19980222,"images":1,"info":{"content":"<p>We travelled along the Kent and Sussex south coast. We went to Beachy Head and Rye.<\/p><img src='images\/years\/1998\/1998_02_22-RyeBeach.jpg' class='diaryImage' alt='Rye beach' \/><p class='diaryImageCaption'>Rye beach<\/p>","images":false},"title":{"value":"Rye"},"version":1},{"date":{"d":14,"m":2,"y":1998},"datev":19980214,"images":1,"info":{"content":"<p>We drove to Chiswick and walked the length of the high street, from Chiswick Park tube to the Polish tourist information. It was a really hot day and it was very relaxing walking in the sun. We caught a bus to Fulham Broadway and began to make our way by foot to the Kings Road, via Chelsea FC. There were many antique shops, but wasn't until we reached a mile or so up that we saw the hub of the Kings Road. We walked and eventually ended up Sloane Square by about 5 or 6 o'clock. We bought some magazines and sat in the square reading them for 45 minutes. It was nice to stop and have a break. We caught the tube to Piccadilly Circus and briefly went in the Rain Forest Cafe. It was somewhere to come back to at a later date. We popped over to the Burlington Bertie for a couple of hours. We then walked through Soho to the Topo Gigio restaurant and almost sat in the same place as 2 years previous. I had raw beef and wild boar. The beef was great. Want to try that again. A lovely evening. Anyway we caught the tube back to Chiswick and drove us home.<\/p><p>We went back to Top Gigio again for a nice Valentines meal.<\/p><img src='images\/years\/1998\/1998_02_14-TopoGigioBrewerSt.jpg' class='diaryImage' alt='Valentine’s Day in London' \/><p class='diaryImageCaption'>Valentine’s Day in London<\/p>","images":false},"title":{"value":"Valentine’s Day"},"version":1},{"date":{"d":13,"m":2,"y":1998},"datev":19980213,"info":{"content":"<p>We went out with the boys to the Litten Tree and Joe Banana's.<\/p>","images":false},"title":{"value":"Camberley Night Out"},"version":1},{"date":{"d":7,"m":2,"y":1998},"datev":19980207,"info":{"content":"<p>Went to Maidstone, Fireman's Party, and go karting<\/p>","images":false},"title":{"value":"Maidstone, Fireman's Party, Karting"},"version":1},{"date":{"d":2,"m":1,"y":1998},"datev":19980102,"first":{"value":null},"images":3,"info":{"content":"<img src='images\/years\/1998\/1998_01_XX-GaysBackGarden.jpg' class='diaryImage' alt='In Mum and Dad’s back garden' \/><p class='diaryImageCaption'>In Mum and Dad’s back garden<\/p><img src='images\/years\/1998\/1998_01_XX-IsteadRiseWithCharlotte.jpg' class='diaryImage' alt='Martin playing with Charlotte' \/><p class='diaryImageCaption'>Martin playing with Charlotte<\/p><img src='images\\years\\1998\\1998_XX_XX-Spring01.jpg' class='diaryImage' alt='Less said the better' \/><p class='diaryImageCaption'>Less said the better<\/p>","images":false},"title":{"value":"Photo's"},"version":2}],"version":-1373298140}