{"entries":[{"date":{"d":31,"m":12,"y":1999},"datev":19991231,"images":2,"info":{"content":"<p>We hadn't organised anything special for this hyped evening. All the pubs and clubs were well over charging. James had quickly and kindly said he'd throw a bash in his house in Cove, with his Emma, Barrie, Laura and the two of us. Although only 6, we had a good time. Ellie and Michael came over to pick us up about 11:30pm and took us back to Steve's house. we spent midnight on the green, where the street had organised fireworks.<\/p><img src='images\/years\/1999\/1999_12_31-PartyRoundJamesBall01.jpg' class='diaryImage' alt='Millennium Eve' \/><p class='diaryImageCaption'>Millennium Eve<\/p><img src='images\/years\/1999\/1999_12_31-PartyRoundJamesBall03.jpg' class='diaryImage' alt='Millennium Eve' \/><p class='diaryImageCaption'>Millennium Eve<\/p>","images":false},"title":{"value":"New Years Eve"},"version":1},{"date":{"d":26,"m":12,"y":1999},"datev":19991226,"info":{"content":"<p>The Barnett clan came over to Gravesend for the traditional party.<\/p>","images":false},"title":{"value":"Boxing Day Party"},"version":1},{"date":{"d":25,"m":12,"y":1999},"datev":19991225,"info":{"content":"<p>Opened remainder of the presents and had traditional Christmas lunch with Mum, Dad and Susan. In the afternoon we went over to Heather and Bobs. We played bingo and had some food. Had a nice time.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":1999},"datev":19991224,"info":{"content":"<p>Over at my house as usual.<\/p><p>Presents from Lau to me.<\/p><ul><li>James Bond Video<\/li><li>OFAH - Alarm Clock<\/li><li>Armani Aftershave<\/li><li>OFAH - Peckham Spring<\/li><li>Mr Man - Mr. noisy<\/li><li>Genesis Album<\/li><li>Blue Shirt\/Jacket<\/li><p>Presents from me to Lau<\/p><li>Shower Curtain<\/li><li>Black Jacket<\/li><li>2 x Mr Men<\/li><li>Abba CD<\/li><li>Road Atlas<\/li><\/ul>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":23,"m":12,"y":1999},"datev":19991223,"info":{"content":"<p>Started off in the Links. Quite a laugh. Ended up with Steve and Paul in the Old Emporium then the Hogshead before Laura rescued us all.<\/p>","images":false},"title":{"value":"Development Night Out"},"version":1},{"date":{"d":20,"m":12,"y":1999},"datev":19991220,"info":{"content":"<p>Took a sicky and went with Laura to Watford shopping. Had a meal in Amersham old town in a Cafe Uno on the way home.<\/p>","images":false},"title":{"value":"Christmas Shopping - Watford"},"version":1},{"date":{"d":19,"m":12,"y":1999},"datev":19991219,"info":{"content":"<p>There was loads of snow and ice around, so I checked the house in the morning with Dad. Laura, I and Mum went to 9 carols and lessons in the late afternoon, then the whole family came to see the house, and have a cup of tea. Susan didn't seem all that enthusiastic about it.<\/p>","images":false},"title":{"value":"9 Lessons and Carols, House Tours"},"version":1},{"date":{"d":18,"m":12,"y":1999},"datev":19991218,"info":{"content":"<p>Laura went to the Horse Of The Year Show. I shopped in London.<\/p>","images":false},"title":{"value":"Horse Of The Year Show"},"version":1},{"date":{"d":15,"m":12,"y":1999},"datev":19991215,"info":{"content":"<p>Laura picked up the keys for the house which mean we're officially house owners. Yippee. However, we can't celebrate because we are going to Laura's Christmas Do at the Hilton in Bracknell. We went along with Steve and found out that David is friends with the likes of Matt House and Miles Cobbitt. We didn't like Amanda after all the 'who har', which has meant Laura working Christmas Eve night. We had our sit down meal, but didn't drink too much this time.<\/p><p>Our plan is to rent it out until we get married.<\/p>","images":false},"title":{"value":"House Completion"},"version":1},{"date":{"d":14,"m":12,"y":1999},"datev":19991214,"info":{"content":"<p>Had a half a day at work and went up with Nick and Martin to London. We made our way to Leicester Square \/ China town area and had a cheap sit down Chinese. I was trying hard with my chop sticks. We went for a couple of pints by St Martin’s in the Fields, Trafalgar Square, then tubed it up to Wembley. Missed the support group. Stereophonics had some great tunes but they lacked to put on a show. Wembley Arena was a very big hall with seating around the edges and standing in the middle. It lasted just under 2 hours without a break. We made it home back late.<\/p>","images":false},"title":{"value":"Stereophonics, Wembley Arena"},"version":1},{"date":{"d":5,"m":12,"y":1999},"datev":19991205,"info":{"content":"<p>Straight from football we belted it down to Gravesend for the annual get together of Lau's friends. We had party games. There was me, Lau, Helen, Nigel, Karen, Richard, Vicky, Paul, Andrew, George, Fiona and occasionally Charlotte. 11 in all which was a fine turn out. We had a good laugh and it was nice to catch up with everyone. Didn't get home until quite late.<\/p>","images":false},"title":{"value":"Laura's Christmas Party"},"version":1},{"date":{"d":4,"m":12,"y":1999},"datev":19991204,"info":{"content":"<p>We went and watched an army rugby league match at the military stadium in Aldershot.<\/p>","images":false},"title":{"value":"Rugby League game"},"version":1},{"date":{"d":3,"m":12,"y":1999},"datev":19991203,"info":{"content":"<woops rating=\"6\" woopstitle=\"Jumping Out On The Limp Man\"><p>We went out with Nick and Martin, for a pub crawl around Wokingham. We walked to Nick's and then to Farnborough North where we popped in to the local there and had a quick pint, then caught a train. Our mission was to drink one pint every half an hour.<\/p><p>The first pub we walked to I saw Ian Wales in there, who had just been made redundant. I felt really sorry for him as there was no explanation for his departure. That kind of feeling that I'll never see him again as well. We carried on regardless. We visited another three or four pubs. One of them a guy had blood all over him and it seemed he'd only been punched 5 minutes before. We quickly got out of there.<\/p><p>We caught the train back and walked along the Hatches. Me and Lau walked on ahead. Nick and Martin tried to out flank us. However, they didn't realize there was a man with a bad boy limp in front of us. It was very dark. Suddenly Nick jumped out and shouted to scare us. However, he jumped out on the wrong person. Needless to say the bad boy limp man walked off fairly sharpish! It was very funny. One of those, you had to be there incidents.<\/p><\/woops><p>We walked all the way home. However, with an upset tummy I managed to speckle the bedroom carpet and wall as well as the landing carpet. Whoops!<\/p>","images":false},"title":{"value":"The 'Jumping Out On The Limp Man' Story"},"version":1},{"date":{"d":30,"m":11,"y":1999},"datev":19991130,"images":1,"info":{"content":"<p>82 London Road, Bagshot<\/p><img src='images\/years\/1999\/1999_10_31-82LondonRoad.jpg' class='diaryImage' alt='First site of 82 London Road, from month before' \/><p class='diaryImageCaption'>First site of 82 London Road, from month before<\/p>","images":false},"title":{"value":"!! First House !!"},"version":1},{"date":{"d":29,"m":11,"y":1999},"datev":19991129,"info":{"content":"<p>14 people laid off from work. A lot of people unhappy of the situation. A big cut back.<\/p>","images":false},"title":{"value":"Work cut backs"},"version":1},{"date":{"d":28,"m":11,"y":1999},"datev":19991128,"info":{"content":"<p>We got up early and had breakfast before scooting back down to London for the Danish Church Christmas bazaar. We had to navigate ourselves through memory and got a little lost by Swiss Cottage, not our fault though. Poorly sign posted. There was a Danish atmosphere about the place. There were craft stalls and they were quite expensive. Laura even had a Danish coffee and she liked it! We also had a pølser with all the trimmings. Scrummy. A very enjoyable weekend overall.<\/p>","images":false},"title":{"value":"Danish Church Christmas Bizarre"},"version":1},{"date":{"d":27,"m":11,"y":1999},"datev":19991127,"info":{"content":"<p>We made it down for a 10 o'clock breakfast. Fill your plate with as much as you like. I had a fully, fully fried big breakfast and some grapefruit and Satsuma to boot. We went to read the ordered Telegraph in the Relax area. Oh yes my son, this is how to live. I even let myself (and Laura did as well) go and put a bet on later. Heavenly. We went to town and ordered our James Bond - The World Is Not Enough tickets. We also needed to buy some toiletries after someone forgot them. We meandered back and then went to the health suite area for a long swim, Jacuzzi, sauna and steam room. Went back to the room to relax, once more. We went for a long walk around the town and ate in a Bella Pasta before going to see the Bond Movie. There were scenes on the Thames which I loved. It was a good film. Still I like Golden Eye the most. We went to a pub then quickly back to the hotel.<\/p>","images":false},"title":{"value":"Stratford Upon Avon"},"version":1},{"date":{"d":26,"m":11,"y":1999},"datev":19991126,"info":{"content":"<p>My car has still got battery problems, so Laura drove up to Stratford in the morning. We almost ended up in Stafford, due to someone's map reading skills confusing the likes of Stratford and Stafford! We stopped off on the way for a spot of bacon sarnie lunch. We surprisingly found the hotel easily. The Moat House was 4 star and very plush inside. A large elegant reception area, with a grand hall, a restaurant area a couple of bars, a relaxing area where there were comfy chairs looking on to the River Avon. We checked in, and went straight to the room. It was very nice. A large, I say large double bed for hurgles, a nice bathroom, although someone again blocked the toilet very easily and Sky TV! The only downside was a poor view, but that didn't matter, all the viewing I needed was of Laura. After checking the springs out, we unpacked, and went for a walk in town. I really liked the atmosphere of the town. I was relaxed, the weather was wintry, but dry and we had the afternoon to do nothing. We wandered back to prepare for the theatre. Laura found my letter to her which she really appreciated. I'm glad because I spent a lot of effort and money on it. Laura wore her very fetching 'mermaid' dress. I wore a white shirt of course. We went to a nearby pub, where we had a pleasant meal before the early evening show of 'The Lion, The Witch and the Wardrobe'. I got us excellent seats, 3 rows in. I didn't even fall asleep, I enjoyed the production so much! I got Laura a surprise Yorkie bar at the break. Afterwards, although still relatively early, we made the 2 minute walk back to the hotel.<\/p>","images":false},"title":{"value":"Stratford Upon Avon - Lion, The Witch And The Wardrobe"},"version":1},{"date":{"d":23,"m":11,"y":1999},"datev":19991123,"info":{"content":"<p>After a hectic week we got to exchange contracts on the house. The completion date is set for the 15th December. We borrowed £1500 from mum so we didn't have to touch the Nationwide account.<\/p>","images":false},"title":{"value":"Exchanged Contracts on 82 London Road"},"version":1},{"date":{"d":20,"m":11,"y":1999},"datev":19991120,"images":1,"info":{"content":"<p>We went over to Cousin Anne's for a murder mystery evening. We all dressed up. Laura ended up being the murderer, but I didn't suspect her at all.<\/p><img src='images\/years\/1999\/1999_11_20-MurderMysteryAnnes.jpg' class='diaryImage' alt='Murder Mystery Party' \/><p class='diaryImageCaption'>Murder Mystery Party<\/p>","images":false},"title":{"value":"Murder Mystery at Cousin Anne's"},"version":1},{"date":{"d":15,"m":11,"y":1999},"datev":19991115,"info":{"content":"<p>The estate agents rang to say that we must exchange contracts by Friday or else that chain is likely to collapse. We were buying from Mr and Mrs West who was buying from someone who was buying a new home. Major frantic ring round with solicitors, estate agents and mortgage provider. We haven't even done the local searches yet and we had to find £4800 for the deposit!<\/p>","images":false},"title":{"value":"House Trauma"},"version":1},{"date":{"d":7,"m":11,"y":1999},"datev":19991107,"info":{"content":"<p>The bonfire was still burning at Tracco, and the game was almost called off because of it. I played Centre Midfield and we played badly and lost 5-2 I think. We walked over to the hospital to borrow 'Something About Mary'. It was an entertaining film. My legs were so tired after the football. We relaxed basically for the rest of the day.<\/p>","images":false},"title":{"value":"Footer - Something About Mary"},"version":1},{"date":{"d":6,"m":11,"y":1999},"datev":19991106,"info":{"content":"<p>Laura had an early, so I played Civilization for most of the time. In the afternoon we made our way to Gravesend to collect Charlotte, Ellie and her friend Judith. We went over to Laura's grandparents in Lee and had a quick chat before we hooked up with Renaud at his house. We walked up to the Blackheath firework display, no bonfire. As the same as last year it was quite impressive. The traffic trying to get out was horrific, we dropped Ren off and returned to the Grandparents before, dropping off the girls at Gravesend.<\/p>","images":false},"title":{"value":"Blackheath Fireworks"},"version":1},{"date":{"d":5,"m":11,"y":1999},"datev":19991105,"info":{"content":"<p>After the week's mix-up, David very kindly offered to pay for my ticket to see the much acclaimed Blairewitch Project. It was interesting and worth seeing, but can't say I really 100% enjoyed it. Afterwards I rushed back to the Prince Of Wales to meet up with Laura, Andrew, Nick and Martin. We had a good evening.<\/p>","images":false},"title":{"value":"Blairewitch - Prince Of Wales"},"version":1},{"date":{"d":31,"m":10,"y":1999},"datev":19991031,"images":3,"info":{"content":"<p>We set off at about 10:30 for Ongar Leisure centre. I took my collage along. It was better organised this year. It had the usual long serving table, where you could buy a lot of merchandise if you were the avid fan. I am 'an avid' fan so bought; Christmas Tree's video, Series 6 videos, book of scripts from series 1 to 4, a TV secret location book, a CD of 'Fools' music and Laura bought me an alarm clock and we're supposed to be saving for a house! We queued for 2 - 2 1\/2 hours to get Sue Holderness (Marlene), Pat Murray (Mickey Pearce), Roy Heather (Sid), and Ken MacDonald (Mike) autographs. They were all brilliant, had real enthusiasm for us all. We drove back at about 6pm exhausted but thoroughly happy of the weekend's activities.<\/p><img src='images\/years\/1999\/1999_10_31-OFAHConventionAll.jpg' class='diaryImage' alt='Fools and Horses Convention' \/><p class='diaryImageCaption'>Fools and Horses Convention<\/p><img src='images\/years\/1999\/1999_10_31-OFAHConventionMarlene2.jpg' class='diaryImage' alt='Marlene - Fools and Horses Convention' \/><p class='diaryImageCaption'>Marlene - Fools and Horses Convention<\/p><img src='images\/years\/1999\/1999_10_31-OFAHConventionSid.jpg' class='diaryImage' alt='Sid - Fools and Horses Convention' \/><p class='diaryImageCaption'>Sid - Fools and Horses Convention<\/p>","images":false},"title":{"value":"Only Fools and Horses Convention"},"version":1},{"date":{"d":30,"m":10,"y":1999},"datev":19991030,"info":{"content":"<p>We got the surveyors report through. There were quite a few things reported that needed urgent attention. They included:<\/p><ul><li>Repair and replace window frame in the bathroom<\/li><li>Upgrade insulation in the roof space.<\/li><li>Re Cover the main roof.<\/li><li>Build up or complete the party walls in the loft.<\/li><li>Overhaul\/Repair the rear gutter and replace the front down pipe rainwater fitting.<\/li><li>Repoint the front walls.<\/li><\/ul><p>So we are going to see if they'll drop the price and let Barrie's dad come round to give us a quote on some of the required work. It seems a bit 50\/50 now whether we'll get the house or not now. However, the sellers, must be a bit worried. I feel for them.<\/p><p>Still I had a croquet final to play against Michael Hague over in Surbiton. I played miserably and lost. Never mind. We decided to have a pizza for lunch, then made our way to Kingston. However, I wasn't in shopping mood much. We didn't buy anything and made our way back to have a quiet evening in.<\/p><p>I got up at 5am in the morning to watch the final Grand Prix. Mikka Hakinen won the title in the end.<\/p>","images":false},"title":{"value":"Croquet Final, Surveyors Report"},"version":1},{"date":{"d":29,"m":10,"y":1999},"datev":19991029,"info":{"content":"<p>Laura was working a late and met myself, Martin and Nick down the Prince Of Wales in Farnborough. There were 'Real Ales' down there, but I really couldn't drink very much. I have become such a light-weight. It's not that I get drunk, but I can't seem to drink too fast.<\/p>","images":false},"title":{"value":"Prince Of Wales"},"version":1},{"date":{"d":24,"m":10,"y":1999},"datev":19991024,"info":{"content":"<p>Our football was played in Gibraltar Barracks, Minley. I had to have the boot and bonnet of my car searched. The weather was awful. I wasn't supposed to play, but we only had 10, so I volunteered to go in goal. I let 5 in, not all my fault I hastened to add. Anyway we won the game on penalties.<\/p><p>In the afternoon we had a little drive to Loosely park and back. Couldn't afford to go in. In the evening we relaxed watched a film for half the time 'cause it was too horrific.<\/p>","images":false},"title":{"value":"The Gibraltar Barracks game - Loosely Park"},"version":1},{"date":{"d":23,"m":10,"y":1999},"datev":19991023,"info":{"content":"<p>We had a lie in. After lunch we tootled down to see our prospective house and have a quick walk around Bagshot. We're both getting to like Bagshot, it's a nice Village, just a shame about the A30 really. Never mind. In the evening, after Laura's late shift, we headed off to Fleet, and met up with Barrie, James and some of their friends\/family. It was nice to see everyone again.<\/p>","images":false},"title":{"value":"Getting to know Bagshot - Out with James and Baz"},"version":1},{"date":{"d":22,"m":10,"y":1999},"datev":19991022,"info":{"content":"<p>We have no money between us, and so decided to have a cheap night in round my house. We played Monopoly which I won and Risk which I also won.<\/p>","images":false},"title":{"value":"Monopolised at home"},"version":1},{"date":{"d":19,"m":10,"y":1999},"datev":19991019,"info":{"content":"<p>We went finally choose a mortgage. We have gone with an Endowment, Interest only mortgage. It's going to cost £650 a month including life assurance and house insurance. It fits within our budget.<\/p>","images":false},"title":{"value":"Mortgage Chosen"},"version":1},{"date":{"d":17,"m":10,"y":1999},"datev":19991017,"info":{"content":"<p>We went to church in the morning, then went straight off to Dover. We had a look at the Factory shop. We saw a shirt for me, but it was £30, which I\/we could not afford.<\/p><p>We then went to see Alan and Linda in their new-ish home. I hadn't realized that it was over 14 months since we last been down. Anyway we got on well with them. Linda was impressed by Laura's religious background. We then went off to Deal for a walk along the beach, then through country roads to a place called Martin. We returned to Gravesend, where some of Laura's family were there. After watching some tele, we returned home.<\/p>","images":false},"title":{"value":"Over to visit Alan and Linda"},"version":1},{"date":{"d":16,"m":10,"y":1999},"datev":19991016,"info":{"content":"<p>We staggered separately back to Woking, where we met up and went to see the estate agent to look at mortgage options. In the afternoon, along with Ellie and Charlotte we went to the cinema to watch Deep Blue Sea. It was an OK film. It was nice to go out with everyone though. In the evening we stayed at home and recovered.<\/p>","images":false},"title":{"value":"Mortgage and the Deep Blue Sea"},"version":1},{"date":{"d":15,"m":10,"y":1999},"datev":19991015,"info":{"content":"<p>Went out with Adam, first in Clapham, then over to Putney for Donna's and Stuart's leaving do. We then returned to Clapham and went in a dive of a night club. Certainly wasn't Clapham Grand. I was not feeling 100%. I felt even worse come the end of the night. I got on alright with Adam, but it could of done with a few other lads out.<\/p><p>Laura had gone out with Karen Marks to a 70's \/ 80's night over in Kent somewhere.<\/p>","images":false},"title":{"value":"Out With Adam in Clapham"},"version":1},{"date":{"d":9,"m":10,"y":1999},"datev":19991009,"info":{"content":"<p>In the morning we looked round 82 London Road, Bagshot with the estate agent, Sally. We both loved it. It had a good character to the place and was well decorated.<\/p><ul><li><i>front room<\/i>You step through the front door, straight into the front room. It had a fireplace for Laura and a dining room table.\u000a        <\/li><li><i>upstairs<\/i>Upstairs via the winding stairs were two smallish bedrooms. Amazingly the triple glazing keeps the noise out very well. A bit noisier downstairs though.\u000a        <\/li><li><i>garden<\/i>Out the back was a 100ft garden in good order. Most importantly I could imagine us in here. I wanted to be here.\u000a        <\/li><\/ul><p>In the evening the whole family went out. I prepared a pizza meal for Laura and made my bedroom up to have a romantic candle lit dinner. I surprised Laura by giving her a couple of \"The Lion, The Witch and The Wardrobe\" tickets for the Royal Shakespeare Theatre production in Stratford Upon Avon.<\/p>","images":false},"title":{"value":"First Viewing Of 82 London Road, Bagshot"},"version":1},{"date":{"d":8,"m":10,"y":1999},"datev":19991008,"info":{"content":"<p>After Laura's late shift we went to the Kings Head for a drink.<\/p>","images":false},"title":{"value":"Kings Head"},"version":1},{"date":{"d":7,"m":10,"y":1999},"datev":19991007,"info":{"content":"<p>Mum and Dad's friends Joyce and Bill came over from Louisville, Kentucky to stay for a week.<\/p>","images":false},"title":{"value":"Joyce and Bill Over"},"version":1},{"date":{"d":3,"m":10,"y":1999},"datev":19991003,"info":{"content":"<p>We won our first game of the season, 2-1. Very impressive. In the afternoon we went to the Staff and watched Man Utd get stuffed 5-0.<\/p><p>In the evening we saw Armageddon. I didn't think much of that.<\/p>","images":false},"title":{"value":"Armageddon"},"version":1},{"date":{"d":2,"m":10,"y":1999},"datev":19991002,"info":{"content":"<p>We had an early-ish start as we were going to see our first house. The estate agent had told us a few porkies. 19 Devonshire Avenue, Sheerwater. A bit of a dump really. The worst thing was it being on a tacky council estate. We lasted less than 10 minutes there. I felt quite embarrassed as you have to go around pretending you're half interested. We went from there to Colchester via London! Big mistake. Over 3 hours later we arrived and eventually found somewhere to park. We had a look around the shops and some things for the kitchen. Mr. Silly and Little Miss Scatterbrain, and believe it or not a talking \/ singing Christmas tree. We then headed off to the leisure pool for some spa-bathing, Jacuzzi, sauna' ring and steam baths.<\/p>","images":false},"title":{"value":"First house viewing"},"version":1},{"date":{"d":1,"m":10,"y":1999},"datev":19991001,"info":{"content":"<p>We went along with Dad to watch Bill Posters Will Be Band. Before that we went to the Castle pub. It was a bit cold and a locals pub really.<\/p>","images":false},"title":{"value":"Bill Posters Will Be Band"},"version":1},{"date":{"d":26,"m":9,"y":1999},"datev":19990926,"info":{"content":"<p>Again I played Centre midfield and enjoyed myself. However, we lost 4-3 to top spot. I beat Andy Davies in the croquet in the afternoon. In t he evening we went around to Philip and Emma's for food and games. Howard and Carol were also there. It was very enjoyable.<\/p>","images":false},"title":{"value":"Uncle Philips Meal"},"version":1},{"date":{"d":25,"m":9,"y":1999},"datev":19990925,"info":{"content":"<p>In the morning I was supposed to play croquet, but because all of the rain there were puddles on the lawn. We instead headed into Woking and put our names down on more mailing lists. You seemed to be able to get more for your money around there. Bisley looks a good bet. We also got one or two things for the house. Laura had work, whilst I went over to Leatherhead to watch Chertsey play. It was a spirited 1-1 draw. In the evening I went over to David's and one of his gatherings. It was quite good fun.<\/p>","images":false},"title":{"value":"Chertsey and David's"},"version":1},{"date":{"d":24,"m":9,"y":1999},"datev":19990924,"info":{"content":"<p>Laura was really making an effort and cooked a romantic meal for the two of us at her Grandma's.<\/p>","images":false},"title":{"value":"Meal Prepared By Laura"},"version":1},{"date":{"d":21,"m":9,"y":1999},"datev":19990921,"info":{"content":"<p>A couple of mortgage consultants came round from Pearl. They were a bit disappointing because they didn't give much on mortgage lenders, instead a lot on what they sell themselves. Still I understand \"mortgages\" a lot more now.<\/p>","images":false},"title":{"value":"Mortgage Consultants"},"version":1},{"date":{"d":20,"m":9,"y":1999},"datev":19990920,"info":{"content":"<p>We went to the White Swan, Ash Vale, for a meal with Graham.<\/p>","images":false},"title":{"value":"Meal With Graham"},"version":1},{"date":{"d":19,"m":9,"y":1999},"datev":19990919,"info":{"content":"<p>The weather was bad, raining. I played centre midfield which I thoroughly enjoyed. We lost 3-2 though. Most enjoyable game I've had for ages.<\/p>","images":false},"title":{"value":"Casuals"},"version":1},{"date":{"d":18,"m":9,"y":1999},"datev":19990918,"info":{"content":"<p>We trained it up to London and met up with Fiona and Vicky at the Griffin, Embankment.<\/p>","images":false},"title":{"value":"London Pubbing"},"version":1},{"date":{"d":12,"m":9,"y":1999},"datev":19990912,"info":{"content":"<p>We got beat 3-0. We also saw the Thomas Crown Affair for the first time. My favourite film ever.<\/p>","images":false},"title":{"value":"Thomas Crown"},"version":1},{"date":{"d":11,"m":9,"y":1999},"datev":19990911,"images":1,"info":{"content":"<p>Because of Laura's 998 course presentation, we postponed celebration of our 4 year engagement till today. We went to Guildford to an Italian restaurant called Olivio's.<\/p><p>We waited ages for our meal. They had actually forgotten about us. We then went to watch something at the cinema afterwards.<\/p><img src='images\/years\/1999\/1999_09_11-AnniversaryOliviosGuildford.jpg' class='diaryImage' alt='4th Going Out anniversary' \/><p class='diaryImageCaption'>4th Going Out anniversary<\/p><p>Changed my hairstyle at the hairdressers. Gone are the curtains.<\/p>","images":false},"title":{"value":"4th Going Out Anniversary - Olivio's Meal and Hairstyle Change"},"version":1},{"date":{"d":10,"m":9,"y":1999},"datev":19990910,"info":{"content":"<p>Steve had been treated badly within the company and I didn't blame him for leaving. We went off to Basingstoke, bowling.<\/p>","images":false},"title":{"value":"Steve Cassidy Leaving Do"},"version":1},{"date":{"d":5,"m":9,"y":1999},"datev":19990905,"info":{"content":"<p>First Casuals game of the season we lost 3-0! We were poor. I got a full game at left midfield. In the afternoon I went to Lau's family picnic.<\/p>","images":false},"title":{"value":"Family Picnic"},"version":1},{"date":{"d":4,"m":9,"y":1999},"datev":19990904,"info":{"content":"<p>Lau and I went out with Barrie and Laura, James and new girl Emma, who was a bridesmaid at the wedding. A good night out.<\/p>","images":false},"title":{"value":"Out With Barrie"},"version":1},{"date":{"d":3,"m":9,"y":1999},"datev":19990903,"info":{"content":"<p>Jon Cooper was leaving the company. We went pubbing, Indian then to the pub again. Hopefully we'll still keep in touch.<\/p>","images":false},"title":{"value":"Jon Cooper Leaving Do"},"version":1},{"date":{"m":9,"y":1999},"datev":19990900,"images":2,"info":{"content":"<p>We went down to Portsmouth for the day. We went on a tour boat ride and saw the British fleet, including the Mary Rose and Victory.<\/p><img src='images\/years\/1999\/1999_09_XX-Portsmouth02.jpg' class='diaryImage' alt='Portsmouth' \/><p class='diaryImageCaption'>Portsmouth<\/p><img src='images\/years\/1999\/1999_09_XX-Portsmouth03.jpg' class='diaryImage' alt='Portsmouth' \/><p class='diaryImageCaption'>Portsmouth<\/p>","images":false},"title":{"value":"Portsmouth"},"version":1},{"date":{"d":1,"m":9,"y":1999},"datev":19990901,"info":{"content":"<p>I had a phone call from the garage to say that my car now starts. OK - but it still overheats, possibly due to a small crack in the engine and it would need a new engine in order to fix it. In other words a write off. I was a bit angry and confused what to do, but eventually decided to give up the idea of having a car. However, come Thursday morning the garage rang up and said it was the thermostat that was broken and the everything was OK. The total bill was £291. Me and dad collected the car that evening.<\/p>","images":false},"title":{"value":"Car Trauma"},"version":1},{"date":{"d":30,"m":8,"y":1999},"datev":19990830,"info":{"content":"<p>Laura had an early whilst I worked on the bedside cabinets again!<\/p><p>In the afternoon the two of us drove to Guildford, first to see a house that was up for auction, but was in a rough area, then to cycle along the River Wey to Woking and back. That was the plan anyway.<\/p><p>We cycled and cycled, stopped and cycled. Laura was scared of a few cows and a few dogs. We never actually reached Woking. We ended up at the junction with the Basingstoke Canal, in Byfleet. Oh dear! We made the long trip back again, going down the canal to Woking, then getting on the A320 back to Guildford. We stopped for a lovely meal and paid for just the cheapest! We cycled back to the car in the dark, and then eventually got back home! Mum and Dad returned back from their holiday on Tuesday.<\/p>","images":false},"title":{"value":"River Wey Bike Ride"},"version":1},{"date":{"d":29,"m":8,"y":1999},"datev":19990829,"info":{"content":"<p>Laura went to church in the morning and then had to work a late. I went up to meet Renaud. Had a quick pint in Greenwich and spoke to the bar maid that he is after. We then met up with some of his friends at Charing Cross before heading off to Notting Hill. There was a lot of hanging about so Renaud and I went off on ourselves. I was mainly black people there who were dancing to their kind of music. It was great as everyone was happy. It was a good party atmosphere. Eventually we had to go back. I needed to collect Laura from work. There were 100's of thousands of people to wade through. I eventually made it back home.<\/p>","images":false},"title":{"value":"Notting Hill Carnival"},"version":1},{"date":{"d":28,"m":8,"y":1999},"datev":19990828,"info":{"content":"<p>I got up early and began work on the computer to try and get the modem working, without much success. We left for home late morning and went via Renaud's, so I could arrange going to the Notting Hill Carnival tomorrow. Laura had a late while I continued on the bedside tables. I was quite tired.<\/p>","images":false},"title":{"value":"Going home"},"version":1},{"date":{"d":27,"m":8,"y":1999},"datev":19990827,"info":{"content":"<p>Laura cooked dinner and then we had to rush across to Gravesend, because it was Karen's sister's 21st. Ellie and Michael came out with us, which was a rare pleasure. Laura asked Karen to do our reading for our wedding, without even asking me if that was OK, which didn't please me in the slightest. Not because it was Karen, just the fact that she didn't even consult me on something which is important for us. We had a big row about it, but later made up.<\/p>","images":false},"title":{"value":"Rachel's 21st and A Big Row"},"version":1},{"date":{"d":22,"m":8,"y":1999},"datev":19990822,"info":{"content":"<p>We got up a little late and had to get round Laura's Grandma's to help setup the BBQ. However, when we arrived it was already done. We had a quick trip to return the broken video and go to the car boot at Lakeside Country Club. Again there was nothing there that I was tempted by. Too much real junk.<\/p><p>The BBQ afternoon went well. We played cricket and chatted. I got on well with Steven I helped clear up before returning home.<\/p>","images":false},"title":{"value":"Dad's Birthday - Grandmas BBQ"},"version":1},{"date":{"d":21,"m":8,"y":1999},"datev":19990821,"info":{"content":"<p>We left early, well 9:30am and I dropped martin off. I met up with Laura and Charlotte.<\/p><p>The three of us went to Sandown Park's Variety Club day that Paul Carroll had suggested. Famous faces were supposed to be there. We only saw an Elton John look alike. We all had a pound on each of the six or seven races. None of us won anything! It was the first time that Char and Laura had gone to the races. I did enjoy it.<\/p><p>We had a romantic evening with a pasta, wine, opera, candle lit dinner in the front room. The video we hired got chewed up in the recorder. We watched Match Of The Day instead.<\/p>","images":false},"title":{"value":"Horse Racing at Sandown Park"},"version":1},{"date":{"d":20,"m":8,"y":1999},"datev":19990820,"info":{"content":"<p>I had managed to organise a trip out with some of the department. Myself, Martyn, David and Peter went up to Adams in Clapham. It was a bit more nerve racking as I had organised this, and we'd never done it before.  I drove up, but Adam wasn't in. We were let in by his brother. It was quite exciting really. We went out to Pizza Express then into a number of pubs. It was such a good atmosphere up there. Bars that spilled onto the streets. trendy, nice looking, not traditional. The conversation flowed most of the time. We discussed what money we were on. Everyone was disgusted at the promises that were made to them.<\/p><p>Adam, Martyn and I stayed on for a bit of clubbing at the 'Clapham Grand', with all its 10 foot high leopard skin doors on of course Dr. Glitz on a 10 foot high stage. Surreal, but cool. We stayed till 3am, completely drunk. We got back to Adams and I gave some generous helpings of Vodka and orange. A good night out.<\/p><p>Laura had returned from holiday and gone to London to see Mama Mia.<\/p>","images":false},"title":{"value":"Adam's - Clapham Clubbing"},"version":1},{"date":{"d":17,"m":8,"y":1999},"datev":19990817,"info":{"content":"<p>This was my only evening in this week, so I decided to continue with the bed side tables.<\/p><woops woopstitle=\"Hit Next Door Neighbours Car\" rating=\"7\"><p>I needed to move Laura's car which was parked in front of the garage. Being casual I used my left foot and subconsciously counted two pedals in from the left. However, because it is an automatic I hit the accelerator and not the brake! The car door was wide open and it smacked into the next door neighbours car! Luckily dad's car wasn't behind. There was no damage to Lau's car but I had made a big dent and scratch in Mike's car!<\/p><\/woops><p>Flustered that I was, I quickly drove away. Nobody else seemed to see this happen. I drove to think whether or not I should tell him. At this stage I wasn't too sure where the dent was. If it was by the passenger door, then it would be noticeable as the door wouldn't open cleanly. I decided not to say anything. He wouldn't notice it was there for a while as it was on the passenger side and how on earth could I have smacked it. The cause of events seemed hard to believe. Also I park Laura's car on the road 9\/10 times, so I don't think I'll be suspected. They are also moving soon and it wouldn't take much to touch up the scratch. I calmed down and done my wood working until dusk.<\/p>","images":false},"title":{"value":"Hitting Mikes Car"},"version":1},{"date":{"d":15,"m":8,"y":1999},"datev":19990815,"info":{"content":"<p>We had an early start. Laura had a major hangover which I wasn't surprised about. She was off for another family trip , this time sailing up the Essex coast. I was to play croquet in Maidstone. Andy Davies was kind enough to drop Laura off at her house. We got to Maidstone for the 10:15 start. The lawn was undulating and patchy. After a nervous start my play reached average. I'd lost both games, one due to my partner, the other was down to a bit of unluckiness. Just as we were about to leave I saw Laura's parents friend, Stan. He was there for the bowling. It's a small world.<\/p><p>Dad and I went off to collect Laura's car from Great Fosters, then flaked out in the evening.<\/p>","images":false},"title":{"value":"Medway Croquet"},"version":1},{"date":{"d":14,"m":8,"y":1999},"datev":19990814,"images":3,"info":{"content":"<p>In the morning I had aches and pains everywhere. On Thursday I went to my first football training session in months. I've never had so much aching muscles. We had planned swimming but none of us were up for that. Instead we browsed around Camberley and got our Sorrento book.<\/p><p>After lunch we went to Barrie's sister's, Sam, wedding. I don't know her really. I think it is the first time I had seen Barrie and James in a suit. The wedding was at St Andrews, Frimley Green, and seemed a low key affair. There weren't many in their 20's attending.<\/p><p>After the wedding we went over to a new housing estate in Ash Vale. We enquired about prices, stating that we wanted a 2 bedroom property. She said 'our cheapest is £120,000'.Good golly gulp. We looked around anyway. Nothing close to our 90-95K mark.<\/p><p>In the evening we drove to Great Fosters, near Egham where the evening do was for the wedding. It was an idyllic setting. A big country house with landscaped gardens. Barrie and James both had rooms for them and their respective partners, Laura and Emma. The party kicked off with Nick and Martin arriving with James's parents. Nick and Emma were chatting each other up and left halfway through the evening. Martin who was also after Emma I think, looked a bit put out. Poor old James wondered where the pair ended up. They ended up in James's room all night. Gutting for James as he was really fond of her. I'm not sure what they were up to., knowing how much James would be hurt. That was a dampener on things. The evening otherwise was a success. Laura drank too much, but danced loads. The evening ended in James finding, what eventually would be his new girlfriend, called EMMA, and me ringing dad up for a lift home. He was brilliant to do this.<\/p><img src='images\/years\/1999\/1999_08_14-SamWestWedding1.jpg' class='diaryImage' alt='Sam and Stuart's Wedding' \/><p class='diaryImageCaption'>Sam and Stuart's Wedding<\/p><img src='images\/years\/1999\/1999_08_14-SamWestWedding2.jpg' class='diaryImage' alt='Sam and Stuart's Wedding' \/><p class='diaryImageCaption'>Sam and Stuart's Wedding<\/p><img src='images\/years\/1999\/1999_08_14-SamWestWedding4.jpg' class='diaryImage' alt='Sam and Stuart's Wedding' \/><p class='diaryImageCaption'>Sam and Stuart's Wedding<\/p>","images":false},"title":{"value":"Sam West's Wedding"},"version":1},{"date":{"d":13,"m":8,"y":1999},"datev":19990813,"info":{"content":"<p>We decided to treat ourselves to a meal, seeing that we will have only seen each other 1 week in 3. We tried the 'Stilton Dish' in Hartley Witney, but it was closed for some strange reason.<\/p><p>We drove to Farnham and found a Cafe Uno, which is an Italian style restaurant. We had a nice chat, the food was OK and wine good. We came back relatively early, and had an early night.<\/p>","images":false},"title":{"value":"Cafe Uno"},"version":1},{"date":{"d":7,"m":8,"y":1999},"datev":19990807,"info":{"content":"<p>The morning was spent making bed side cabinets. The wood cost £45 so I'd better make a decent job of it.<\/p><p>I went to watch Chertsey in the afternoon, then around for a BBQ at Barrie and his Laura around James's new pad. I was really missing my Laura now.<\/p>","images":false},"title":{"value":"Making Bedside Cabinets, BBQ with Bazza and James"},"version":1},{"date":{"d":6,"m":8,"y":1999},"datev":19990806,"info":{"content":"<p>Took another day off work in order to get the car sorted. The garage we parked at was for Hearses and limo's. We towed it to a back street garage close by. It'll be a few hundred pounds they suspect. There goes my back pay.<\/p><p>In the evening Dad and I went down the snooker hall to play a few frames.<\/p>","images":false},"title":{"value":"Margate Car Breakdown - Part II"},"version":1},{"date":{"d":5,"m":8,"y":1999},"datev":19990805,"info":{"content":"<p>Work so far this week has been pretty lack lustre. The 'pipe' work that was so urgent still hasn't moved any further and I was really missing Laura. I've never missed her so much. I felt lonely without her.<\/p><p>My craving for her happy face was so much so I decided to go and see her, by driving down to Margate to surprise her.<\/p><p>I trundled off at about 9am, but realized the temperature gauge on my car was on full whack. I limped off at Leatherhead and put it down to an empty water tank. However, the problem persisted, stopping every 10 or 15 miles or so for new water. I eventually made Margate at 1:30pm! Now where in Margate was Laura? The hotel they were staying at didn't know where, so I began searching the town, up and down the beach, in the amusement arcades, in the town, everywhere! I grew weary of walking and waited till around 4:30pm where I went to buy some flowers and prepared to wait at the hotel. They were already there! I left the flowers in the door way with a note saying something along the lines, 'I've been watching you and think you're really gorgeous. From another carer'. I got a hotel man to get Laura who found the flowers and the note. She went back to the chalet and laughed nervously with her mum. She caught me watching her and she was very pleased to see me. I met the three clients, we played pool and darts before I had to return home.<\/p><woops rating=\"6\" woopstitle=\"Towed to a Hearse Garage at 3am!!\"><p>After taking 4.5 hours getting to Margate, with the leaking water tank, I had the pleasurable task of getting home! Having reached Detling, just outside Maidstone, I could see grey clouds bellowing from my exhaust, as I was stopping in a garage the car stalled. I feared the worst, and thought it was some sought of seizure. It didn't sound right as I turned the car over.<\/p><p>I phoned dad who was at the football club to come and rescue me. At about 11:30pm (3.5 hours after I left Margate) he arrived. We tied up some blue rope and I was in my own car, making sure bit bumping into Dad. The rope only gave a maximum of one car length between us, and guess what we pulled out and the first hill was saw had an 11% sign!! It wasn't a nice experience as the rope kept slackening and then yanking and because the servos on the brakes weren't as good as usual I was afraid of going into the back of the 'tank' (dads car).<\/p><p>However, we never came close. We stopped shortly afterwards. Dad was ready to set off again but I hadn't put the key in the ignition to unlock the steering wheel yet! So I slammed on the brakes whilst I frantically looked for the key. Dad was struggling to set off, revving up his car. Luckily I found it quickly in my pocket and we were off again.<\/p><p>Another big problem was that in order to preserve my battery, I switched off my lights in lit areas. This made it difficult at times to see 'the tank'. The rope finally snapped in Maidstone. We stopped and someone got us a proper tow rope, and off we went again.<\/p><p>The lights began to dim, and I was getting extremely tired. We eventually stopped in a garage in Riverhead, Sevenoaks and we got home at 3am! Unknown to us we dumped the car in a Hearse garage. A fitting end. I had managed to buckle the cylinders, but of course they were just about OK to be fixed and a week later I was back on the road.<\/p><\/woops>","images":false},"title":{"value":"Margate Car Breakdown - Part I"},"version":1},{"date":{"d":1,"m":8,"y":1999},"datev":19990801,"info":{"content":"<p>I went off to Croquet and beat Andy Davies, while Laura went off for a week with her mum and Ellie to Margate, taking some mentally handicapped people out.<\/p>","images":false},"title":{"value":"Croquet and Start of Laura's Margate Trip"},"version":1},{"date":{"m":8,"y":1999},"datev":19990800,"images":2,"info":{"content":"<p>We went to watch a polo match somewhere near Windsor<\/p><img src='images\/years\/1999\/1999_XX-XX-Summer-Polo1.jpg' class='diaryImage' alt='Polo' \/><p class='diaryImageCaption'>Polo<\/p><img src='images\/years\/1999\/1999_XX-XX-Summer-Polo2.jpg' class='diaryImage' alt='Polo' \/><p class='diaryImageCaption'>Polo<\/p>","images":false},"title":{"value":"Polo Match"},"version":1},{"date":{"d":31,"m":7,"y":1999},"datev":19990731,"info":{"content":"<p>I noticed I had a pay rise of 10% now making me on £19,250. I was hoping for a bit more. Laura had hers risen to £14,900.<\/p><p>In the morning we trundled off to Watford. The town centre seemed quite busy. Somewhere to return shopping one day, perhaps Christmas.<\/p><p>We went to look for a computer company to get a 4.3gb hard disk for £65. We then meandered our way to Hanwell to watch Chertsey win 4-1. We returned to watch A Life Less Ordinary on video.<\/p>","images":false},"title":{"value":"Watford"},"version":1},{"date":{"d":30,"m":7,"y":1999},"datev":19990730,"info":{"content":"<p>We frantically moved the rest of the stuff out to Laura's Grandmas. Someone came around the place to assess its condition. I'd put a lot of effort in and another row was brewing as Laura's attitude stunk! We made up and went into Camberley to look at mortgages and whether we could sort something with our Sorrento honeymoon. It was nice and relaxing.<\/p><p>After another BBQ we went bowling with my work at Pine Ridge. We walked there and arrived too late for the bowling. However, we had a good time chatting. We almost got chucked out after Robbie decided to spray Steve Cassidy with a load of Ketchup.<\/p>","images":false},"title":{"value":"Laura Moves Out Of Farnborough Pad"},"version":1},{"date":{"d":29,"m":7,"y":1999},"datev":19990729,"info":{"content":"<p>We awoke early and got away within an hour and made our way to Limmington. It was a nice seaside town with a good character to it. We wandered around the shops before doing the same in Christchurch.<\/p><p>We headed north to Brokenhurst, where we got the bikes out and saw some countryside on our way to Lyndhurst and back. It was a long ride (10 miles) and many hills, but I was chuffed at Laura enjoying it and making a great effort.<\/p><p>We returned home and picked up my car from its MOT (cost £260). In the evening we saw Austin Powers 2 and by coincidence sat behind Phil Rowe and Emma! the film was good and better than the first one. We returned to Farnborough finding that Laura had to move out by 10am!<\/p>","images":false},"title":{"value":"A Tour Of The New Forest"},"version":1},{"date":{"d":28,"m":7,"y":1999},"datev":19990728,"info":{"content":"<p>We had a two day mini break planned. We packed up and went down to Bournemouth. The scorching weather meant the beaches were packed. The surf was up as well with big waves coming to knock us over. I forgot my bucket and spade.<\/p><p>Later on in the afternoon we walked into town to wander around. They've built something new in the square and by the pier. It was nice to see again. We made our way up to the New Forest, buying some food for our BBQ. We stayed near Romsey and had a great BBQ.<\/p><p>We then went off to the pub for a quick refreshment, before settling down for the night.<\/p>","images":false},"title":{"value":"Bournemouth Mini Break"},"version":1},{"date":{"d":27,"m":7,"y":1999},"datev":19990727,"info":{"content":"<p>This was going to be our healthy day. After dropping some stuff off at Lau's Grandma's we biked over to play tennis at Watchets. I'm beginning to want to play more and more now.<\/p><p>We then biked over to Aldershot and had a pub lunch before moving on to the Aldershot Lido. It was a big cold pool with loads of kids everywhere. It was good fun, and still very hot. We spent quite a few hours there before riding along the Blackwater Valley path to home.<\/p><p>We had a nice BBQ, then went off to Pantiles for the Nurses Ball. We didn't know hardly anyone and left early having spent very little money.<\/p>","images":false},"title":{"value":"Bike Ride, Aldershot Lido and Nurses Ball"},"version":1},{"date":{"d":26,"m":7,"y":1999},"datev":19990726,"images":1,"info":{"content":"<woops rating=\"3\" woopstitle=\"4am Getup Only To Find Market Shut\"><p>I made Laura get up early. 4am! The reason was Billingsgate Fish Market. I've always wanted to go there. Laura drove up there arriving at 5am only to find it's only open Tuesday to Sunday!<\/p><p>Oh dear. We made our way back, slept in the car before being let back in at 7am!<\/p><img src='images\/years\/1999\/1999_07_26-BillingsgateFishMarketClosed.jpg' class='diaryImage' alt='24th Birthday Meal in Englefield Green' \/><p class='diaryImageCaption'>24th Birthday Meal in Englefield Green<\/p><\/woops><p>After a short doze, we were off again to Garratt Lane for the auctions. I'd last been here 7 or 8 years ago. They sold all sorts. It was quite fun, although Laura wasn't so interested.<\/p><p>I was looking for a new hard drive so we made our way up to Tottenham Court Road, but didn't find anything cheap enough.<\/p><p>We also popped over to the Globe Theatre, but didn't see anything really.<\/p><p>It was a real summers evening and we decided to go for a walk on Chobham Common. We returned to Farnborough for the night.<\/p>","images":false},"title":{"value":"Billingsgate, Garratt Lane, Tottenham Court Road, Globe Theatre"},"version":1},{"date":{"d":25,"m":7,"y":1999},"datev":19990725,"info":{"content":"<p>Mum and Dad came over to go on the boat. We set sail from Gillingham and went up-stream towards Rochester, Dad particularly enjoyed it, playing the rudder controller.<\/p><p>We came back mid-afternoon where Mum and Dad stayed for a cup of tea for an hour or so. It was good fun.<\/p>","images":false},"title":{"value":"Babar with Mum and Dad"},"version":1},{"date":{"d":24,"m":7,"y":1999},"datev":19990724,"info":{"content":"<p>We went up to Lee where I got my haircut, then on to the Grandparents. There was a lively, great atmosphere there. Heather and a daughter along with Christine were there. Christine was mad as ever. The good old days was the theme. We heard some World War II stories from Grandpop.<\/p><p>We'd arranged to meet Renaud, so went around for him at Greenwich, and played chess in the park for a couple of hours. We had a great time. I really enjoyed it. We parted with a drink at the Trafalgar and returned for a BBQ in the back garden at Lau's house. We then went down the pub with Ellie, Michael and Charlotte for a drink.<\/p>","images":false},"title":{"value":"A day in SE London"},"version":1},{"date":{"d":23,"m":7,"y":1999},"datev":19990723,"info":{"content":"<p>We could afford a proper holiday this summer. We had booked a couple of nights in a hotel in Newcastle, but had to cancel that. Still we had lots planned. The weather all week was scorching hot which helped.<\/p><p>We spent the first weekend in Gravesend. Ellie had returned from Germany the previous week so it was the first time we saw her at home. We went out almost straight away and met in the Black Prince, Hartley way. We spoke to William, who seemed to have a good time in the south of France, all loved up with Fabien. Karen, Helen and Nigel all came along a little later.<\/p>","images":false},"title":{"value":"Home Holiday - Meeting with Lau's Friends"},"version":1},{"date":{"d":20,"m":7,"y":1999},"datev":19990720,"info":{"content":"<p>Mum, Dad and some of Laura's family went along to the last ever Royal Tournament at Earls Court. We arrived early, even though it took 50 minutes to find a parking space! All residential streets are permit only. We went to the pub beforehand. The show itself was very good. We were sure that some of the motorcyclists were going to collide as they criss-cross. It was good to see the gun race which is quite competitive. It lasted about 3 hours. My bottom ached on the uncomfortable seats.<\/p>","images":false},"title":{"value":"Royal Tournament"},"version":1},{"date":{"d":19,"m":7,"y":1999},"datev":19990719,"info":{"content":"<p>Work at the moment is a bit mixed. I'm working on my 'pipe' project which is teaching me programming network applications. I'm doing this unaided, so I'm a little unsure if my design is any good. Even so, I'm enjoying the responsibility and experience. Roy has planned for me the archive problem, which means re-engineering code. This seems to be a grotty, although large and important job.<\/p><p>There are many people speaking of leaving the company mainly due to salary. The company better do something about it and fast otherwise it'll be too late. I or we have felt like mushrooms, not knowing anything. I'll be looking for around £20K to £22K minimum.<\/p>","images":false},"title":{"value":"Work at the moment"},"version":1},{"date":{"d":18,"m":7,"y":1999},"datev":19990718,"info":{"content":"<p>The weather this weekend has been a glorious 24C. Laura went to church in the morning, this time to St. Peters. She joined me afterwards, lying in the back garden reading the paper and planning our week off. The five of us had a roast, then Laura had a late shift, whilst I relaxed and croquet against my dad in the evening.<\/p>","images":false},"title":{"value":"Day in the Back Garden"},"version":1},{"date":{"d":17,"m":7,"y":1999},"datev":19990717,"info":{"content":"<p>Laura had an early, whilst I played Andy Davies at croquet, and won. My break building was good, my hitting in was variable. I made lunch for Laura and I and Barrie came around for half an hour for a chat.<\/p><p>We went into Camberley to buy James's birthday present, a £15 gift voucher for WH Smiths. We rushed over to watch the new Star Wars film over in Bracknell. I haven't heard too many good things about it. There were 10 of us or so. I saw Nikki, David's girlie for the first time. She seemed quite outgoing. I loved the film, I think more because it was Star Wars rather than its content. I just love the different animals and droids, the light sabres and the fact it was a part of a bigger story.<\/p><p>After the film we scooted to Camberley's Litten Tree. It was happening there. Everyone enjoyed themselves. We ended up in Joe Bananas, which we couldn't really afford, but we got persuaded. We didn't buy a round that evening! and we came back potless. I danced quite a lot, but again, clubbing ain't my scene anymore. Barrie's Laura was off her head. We got on well as a four. We also met Susan's new fella Graham. He's Susan's age and a mechanic. Very outgoing. I just hope he treats her right.<\/p>","images":false},"title":{"value":"New Star Wars Film and Met Graham for first time"},"version":1},{"date":{"d":16,"m":7,"y":1999},"datev":19990716,"info":{"content":"<p>It's getting quite sociable at work at the moment. I went out during one lunchtime down to the pub, and again this evening. After a few games of pool I slid off home quickly, ate dinner, and went off with the whole family for the first time in ages, to Chertsey for the 'quiz de la musique'. It was quite a fun evening.<\/p>","images":false},"title":{"value":"Music Quiz at Chertsey"},"version":1},{"date":{"d":11,"m":7,"y":1999},"datev":19990711,"info":{"content":"<p>We began by looking around some car boot sales, but weren't very impressed, other than Spectrum stuff. We eventually had lunch at Laura's grandparents prepared by Laura. It was very nice, but we sat outside in the searing heat. She had put a lot of effort into the meal. I had prawns with a dip for starter, then some Italian potatoes in a sauce which was very filling. For pudding we had a raspberry ice cream sorbet which was the best pudding I've tasted. After watching the end of the British Grand Prix which Michael Schumacher had a bad shunt, we walked to the bust Frimley Green carnival.<\/p><p>In the evening we watched Live and Let Die.<\/p>","images":false},"title":{"value":"Still looking for furniture"},"version":1},{"date":{"d":10,"m":7,"y":1999},"datev":19990710,"images":1,"info":{"content":"<p>I had a croquet match arranged with Charles Bailey, and again I won. He was younger than me and he just graduated from Oxford. He was a nice chap with a plum in his mouth. We returned to have a scrumptious lunch, which meant smoked salmon. In the afternoon we went out in the scorching sun, 27C, in search for furniture shops. We went to furniture 2000 which was well over priced. We headed off to Reading, and on the way saw a couple of pine shops in Lower Early. One claimed to be second hand, but they were all new it seemed. Definitely one to go back to at a later date. The trouble is that we don't know what furniture to get because we don't know what the rooms are like. Also storage space is a bit of a premium. We scooted back to prepare for Laura's surprise dinner out.<\/p><p>By this stage I didn't know where I was going. Laura wore the lovely black dress that I got her at Christmas and she did look very stunning. Just thinking about her in it make me want to give her a big cuddle. She led me down by foot to Frimley station, caught the train to Egham. Fuggy wasn't working the late turn which was a shame. We got a taxi to Englefield Green and had a drink in the Barley Mow pub whilst watching the village cricket. Laura done her usual trick and couldn't remember where the restaurant was, even though she had made a special trip previously! It's difficult to get lost in the village of Englefield Green! I couldn't believe it! She asked a man where the restaurant was then comes back to me and says 'he's Italian too', which gave it away. The restaurant was down the same road as the green we were just at. How does she get it wrong? I was laughing as Lau was getting stressed at being late. Don Beni's was its name.<\/p><p>We both had a lovely starter as we sat outside. Al fresco style.  For my main I had a fish pasta selection, with cockles and muscles and prawns. I enjoyed it, but was getting a bit fed up at picking my way through it. It was very filling. Laura stuck to garlic bread and lasagne, how predictable. We walked back to the station. We had to wait 45 minutes at Ascot, so I called up Dad who took us home.<\/p><img src='images\/years\/1999\/1999_07_10-EnglefieldGreenItalian2.jpg' class='diaryImage' alt='24th Birthday Meal in Englefield Green' \/><p class='diaryImageCaption'>24th Birthday Meal in Englefield Green<\/p>","images":false},"title":{"value":"Martin's 24th Birthday - Don Beni's Italian"},"version":1},{"date":{"d":9,"m":7,"y":1999},"datev":19990709,"info":{"content":"<p>I didn't want too much fuss over my birthday, other than from Laura of course. We met up with Nick, Martyn, James and Barrie at the Kings Head. I got £15 in vouchers from both Barrie and James, and I got drink bought for me. I only had 5 or 6 Caffreys, but I paid for it later as I chucked up all over the place at home. Apparently I'm the loudest person when wrenching up.<\/p>","images":false},"title":{"value":"Birthday Drinks"},"version":1},{"date":{"d":4,"m":7,"y":1999},"datev":19990704,"info":{"content":"<p>We rose early, as I had to get to Woking, for a day's speed croquet competition. I won it! But to my disappointment, didn't win a goblet. It was good fun, but quite tiring.<\/p>","images":false},"title":{"value":"Speed Croquet"},"version":1},{"date":{"d":3,"m":7,"y":1999},"datev":19990703,"info":{"content":"<p>Laura had an early whilst I went out shopping with dad for wood. I wasn't too sure what I was going to make beforehand. I'm just a frustrated DIY'er with nothing planned. Dad suggested bed side tables, which I thought would be good.<\/p><p>We went over to Gravesend and helped set the quiz up that Laura's mum was running. Laura was in a foul mood, but cheered up later! Mum and dad came across for this one, and done us proud. They met Helen and Nigel and they thought Uncle Peter was a little strange.<\/p>","images":false},"title":{"value":"St George's Quiz"},"version":1},{"date":{"d":2,"m":7,"y":1999},"datev":19990702,"info":{"content":"<p>I had a game against June which I won and played reasonably well.<\/p>","images":false},"title":{"value":"Croquet"},"version":1},{"date":{"d":30,"m":6,"y":1999},"datev":19990630,"info":{"content":"<p>Adam who sat next to me at work was leaving to work in the city. A pay increase from 19K to 23K. For the first time, Development were going out for a few drinks. Trouble is we had for than a few, ending up with myself, Adam, Steve Cassidy and Martyn. I was a bit out of my head, but apparently made everyone laugh. It ended up us leaving for the train station (trampling across the bushes along the way) only to find we had to wait half an hour. So we turned to the pub for more alcohol only to find it was shut of course. We then for some reason began walking into Fleet to find if an 'offy' was open. Once we reached the traffic lights however, we realized we needed to get back sharpish to catch our train. I was trying to avoid the guard so we went on the end carriage only to find he was there!! I began to walk purposely in the other direction, but of course didn't get too far, because it was the end carriage. Luckily I didn't get fined and was only charged £1.60.<\/p>","images":false},"title":{"value":"Adam's leaving do"},"version":1},{"date":{"d":28,"m":6,"y":1999},"datev":19990628,"info":{"content":"<p>Laura felt she had to go to Germany to see Ellie for her 21st. she went with Helen and had a good time. I missed her loads while she was away for 4 days.<\/p>","images":false},"title":{"value":"Laura off to Germany"},"version":1},{"date":{"d":27,"m":6,"y":1999},"datev":19990627,"info":{"content":"<p>After church on Sunday we toot led home. Laura had work while I had a croquet match which I played well and won.<\/p>","images":false},"title":{"value":"Returning back home"},"version":1},{"date":{"d":26,"m":6,"y":1999},"datev":19990626,"info":{"content":"<p>I returned up the A3 to Surbiton to represent the club in the Longman Cup. I didn't play particularly well, but enjoyed basking in the sunshine, and we won in the end.<\/p><p>In the evening I trekked over to Gravesend to meet up with Laura's crowd for a night out in Maidstone. We went to Yates's and Strawberry Moons. It was so nice to see so many of Laura's friends collectively and getting on really well. It was the first time I had seen Jessica for absolutely ages, Fiona for 6 months or so, sane with Andrew. William was also down, being the fool as usual. A good night out.<\/p>","images":false},"title":{"value":"Croquet - Maidstone with Lau's Friends"},"version":1},{"date":{"d":25,"m":6,"y":1999},"datev":19990625,"images":2,"info":{"content":"<p>On Laura's birthday we queued after an hour’s or two sleep to a blistering hot day. The scousers seemed a bit worse for wear. I put everything back in the car and moved it just up the road. I was surprised how close I was able to park considering.<\/p><p>The girls that the Liverpuddlians had chatted up, were rough looking which brought a smile to my face.<\/p><p>We had a choice of tickets. Centre court had just been sold out with Henman and Rusedski playing there. We plumped for court no. 2 after my persuasion, with Anna Kournikova first up. She's got a great body and legs, but she has a face like a spoilt brat, and she is miserable, so overall I'm still happy with Laura I suppose!!! ;) She's my babes.<\/p><p>We got in about mid-morning paying £23 for our seats each. We sat and had my rolls for breakfast by the impressive new court no.1. We decided to wonder around, until we found Steffi Graf warming up for her match with McEnroe later on. I don't want to sound like a pervert, but she's got nice legs to. She looked in great shape for the championship this year. the effort she puts in to each shot is staggering.<\/p><p>We then made our way over to the seats, where we found we had front row positions. Top banana. Just after midday the two players arrived. Was there a loud cheers for Anna or what. Wolf whistles the lot. To the opponents credit she smiled at all the attention Anna was given. Anna on the other hand looked miserable as sin. I was quite surprised how brown she actually was. I didn't think Russians got a tan. I had my camera poised, but was under the evil eye of Laura. There was a huddle of photographers there waiting for Anna. It's a bit sad really, all the men interested in her because of one thing only. Not because she is one of the world’s top players. I wonder if the day will come when we get bored of seeing her face and appreciate the tennis she plays.<\/p><p>The game lasted just over an hour with her opponent retiring, already one set up anyway. It was nice to watch our first game of tennis for two years! Next on court Laura got her own back because the supposedly good looking Mark Philippoussis was on. Now he had one mean serve on him.<\/p><p>We broke off for a rest to look around a bit. we were getting frazzled in the sun. We saw Henman play on Henman Hill, looking to the big screen by court no.1. He won.<\/p><p>I also saw Greg warming up for his match as well. We returned back to our seats later on in the afternoon to see a Briton pairing get knocked out. Now there's a surprise.<\/p><p>We returned to 'Henman Hill' to watch Greg play, before being worn down by the sun. Both wanting to get something to eat. Having enjoyed our day out, we rounded it off by some fish and chips in Berrylands on the way home.<\/p><img src='images\/years\/1999\/1999_06_25-BirthdayAtWimbledon1.jpg' class='diaryImage' alt='Wimbledon Tennis' \/><p class='diaryImageCaption'>Wimbledon Tennis<\/p><img src='images\/years\/1999\/1999_06_25-BirthdayAtWimbledon4.jpg' class='diaryImage' alt='Wimbledon Tennis' \/><p class='diaryImageCaption'>Wimbledon Tennis<\/p>","images":false},"title":{"value":"Wimbledon - Laura's 23rd Birthday"},"version":1},{"date":{"d":24,"m":6,"y":1999},"datev":19990624,"info":{"content":"<p>It was Laura's birthday treat to go to Wimbledon again this year. Even though the past two years have been disastrous, we hadn't lost any will for Laura's 23rd. In fact I think we were more determined. I've spent the last 2 or 3 weeks working hard on her picture frame present. After getting the number of years wrong on the Christmas Card I went one better and put Laura's age wrong down in her card. As small compensation I did realise before giving her the card..<\/p><p>I made sure the tent was all there on the Wednesday. I had planned to make some nice rolls so I bought some fresh after work on the Thursday. I made some bacon and cheese + tomato rolls, got a large tray of strawberries and a big bottle of orange. I raced to meet Laura, who had been wedding dress shopping, by Wimbledon stadium.<\/p><p>We parked very close to the tennis and decided to go down to the pub before joining the queue. We walked and walked and found a pub in Smallfields that wasn't packed out with tennis tourists. The pub was excellent, having a blues band jamming there. Even Laura got to like the noisy atmosphere. We stayed till closing time and took a different route back. We setup tent in the park and we were about the 800th people queuing. The weather was hot and dry for once with no clouds in the sky. Perfect! However, we had 3 or 4 scousers next to us who decided to stay up all night and cause commotion.<\/p>","images":false},"title":{"value":"Wimbledon - Camping in the queue"},"version":1},{"date":{"d":20,"m":6,"y":1999},"datev":19990620,"info":{"content":"<p>After Laura went to an early church service we went up to London for a bike ride along the Regent's Canal. We dumped the car at Limehouse and begun our cycle up the canal. Instead of the Regent's Canal we begun on the Limehouse Cut, which feeds into the River Lea. How we laughed! I mean who are the only people who could get lost on a canal, there's only one path! Having looked at the map and calming Laura down, I decided that we should continue up the river, turn off the Hertford Union canal and join the regent's Canal from there.<\/p><p>The cycling itself was very enjoyable. There were no hills to climb, instead Laura got off sometimes to go down them! There were a lot of fisherman as we raced alongside scrub lands, disused factories, flats and trendy apartments and houses.<\/p><p>Dad suggested to stop and look where Auntie Grace and Ada grew up in Dalston. It was a rough looking area and we eventually found 109 Hertford Road. It was quite a nice looking house. We went to the A10 and ordered two pizza's which we ate by the crossroads. By this time it was getting quite hot. Lau took a picture of me outside the house before we continued  westwards along the canal. At one point a kid chucked a bit of roll at me from the other side of the canal. Cheeky so and so. We made it through Islington until we came across the very long tunnel, which didn't have a tow path. We rejoined via Rodney Street! We went through Regent's Park after going through the busy Camden Town. we again were forced off the canal route by Lords cricket ground.<\/p><p>The World Cup Final was being played, Australia Vs Pakistan. As we were biking along a street to rejoin the canal, half a dozen Pakistani's were in a shouting match with some others who taunted at them about Australia winning. They ran at them and a fight was about to break out. Some 'authentic inner city violence'. However, someone calmed the situation down and they walked off!<\/p><p>We rejoined having gone through London Zoo and finally reached Little Venice. From there we had a break and rode to Hyde Park, went past Speakers Corner, down the side of Park Lane to Buckingham Palace, to Parliament, then followed the Thames path before returning to the car a bit wearily.<\/p><p>In the evening Laura went to Chiquitto's for Uncle Philip's birthday, whilst I played croquet with Dad. A very enjoyable day.<\/p>","images":false},"title":{"value":"Regents Canal Bike Ride"},"version":1},{"date":{"d":19,"m":6,"y":1999},"datev":19990619,"info":{"content":"<p>After the previous two weekends of practically non-activity due to skintness and Laura working we decided to venture out this weekend. I'm currently in a furniture making mood at the moment, so we decided to go out and see some second hand furniture shops. We went to Aldershot, Cranleigh and another craft factory units village. Although we saw nothing, the weather was good and it was quite relaxing. It was Nick's birthday so in the evening we went to a Guildford pub called Roxboro's or somewhere close to the Friary centre anyway.<\/p>","images":false},"title":{"value":"Furniture Shops and Nicks Birthday"},"version":1},{"date":{"d":29,"m":5,"y":1999},"datev":19990529,"info":{"content":"<p>We travelled up on Saturday afternoon and met Helen and Vicky on the way. A glorious sunshine morning, turned into a rainy, brummy afternoon. We met with Will and Phil and travelled back to his place. Now correct me if I am wrong, but I'm sure William had finished being a student. I think a student would even think twice about renting this place. The smell, the untidiness were something else. This provided great comedy, William being the butt of all jokes of course.<\/p><p>After jogging to the bank and back, we went into Will's local for a couple and played some pool. 'Quiet' Phil was an OK bloke who I could warm to. Will's friends seemed a bit dodgy. The words of the weekend were 'Who's your daddy', 'sweet as' and 'get amongst'. We went back had some dinner, then hit a pub before going to the 'dome' nightclub which was good.<\/p><p>However, Laura was very tired which spoilt things a bit. The taxi ride home was a bit of trauma. The mad Asian, drove very fast and at the same time hooted on to the bumper of the car in front. Shattered, we collapsed and fell asleep very quickly.<\/p>","images":false},"title":{"value":"Visiting William in Birmingham"},"version":1},{"date":{"d":26,"m":5,"y":1999},"datev":19990526,"info":{"content":"<p>I went to Renaud in Greenwich and watched an amazing cup final in a pub in Foots Cray. We played chess afterwards. He said he would be 'honoured' to be one of my ushers at the wedding.<\/p>","images":false},"title":{"value":"European Champions League Final - Man Utd Vs Bayern Munich"},"version":1},{"date":{"d":25,"m":5,"y":1999},"datev":19990525,"info":{"content":"<p>We returned home, to go and sort some banking and look at some furniture and DIY shops. The weather was good and I failed miserably to make a picture frame. A good long break.<\/p>","images":false},"title":{"value":"Back home again"},"version":1},{"date":{"d":24,"m":5,"y":1999},"datev":19990524,"info":{"content":"<p>Because there were no showers, it was a priority to find some swimming baths. We went to Mansfield, had no luck there, but did find some in Chesterfield. After our swim we proceeded to Sheffield. A city much like any other. Nothing to go out the way for in the future it seems.<\/p><p>The weather had turned for the worse and we'd run out of money, so we thought we'd go and see Ellie back in Gravesend. After the long drive back we arrived early evening.<\/p>","images":false},"title":{"value":"Up to Sheffield"},"version":1},{"date":{"d":23,"m":5,"y":1999},"datev":19990523,"info":{"content":"<p>Sunday morning and I spookily didn't have a hangover. We went down for breakfast and met some of the other party go'ers. We waited for a while, then went to Dave and Ally's house with his parents to open some of their wedding presents. Well watch them open them. The house was a brilliant starter home. 4 bedrooms, nice street, 8 year old house for only £90K. It was really nice to be there watching them open the presents. They got loads. All nice as well. They had it all now.<\/p><p>The day was sunny and we left just after midday for Sherwood Forest. We walked around, looked at the visitor exhibition, then basked in the sunshine, listening to Radio 5, watching a local village cricket match with 'my woman' beside me. Bliss, bloody bliss. We traipsed around looking for a campsite, eventually found one, costing just £3.50. However, there were no showers. We set the tent up in 5 minutes, before driving on to Nottingham to look for the Cathedral. There is no Cathedral in the city. Well I thought it was a city! We found the main church instead and went for evensong. We then bought pie and chips and ate them in the town hall square, before returning to Calverton for a quick drink and then an early night off to bed.<\/p>","images":false},"title":{"value":"Sherwood Forest and Nottingham Camping"},"version":1},{"date":{"d":22,"m":5,"y":1999},"datev":19990522,"info":{"content":"<p>We booked a night in the hotel where the reception was held and decided to stay up in Nottingham for a couple of days. We drove Susan up and got there about 12 midday. Mum and dad left half an hour earlier but arrived at about 1:30pm. Typical.<\/p><p>The hotel was on the edge of a housing estate, in a country park. It was 3 star. The room was OK. I watched the lead up to the FA Cup final and the cricket, while we were getting ready.<\/p><p>The town Arnold, seemed a bit like the Ancell Estate. We three, got to the church not knowing anyone really. The service was nice. I felt admiration for the two of them. Lots of friends there, a bit of family, a sunny day and a lot of happiness and excitement.<\/p><p>After the service there were millions of photos that needed taking. We were included in the grooms half. We waived the two wedding cars off and proceeded back to the hotel for the reception. I managed to pop into our room once or twice to look at the football. We hung around for a while. Mum and Dad found it difficult to socialize, that's one thing I have learnt this weekend. I can see why we're not include with family that much. We were sat with some other Dixon's, cousins, a son and a great nephew of Grace's. They were quite posh, and I felt sorry for the mid 20's nephew who was a complete mummy's boy.<\/p><p>Terry, Alan's brother, didn't seem to mix in much either. I had a good time as did Laura. The speeches were good, and the best man's was relatively short. A lot of wine was left over, which we hid away for the evening do.<\/p><p>Mum, Dad and Susan left for home, while we were going to party. Me and Laura chatted most of the night, but I did get to speak to Lynda's aunt and mother. The disco was pumping out disco music mainly, to Laura's disappointment, but we still had a boogie. We didn't quite make it to the end. I was so tired, I collapsed and passed out on the bed. We'd finished that wine off.<\/p>","images":false},"title":{"value":"David and Alison’s Wedding"},"version":1},{"date":{"d":21,"m":5,"y":1999},"datev":19990521,"info":{"content":"<p>I had a croquet match which didn't go very well. I still haven't got a natural swing. When I returned home, I found Dan and Karen speaking to dad. I'd managed to get him a F.A. Cup Final ticket. I was supposed to go up with him, but I had the wedding to go to instead. Dan only stayed a short while as he had to go to Deal, funnily enough.<\/p>","images":false},"title":{"value":"Dan And Karen over for fleeting visit"},"version":1},{"date":{"d":20,"m":5,"y":1999},"datev":19990520,"info":{"content":"<p>I drove over to Croydon to meet up with Claire and her new man James.<\/p>","images":false},"title":{"value":"Claire and new man James"},"version":1},{"date":{"d":16,"m":5,"y":1999},"datev":19990516,"info":{"content":"<p>I played my first competitive game of the season against Ray Mobsby and won. Laura had a late. I didn't do too much.<\/p>","images":false},"title":{"value":"Croquet"},"version":1},{"date":{"d":15,"m":5,"y":1999},"datev":19990515,"info":{"content":"<p>Laura had an early on Saturday. I pottered around then went into Camberley with her to buy some nursing shoes.<\/p><p>In the evening we went to Jas's place in Guildford. There were a number of us. David showed his single mindedness and wanted to go out, while the rest of us wanted to stay in. Jas's flat was very nice. Over the last few weeks, Susan and Mark have split up as has Steve and Emma, Claire and Jon, and now Jas and 'boyf' Chris. It must be the season for it. Only Ellie and Michael have outlasted us.<\/p><p>We went to a couple of pubs, then David wanted to go on to a club. It was quite funny as the rest of us didn't want to go, but we were all too scared to say anything to him. We eventually ended up back at Jas's. We both felt very uncomfortable as they were doing funny substances.<\/p>","images":false},"title":{"value":"Jas's Party"},"version":1},{"date":{"d":14,"m":5,"y":1999},"datev":19990514,"info":{"content":"<p>Both me and Lau are very strapped for cash, especially with Lau's car potentially either needs a new engine or even a complete write off. She had gone home for a couple of days so I picked her up from Woking station and went for a quick drink in Woking's Litten Tree. We went home only to find we couldn't take the car over to Gravesend because automatics can't be towed for long distances.<\/p><p>Anyway we went to the Quays with Bazza for one of the nurses leaving do's. We're really becoming good friends with him. Nick and Martin and turned up later. They are now not moving in together. For the last 2 or 3 years they're moving out.<\/p>","images":false},"title":{"value":"Down the Quays"},"version":1},{"date":{"d":9,"m":5,"y":1999},"datev":19990509,"info":{"content":"<p>On Sunday I played my last game for Casuals and have come runners-up in the division. I've got fed up with being substitute unfairly.<\/p><p>In the evening I went to practice croquet. Laura came as well. She doesn't seem to work at the moment!<\/p>","images":false},"title":{"value":"Last Game For Casuals?"},"version":1},{"date":{"d":8,"m":5,"y":1999},"datev":19990508,"info":{"content":"<p>We went to Guildford, shopping. We bought David and Alison’s wedding present and we choose the Denby Boston dinner service for ourselves to collect. I again really enjoyed myself.<\/p><p>In the evening we went out with Baz and the boys for his birthday. We went to Yates's, Litten Tree and then on to Joe Banana's. Steve B was trying to make friends over this Council Tax thing. I'm here with an open mind. If her wants to make the effort then so will I, but I've given up trying with him.<\/p>","images":false},"title":{"value":"Guildford Shopping"},"version":1},{"date":{"d":7,"m":5,"y":1999},"datev":19990507,"info":{"content":"<p>I took the day off to spend with Mormor. I had a great time with her karting her about. I went with Mum and Dad to take her to the airport in the late afternoon. She seems her old self, but is now less mobile having bad arthritis in the leg, which is very sad to see.<\/p>","images":false},"title":{"value":"A Day With Mormor Before She Returns"},"version":1},{"date":{"d":3,"m":5,"y":1999},"datev":19990503,"images":1,"info":{"content":"<p>We took Charlotte to Clacton On Sea. It was another warm day. We only managed the beach area, but it was very Essex! We lat on the beach, went up and down the promenade and the pier.<\/p><img src='images\/years\/1999\/1999_05_03-ClactonPier.jpg' class='diaryImage' alt='Clacton' \/><p class='diaryImageCaption'>Clacton<\/p><p>We stopped off on the way back at a moto cross meeting. We dropped Charlotte off before returning to Farnborough.<\/p>","images":false},"title":{"value":"Clacton"},"version":1},{"date":{"d":2,"m":5,"y":1999},"datev":19990502,"images":3,"info":{"content":"<p>We had a camping tour around East Anglia. Over the bank holiday weekend, we went to Ipswich, Great Yarmouth and Norwich. We stayed at Orwell Meadows Leisure Park, Nacton for one our nights.<\/p><img src='images\/years\/1999\/1999_08_29-GreatYarmouth01.jpg' class='diaryImage' alt='Great Yarmouth' \/><p class='diaryImageCaption'>Great Yarmouth<\/p><img src='images\/years\/1999\/1999_08_29-GreatYarmouth02.jpg' class='diaryImage' alt='Great Yarmouth' \/><p class='diaryImageCaption'>Great Yarmouth<\/p><img src='images\/years\/1999\/1999_08_29-GreatYarmouth03.jpg' class='diaryImage' alt='Great Yarmouth' \/><p class='diaryImageCaption'>Great Yarmouth<\/p>","images":false},"title":{"value":"East Anglia Tour"},"version":1},{"date":{"d":2,"m":5,"y":1999},"datev":19990502,"info":{"content":"<p>On Sunday I played football where I got my first ever booking for dissent. The referee was awful.<\/p><p>We had lunch around Mum and Dad's before venturing again over to Gravesend. We stayed at Lau's parents for a while, then went to the Black Prince with Lau's Dad, Mum, Grandma, Granddad, Charlotte, My Mum and Dad, Susan, Mark and Mormor. The purpose was to celebrate our engagement, to show the reception location, and discuss. We all got on very well in the pub a bit before hand, then when we ate our families settled in to two groups and defeated the purpose of the meeting. Never Mind. We slept around Laura's parents that night.<\/p>","images":false},"title":{"value":"Showing off the Black Prince"},"version":1},{"date":{"d":1,"m":5,"y":1999},"datev":19990501,"info":{"content":"<p>We ventured up to Cambridge for the day. I don't know why Laura wanted to go there, but I agreed. It took us a fair while, but the weather was good and me and Laura were getting on like a house on fire.<\/p><p>I wasn't expecting much of Cambridge, but I was very wrong. It had a nice classical architecture, it was vibrant, full of students, it had nice parks, a market and nice shops. We had a really enjoyable time wandering around. We ended up in a park reading our magazines for an hour or so. We returned home mid-evening, bought a pizza from Sainsbury’s' on the way home, which we ate and then watched Match Of The Day.<\/p>","images":false},"title":{"value":"Cambridge"},"version":1},{"date":{"d":30,"m":4,"y":1999},"datev":19990430,"info":{"content":"<p>On the Friday night we stayed in and watched a video, still living around Laura's.<\/p>","images":false},"title":{"value":"Bank Holiday Weekend"},"version":1},{"date":{"d":28,"m":4,"y":1999},"datev":19990428,"info":{"content":"<p>Laura had a surprise restaurant trip planned. This time she had managed to keep the location quiet, well until we got lost anyway.<\/p><p>It was a quaint looking place just to the south of Haselmere. However, when we got inside, we were the only guests except one. It was a small place with just 8 or 9 tables. This unnerved Laura who moaned a bit. I didn't mind so much. I had the Thai style prawns which were a bit spicy hot, then Monk Fish on a bed of rice. The fish was salty, but the meal was nice. The rice especially was well done. An enjoyable, but different evening.<\/p>","images":false},"title":{"value":"Shrimptons Restaurant surprise"},"version":1},{"date":{"d":25,"m":4,"y":1999},"datev":19990425,"info":{"content":"<p>I played football and returned to see Mormor here. I love it when she comes over. We relaxed for most of the day, and began my stay at Laura's place as Mormor was going to live in my room.<\/p>","images":false},"title":{"value":"Mormor Over"},"version":1},{"date":{"d":24,"m":4,"y":1999},"datev":19990424,"info":{"content":"<p>Me and Lau went to Wokingham to shop for a present for Mum's birthday. Never really been to Wokingham before. It's quite a nice, small town. I found a 3 tier plant thing for her.<\/p><p>In the evening we went to the Grove School with Laura's mum's family for a quiz. Laura's parents could see we had a row, which I didn't like one bit. I want us to be seen as perfect couple on the outside. Anyway we made up quickly and enjoyed this very long quiz.<\/p>","images":false},"title":{"value":"Grove Quiz"},"version":1},{"date":{"d":17,"m":4,"y":1999},"datev":19990417,"info":{"content":"<p>We again ventured over to Gravesend. We wanted to finally finalize which reception venue we would like. Every week that goes on restricts our options in terms of availability. There is about a 15-18 month wait time!<\/p><p>We began at the Stakis by Dartford Bridge, which was really nice, but a little too expensive for us. We tried to find the 'Mock Tudor Inn', in Greenhithe, but couldn't find it. We tried one in Gravesend, another near Chalk, and one small place in Cobham. However, none was as good as the Black Prince, Forte Hotel, Bexley.<\/p><p>We went Laura's grandparents in the late afternoon, where I almost fell asleep, exhausted from the morning. We headed back to Lau's for dinner before departing for the cinema in Rochester to watch Shakespeare In Love.<\/p>","images":false},"title":{"value":"Reception places"},"version":1},{"date":{"d":17,"m":4,"y":1999},"datev":19990417,"info":{"content":"<p>We went to Church at Southfleet, then in the late afternoon make our way to Wimbledon to the World Figure Of 8 Final with Mum, Dad and guests. We then made our way home. Terry and Anne left us on the Monday.<\/p>","images":false},"title":{"value":"Banger Racing Final"},"version":1},{"date":{"d":16,"m":4,"y":1999},"datev":19990416,"info":{"content":"<p>Mum and Dad’s friends Terry and Anne came over from France. On the Friday night we went down the Kings Head to meet up with the usual crowd.<\/p>","images":false},"title":{"value":"Terry and Anne Over"},"version":1},{"date":{"d":10,"m":4,"y":1999},"datev":19990410,"info":{"content":"<p>On Saturday we were fine again and headed to Ashdown Forest home of Winnie The Pooh. We done a small walk to Pooh sticks bridge and back.<\/p><p>We had a meal in the pub, before making our way to Tunbridge Wells where we put on a bet on the Grand National.<\/p><p>In the evening Barrie and James came over to Nigel's house and along with Helen, Karen and Richard we made our way into Maidstone where we ventured into Yates's and Strawberry Moons. It was a good night with Barrie and James on top form.<\/p>","images":false},"title":{"value":"A Tun Of Pooh - Then Maidstone with Nig, Baz, Jam"},"version":1},{"date":{"d":9,"m":4,"y":1999},"datev":19990409,"info":{"content":"<p>Again we headed towards Gravesend. We had a bit of an argument and both sulked for most of the evening and hardly spoke a word down the Central pub.<\/p>","images":false},"title":{"value":"Sulky Central"},"version":1},{"date":{"d":5,"m":4,"y":1999},"datev":19990405,"info":{"content":"<p>On Sunday we relaxed. Today we saw Laura's family at her Grandma's Easter gathering. We had a toast to congratulate us.<\/p>","images":false},"title":{"value":"Easter Monday"},"version":1},{"date":{"d":3,"m":4,"y":1999},"datev":19990403,"info":{"content":"<p>Laura had a late on Saturday, so I hung around till football where Chertsey were playing in Grayes. In the morning we went to the nearly open Bluewater shopping complex. However, after America, I'd seen enough shops, so didn't think much of it.<\/p><p>In the evening I returned back to David's for a boys night. It was the usual playing on the Playstation. That's getting a bit boring now.<\/p>","images":false},"title":{"value":"Chertsey at Grayes, New Bluewater"},"version":1},{"date":{"d":2,"m":4,"y":1999},"datev":19990402,"info":{"content":"<p>On Good Friday we went to Gravesend to see Lau's parents. We went to clean up the boat, then looked at the Black Prince in Bexley and another place nearby as a prospective place for our wedding reception. The Black Prince looked good. We stopped off at Laura's Nan and Grandpop's before returning back to Istead Rise.<\/p>","images":false},"title":{"value":"Good Friday in Gravesend, First view of the Black Prince"},"version":1},{"date":{"d":28,"m":3,"y":1999},"datev":19990328,"info":{"content":"<p>We rose very early to catch our return bus to JFK airport. We wanted to make sure we got there on time. We caught a tube to Grand Central station and then bussed it to terminal 7. Laura got really stressed at the bus driver as she thought we were going to be late. However, we arrived on time and had a little money for duty free. We were very disappointed with the three shops there. Poor selection.<\/p><p>We had something to eat before boarding. Again we watched a few films on the way back to pass the time quickly. Before we knew it, it was 10pm and Mum and Dad picked us up at Heathrow to drive us home.<\/p><p>A very enjoyable, if tiring holiday. We both had work on the Tuesday morning. We both didn't seem to suffer with Jet lag.<\/p>","images":false},"title":{"value":"NY Trip - Homeward Bound"},"version":1},{"date":{"d":28,"m":3,"y":1999},"datev":19990328,"info":{"content":"<p>Sunday was our real last day. Laura wanted to go to church on this Palm Sunday. After breakfast we went searching for a church. There was a Serbian church opposite the hotel. I thought this is a bad place to go seeing that the Kosovo crisis had just began. We found a nice, big church near Lexington Avenue, but it began a little later. Just enough time for us to go off exploring the east side a little more. Lexington Park and Madison Avenue had a nice atmosphere about them. The lower numbered avenues were also nice and more refreshing than the busier west side. We hit first avenue and saw the UN building again.<\/p><p>We returned back to the church hurriedly (as someone was worried about the time). The service was much the same as in England. People seem to take it more seriously, dressing up, singing louder. The choir was excellent. We took communion and an hour and a half later exited the church and went to a diner like in Pulp Fiction for some lunch. We then headed to the bus station for the second half of our bus tour, Central Park and Harlem. This was much more enjoyable than the previous tour as the lady commentator was better and we had good seats. We saw where John Lennon was shot, the whole of Central Park and Harlem where it was spot the white man. The shops there were very cheap. Low quality clothing and electrical stuff. We got off early and wandered round the souvenir shops buying tacky things. Laura laughed at me for wanting to go in these shops. To be honest every shop did seem the same. We slowly walked back to the hotel via the westerly avenues. We stumbled across a massive sports complex in Chelsea. It was brilliant having an all sports arena from ice hockey to football to gymnastics. A separate are dedicated to each sport. There were also exclusive boats trips. We also looked at the local heliport nearby, but decided against a helicopter trip as we had seen enough. Walking through Chelsea I was pleasantly surprised what a nice area this looked. If I had to live in New York it would be here. We finally reached the hotel, packed our clothes and quickly walked back uptown to the Mars 2012 cafe, another of Laura's theme cafes.<\/p><p>This one surpassed the Rainforest cafe visit in terms of gimmicks. You don't book a table, you get a boarding pass for the shuttle flight. The flight attendant then introduces us to the cafe and then to our simulated flight. We then went to Mars where the bar was situated. It looked like something out of Star Wars. The prices had already been inflated to 2012 levels I think!! Our name was displayed on screen 20 minutes later which meant we could enter the restaurant area and eat. It was like being inside a huge cave or volcano. It was brilliant. The service was good and tables set apart from one another so you could have a private conversation. It was huge inside. Down to our last pennies we couldn't afford much. We even shared the drink. The meal was fine and after chatting and paying the waiter, we left for our last walk back to the hotel (free of bags this time).<\/p>","images":false},"title":{"value":"NY Trip - Church"},"version":1},{"date":{"d":27,"m":3,"y":1999},"datev":19990327,"images":5,"info":{"content":"<p>Today was the big day. I wasn't nervous at all. I knew she would say \"yes\". I looked forward to making her happy. I guessed that her reaction would be one of excitement. Breakfast was a bit of a joke as we queued for half an hour. We had a busy day ahead of us. Again the weather was sunny, dry and getting warmer. I double checked the ring was with us as we left to head back towards the southern tip of the Island. We caught the subway again and headed for 'Clinton Castle' where we bought tickets for the 25 minute crossing to Liberty Island.<\/p><p>This area interested me the most as this where New York was colonised. The statue is the symbol of freedom and was donated by the French as was the first view that immigrants had of New York. The statue had in the past 10 years been cleaned up and renovated to its past glory. The boat was packed with tourists. The Island itself was packed and there was a 3 hour queue to Liberty herself. Having a full days schedule, we didn't have time to waste. There was a band and dancers performing which gave a really good atmosphere to the place. We ventured to the edge of the Island where there were spectacular views back to Manhattan. I was obsessed (well so Laura says) of getting some pictures of us, in front of the postcard scenery. We walked around Liberty to return to the queue for the 5 minute boat journey to Ellis Island.<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork72.jpg' class='diaryImage' alt='New York - Statue Of Liberty' \/><p class='diaryImageCaption'>New York - Statue Of Liberty<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork49.jpg' class='diaryImage' alt='New York - Our Picture Postcard' \/><p class='diaryImageCaption'>New York - Our Picture Postcard<\/p><p>Now this really did interest me (oh yes Norman!). It was difficult to capture any kind of atmosphere or resemblance of how it used to be, with 100's of thousands travelling through. Again there were many tourists here. We went to see an informative and interesting film about immigration and Ellie Island. Although it only last an hour, I was knackered and kept falling asleep even though I really wanted to watch it. We had a look around the exhibition for about half an hour but had to leave if we were going to fit everything in.<\/p><p>We returned to shore, caught a hot dog, and ate it looking over to the Island we had just visited. With my 'Norman' hat on, we followed a walk as described in the guide book. I read aloud as we walked. Laura couldn't believe how sad I was, but she loves me for it. We took in a lot of historic offices, a medium sized church that used to be a toilet building in New York, where George Washington was inaugurated. We then reached the World Trade Centre which is a collection of buildings but are famous for the twins towers that make New York's current tallest building. Again we queued for half and an hour or so. The lift took us quickly to the top floor. This time we were inside, but we could see all the way down as we could press our noses right on to the glass building. We had clear, spectacular views of the whole of Manhattan and could see much of Brooklyn. It was a beautiful sunny afternoon. Whilst we were up there we had to go on the helicopter ride simulator around Manhattan. We also had a drink in the cafeteria, before returning back to 'terra cotta' (as Del Boy would say)!<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork75.jpg' class='diaryImage' alt='New York - World Trade Centre' \/><p class='diaryImageCaption'>New York - World Trade Centre<\/p><p>We quickly exited and followed the guided walk around. We trundled along, but I started to get worried about the time. Although we were close to Brooklyn Bridge, I knew it would take a while to cross. We seamlessly made our way to the bridge, as the sun began to lower from the sky. I can remember the reflections on the buildings as we looked across. I was anxiously trying to pick out Brooklyn Heights, but I couldn't see it. Anyway, we eventually found the bridge footpath which runs above the traffic. It was a wooden walkway. Laura's feet were hurting from her shoes, so she took them off, which I gladly carried. As we walked across the sun was descending quickly as we admired the fantastic views of the buildings, the lights and the traffic. Half an hour later we reached the other side. I doubled checked that the ring was with me. I wasn't particularly nervous. I just wanted to ask her.<\/p><p>Once we reached the end we headed south. Laura knew we were going to the heights. We asked for directions and walked down a nice quiet residential street.<\/p><p>We finally made it. It was pretty dark by now which was a shame in some ways, but added to the atmosphere in others. The location was perfect, only a couple that were chatting to each other on a bench 40 yards away and one or two couples walking by. The atmosphere was relaxed and tranquil as the traffic could only be heard in the distance. We parked our bags on one of the rows of black, cast iron benches. Laura went to the railings to look across the water towards Manhattan. This was a chance for me to discretely set the video camera up and get the ring out. Now my adrenalin was flowing quickly. I went up to Laura, who still had her back turned. We kissed for a while and then got the ring box out, and so we were still close to each other presented the box, opened it, and asked \"Will you marry me?\" It was a bit of a blur after that, but I don't think I even got a 'yes' answer. She didn't even look at the ring. Instead I got crushed with a big hug. I could tell it took Laura aback, she was lost for words. There was a lot of feeling there. I felt glad on the one hand it was no longer a secret, the other happy that Laura was happy and happy myself for her wanting to spend the rest of our lives together.<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork56.jpg' class='diaryImage' alt='New York' \/><p class='diaryImageCaption'>New York<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork59.jpg' class='diaryImage' alt='New York' \/><p class='diaryImageCaption'>New York<\/p><p>We chatted back over Brooklyn Bridge about the whole setup and who knew. We walked to Little Italy where we found a restaurant to have a celebratory meal. Neither of us fancied champagne and to be honest felt like nothing had really changed. We still loved each other the same, still felt as close. I think this was the case as we both know what we wanted, we both wanted each other so much. I felt excited as we took a step closer to our goal of living together and marriage. We finished our meal and headed home early-ish as we had another exhausting day.<\/p>","images":false},"title":{"value":"NY Trip - !! Marriage Proposal !! - World Trade Centre, Statue Of Liberty, Ellis Is, Brooklyn, Little Italy"},"version":1},{"date":{"d":26,"m":3,"y":1999},"datev":19990326,"info":{"content":"<p>Today we went to a large discount retail park, Woodbury Common. However before that we caught the subway to go to Wall Street to see the Stock Exchange which is only open during the week. We queued for a while, but eventually got in to see the trading floor for about 15 minutes.<\/p><p>We then subbed it back to the other side of town to catch a bus from 42nd and 8th. The subway seemed to have more room inside the carriages to the London Underground. However, the stations themselves didn't seem to be a friendly place to be, with large cast iron black fences which reached to the ceiling and turnstiles designed in a similar fashion. It cost roughly 60p a ride. We rushed to queue for the bus only to find it was leaving 20 minutes later than advertised.<\/p><p>We left the city west into New Jersey. There was a lot of nothing on our 1\/5 hour trip. There were many megastore type places and on one particular dual carriage way there was shop upon shop for about 10 miles. It was quite amazing. You have to drive to each shop. After a fair while the landscape turned hilly, rocky and green. It was a refreshing change to the bland, flat landscape previously.<\/p><p>We finally arrived at the 200+ shopping outlet for fashion stores rejects are unsold lines. I was expecting swarms of people like Camberley on a Saturday morning. However, it was very quiet. The sun was shining and we were ready to shop. It was fantastic. The prices were cheap, the shops were practically empty, the sun was shining. I had money set aside to spend and 'my honey' could carry all the bags for me!! No not that last bit.<\/p><p>I bought some Skechers for $40, some smart suit shoes from another place for a similar place, some large smelly candles (which I later found in England to be cheaper!), two pairs of Dockers chinos for $50 the pair. A Nike top reduced from $70 to $20, a Calvin Klien jumper at $15 and some Vans shorts for $5 each. I really wanted a black hat exactly like Greg Normans, but Laura wouldn't let me, and I had run out of money. I bought Laura a top as a consolation for her. We flukely caught an earlier bus back, but it stuck heavily of toxic smell. I almost passed out.<\/p><p>We walked with all our shopping to Planet Hollywood where we had a meal. This is something Laura wanted. I personally would have preferred somewhere else, especially as you could walk into one of these back in England. Again we wearily walked back to the hotel and flaked out.<\/p>","images":false},"title":{"value":"NY Trip - Wall Street, Woodbury Common"},"version":1},{"date":{"d":25,"m":3,"y":1999},"datev":19990325,"images":1,"info":{"content":"<p>We had our bagels for breakfast and set off to buy our various bus tickets. We decided to go on a sightseeing bus tour, first taking the southern loop which took in the highlights of downtown Manhattan. To begin with it wasn't all it was cracked up to be. The bus was noisy so we couldn't hear the guide. It was also cramped and we seemed to be stuck in traffic all the time. However, we saw the other parts of New York. It looked as any other city as we travelled between mid-town and downtown. Then we began to come into China town and Little Italy. The roads were not in grid positions which strangely was a refreshing change. This area had a certain charm about it. A lot of old buildings. I was interested to hear the history of the oldest part of New York. We then reached the financial region, down at the southern tip. We stopped here for a short break. On the next stage we sat closer to the front where we could hear the guide, but nothing much he said was particularly interesting. In fact he kept going on about tipping him.<\/p><p>We were eventually dropped off at about 2pm at the Astoria Hotel and Central Park. The weather was fine and we decided to go for a walk in the famous park. The park is vast and was designed over 100 years ago. There are many characteristics to the park: hilly, ponds, flat, rocky, trees. We walked past a pond first, past an ice staking rink and sat by some rocks. There we wrote our postcards and rested for a while. We didn't go too far north. We exited to the east on to 5th Avenue. We looked at a more salubrious part of Manhattan. These streets were more quiet and there were many hotels as we dodged to Lexington Avenue.<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork65.jpg' class='diaryImage' alt='New York - Entrance To Central Park' \/><p class='diaryImageCaption'>New York - Entrance To Central Park<\/p><p>We found Bloomingdales which was huge, nicely presented, huge number of lines and some very expensive items. We also went into the Spy shop briefly and the Sony experience place which was free and we spent a couple of hours in there.<\/p><p>We found a diner in which to eat. I loved it. It was a typical diner with stools all along the serving bar and a huge mirror, so the vain could watch themselves eat. We couldn't afford much and embarrassingly gave a small tip.<\/p><p>On our way back we explored the Rockefeller building and watched part of the ice skating that was strangely there.<\/p><p>We de-toured and headed for a cinema in Time Square to watch 'Analyze This'. We wanted to see a film that hadn't reached our shores. We were so tired after this we wearily walked home.<\/p>","images":false},"title":{"value":"NY Trip - Bus tour, Central Park, Bloomingdales, Sony Experience, Rockefeller, Cinema"},"version":1},{"date":{"d":24,"m":3,"y":1999},"datev":19990324,"images":1,"info":{"content":"<p>An early departure for our memorable trip abroad. Dad dropped us off at terminal 3 at about 7:15am and we headed for check in at United Airlines. We were greeted with a note offering us to travel on a later flight, arriving at Newark airport for £800 each. A chance not to be missed. So we volunteered for this. We checked in and looked around duty free for 20 minutes. I wanted to make sure we had the best possible chance of qualifying by getting to the boarding point first, so our names would be top of the list. However, it didn't work that way and we were not chosen. We boarded and took off at about 9:30am.<\/p><p>Laura done her usual 'Brace as hard as possible' routine. I thought she was going to have a baby the way she was going. Our flight lasted 7.5 hours and passed quickly with a couple of films and meals to occupy us. The TV screen was built into the back of the seat which was quite neat. We even had a tracking system to guide us, and report our location, speed and altitude. It was a bit cloudy when we landed at about 1pm, but we noticed that even in the suburbs houses were organised in a grid pattern.<\/p><p>JFK airport wasn't as modern as we'd thought it might be. The usual intermediation of being in a new country hit us almost straight away whilst trying to organise transport for the 20 miles trip to Manhattan. There was a travel information point where we sought help. The so called helper was very official with her advice and manner. Meanwhile Laura was waiting outside with the luggage getting her shins reformed  from trolley pushers who totally disregarded what was in front of them. A bus just arrived as we rushed to get seats. Two black ticket sellers were outside and sold us return tickets and told us to hurry on to the coach. Before I knew I was short changed by $10, but only realised when I got on the bus. This made me annoyed.<\/p><p>The weather was a bit grim and drizzly, and leaving the airport we noticed how untidy everything was. Our coach trip was about 30 minutes long, and we didn't really see much on the way. We came in through Brooklyn and Queens and through Queens tunnel to Manhattan Island. As soon as we came out the other side we immediately noticed how tall the building are. They make you feel to be at the bottom of a canyon. I'd not seen anything like it before. We were slightly held up in the notorious Manhattan traffic, but were finally dropped off at Grand Central station.<\/p><p>Excited at the prospect of taking in the atmosphere of New York, we decide to walk to our hotel, with all our luggage. The Arlington Hotel which was on 25th Street by Broadway and fifth avenue. We went passed the library and the impressive Empire State building. We saw the first of many steaming man hole covers and the yellow taxi's, which seemed to make 25% of the traffic. The walk was tiresome as we had to carry all our luggage. We finally arrived at our hotel, which seemed to be in a rough par, although it seemed fine inside with a reception area and nice cafe at the back. Again the receptionist was coarse and could have some of Laura's 'happiness lessons'. The room was basic but clean. The view was other rooms of the hotel and we had an ensuite bathroom. We unpacked and I continually checked the ring was still safely tucked on my inside jacket pocket.<\/p><p>We left the hotel at about 3pm and headed for the tourist information in Time Square. We got on to Broadway, but to our surprise this area for several blocks looked decidedly dodgy. There were many foreigners, electrical shops and general untidiness. We felt a little apprehensive walking down here. However, the rundown area quickly passed. Time Square is the New York equivalent of Leicester Square. However, this had a number of busy roads running across it. In the middle there were boards up, stopping you entering a building site. There was scaffolding all over the place, seemingly holding buildings up. Having said that, we did get a piece of New York. There were loads of lit adverts, like at Piccadilly Circus, there were news feeds scrolling across, there were loads of yellow taxis, there were many shops and sky scrapers. There were such a large mix of races. I couldn't really see them as Americans. We looked at the half price ticket bureau for Broadway shows but they were still too expensive for us at $40 each. We went to the Visitor Centre (tourist information). We had to go to the bus terminal itself to buy our tickets to Woodbury Common and a sightseeing tour. Our traditional swimming baths visits would not be fulfilled here. You either had to buy a year’s ticket for the municipal baths or go to an expensive.<\/p><img src='images\/years\/1999\/1999_03_XX-NewYork66.jpg' class='diaryImage' alt='New York - Time Square' \/><p class='diaryImageCaption'>New York - Time Square<\/p><p>Never mind. We headed off to the bus station but inadvertently took a de-tour through the unknown then, Hell’s Kitchen area, North West of Time Square. This was once home of gang land territory. Where West Side story is supposed to have been set. Although not the nicest area, I felt safe enough. Laura however, felt a bit intimidated. While we walked along one of the busy roads I was filming. Suddenly somebody lent out of their car and yelled across, 'I love you' or something like that. It was quite funny. A lady, who was  walking towards us, who saw this remarked \"it could only happen in New York\". To which I thought \"only a comment like that could be made by a New Yorker\". We eventually made it to the bus station. By now it had got dark. It was closed!!!<\/p><p>Apparently there were two big stores not to miss. Macy's was close by so we popped in. We weren't very impressed. I expected a Harrods or Selfridges type thing. All we got was an ordinary looking department store. We only saw part of it, and I reckon we just saw the bad bit.<\/p><p>We continued east along 5th avenue and the Empire State building. To be honest the building didn't look any taller than any other big sky scraper there. It again had scaffolding around the bottom. The interior was very plush. We queued a little bit on our way up the 80 something floors. The left was quick. It took perhaps 30 seconds to get to our destination. We walked outside to the viewing gallery and the views across the New York skyline was amazing. It was very windy. It was difficult to pick out people we were so high up. The highest we'd ever been. The traffic could be seen, the whole island could almost be seen. From Central Park in the north, to the World Trade centre in the south, and bridges east and west linking the other boroughs. We were so high up and it was dark it was difficult to pick any detail out of anything. The viewing area was quite big at 15-20 metres squared. There were a couple of gift shops in the middle. Laura turned all romantic on me which was nice. I think she was hoping for a proposal. I think she thought if I was going to ask on holiday, here would be the place. Never mind eh Laura, I didn't disappoint in the end.<\/p><p>We returned back to earth, hungry. There was a Houghlihan's restaurant close by, which we entered and had a burger 'dinner'. Shattered from all the travelling and walking we made our way back to the hotel on foot where we crashed out.<\/p>","images":false},"title":{"value":"NY Trip - Set Off, Grand Central Station, Walking around Manhattan, Empire States Building"},"version":1},{"date":{"d":22,"m":3,"y":1999},"datev":19990322,"info":{"content":"<p>Trying to organise this was a bit of a nightmare. I had to tell Laura I was going to David's this evening, so Laura then decided to go back to Gravesend. Great start!<\/p><p>The next problem was getting Gerry out to tell him, I mean ask him, without letting on beforehand what I wanted to speak about. I told him it was surprise I needed help on. Very good I thought.<\/p><p>I got to Southfleet at about 8pm and rang to meet in the Ship pub. I asked if Carol could also come. I waited having already bought me and Gerry a pint. They arrived 10 minutes after my call. I waited and agonised at the bar. I just wanted to get it over and done with. My insides were all twisted as I travelled down. I can't remember the exact words, but it went something along the lines \"... I was going to ask Laura to marry me in New York\". They were very happy especially Carol. I think she went on to organise the wedding that evening. I showed them the ring as well. We must have chatted for about an hour and a half before I returned home.<\/p>","images":false},"title":{"value":"Asking Carol and Gerry's Permission"},"version":1},{"date":{"d":20,"m":3,"y":1999},"datev":19990320,"info":{"content":"<p>In the morning Laura went off to aerobics with Susan, giving me a chance to get the final remaining bits for New York. I got a tape for the dictaphone I borrowed, but couldn't find Flash Gordon (Queen) or Wonderful, Wonderful Copenhagen on CD. Got my haircut done as well. In the afternoon I drove to Hambledon near Guildford where we done some nice cycling. We stopped off at a nice pub in Chiddingfold, for a drink and a read of the paper.<\/p><p>We moved on to Bognor via the back roads. Having got there we visited a few pubs but couldn't find a decent restaurant. We decided to find a pub on the way back. The one we found was 5 miles north of Bognor, and had a nice locals atmosphere.  We returned home, not going to Jas's do!<\/p>","images":false},"title":{"value":"Biking and Bognor"},"version":1},{"date":{"d":20,"m":3,"y":1999},"datev":19990320,"info":{"content":"<p>I played football, whilst Laura went to church. The afternoon and evening was spent relaxing.<\/p><p>Later on we went to Chertsey's quiz night and came joint third.<\/p>","images":false},"title":{"value":"CTFC Quiz Night"},"version":1},{"date":{"d":19,"m":3,"y":1999},"datev":19990319,"info":{"content":"<p>We went down to the Kings Head as usual, with all the boys there.<\/p>","images":false},"title":{"value":"Kings Head"},"version":1},{"date":{"d":14,"m":3,"y":1999},"datev":19990314,"info":{"content":"<p>Football was cancelled. So I played up at the park in the afternoon. In the morning I started on Laura's engagement video. In the evening we went to evensong at St Peters.<\/p>","images":false},"title":{"value":"Started Engagement Video"},"version":1},{"date":{"d":13,"m":3,"y":1999},"datev":19990313,"info":{"content":"<p>We went with Steve and Uncle Peter to the Hogsback Brewery. It was very sunny. Laura had a late, while I had a round of golf with David over in Hawthorn Hill, near to Maidenhead. We had a practice on the driving range, where I was terrible. I was missing the ball more often than not. Anyway y we had to hire shoes as there was a dress code that I broke. David teed off well on the first. There was a bit of an audience.... and I fluffed mine. I played badly for the first three holes. I steadily improved from there. I was cracking away my drives. I felt great satisfaction. We played match play and lost 6-3, but had a good laugh.<\/p>","images":false},"title":{"value":"Golf with David"},"version":1},{"date":{"d":12,"m":3,"y":1999},"datev":19990312,"info":{"content":"<p>It was Laura's grandparents 50th wedding anniversary. It was held at Bluebeckers in Warnborough. The whole family were there, and we were both buzzing. There were two tables , the oldies and the youngies. I had a great laugh. Too much so apparently. I was too noisy and excitable Laura said. Laura's mum had got 50 golden things for her parents.<\/p>","images":false},"title":{"value":"Alan and Joyce's 50th Wedding Anniversary"},"version":1},{"date":{"d":10,"m":3,"y":1999},"datev":19990310,"info":{"content":"<p>I'm getting very excited about the prospect of going to New York. A) because it's New York and B) Popping the question to Laura. She's been harping on about when we should get engaged and I'm shrugging her off and saying not for a long time yet. However, it's not easy, to keep saying that when in my heart of hearts I'd love to marry her this weekend. Not only does she harp on to me, but to our friends as well. 'Oh Martin and me are getting married' she'll say. I've told quite a few people my plan. I shouldn't really but I'm so excited by it. I haven't told work, any of Laura's family or David. She keeps bluffing me, which is a bit scary. Last night she came out with \"You're going to ask me on top of the empires state building. I know your mum told me\". For 5 or 10 seconds I believed that she knew. I do want it to be a surprise. I can't wait to see her face. I think she's going to be unbearable. I don't want it to completely over shadow the trip, so I'll give it to her the day before we leave. I plan to do it close to Brooklyn Bridge. The view from there is amazing, looking down towards Manhattan. I'm still not too sure how to ask her. I want it to be serious, but not over the top. I want to make sure we're both in a loving mood at the time. I also want to give her some presents, a CD at least. It's got to be small enough for me to hide in my coat.<\/p><p>My other problem is asking Laura's Dad. Do I involve her Mum, what do I say, how do I say it, where do I say it and when? All unknown at the moment. The trouble is Laura is going back to Gravesend in the days leading up to New York. However, I don't want to do it before she goes back because I don't her mum not letting the cat out of the bag! I think I'll take them down to The Ship or the Black Horse in Southfleet and ask and go through the financial plan and ask them whether they have any questions. How do I get them down the pub through! Tricky.<\/p>","images":false},"title":{"value":"2 Weeks to New York"},"version":1},{"date":{"d":8,"m":3,"y":1999},"datev":19990308,"info":{"content":"<p>Nothing special was arranged as Laura was working a late. I had made a glass head to look like myself. I bought the head, which is slightly smaller than real life size, in Kingston, whilst Christmas shopping. Unfortunately the nose bit broke. Never mind, I was undeterred. I'd spent quite a few evenings doing it. I first painted the whole head in a skin colour. However, it turned out too red. Another night I painted an undercoat of blonde hair. Then, I combed brown paint to give it some detail. I then ventured on to the face, which I had lighten somehow, and give it character. In the end I'd finished. Now what should I do with it. Give it as an anniversary present! Instead of just giving it to her. I set it up in her bedroom as a surprise for when she returned from her late shift. I'd put a lamp underneath and switched it on, to illuminate it. When she came home I hid to make it look like it had been left there. When she saw it, she was horrified and ran into the bathroom for half an hour. She hated it and said it was like something out of the Godfather. I tried to talk her out by saying 'don't lose your head' and a million and one other puns. The story ends by me taking back the present that I'd put so much effort and planning into. Hopefully one day she'll come round. My plan was to do one of her and we could have the pair as bedside table lamps! I didn't get a an anniversary present to top it all off.<\/p>","images":false},"title":{"value":"The Glass Head Story"},"version":1},{"date":{"d":7,"m":3,"y":1999},"datev":19990307,"info":{"content":"<p>Football had been cancelled due to a waterlogged pitch. Laura went to church, while I continued developing the curfews web site. After lunch I met up with Martin and Nick down the 'Staff' to watch the FA Cup Q\/Final, Man Utd V Chelsea. It was 0-0! In the afternoon I continued developing and eventually relaxed in front of the TV.<\/p>","images":false},"title":{"value":"Pubbing"},"version":1},{"date":{"d":6,"m":3,"y":1999},"datev":19990306,"info":{"content":"<p>We went to the garden centre and got some rose bushes. One for mum next week for mother’s day and one for Laura's grandparents 50th wedding anniversary. The anniversary bush was called Golden Shower!<\/p><p>We went to play tennis in the afternoon at Woking, then Laura has an early start for her nurse friend Jane's hen party. I dropped her and her friend Kelly off at Jane's house. I went out in the evening with the boys down the Kings Head. A great laugh. A got a call from Laura just gone 11 to pick her up as they had burnt themselves out, well Jane had apparently. It was nice as Barrie came to, we all had a laugh on the way back.<\/p>","images":false},"title":{"value":"Laura on hen party"},"version":1},{"date":{"d":5,"m":3,"y":1999},"datev":19990305,"info":{"content":"<p>This weekend went on forever. Not because it was boring, but it just did. It was Steve's 24th birthday and we all went bowling. It was quite a laugh. Steve and I got on a bit better. We found out that Matthew will be in New York at the same time as us. Spooky!<\/p>","images":false},"title":{"value":"Stevey B's 24th birthday"},"version":1},{"date":{"d":28,"m":2,"y":1999},"datev":19990228,"info":{"content":"<p>I played a full game for Casuals and won 5-0. Laura was working. In the evening we relaxed.<\/p>","images":false},"title":{"value":"Typical"},"version":1},{"date":{"d":27,"m":2,"y":1999},"datev":19990227,"info":{"content":"<p>In the morning we attempted to play tennis, but the courts were too busy for us non-paying, not supposed to be there people. We made a double quick exit when I saw Ian McDiarmid. We had to trundle back again. Laura worked in the afternoon again.<\/p>","images":false},"title":{"value":"Tennis - Non Event"},"version":1},{"date":{"d":26,"m":2,"y":1999},"datev":19990226,"info":{"content":"<p>Last week a Bugs Life, this week was You've Got Mail. It was awful. A romance without a storyline \/ plot. All I want is a half decent plot or storyline or at least a bit of action. Oh well Laura enjoyed it at least.<\/p>","images":false},"title":{"value":"Cinema - You've Got Mail"},"version":1},{"date":{"d":23,"m":2,"y":1999},"datev":19990223,"info":{"content":"<p>Susan came home on Tuesday from Marks. It seems pretty terminal and quite sudden. It's nice to have her back in the house again as a proper sister. Mum and Dad blame Mark as they've only moved in together for 2 or 3 weeks. It seems as if Mark is going to struggle to keep the house. Susan is fine some moments, bit tearful at others understandably. I think she's accepted it's over and wouldn't go back even if asked. In the evening me and Lau went for a walk in Heatherside and was that 32 Dawesmere Close had a 'sold' board outside.<\/p>","images":false},"title":{"value":"Susan Back Home"},"version":1},{"date":{"d":21,"m":2,"y":1999},"datev":19990221,"info":{"content":"<p>Sunday was spent watching Match Of The Day, waking up late and painting my head stone which was made of glass. It is a head that I have painted to make it look like me. The face is too red. The hair I painted dark blonde then combed brown paint on top. It has to be seen to be believed. I was thinking of putting a light underneath and leave it in her room in Farnborough as a surprise. Then when she came in from a late shift she'd get a bit of a shock! Perhaps for our 3.5 year anniversary!<\/p><p>Mum returned from Denmark in the evening and went sledging!<\/p>","images":false},"title":{"value":"Mum returns from Denmark"},"version":1},{"date":{"d":20,"m":2,"y":1999},"datev":19990220,"info":{"content":"<p>Laura had two earlies this weekend. This gave me an opportunity to prepare for the engagement in New York. First and most importantly the ring. I've already looked around Farnham and Fleet and have not seen anything suitable. I decided upon Guildford. I trundled over and must have looked around a dozen or so shops. I was beginning to get disillusioned, either rings being too ostentatious, expensive or not right. I want a diamond\/ruby ring with a thin ring or band, without a shoulder, spending between £250 and £350. I saw one cheaper at £150, but wanted to spend more on her. I was on my way back when I looked in Ernest Jones and saw one that met my requirements. This sounds bad, but it was £600 reduced to £300. I didn't progress any further as I needed to borrow one of Laura's rings and wanted Susan there as well to get a second opinion. I was very, very happy with my choice. It felt just right. I scooted back as happy as a sandboy. I told Susan and Dad the news.<\/p><p>After Laura came home and had some lunch we went off to St John’s to play some tennis. I really wanted a good knock around. I'd get immense satisfaction if we managed to get some decent rallies going that lasted more than 4 or 5 shots. We had a good time and said we weren't allowed to go until we had a 10 shot rally. It took us about 20 attempts but in the end we managed 30+ consecutive shots. Wow!<\/p><p>We went to Sainsbury’s to do out family shop. I bought some strange things. Pineapple, orange and banana juice comes to mind. Laura laughed at me getting done by dad. £56 it came to. I made a pasta carbonaire from Delia, which wasn't brilliant.<\/p><p>We headed off to another of David's parties. We played Taboo and I think I made an impression with my cheating tendencies. The Playstation inevitably came out which inevitably broke the party up again. We left just after midnight as Lau had an early.<\/p>","images":false},"title":{"value":"Engagement Preparation, Tennis, David Party"},"version":1},{"date":{"d":18,"m":2,"y":1999},"datev":19990218,"info":{"content":"<p>We went to see the holiday show which had over 100 stands. I didn't enjoy it as much as last time because I've seen what's on offer. I just want to go and do it. Afterwards we tried the New York visitors bureau again, to no avail, and the BBC also to no avail. However, it was a long, but enjoyable day. I did scrape my car against someone else’s but no damage was done. Training in the evening.<\/p><p>Susan was back home after Mark wanting a trial separation. Mark did not explain why and Susan is a bit tearful and didn't think there was a problem.<\/p>","images":false},"title":{"value":"Destinations’ 99"},"version":1},{"date":{"d":14,"m":2,"y":1999},"datev":19990214,"images":1,"info":{"content":"<p>I had football in the morning. Before I left we exchanged Valentines presents. I gave her 1881 perfume and Spice Girls compilation that I created at work, whilst I got a new wallet and Jolly Boys Outing OFAH video... and a nice card.<\/p><p>Mum left for Denmark on Friday and wasn't back will next Saturday. So Dad cooked a nice Sunday lunch. We all watched Man Utd V Fulham on the tele before me and Laura prepared to go out for a Valentines meal over in a pub\/restaurant in Warfield near Bracknell.<\/p><p>The Yorkshire Rose was very relaxing and we had a nice time. I had Brie in batter for a starter which was very nice then Duck Orange for main course which I didn't enjoy so much. Laura had soup and beef which she loved. It was thoroughly enjoyable.<\/p><img src='images\/years\/1999\/1999_02_14-YorkshireRoseBracknell.jpg' class='diaryImage' alt='Valentine’s Day' \/><p class='diaryImageCaption'>Valentine’s Day<\/p>","images":false},"title":{"value":"Valentine’s Day"},"version":1},{"date":{"d":13,"m":2,"y":1999},"datev":19990213,"info":{"content":"<p>I had to get up early to play Paintball over in Effingham. There were about a dozen AFP members. We had about 5 different scenarios, playing each twice. It was enjoyable, but not as good as the Horsham one last July.<\/p><p>In the evening we made our way up to London to meet up with Laura's friends. Andrew had only got back from Oz a couple of weeks ago. He seemed to have enjoyed himself. We all met in the Griffen pub just by Charing Cross station. We then moved on to the Buzz Bar by Leicester Square. This place was a great and had a club type atmosphere, size and unfortunately prices, but shot at 11 o'clock. I had nice chats with Nigel, Phil (Andrews mate), Richard and Karen. Really enjoyed it.<\/p><p>Both of us had a bit too much to drink. We passed out on the train back and missed our stop and went on to Fleet. It was freezing waiting for Dad to pick us up.<\/p>","images":false},"title":{"value":"Paintballing and London"},"version":1},{"date":{"d":12,"m":2,"y":1999},"datev":19990212,"info":{"content":"<p>I went over to Lau's where she had a meal prepared. Macaroni Cheese! We went to see a Bugs Life which was a Disney animation about a colony of bugs bullied by some grasshoppers. Exciting stuff eh??<\/p>","images":false},"title":{"value":"A Bugs Life"},"version":1},{"date":{"d":6,"m":2,"y":1999},"datev":19990206,"info":{"content":"<p>Stewart drove back on the Saturday and came round briefly for a drink. I went out immediately to Farnham to look for an engagement ring and valentines present. The rings I saw were £700 minimum. A bit over my £350 top limit. I bought the perfume 1881, however for the next weekend. Laura worked an early so we had a few hours in the afternoon together before I headed off to David's for a boys night in. There were only four of us in the end, but I had a good time playing on the Playstation.<\/p>","images":false},"title":{"value":"David’s Boys Night In"},"version":1},{"date":{"d":5,"m":2,"y":1999},"datev":19990205,"info":{"content":"<p>After organising it seemed, Me, Stewart Hector, Sean Creed and David Guest all met up. First time since the end of university in 1997. Stewart picked me up and he scarily drove us to Sean's house in Lingfield. We went to a nice pub and had a few drinks. Actually I only had 3 1\/2 pints, which was quite enough for me. We came home at closing time to play on his Nintendo. We all slept over.<\/p>","images":false},"title":{"value":"Uni Friends Meet up"},"version":1},{"date":{"d":31,"m":1,"y":1999},"datev":19990131,"info":{"content":"<p>We went with the nurses to play skittles in the Bricklayers Arms pub in Windlesham.<\/p>","images":false},"title":{"value":"Windlesham Skittles"},"version":1},{"date":{"d":30,"m":1,"y":1999},"datev":19990130,"info":{"content":"<p>About 150 people turned up. I wanted to speak to Laura's dad side of the family, as I don't know them so well. Not many of them turned up. Mum and Dad came and they saw some of Laura's family which was good. I spoke to Christine, Michael's dad and Karen and Richard, first time since their engagement.<\/p><p>Afterwards, it took ages to clean up that night and morning after. Both me and Laura were buzzing and really enjoyed it.<\/p>","images":false},"title":{"value":"Carol and Gerry's 25th Wedding Anniversary"},"version":1},{"date":{"d":23,"m":1,"y":1999},"datev":19990123,"info":{"content":"<p>We decided on a day out to the Cotswold's. We went to Abingdon, Witney, Bourton On The Water and finally Stow on the Wold. We stopped in a tea shop in Bourton which was lovely. Stow on the Wold had some good pubs. Places I would love to visit again. Somewhere I would retire to.<\/p>","images":false},"title":{"value":"Cotswolds"},"version":1},{"date":{"d":16,"m":1,"y":1999},"datev":19990116,"info":{"content":"<p>Laura was working an early, so I went to the Daily Telegraph Adventure and Travel Show on my own at Kensington Olympia. It was quite small. I got chatting to a hang glider, which made me dreaming of hang gliding one day. Up in the skies, with everyone below, nothing noisy. Bliss. There was also a speaker who talked about travel writing and photography. I think this would be my second most ideal job after rally car driving. After the show I walked down Tottenham Court Road to try to find some sort of bug device, so I could tape or record when I ask Laura's parents the big question, and when for I ask Laura the big question.<\/p><p>I plan to do it in New York, perhaps on the Empire State building. Anyway I didn't buy anything. I met up with Laura at Waterloo and we went to an Italian restaurant, St Martin's (or something). It was different. I had the now traditional raw beef. It was a small restaurant, the service was bad, the food not brilliant, but it was fun and different. The waitress even came running out to check we had paid.... which we had. We went looking for a pub and stumbled one close to Trafalgar Square. We were stopped by a women bouncer. I thought we were going to be asked for ID. Instead she warned us it was a gay pub! Suitably embarrassed we walked on to a pub down the Strand.<\/p>","images":false},"title":{"value":"Adventure Travel Show - Italian Restaurant"},"version":1},{"date":{"y":1999},"datev":19990000,"info":{"content":"<p>We wanted our parents to double check the house over. I managed to organise everyone to meet at 10am. There were quite a few things that were needed to be done with the house.<\/p><ul><li>a new boiler<\/li><li>new flat roof<\/li><li>loft insulation<\/li><li>brick re-pointing<\/li><li>re-tiling parts of the roof<\/li><\/ul><p>Still, the mothers liked it, whilst the dads were inspecting it closely.<\/p><p>I rushed over to football, at Aldershot Park where we threw away the game. Watched football down the pub in the afternoon and that had a Danish evening where we had a big meal with 8 of us, and played the dice game.<\/p>","images":false},"title":{"value":"Danish night"},"version":1},{"date":{"y":1999},"datev":19990000,"info":{"content":"<p>I played Jeff Dawson in the morning and won. After lunch, Laura returned. I was so happy to see her. We went to church in the evening and had a relaxing day.<\/p><p>With both of our pay rises  we should now be able to afford an additional £200 a month into the house fund. I'm not sure that my pay rise is really enough. Roy had said is looking to pay me more, but I'll believe it when I see it, which is never I don't suppose. Perhaps it seems worse as things are a bit boring at the moment.<\/p><ul><li><i>Martins Contrib<\/i>£300\u000a        <\/li><li><i>Laura's Contrib<\/i>£400\u000a        <\/li><li><i>Running Total<\/i>£3700\u000a        <\/li><li><i>Martins Bonus<\/i>£300\u000a        <\/li><li><i>Total Savings<\/i>£4000\u000a        <\/li><li><i>Martins Wage<\/i>£19250\u000a        <\/li><li><i>Laura's Wage<\/i>£14900\u000a        <\/li><li><i>TOTAL MORTGAGE CAN AFFORD NOW<\/i>£84100\u000a        <\/li><\/ul>","images":false},"title":{"value":"Laura returns from Margate - Saving for a House"},"version":1},{"date":{"y":1999},"datev":19990000,"images":1,"info":{"content":"<img src='images\/years\/1999\/1999_XX_XX-IsteadRise.jpg' class='diaryImage' alt='Us in Istead Rise' \/><p class='diaryImageCaption'>Us in Istead Rise<\/p>","images":false},"title":{"value":"Photos"},"version":1}],"version":-1084589780}