{"entries":[{"date":{"d":31,"m":12,"y":2004},"datev":20041231,"info":{"content":"<p>During the day we chilled. I took baby for a walk around the estate. I particularly like taking her to the top of the fountain bridge and then just letting go, making baby roll down all by herself. In the afternoon Mummy and I had a long sleep for 2.5 hours!<\/p><p>In the evening we went over to Ellie and Michael's to celebrate the new year in. We had a 'cook yourself' Indian which was scrummy, tried out the chocolate fondue and had some ice cream. We played games and quizzes. Michael and Daddy went out at about 11:15 as we heard, some glass smash. some yobs had smashed 3 car windows and someone’s front door! We spoke to the Police and told them where the boys went. We got in with seconds to spare to sing 'Aulds Langs Syne' and see the fireworks in London.<\/p><p>I'm getting very clever now. I can say a few words, fish, bee, pooh, duck, mummy, daddy, feet, biscuits (well tries to say that), car, teeth. I understand some words. If mummy or daddy ask me to point to an animal in the book then I can usually get it, or if they ask me to point to body parts like tongue, head, ears, eyes, feet and nose.<\/p><p>Daddy calls me insatiable, relentless, naughty, sociable, clever and happy.<\/p>","images":false},"title":{"value":"New Years Eve - Ellie and Michael's"},"version":1},{"date":{"d":30,"m":12,"y":2004},"datev":20041230,"info":{"content":"<p>We walked along the back where the firing ranges are towards Heatherside. We went to see where daddy used to live in Dawesmere Close.<\/p><p>first time we went to see the doctor about my little brother or sister.<\/p>","images":false},"title":{"value":"Long Walk To Heatherside"},"version":1},{"date":{"d":29,"m":12,"y":2004},"datev":20041229,"info":{"content":"<p>We walked along the back where the firing ranges are towards Heatherside. We went to see where daddy used to live in Dawesmere Close.<\/p><p>In the evening we went around to Auntie Susan's and Grahams and had a nice stew and dumplings. I think they are the best we've ever tasted.... The pudding was out of this world! We unfortunately didn't stay that late because Mummy wasn't feeling well again.<\/p>","images":false},"title":{"value":"Richmond Park Walk and Susan Meal"},"version":1},{"date":{"d":28,"m":12,"y":2004},"datev":20041228,"info":{"content":"<p>More jobs and sorting out. We went for a walk in the woods at the back of houses. I loved walking on the iced puddles and cracking the ice.<\/p><p>In the evening Barrie and Laura came over. They gave yet more presents. Poor Laura was big and uncomfortable all evening. We got the bean bag down and all sorts.<\/p>","images":false},"title":{"value":"Barrie and Laura over"},"version":1},{"date":{"d":27,"m":12,"y":2004},"datev":20041227,"info":{"content":"<p>Daddy prepared a lovely lunch for Farmor and Oldemor, with Smoked Salmon and posh cheeses and fresh bread it was lovely. We went for a short walk up to the fountain in the crescent, which took half an hour with me playing with the ball and Oldemor not being so quick on her feet these days.<\/p><p>We spent a lot of time tidying up and sorting out. Oldemor was to leave early tomorrow to go back home with the Fars.<\/p>","images":false},"title":{"value":"Oldemor over for lunch"},"version":1},{"date":{"d":26,"m":12,"y":2004},"datev":20041226,"info":{"content":"<p>We went to Broadstairs for the day. It’s a long way from Istead Rise. There was a lovely small sandy beach. We watched from the cliff top a large family playing all sports day games. We had a nice day, although I was cold, tired and hungry at some points. We stopped in a cafe and had some nice lunch.<\/p><p>Later in the afternoon the Barnett family arrived for games and food. We returned back to Deepcut late.<\/p>","images":false},"title":{"value":"Boxing Day"},"version":1},{"date":{"d":25,"m":12,"y":2004},"datev":20041225,"info":{"content":"<p>Opened presents at home first. Went to Fars for breakfast. Whilst Mummy and I went to church Daddy finished opening the rest of his presents.<\/p><p>We also announced that Mummy was pregnant. Everyone congratulated us and were happy, although I think they may have guessed a little bit, because mummy hasn't been that well recently.<\/p><p>We went over to Istead Rise for Christmas Lunch, and spent the afternoon opening even more presents! We watched the Vicar Of Dibley Christmas Special which was good and played a pop quiz game.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2004},"datev":20041224,"info":{"content":"<p>During the afternoon both Martin and Steve popped around for a bit to swap presents and cards which was nice.<\/p><p>Went to work. Went out to see Christmas lights on people’s houses. Around to the Fars for Danish Christmas Dinner.<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":23,"m":12,"y":2004},"datev":20041223,"info":{"content":"<p>There were a 10 of us from the football team that met up in Fleet for a few Christmas celebratory drinks. It was nice to meet some of the other team members like Meths, Jason and Phil C socially.<\/p>","images":false},"title":{"value":"Casuals Christmas Drink"},"version":1},{"date":{"d":19,"m":12,"y":2004},"datev":20041219,"info":{"content":"<p>In the morning we had to do some cleaning up from the night before. In the afternoon Karen and Richard took me to her Christmas Do, which was at a soft play centre.<\/p><p>Whilst I was there, Mummy and Daddy went to watch Bridget Jones 2 with Ellie and Michael.<\/p><p>In the evening Mummy went over to Karen's for a Christmas get together.<\/p>","images":false},"title":{"value":"Cinema"},"version":1},{"date":{"d":18,"m":12,"y":2004},"datev":20041218,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning mummy went to bed after she worked a night. Daddy and I went over to see Oldemor and Daddy and played lots. We then picked up Farmor and went to Chertsey where we walked through the town and stopped in the Ladybird cafe to have a coffee and a doughnut.<\/p><p>In the afternoon we had to take Mrs Oddie to her son and get ready for the evening's Christmas Party. Auntie Susan also came around for an hour which was nice.<\/p><p>There were quite a few for this year’s Christmas Party. We played lots of good games including Kelly's finger football game and Michael's flashing pictures quiz. We managed to meet Vicky’s new boyfriend, Paul, and William predictably had oil ridden hands and fell asleep quite early. We finished quite early this year.... In fact just when I was beginning the cocktails!! A good time had by all.<\/p><img src='images\\years\\2004\\2004_12_18-06-ChristmasParty.JPG' class='diaryImage' alt='Party Time' \/><p class='diaryImageCaption'>Party Time<\/p>","images":false},"title":{"value":"Our Christmas Party"},"version":2},{"date":{"d":17,"m":12,"y":2004},"datev":20041217,"info":{"content":"<p>In the evening Daddy went to the Development Christmas Do. However he couldn't eat, because of the previous years experience with the Indian food, and couldn't drink because he had to drive back and look after me, whilst mummy went to work. Anyway it was an enjoyable night where 3 or 4 people were getting drunk whilst the rest of us were stone cold sober. A bit of a surreal experience.<\/p>","images":false},"title":{"value":"Development Christmas Do"},"version":1},{"date":{"d":13,"m":12,"y":2004},"datev":20041213,"info":{"content":"<p>We put the decs up today. I loved them except for the dancing Christmas Tree. That's a bit scary!!<\/p>","images":false},"title":{"value":"Christmas Decs Up"},"version":1},{"date":{"d":12,"m":12,"y":2004},"datev":20041212,"info":{"content":"<p>Daddy played football down in Alton and lost narrowly by 2-1. It was a really good team effort as they only had 11 players, and played in the right spirit. Mummy and I went to church.<\/p><p>After Sunday lunch, we drove to Heathrow Airport in hope to tour around the visitors centre. However, it was shut. So Daddy continued up the M4 and drove into the centre of London.<\/p><p>It was fun looking at all the Christmas lights. Harrods was well lit up. We parked up in Piccadilly, walked up through Piccadilly Circus to the Trocadero. We enjoyed watching all the video games and going up and down the big escalators. It was good fun. We got back to the car and drove up Regents Street to see all the Christmas Lights hanging across the road. Then it was a bit of a mission to get out of London! We stopped off at Makie D's on the way home.<\/p>","images":false},"title":{"value":"London Lights"},"version":1},{"date":{"d":11,"m":12,"y":2004},"datev":20041211,"images":1,"info":{"content":"<p>Today we drove up to Woburn Safari Park. We got there before it opened, so we went to visit the bison and some deer. The bison were in real muddy conditions.<\/p><p>We drove around the park, seeing tigers, lions, elephants, giraffes, bears, zebras, rhinos, a hippo, wolves, and last but no means least monkeys. Like at Longleat the monkeys took a fancy to our car. A couple of them climbed on the roof, one of them done a big plop, then decided to tread it in to various parts of the car. Looking forward to seeing mummy clean that one up! Daddy was getting a bit worried because the petrol gauge was on empty, and the warning light was on. However, we managed to get out OK.<\/p><p>After the driving around we went to stroke the wallabies, played on the outdoor adventure playground, went in the mini-monkey enclosure, saw the sea lion show, played in the soft play area, where daddy went on the vertical drop slide. We also saw the cute penguins (Daddy's favourites), went in the area where you can hold lemurs and went to the elephant ring and actually touched the rough skin of an elephant. Wow wee. We done loads and spent the whole day there.<\/p><p>In the evening Mummy had to watch her Strictly Come Dancing final. Boring!!<\/p><img src='images\/years\/2004\/2004_12_11-01-Woburn.jpg' class='diaryImage' alt='Resting at Woburn Safari Park' \/><p class='diaryImageCaption'>Resting at Woburn Safari Park<\/p>","images":false},"title":{"value":"Woburn Safari Park"},"version":1},{"date":{"d":10,"m":12,"y":2004},"datev":20041210,"info":{"content":"<p>Oldemor, with the Fars came around to visit for half an hour. It was ages since I last saw Oldemor.<\/p><p>In the evening we went around Mytchett and Hawley to look at houses with Christmas lights. There were some outrageous ones.<\/p>","images":false},"title":{"value":"Oldemor and Lights"},"version":1},{"date":{"d":7,"m":12,"y":2004},"datev":20041207,"info":{"content":"<p>Daddy had a busy day. We all went over to Chertsey with Michael as well. Mummy and I went for a walk, looked around the shops and played on the swings near the river.<\/p><p>Daddy and Michael went to the auctions, but didn't buy anything. They then 'trained' it up to London and met Nick, Martin and Steve to go drinking around Waterloo and to watch Faithless at the Brixton Academy.<\/p>","images":false},"title":{"value":"Auction and Faithless"},"version":1},{"date":{"d":6,"m":12,"y":2004},"datev":20041206,"info":{"content":"<p>Oldemor has arrived and will be staying for Christmas. Susan and Graham went to Denmark for the weekend and have brought her back over.<\/p>","images":false},"title":{"value":"Oldemor Arrives"},"version":1},{"date":{"d":5,"m":12,"y":2004},"datev":20041205,"images":1,"info":{"content":"<p>Mummy and I went to church whilst daddy played football. Mummy had a sleep in the afternoon as she worked last night, and was going to work tonight. That's 6 out of 7 weekends!<\/p><p>In the afternoon Daddy and I went over to the Fars, who were babysitting Susan's cats. I loved watching the cats. They kept me entertained for ages. I'm still not confident to go too near to them. I had a lovely time. We went and posted the parish magazine with Farmor and Farfar then onto the duck pond. DUCK, DUCK, DUCK.<\/p><img src='images\/years\/2004\/2004_12_05-06-WalkWithFars.JPG' class='diaryImage' alt='By Tomlins Pond With Farmor' \/><p class='diaryImageCaption'>By Tomlins Pond With Farmor<\/p>","images":false},"title":{"value":"Katie Cats"},"version":1},{"date":{"d":4,"m":12,"y":2004},"datev":20041204,"info":{"content":"<p>Mummy and I went on another shopping trip, this time with Helen, Fee and Karen S and this time to Guildford. Daddy went to Camberley to do some Christmas shopping, then met up with us later to go swimming in the Spectrum.<\/p>","images":false},"title":{"value":"Guildford"},"version":1},{"date":{"d":28,"m":11,"y":2004},"datev":20041128,"info":{"content":"<p>Mummy had to sleep having worked a night. So Daddy and I played a bit in the morning then went around to Farfar and Farmor's. We went for a nice walk up at the heath near a place called Donkey. It was very cold.<\/p><p>After a spot of lunch we returned to wake Mummy up and went over to the Spectrum in Guildford to play on the soft-play. However it was shut! Still I loved looking at the pool and at the disco ice rink. Perhaps we'll go there next week.<\/p>","images":false},"title":{"value":"Spectrum"},"version":1},{"date":{"d":27,"m":11,"y":2004},"datev":20041127,"info":{"content":"<p>Mummy and I went for a walk at Frimley Lodge Park, whilst Daddy went to Richmond for a long walk around the river. We had a nice time playing in the afternoon, and Daddy made lots of juices in his new Super Juicer!<\/p><p>In the evening Daddy went out with his friends to see a Red Hot Chilli Peppers tribute band.<\/p>","images":false},"title":{"value":"Chilli Peppers"},"version":1},{"date":{"d":24,"m":11,"y":2004},"datev":20041124,"images":1,"info":{"content":"<img src='images\/years\/2004\/2004_11_24-Katie.jpg' class='diaryImage' alt='Bath time fun' \/><p class='diaryImageCaption'>Bath time fun<\/p>","images":false},"title":{"value":"Bath time fun"},"version":1},{"date":{"d":22,"m":11,"y":2004},"datev":20041122,"info":{"content":"<p>Mummy took a pregnancy test today and it came back positive. Whoopee. I'm going to have a little brother or sister.<\/p>","images":false},"title":{"value":"Mummy Pregnant Again"},"version":1},{"date":{"d":21,"m":11,"y":2004},"datev":20041121,"info":{"content":"<p>We had a busy Sunday. Done the usual things in the morning. We had Grandma and Grandpa around for Sunday lunch, but had to rush them, as we had our first people to view the house at 3:30pm. Mummy had to sleep around Ellie and Michael's, and I went with her. Daddy showed the man around, but they thought the bedrooms were too small for them.<\/p>","images":false},"title":{"value":"Usual, Meals and Visits"},"version":1},{"date":{"d":20,"m":11,"y":2004},"datev":20041120,"info":{"content":"<p>We all met up lunchtime and went to take Mrs Oddie to see her son. Whilst she was doing that we went off to the shops to look around. I loved seeing the Christmas lights. We took Mrs Oddie back and played for the rest of the day. Mummy went to work during the night.<\/p>","images":false},"title":{"value":"Woking"},"version":1},{"date":{"d":19,"m":11,"y":2004},"datev":20041119,"info":{"content":"<p>Daddy bought a load of shares in Tesco today, against Mummy's will.<\/p><p>Daddy went over to Reading to play Poker. This time he won £100. Whoopee... and he managed to not get to drunk. Mummy and I went over to Istead Rise to see Grandpop and Grandma.<\/p>","images":false},"title":{"value":"Poker and Shares"},"version":1},{"date":{"d":14,"m":11,"y":2004},"datev":20041114,"info":{"content":"<p>Daddy won at football in the morning, whilst Mummy and I went to church. Farmor and Farfar came over to play for a bit, whilst mummy and daddy had their roast.<\/p><p>Later in the afternoon we went to Sandhills near Godalming to a donkey sanctuary. There were over 70 donkeys, a number of horses, goats and chickens. It was a private working farm, so it was a bit strange walking around someone else’s property.<\/p><p>As we were close by, we popped into James and Emma's for a cup of tea. They had their Christmas Tree up already! Couldn't believe it. Anyway it was very Christmassy and we had mince pies as well.<\/p>","images":false},"title":{"value":"James and Donkeys"},"version":1},{"date":{"d":13,"m":11,"y":2004},"datev":20041113,"images":1,"info":{"content":"<p>Our first weekend where Laura didn't have a night shift, or have to do Mrs Oddie, or do Crèche at church.<\/p><p>We decided to go down to Weymouth for the day. We arrived about midday starving, so we had our picnic on the benches by the beach. It was freezing cold and there wasn't a cloud in the sky. The view from the beach was fantastic, looking along the coast to Lullworth. We played on the beach for a while before we needed to find some warmth. Ahh the arcades. We won some money in on the slidey coins machine, then Mummy and Daddy thought it would be a good idea to stick me in a car roundabout ride. I weren't that impressed! We walked around the town centre and the shops in the town. Dad put a bet on and won a 5 way accumulator!<\/p><img src='images\/years\/2004\/2004_11_13-12-Weymouth.JPG' class='diaryImage' alt='Amusements in Weymouth' \/><p class='diaryImageCaption'>Amusements in Weymouth<\/p><p>We then headed back to the car and shifted along to Monkey World near Wareham. We started off by having a nice drink, although I wasn't sure that a slush puppy was a good idea in this weather. We saw lots of chimpanzees, orang-utans and gibbons. We managed to get really close up to them, only the width of the glass away. They were either playing outside, grooming each other or sleeping. You were never too sure at first if they were playing or fighting. It was good to see though.<\/p><p>In the evening Mummy and Daddy went out for a meal with David and Louise which was very nice. Louise is now 16 weeks pregnant.<\/p>","images":false},"title":{"value":"Weymouth and Monkey World"},"version":1},{"date":{"d":7,"m":11,"y":2004},"datev":20041107,"first":{"name":"katie","value":"Giving kisses"},"info":{"content":"<p>Normal routine for Sunday morning. Mummy went with Ellie to Grandma's birthday meal at the Star, Leatherhead. Daddy came after football (which they lost 4-1), then Mummy went to catch up on some sleep.<\/p><p>Daddy and I then drove to Petersham, and we were originally going to go around Ham House, however, we arrived a bit late, so we went for a nice walk instead. We circled Ham House and walked along the Thames. Daddy loved the area. The scenery looking from the banks of the Thames up the hill towards Richmond was brilliant. It was a real Autumns day, very grey, murky and fine rain. Lovely atmosphere. I am still doing this cute thing where I am crouching down (as if I was going to do a plop) and looking around. I also like jumping from the curb into Daddy's arms.<\/p><p>Mummy again worked another night shift. We all haven't had a decent night’s sleep for 2 weeks!!<\/p><p>Daddy asked me for a kiss today and turned my head and kissed Daddy on the lips. Daddy felt all proud and warm.<\/p><p>I am beginning to understand a few things now:-<\/p><ul><li>Get the ball<\/li><li>Get the biscuits<\/li><li>Can I have a kiss<\/li><li>Duck<\/li><li>Putting shoes on means going out<\/li><\/ul>","images":false},"title":{"value":"Great Grandma Birthday and Petersham Walk"},"version":1},{"date":{"d":6,"m":11,"y":2004},"datev":20041106,"info":{"content":"<p>I decided that we should have an early start to the day. 6am! It was a bit difficult to do anything for a couple of hours as the house was full of guests. Daddy went out for a walk around the Denton Wharf area. He could have sworn he saw the scaffold fighting man in the pub from last night.<\/p><p>After breakfast we went off to Shorne Country Park for a nice walk. Mummy beat Daddy by 10 seconds on the adventure trail! I know I surprised as well.<\/p><p>Mummy, Daddy, Grandpop and Uncle Howard went off to watch Tottenham play Charlton, whilst Grandma and I went for a walk and went swimming with Auntie Ellie in the afternoon.<\/p><p>The others went to pick up Grandpop's friend from Sidcup who was a staunch Spurs fan. We drove through London to get to the ground, which pleased Daddy (Norman). The tickets were £46 each was a lot of money.<\/p><p>Anyway, got into the ground and Mummy and Daddy had really missed watching Premiership football. The day before Tottenham had got rid of their manager and they played the first 60 minutes of the game poorly. Charlton weren't much better, just they scored 3 goals from three chances. The Tottenham fans were singing 'you're not fit to wear the shirt'. Substitutions were made and the game turned around. Charlton handballed on the line. 10 men and a penalty against, which was duly scored. Spurs pulled another one back, and the last 15 minutes were tense. However, Charlton hung on and eventually ran out 3-2 winners. An exciting match in the end.<\/p><p>We then spent the next 3.5 hours travelling back home. Mummy then had a night shift.<\/p>","images":false},"title":{"value":"Tottenham V Charlton"},"version":1},{"date":{"d":5,"m":11,"y":2004},"datev":20041105,"first":{"name":"katie","value":"I am 80cm tall"},"info":{"content":"<p>We went to Istead Rise for the Weston firework night. It was littered with the usual array of fireworks, including one Howard brought along which cost £50! They were good, but I cried after the first couple that went up. I'm not sure if I was in the best of moods to watch them as it was quite late for me.<\/p><p>Later on in the evening Daddy and Michael went off to Gravesend for a couple of jars. First went into Weatherspoons' where a fight was brewing up. One chap took off his jumper, ready for a fight. Everyone in the pub was either a thug or a bit of a slap per!!! Well not quite everyone. But you had to be careful. After a swift pint, we meandered through town seeing some 16 year old, tarted up, being sick in a shop doorway, and shouting obscenities. Daddy had forgotten how entertaining Gravesend was on a Friday night. We then went into the Troc. I think it should be renamed Trogs. Anyway we got back to chez Weston and the party was still on. Daddy didn't get to bed till gone 1 in the end which was a mistake.<\/p>","images":false},"title":{"value":"Fireworks Night"},"version":1},{"date":{"d":4,"m":11,"y":2004},"datev":20041104,"info":{"content":"<p>I had my MMR jab today at last. I wasn't very impressed! :(<\/p>","images":false},"title":{"value":"MMR"},"version":1},{"date":{"d":30,"m":10,"y":2004},"datev":20041030,"images":1,"info":{"content":"<p>After Farmor visited us in the morning fresh back from her trip from Copenhagen, and a half hour visit to Grandma and her parents (listening to their nightmare story in France), we went off to Polesden Lacey, near Great Bookham, a National Trust home and grounds.<\/p><p>A lovely Autumns day and we started by having lunch on the nice lawns of the house overlooking the North Downs. It was a lovely big mansion and a nice view. We done some walking, and more walking and finally it was time to look around the house. There were allot of posh people there, and a lot of guides to help and ask questions. It was an Edwardian house with still allot of the original features in it. Funny to see the old gramophone being wound up. Some of the rooms looked very opulent (word for the day).<\/p><img src='images\/years\/2004\/2004_10_30-04-PolesdenLacey.JPG' class='diaryImage' alt='Having lunch at Polesden Lacey' \/><p class='diaryImageCaption'>Having lunch at Polesden Lacey<\/p><p>Anyway I had to be carried all of the way around, because for some reason no one trusted that I wouldn't go up to stuff and wreck 'em like I only know how. Even Daddy got told off for touching stuff!<\/p><p>We went around to the stables area and had tea, and done some more walking again through the gardens. We all enjoyed ourselves, had a laugh. A very nice day out.<\/p>","images":false},"title":{"value":"Polesden Lacey"},"version":1},{"date":{"d":29,"m":10,"y":2004},"datev":20041029,"first":{"name":"katie","value":"Climbed on to the bed"},"images":1,"info":{"content":"<p>What a week we have had. Mummy has been working a few night shifts, she lost the Bagshot Care mobile phone, and yesterday we were in a car crash with Lorraine. Thankfully everyone was OK.<\/p><img src='images\/years\/2004\/2004_10_29-12a-Katie.jpg' class='diaryImage' alt='Katie Sandwich' \/><p class='diaryImageCaption'>Katie Sandwich<\/p><p>Tonight we had Andrew and George round and I was allowed to stay up late to see them. It was nice to see them. They bought me this cool steering wheel toy, which make loads of noise. They are so naughty.<\/p>","images":false},"title":{"value":"Andrew and George"},"version":1},{"date":{"d":22,"m":10,"y":2004},"datev":20041022,"first":{"name":"katie","value":"Ate my dinner by myself with a spoon"},"info":{"content":"<p>I am becoming so clever these days. I am babbling allot and sometimes say the odd word like; Mummy, Daddy, Duck and Baby.<\/p><p>I can understand simple things like 'get your shoes', 'get mummy a biscuit!!' and 'no', although I tend to burst out crying for this one.<\/p><p>I am also very clingy to mummy. If I am with Mummy and then she leaves the room, then I will starting crying for her for anything from 5 to 20 minutes. It is very difficult for Daddy to get close to me sometimes :(<\/p><p>I am also a pickle at night times. In the past week, I have been waking up at 4:30am and not settling down again, unless Mummy comes in to sleep on my bedroom floor. What a pickle<\/p><p>When I am not tired I am easily pleased and happy, and really like to play with all my toys very quickly. I most of all like sorting things out, like leaflets, or clothes in drawers, DVDs or books even.<\/p><p>My favourite though has got to be going out for walks and visiting farms and animals. I enjoy going to 'soft play' as well.<\/p><p>Today, Mummy cooked a shepherd’s pie for me. I ate it on my high chair and scooped the dinner out myself with my spoon. Some ended up on my cardigan, but I did manage to eat a lot. I am becoming more and more independent.<\/p>","images":false},"title":{"value":"Me, Katie"},"version":1},{"date":{"d":17,"m":10,"y":2004},"datev":20041017,"info":{"content":"<p>After a bad night’s sleep we done the usual routine. Boys to football and us girls to church.<\/p><p>In the afternoon the three of us went to Claremont Landscaped Gardens. A National Trust place in Esher. It was a lovely scenic, relaxing place. There was a big lake, with lots of ducks and even more importantly, puddles! we had a lovely walk, however, I ended up falling over in a puddle and soaking my peachy bottom. Seeing that I had already got a cold, we didn't spend too much longer there until we rushed back to a nice warm house.<\/p>","images":false},"title":{"value":"Claremont Landscaped Gardens"},"version":1},{"date":{"d":16,"m":10,"y":2004},"datev":20041016,"first":{"name":"katie","value":"Sore Throat"},"info":{"content":"<p>We had quite a busy day. Daddy and I went to pick Mummy up from work at 7:30am, as her car has gone into the repairers at last. Daddy cleaned and fixed the oven, then we went to Camberley to find a present for Uncle Graham. Daddy had forgotten it was his birthday during the week. Anyway we found a cool present for him. A Pink Floyd DVD. We went over to Auntie Susan and Grahams to drop off the present and have a cup of tea.<\/p><p>After lunch we headed over to Farnborough and for some reason went into Maplin's as it was their opening day. I only mention it because they had a robot man there which I couldn't stop staring at. He came up to me and sang Twinkle Twinkle Little Star, and done some Michael Jackson moves. Fascinating!<\/p><p>We were going to 'soft play' but the weather had seemed to cheer up and decided in the end to go to the Lookout. I had my new wellies and loved going through the puddles, then back again through the puddles again. Once in the puddles, I made these little splashes by stamping in the water. What fun. However, I fell over a couple of times and got soaked, so it wasn't long till we had to go back home again.<\/p><p>Grandma, Grandpop, Cherie popped over for a quick cup of tea before they went off for the evening. By this stage I had practically lost my voice, and I couldn't even cry very loud. Grandma asked for a biscuit and I duly obliged by going to the kitchen and getting the biscuit tin. However, I ate the biscuits myself!<\/p><p>Ellie and Michael also came over for a meal and to watch Lost In translation. I don't think many of us thought much of the film. Ellie and Michael stayed the night, but I didn't really go to sleep until 2am, as I was so poorly.<\/p>","images":false},"title":{"value":"Puddles and Ellie and Michael"},"version":1},{"date":{"d":10,"m":10,"y":2004},"datev":20041010,"first":{"name":"katie","value":"Blow my nose into a tissue"},"info":{"content":"<p>The usual routine on Sunday morning, football and church. I can't be left in crèche anymore. I much prefer it with the grownups in church. Far more attention to be gained!!<\/p><p>It was a lovely sunny day. In the afternoon we set off to Odds Farm Park. It was a rare breeds farm, and of course I loved seeing all the animals. I never like going to close. When an animal comes close to me, I cry a bit. Otherwise, I do this stooping thing to look at the animals, to check them out first. I can say duck and puppy and I sometimes say \"hi\" to the animals. we went on a tractor ride, and Daddy let me go on this really fast slide in the playground. I absolutely loved it. Farms are my favourite day out by far.<\/p>","images":false},"title":{"value":"Odds Farm Park"},"version":1},{"date":{"d":2,"m":10,"y":2004},"datev":20041002,"first":{"name":"katie","value":"Jumping and bouncing on the bed"},"images":2,"info":{"content":"<p>We drove over to Gillingham and went sailing on Babar with Grandma, Grandpop, Ellie and Michael.<\/p><woops rating=\"8\" woopstitle=\"Family members almost went boom\"><p>It was quite blustery, getting up to force 7 (over 30 knots). We decided to put the sail up. We were going for quite a while until Daddy took the tiller and within 20 seconds the boat was zig zagging and rolling violently from side to side. The boom unexpectedly came whipping across and knocked poor Uncle Michael on the head. It was lucky he wasn't knocked off the boat or anyone injured.<\/p><p>Daddy's stint at the tiller ended and Mummy's call for \"mota, mota\" were finally heeded, and we motored to Queenborough.<\/p><img src='images\/years\/2001\/2001_05_20-BarbarTrip07.jpg' class='diaryImage' alt='Captain 'Uncle Albert' Gay' \/><p class='diaryImageCaption'>Captain 'Uncle Albert' Gay<\/p><\/woops><p>Just got to mention the lovely lunch we had. Sounds simple, but it was 'crepe suset'. Cheese ploughman’s. Mmmm<\/p><p>We eventually got to Queenborough, where there was a grumpy man who wouldn't let us moor against his boat. Don't understand people like that. Anyway the next boat along couldn't be friendlier, helping us moor and even took me in his arms when we were clambering off.<\/p><p>The boys went to the pub, whilst us girls went for a walk around. We later joined the boys, just after daddy took me on a walk down the sludgy, muddy spit to the sea.<\/p><img src='images\/years\/2004\/2004_10_02-11-SailingQueenborough.JPG' class='diaryImage' alt='Queenborough - Thames Estuary' \/><p class='diaryImageCaption'>Queenborough - Thames Estuary<\/p><p>We had a lovely dinner and went back to the boat. I was snuggled to bed, whilst the grownups played Triv Pursuit. Of course the brainy boys thrashed the girlies.<\/p><p>The boys headed off home in record time. Queenborough to Deepcut in 1hr 5mins!!! 90-100mph all the way back. Fantastico.<\/p>","images":false},"title":{"value":"Sailing"},"version":1},{"date":{"d":30,"m":9,"y":2004},"datev":20040930,"info":{"content":"<p>Mummy (mainly) and Daddy have decided they would like to move to Alton. So we all went over after Daddy's work. Uncle Michael kindly babysat for me, whilst mummy and daddy cased the town out and checked some of the pubs (Eight Bells and Swan Hotel) and of course the fish and chip shop. I think they found some properties they liked the look of all about the 230K - 250K mark.<\/p><p>First there are things in the house that need to be done in order to sell it. Secondly the house opposite is up for 270K, which seems expensive. If we come onto the market, then we fear of a bidding type war occurring. Thirdly we got to find out what sort of mortgage we can afford, especially now that Mummy is sort of working part-time.<\/p><p>Lots to do, but quite exciting really. Hopefully we'll move to a house that has got more character, in an area that has amenities and parks within walking distance. Also it helps with Ellie and Michael living in the same town.<\/p>","images":false},"title":{"value":"Alton Feelers"},"version":1},{"date":{"d":25,"m":9,"y":2004},"datev":20040925,"info":{"content":"<p>I think we'll rename Daddy as 'Daddy Disaster'. He bashed Mummy's car into the side of the garage. We were supposed to go cycling and forgot my seat, so we couldn't!<\/p><p>Anyway we went over to see Kelly and Fiona in their new house in Kenley. It was really nice. We also saw Kelly's new big bike. A killing machine and no mistake.<\/p><p>We then went over to Caterham to try and find a soft play place, but we couldn't find it. We then went home to drop the bikes off and went to another soft play place that was in Mummy's book. It was over in Knaphill. However it was about 10 square foot. It entertained her for about 5 minutes..... Mummy turn for a disaster.<\/p><p>We came home and had some nice play time.... then David and Louise came over. Louise is 7 weeks pregnant and we heard about their move to Australia.<\/p>","images":false},"title":{"value":"Disasters! Over to Fee and Kelly's and David and Louise visit"},"version":1},{"date":{"d":19,"m":9,"y":2004},"datev":20040919,"info":{"content":"<p>The usual routine on Sunday morning. Mummy and I to church in Alton with Ellie and the boys played football and lost. Daddy twisted his knee :(. Daddy and Michael went to pick someone up from the railway station. He was buying Michael's Cav. We had a lovely Sunday lunch at the Elder's. Mummy and I settled in for the night, whilst Daddy played Farfar at croquet in Woking.<\/p>","images":false},"title":{"value":"Football\/Church, Alton Lunch, Croquet"},"version":1},{"date":{"d":18,"m":9,"y":2004},"datev":20040918,"info":{"content":"<p>After enjoying the Farnborough Air Show, mummy treated us all to go to the Biggin Hill Air Show. Daddy was particularly looking forward to it, as it was supposed to be commemorating the Battle Of Britain. However, there were just 2 American WWII planes. No spitfires!! Boo hoo.<\/p><p>Anyway we enjoyed the scenic route to Biggin Hill, so close to London, yet so much lovely countryside. There was a fair and plenty of stalls and tents to amuse us. We saw Bleroit's plane which was the first to fly the channel.<\/p><p>We saw a F16, Some WWI replica planes which struggled against the wind, a formation flying display, like the red arrows, an army helicopter convoy, which looked impressive. But our favourite from Farnborough is still our favourite here.... The Harrier Jump Jet. Impressive how it can sit in the sky and go up and down at 90 degrees and even go backwards. Defo the best.<\/p><p>The weather was on the turn a bit and Katie was developing a cold, so we headed back home again.<\/p>","images":false},"title":{"value":"Biggin Hill Air Show"},"version":1},{"date":{"d":16,"m":9,"y":2004},"datev":20040916,"images":1,"info":{"content":"<img src='images\/years\/2004\/2004_09_16-Katie.jpg' class='diaryImage' alt='Grown up' \/><p class='diaryImageCaption'>Grown up<\/p>","images":false},"title":{"value":"Grown up"},"version":1},{"date":{"d":12,"m":9,"y":2004},"datev":20040912,"info":{"content":"<p>Daddy scored two goals on the opening day of the football season. He's top goalscorer in the league!! Me, mummy and Ellie came and watched.<\/p>","images":false},"title":{"value":"Casuals"},"version":1},{"date":{"d":11,"m":9,"y":2004},"datev":20040911,"info":{"content":"<p>We travelled down south in the morning to Bognor Regis. It was very windy and not all that warm. I enjoyed walking along the promenade and along the pier. I had a thing for eating the pebbles on the beech as well. We walked around the town and made our way back to the car.<\/p><p>Daddy had just bought a spare key for mummy's car. He unlocked the car OK with it, but couldn't get the car started. We were there for about 15 minutes trying, and opening the bonnet, until Mummy said to try the normal key. This worked. Phew!!<\/p><p>We moved onto Chichester, only 15 minutes away. We parked up and looked for a wedding present for Lindey. It was a really nice Market kind of town.<\/p><p>We shot off to Eashing for Lindey's afternoon celebrations at her and Rob's house. It was cool there as there were 4 or 5 other children there, and new toys to play with. The 'do' itself was very nice, with loads of marquee's in the garden and nice food. All the usual suspects were there. Grandma had a very interesting chat with Lindey's brother about what he got up to the night before. Grandma came back shaking. :)<\/p>","images":false},"title":{"value":"Bognor, Chichester, Lindey's Wedding"},"version":1},{"date":{"d":9,"m":9,"y":2004},"datev":20040909,"images":1,"info":{"content":"<p>Another glorious day. We set off early (goes without saying), and drove down to Portsmouth Harbour, caught the catamaran over to Ryde where we had an old underground train waiting for us. This took us to Shanklin, where we travelled on a Bus to Blackgang Chine, via a short stop in Ventnor.<\/p><img src='images\/years\/2004\/2004_09_09-02-IsleOfWight.JPG' class='diaryImage' alt='Ventnor coastline' \/><p class='diaryImageCaption'>Ventnor coastline<\/p><p>Blackgang Chine is brilliant for kids of about 4 to 6 years old. Lots of difference things to see. My favourite bit of course was the 'Pet Shop', where there were different animals on display. Mummy and daddy don't understand the love for animals, as they are not big pet fans. We spent quite a few hours in there moving along the windy paths going up and down the cliff.<\/p><p>We ventured back to Shanklin, and went into the Chine where t ere was a big waterfall and lots of overhanging tree's. It was very peaceful in there.<\/p><p>We then made our way home, getting fish and chips on the way. I enjoyed the train journey back to Ryde as I had a big audience to show off in front off. An exhausting day out.<\/p>","images":false},"title":{"value":"Trains, Cats and Automobiles - Isle Of Wight"},"version":1},{"date":{"d":8,"m":9,"y":2004},"datev":20040908,"info":{"content":"<p>Daddy got his haircut, then we went over to Basingstoke and went in the best pool for kids. There was a slide that I got up myself, and lots of animals to point at. It was nice a quiet as well.<\/p><p>In the afternoon, mummy went for her weekly medical appointment!!! leaving Daddy to take me to tumble tots class. You should have seen Daddy and Dan trying to put the car seat in Dan's car. I think I would have done it quicker! Tumble tots was OK. Lots for me to do there.<\/p>","images":false},"title":{"value":"Swimming, Tumble Tots"},"version":1},{"date":{"d":7,"m":9,"y":2004},"datev":20040907,"images":2,"info":{"content":"<woops rating=\"8\" woopstitle=\"The Carpet Needs Ironing\"><p>In the morning mummy decided to burn an iron mark into the living room carpet!!!! The carpet is ruined.<\/p><img src='images\/years\/2004\/2004_09_07-MummuysIroning-01-.JPG' class='diaryImage' alt='Mummy and her ironing!!' \/><p class='diaryImageCaption'>Mummy and her ironing!!<\/p><\/woops><p>Anyway in the morning Daddy went with Farfar to the Chertsey auctions. It was good there. So many lots up for auctions. All end of line or bankrupt stock goods. There was a big argument between one of the officials and an Albanian. Quite funny really. Mummy and I done the weekly food shop.<\/p><p>In the afternoon we went by train up to London and done lots of walking. The weather was really hot again, so it was nice. We started by going across the Thames, to Trafalgar Square, through to St James's park where we fed the ducks, talked to the geese and got close up to the pelicans. I kept saying \"duck, duck\" to all the birdies, and kept trying to go up to them all. I think I would spend all day there if mummy and daddy didn't keep moving me on! We saw Buckingham Palace, walked through Green Park, up to Piccadilly Circus where we stopped for some lunch. We then walked all the way back up to Hyde Park and went through the nice gardens, stopped off under the kissing tree, walked passed some more ducks in the serpentine until we eventually got to Princess Diana's memorial fountain. There wasn't actually a fountain there, but more of a looped toboggan run with streaming water. It was fun to put my feet in the cold water. Very refreshing. I had a bit of a run around in the grassy bit in the middle and played with another boy for a bit, before we caught a bus back to Charing Cross and walked back to Waterloo station. Then daddy decided to get lost, so mummy and I travelled alone back to Woking, leaving daddy searching around a packed, rush hour station for us. We eventually found each other back at Woking. We shot home and relaxed in the evening. We must have walked for 5 miles today!!<\/p><img src='images\/years\/2004\/2004_09_07-08-LondonParks.JPG' class='diaryImage' alt='Outside Buckingham Palace' \/><p class='diaryImageCaption'>Outside Buckingham Palace<\/p>","images":false},"title":{"value":"Auction and London Parks"},"version":1},{"date":{"d":6,"m":9,"y":2004},"datev":20040906,"images":1,"info":{"content":"<p>We went to Longleat Safari Park to see all the animals. We knew Katie would love it. We started by going around seeing giraffes and camels. Katie sat in the front with the grown up's, and said \"look\" to all the animals, as if she wanted to show us! We then went around to the monkeys where one clambered on to our car which was very exciting and hitched a lift. When the monkey decided to get off, he took half the windscreen wiper as well!!! We moved onto see lions and tigers. After the safari park bit we had a picnic looking at the big stately home, then went to look at pet world and have ago on the little train ride around the park. Daddy tried and failed on the big hedge maze. We also tried the mirror maze and the mining tour, where mummy ran out screaming because of a bat. Daddy got stung by a wasp as well! We finally went on the paddle tour boat and saw some sea lions getting fed which was wicked, as they got so close to us. We also saw some gorilla's and hippos. Mummy and Daddy have never seen me so happy.<\/p><p>I have got another 2 or maybe 3 teeth coming through.<\/p><img src='images\/years\/2004\/2004_09_06-15-LongleatSafariPark.JPG' class='diaryImage' alt='A Longleat Smile' \/><p class='diaryImageCaption'>A Longleat Smile<\/p>","images":false},"title":{"value":"Longleat Safari Park"},"version":1},{"date":{"d":5,"m":9,"y":2004},"datev":20040905,"images":3,"info":{"content":"<p>After church Mummy and I went over to watch Daddy play in his first game for Casuals this season. It was just a friendly, but it was a baking hot day to play football. I think Casuals lost 3-2, but it was a spirited performance.<\/p><p>In the afternoon we went over to Hollycombe Steam fair. There were lots of rides for me to go on. I went on the swinging chairs, the ghost house, gallopers, carousel, big wheel and the car roundabout. Farmor and Farfar joined us as well. We also went on the Steam Engine and went for a walk and said hello to the horses. A great afternoon out.<\/p><img src='images\/years\/2004\/2004_09_05-01-HollycombeSteam.JPG' class='diaryImage' alt='Hollycombe Steam Collection - Mummy' \/><p class='diaryImageCaption'>Hollycombe Steam Collection - Mummy<\/p><img src='images\/years\/2004\/2004_09_05-10-HollycombeSteam.JPG' class='diaryImage' alt='Hollycombe - In My Car' \/><p class='diaryImageCaption'>Hollycombe - In My Car<\/p><img src='images\/years\/2004\/2004_09_05-14-HollycombeSteam.JPG' class='diaryImage' alt='Hollycombe - On Train With Farfar' \/><p class='diaryImageCaption'>Hollycombe - On Train With Farfar<\/p><p>In the evening, Daddy finally managed to sell his car for 1450. Almost 3000 less than he paid for it, 30 months previous.<\/p>","images":false},"title":{"value":"Casuals and Hollycombe Steam Park"},"version":1},{"date":{"d":4,"m":9,"y":2004},"datev":20040904,"images":1,"info":{"content":"<p>In the morning we went to Chaley Heath near Ockham for a lovely walk in the woods. We eventually arrived at the Semaphore Tower and had some early lunch, as mummy and daddy were starving.<\/p><img src='images\/years\/2004\/2004_09_04-ChaileyHeathSemaphoreTower.JPG' class='diaryImage' alt='Chaley Heath Semaphore Tower' \/><p class='diaryImageCaption'>Chaley Heath Semaphore Tower<\/p><p>We went into the tower and m de some semaphore messages up, before going to the top and looking for miles around. We could see right into London one way and Guildford the other.<\/p><p>We then went over to Istead Rise, where Daddy left for a bit to go and watch Chertsey lose 5-1 to VCD Athletic over in Lords Wood. A disgraceful performance. The rest of us done a spot of shopping and relaxed.<\/p><p>We returned home and our footballing woes weren't over with as England drew 2-2 with Austria. Daddy hit the red wine!!<\/p>","images":false},"title":{"value":"Chaley Heath Semaphore Tower and Kent"},"version":1},{"date":{"d":2,"m":9,"y":2004},"datev":20040902,"info":{"content":"<p>It was 4 years ago Mummy and Daddy got married. They celebrated by going to an Italian Restaurant in Frimley. It was a really, really good evening. Mummy got a big bunch of roses and lilies, which pong! Mummy got tipsy for the second time this week!<\/p>","images":false},"title":{"value":"4th Wedding Anniversary"},"version":1},{"date":{"d":1,"m":9,"y":2004},"datev":20040901,"info":{"content":"<p>There were tears as Charlotte and Marina left Heathrow airport. Destination initially Singapore, then eventually on to New Zealand. Daddy worries for her safety, whilst Mummy will miss her a lot.<\/p>","images":false},"title":{"value":"Charlotte Off On World Travels"},"version":1},{"date":{"d":31,"m":8,"y":2004},"datev":20040831,"info":{"content":"<p>Mummy, Charlotte and Ellie went to Lindey's Hen Night over in Godalming. Daddy and Michael stayed and played XBox.<\/p>","images":false},"title":{"value":"Lindy's Hen Night"},"version":1},{"date":{"d":30,"m":8,"y":2004},"datev":20040830,"info":{"content":"<p>We woke to total mess after Charlotte and Marina's party. After tidying up for a bit, we went into Gravesend and had a walk along the river side. After lunch we went down to the duck pond in Southfleet and saw some koi carp in the shop.<\/p><p>We rushed back as Daddy was selling his car to someone, but they never turned up!!<\/p>","images":false},"title":{"value":"Duck Pond"},"version":1},{"date":{"d":29,"m":8,"y":2004},"datev":20040829,"info":{"content":"<p>Charlotte and Marina were about to slide off to New Zealand for several months, so it was decided we should have a party to celebrate. The party was at the Weston's abode. Daddy helped setup, whilst mummy and I went off to church. There were 60 people expected throughout the day. It started at midday.<\/p><p>It was manic as usual, and luckily the weather held out. There was a nice BBQ as well.<\/p><p>Daddy and I went to see the open air concert at the community centre field. There were some fun inflatable to play on. We felt sorry for the acts having to compete with the indifferent weather.<\/p><p>Come 6 o'clock all of Charlotte and Marina's friends began to arrive. Time for Mummy and Daddy to escape to the pictures to watch Bourne Supremacy at Bluewater, whilst myself, Grandma and Grandpop went to Marina's house to get out of the way. I was a pickle for Grandma!! Mummy and Daddy finished the night having some cocktails and a meal in TGI Friday's.<\/p>","images":false},"title":{"value":"Charlotte and Marina's Leaving Party"},"version":1},{"date":{"d":28,"m":8,"y":2004},"datev":20040828,"info":{"content":"<p>Mummy was working nights again. Daddy and I went over to Worplesdon to muck around in a soft play area. I think Daddy was enjoying it more than me on the assault course bits. We were there for a few hours, but I wasn't in the best of moods.<\/p><p>We popped over to see Farfar briefly and had some lunch.<\/p><p>In the evening we went around Karen and Richards to celebrate Rachel's 26th birthday.<\/p>","images":false},"title":{"value":"Soft Play, Karen and Rich's"},"version":1},{"date":{"d":22,"m":8,"y":2004},"datev":20040822,"info":{"content":"<p>In the morning Mummy and I went to church leaving Daddy to do jobs.<\/p><p>It was Farfar's 58th birthday. We went round to have a sausage and mash lunch, before venturing over to Bocketts Farm near Leatherhead. It was a wicked place. There was pig racing and lots of play areas for children like me. We also saw some horses, donkeys, chicken, peacocks, rabbits, etc, etc. I loved it there.<\/p><p>In the evening we watched Paula Radcliffe crash out of the Olympics women’s' marathon. She was so distraught.<\/p>","images":false},"title":{"value":"Farfar's Birthday"},"version":1},{"date":{"d":21,"m":8,"y":2004},"datev":20040821,"images":1,"info":{"content":"<p>We went over towards Godalming and went to Winkworth Arboretum which was a National Trust place. We had a nice walk around for a few hours.<\/p><img src='images\/years\/2004\/2004_08_21-27-WinkworthArboritum.JPG' class='diaryImage' alt='At Winkworth Arboretum' \/><p class='diaryImageCaption'>At Winkworth Arboretum<\/p><p>Afterwards we popped into Godalming itself. The first time daddy has been there.<\/p><p>In the afternoon we went to see Karen and Richard's new place. It was a nice house in Church Crookham. Mummy and Daddy loved it. They had only just moved in so there was no furniture. Lovely and spacious.<\/p>","images":false},"title":{"value":"Winkworth Arboretum, Karen and Rich's new house"},"version":1},{"date":{"d":15,"m":8,"y":2004},"datev":20040815,"info":{"content":"<p>Mummy was working again this weekend, which meant it was just me and Daddy to challenge the world today. We went early to the Arena to Creepy Crawlies. It was 'soft play', which meant lots of objects that you could crash into. There was a ball pool and a bouncy castle assault course. I think I was a bit young for all of that. The other kids there were a bit older. I was quite content walking around, nosing into other people’s business and watching the other children play. I did a lot of running around and kicked one of the balls around. Daddy was very pleased with me.<\/p><p>We then went over to watch Casuals train. There were only 5 players that turned up again. We went to play in the playground. So much playing today. Great. We had to do the shopping this week, so Daddy took us to the Meadows and spent 2 hours there!!! I ate lots of grapes!<\/p><p>We got home for a late lunch and some playing. Mummy then played with me whilst Daddy went out with his friends to watch the football down the pub.<\/p>","images":false},"title":{"value":"Soft Play, Training and Shopping"},"version":1},{"date":{"d":14,"m":8,"y":2004},"datev":20040814,"info":{"content":"<p>We went to over to Runnymede to go on a nice paddle boat trip up and down the Thames. We had a small picnic first. There was plenty to nose at on the boat.<\/p><p>In the afternoon we went to watch Chertsey play in their first league game of the season. They won 4-3 in a thrilling and competitive match.<\/p>","images":false},"title":{"value":"Runnymede Boat Trip - Chertsey"},"version":1},{"date":{"d":10,"m":8,"y":2004},"datev":20040810,"images":3,"info":{"content":"<img src='images\/years\/2004\/2004_08_10-01a-Katie.JPG' class='diaryImage' alt='Chill'in man' \/><p class='diaryImageCaption'>Chill'in man<\/p><img src='images\/years\/2004\/2004_08_10-05a-Katie.jpg' class='diaryImage' alt='At Home' \/><p class='diaryImageCaption'>At Home<\/p><img src='images\/years\/2004\/2004_08_10-07a-Katie.jpg' class='diaryImage' alt='Chill'in man' \/><p class='diaryImageCaption'>Chill'in man<\/p>","images":false},"title":{"value":"Some pics at home"},"version":1},{"date":{"d":8,"m":8,"y":2004},"datev":20040808,"images":1,"info":{"content":"<p>After church, Daddy drove us on this hot, muggy day down to Shoreham By Sea. The plan was to ride along the 6 mile seafront to Brighton. However, nothing is ever that straight forward. We started off, and spent ages riding and we were not seeing much of the sea. Instead there is a large industrial estate. We hit the promenade at Hove, where we stopped for some lunch and a nice play in the paddling pool and playground. We continued on to Brighton which was really busy with loads of people on the beach. We parked our bikes and we all walked around a few shops. It took a while because I wanted to explore every single shop and interesting thing en-route. We eventually caught the train back to Shoreham and returned back home exhausted.<\/p><img src='images\/years\/2004\/2004_08_08-09a-Brighton.jpg' class='diaryImage' alt='The promenade at Hove' \/><p class='diaryImageCaption'>The promenade at Hove<\/p>","images":false},"title":{"value":"Brighton Bike Ride"},"version":1},{"date":{"d":7,"m":8,"y":2004},"datev":20040807,"images":1,"info":{"content":"<p>Grandma has spent the last few days here, visiting me mainly! Anyway, us girls went shopping in the morning into Camberley.<\/p><p>After Grandma left us, we went over to Frensham Little Pond where we paddled, then on to Tilford and splashed about in the river by the bridge. It was a really hot day, and it was packed with people.<\/p><img src='images\/years\/2004\/2004_08_07-02a-Tilford.jpg' class='diaryImage' alt='Playing at the river in Tilford' \/><p class='diaryImageCaption'>Playing at the river in Tilford<\/p>","images":false},"title":{"value":"Tilford"},"version":1},{"date":{"d":1,"m":8,"y":2004},"datev":20040801,"info":{"content":"<p>Mummy got home from her night shift. Daddy and I went for a long walk over to the woods and picked some nice flowers for Mummy. I then went to church which was OK. Daddy couldn't leave Casuals alone, and we had to go over and watch the boys train. It did mean I could go on a new playground. Shock, horror, Daddy took me for the weekly food shop in the big Tesco's. It went surprisingly well. Dad prized me with grapes and kept blowing in my face which was funny. After a very late lunch we played in the paddling pool in the back garden which was great fun. I managed to soak Daddy, no problem. It was such a hot day, so the pool was the best place to be. Mummy and I took Mrs Oddie to go see her son as well.<\/p><p>It will be nice to spend a day with both Mummy and Daddy. It hasn't actually happened very often recently.<\/p>","images":false},"title":{"value":"Church, Footie Training"},"version":1},{"date":{"d":31,"m":7,"y":2004},"datev":20040731,"info":{"content":"<p>Mummy was working nights all weekend, which meant Daddy and I had to get out of the house to let her sleep. As it was such a nice sunny day Daddy and I decided to go off cycling. We drove to Ash and rode up and over the Hogs Back and eventually picked up the North Downs trail. I fell asleep on the back of the bike as, Daddy was working hard getting up all of the big hills. We must have cycled for an hour and a half before reaching Guildford. We saw some nice butterflies and flowers on the way which I always like to point out. I marvelled everyone with my smile and walking capabilities up Guildford high street. We got some milk and strawberries and sat by the river, under a tree and we got fed and watered. We caught the train back to Ash and quickly drove home.<\/p><p>It was my friend's, Henry's birthday today. We went around to his house to celebrate. He's got some cool toys. I particularly liked the 'water table' which Oliver and I played with. Also I managed to let myself go on the slide. I'm so brave. I've decided I really don't care for the swings anymore. Old hat I finks! It was boiling, and maybe I got a bit of heat stroke, as when we left I was sick! Unlucky for Daddy. We dropped off Mummy for another little sleep - Daddy and I returned back to Camberley and went swimming.<\/p><p>I tested out my lungs in the changing rooms. Daddy gave up trying to put my swimming costume on, but we had fun in the swimming pool. My favourites are when I dunk daddy's head under the water, and he comes up and surprises me. I also like splashing around and noseying at the other children in the pool. For those who weren't around for my first performance, I managed to make an even louder noise in the changing rooms on the way out. Daddy and I were only half dressed when we left!<\/p>","images":false},"title":{"value":"North Downs ride, Henry Birthday, Swimming"},"version":1},{"date":{"d":28,"m":7,"y":2004},"datev":20040728,"info":{"content":"<p>Uncle Michael came to pick us up from Portsmouth and took us home.<\/p><p>Oldemor was also returning back to Copenhagen. She has been over here for just over a month. It is sad to see her go back. The Far's went back with her also for their summer holiday.<\/p>","images":false},"title":{"value":"Back from Holiday, Oldemor returns home"},"version":1},{"date":{"d":25,"m":7,"y":2004},"datev":20040725,"info":{"content":"<p>Karen very kindly managed to get us some free tickets to get in to the air show this year. We started off early, because we all know how busy it gets. We drove over to Zebon Copse to collect our friends. The weather again was good. We parked up inside the airfield and made our way straight to the parachute jump area. Daddy, Karen and Richard all had a go. You climb this scaffold tower, which is 100 foot in the air, and just jump off! Very good.<\/p><p>Next Daddy tried some glass painting with me, but I didn't really grasp what was going on. Still Daddy finished it off. We looked around a couple of stands before the air show began. Karen made this really nice picnic for us all, which we were able to eat at her company's box. Some of the airplanes were really loud, my face was a picture of scared confusion when they became really loud. I didn't cry though. I pointed out the helicopters and stuff. I was more interested in walking around the box area and going up to people. Mummy liked the Hornet the most, Daddy loved the Spitfire and F16. We continued to walk around to see the planes on the ground for a bit before it was time for us to leave.<\/p><p>Daddy drove us, via Ellie's, to Portsmouth where we caught a hovercraft over to the Isle of Wight to start our 3 day holiday. Daddy unfortunately had to go and work.<\/p>","images":false},"title":{"value":"Farnborough Air Show and Going On Holiday"},"version":1},{"date":{"d":24,"m":7,"y":2004},"datev":20040724,"images":17,"info":{"content":"<p>Mummy made us get up at 6:30am so I could open my presents downstairs in the front room. Grandma, Grandpop and Auntie Charlotte where there to see me open them. I got so many nice cards and presents.<\/p><p>Our visitors left to go on holiday. Mummy and Daddy had lots to do to prepare for my party. We had 25 people expected to come for my birthday party. Lucky the weather was good so everyone could go in the back garden. Lorraine and Joshua came across from next door to help us out.<\/p><p>Guest started arriving at midday. Daddy was doing the BBQ, although almost blew everyone up, when he forgot to tighten the gas pipe properly. The gas pipe caught light! Fortunately he switched the gas before the gas cylinder blew up. Me and my friends had so many new toys to play with. Everyone was so generous.<\/p><p>Later we played pass the parcel and musical chairs. Great Grandma won both! Then daddy brought the birthday cake out and everyone sang happy birthday. Although the ladybird cake looked very professional, unfortunately it wasn't very edible. We continued till 3 o'clock-ish. There was lots of clearing up to do.<\/p><p>We then went off to Gillingham to go to Uncle Nigel's 50th birthday celebration. On the way we stopped off at Buckmore Park to watch David Hump race for 10 minutes. Mummy and Daddy could finally relax which was nice. It was good to catch up with everyone again. I managed to play with some boys and their cars, which was sweet. The BBQ put ours to shame. It was superb. It was the first time I met William. He's a funny man, with his stories. We saw pictures from Fee and Kelly's honeymoon in the Maldives, and it looked like paradise. Clear water and a small island. The hooligan that was caught in the Euro championships and who was on front of all the national papers was also there! Daddy was joking and stirring up trouble, without knowing that we were sat next to his family!! Still lucky Daddy is so discrete.<\/p><p>We left at about 9:30 so I could get to bed. We had another busy day planned for tomorrow.<\/p><img src='images\/years\/2004\/2004_07_22-02-KatieBirthdayCake.JPG' class='diaryImage' alt='Birthday Cake' \/><p class='diaryImageCaption'>Birthday Cake<\/p><img src='images\/years\/2004\/2004_07_24-01-KatieBirthday.jpg' class='diaryImage' alt='Opening cards in the morning' \/><p class='diaryImageCaption'>Opening cards in the morning<\/p><img src='images\/years\/2004\/2004_07_24-05-KatieBirthday.jpg' class='diaryImage' alt='Playing on my new keyboard' \/><p class='diaryImageCaption'>Playing on my new keyboard<\/p><img src='images\/years\/2004\/2004_07_24-06-KatieBirthday.jpg' class='diaryImage' alt='Reading my new book' \/><p class='diaryImageCaption'>Reading my new book<\/p><img src='images\/years\/2004\/2004_07_24-07-KatieBirthday.jpg' class='diaryImage' alt='The back garden. What a mess.' \/><p class='diaryImageCaption'>The back garden. What a mess.<\/p><img src='images\/years\/2004\/2004_07_24-08-KatieBirthday.jpg' class='diaryImage' alt='Some riffraff' \/><p class='diaryImageCaption'>Some riffraff<\/p><img src='images\/years\/2004\/2004_07_24-09-KatieBirthday.jpg' class='diaryImage' alt='The Gays playing with me' \/><p class='diaryImageCaption'>The Gays playing with me<\/p><img src='images\/years\/2004\/2004_07_24-12-KatieBirthday.jpg' class='diaryImage' alt='Great Grandma and Grand ad' \/><p class='diaryImageCaption'>Great Grandma and Grand ad<\/p><img src='images\/years\/2004\/2004_07_24-14-KatieBirthday.jpg' class='diaryImage' alt='Pass the parcel' \/><p class='diaryImageCaption'>Pass the parcel<\/p><img src='images\/years\/2004\/2004_07_24-16-KatieBirthday.jpg' class='diaryImage' alt='Opening more presents!' \/><p class='diaryImageCaption'>Opening more presents!<\/p><img src='images\/years\/2004\/2004_07_24-23-KatieBirthday.jpg' class='diaryImage' alt='Ellie, Great Grandma, Uncle John Garrett, Great Grand ad, Vicky' \/><p class='diaryImageCaption'>Ellie, Great Grandma, Uncle John Garrett, Great Grand ad, Vicky<\/p><img src='images\/years\/2004\/2004_07_24-24-KatieBirthday.jpg' class='diaryImage' alt='Andy and Oliver' \/><p class='diaryImageCaption'>Andy and Oliver<\/p><img src='images\/years\/2004\/2004_07_24-25-KatieBirthday.jpg' class='diaryImage' alt='Henry with mum Caroline' \/><p class='diaryImageCaption'>Henry with mum Caroline<\/p><img src='images\/years\/2004\/2004_07_24-28-KatieBirthday.jpg' class='diaryImage' alt='The maestro cooking on heat' \/><p class='diaryImageCaption'>The maestro cooking on heat<\/p><img src='images\/years\/2004\/2004_07_24-29-KatieBirthday.jpg' class='diaryImage' alt='Party in Back Garden' \/><p class='diaryImageCaption'>Party in Back Garden<\/p><img src='images\/years\/2004\/2004_07_24-30-KatieBirthday.jpg' class='diaryImage' alt='Katie's friend Oliver' \/><p class='diaryImageCaption'>Katie's friend Oliver<\/p><img src='images\/years\/2004\/2004_07_24-38-KatieBirthday.jpg' class='diaryImage' alt='On new swing' \/><p class='diaryImageCaption'>On new swing<\/p>","images":false},"title":{"value":"My First Birthday and Nigel's 50th"},"version":1},{"date":{"d":23,"m":7,"y":2004},"datev":20040723,"info":{"content":"<p>Mummy had to go to the hospital, so while we were waiting Daddy and I went for a bike ride into Farnham, had some lunch in a nice garden, then biked up those hills again. I wasn't a happy camper. I was so tired. I even fell asleep on the bumpy ride back to the hospital. We got back and mummy was OK to leave for home.<\/p><p>In the evening Grandma, Grandpop and Auntie Charlotte came to stay the night, but they arrived too late for me to see.<\/p>","images":false},"title":{"value":"Farnham"},"version":1},{"date":{"d":18,"m":7,"y":2004},"datev":20040718,"info":{"content":"<p>We went to church as usual. In the afternoon we slept as mummy had done a night shift. Daddy went over for a family meal at the Far's, which Susan and Graham also graced us with their presence. They had lovely roast lamb and chicken. Daddy's favourites. Mummy and I woke up and came round for desserts. Afterwards, we strolled up to Borrowhill school for their fete and I showed off, how much walking I could do. :)<\/p><p>In the evening Steven popped around to give Daddy a birthday present.<\/p>","images":false},"title":{"value":"Gay Family Lunch"},"version":1},{"date":{"d":17,"m":7,"y":2004},"datev":20040717,"info":{"content":"<p>A busy day today, largely spent without Daddy. Mummy and I went to the Elder household for the day. Ellie told us that she was 12 weeks pregnant! :) What great news for Auntie Ellie and Uncle Michael. That means I will have a cousin, and a new play mate. Child of Elder can be taught some tricks of mine!<\/p><p>Myself, well I am getting into this walking. It's easy. I can now walk the length of the living room unaided, and walking is my new thing I'm into. Don't want to play so much. I just want to walk places. Of course I have a few falls. But no bad scrapes just yet.<\/p><p>While we were at the Elder's, Daddy was with the Far's at a Tank Driving experience in the morning. Farmor drove a Chieftan, an Abbot, a armoured personnel carrier and a quad bike that was very powerful. Farmor enjoyed driving all of them except the quad bikes, which were a bit too powerful for her. She carried 20 people as passengers on the Chieftan. Daddy and Farfar were allowed to be passengers on a couple of tanks, but were there to support Farmor during the morning.<\/p><p>Daddy then went to meet up with Michael, to go windsurfing down at Hayling Island. The conditions weren't great. But Daddy is getting frustrated that he can't do it that easily. I'm sure with a bit more practice he'll get it.<\/p><p>We were joined at the Elders, by the Weston's and Howard's. After our nice meal, mummy had to do a night shift in the evening, whilst the boys went on the 'Real Ale Steam Train' that runs from Alton to Alresford (Bluebell Railway). There were quite a few strange looking people on the strange. Strangely enough a cross between real ale drinkers: half bald, half long hair, beer bellied, middle aged men, and train spotters: grey haired, middle aged men. Anyway tried 4 or 5 beers out. The best being Trotten beer.<\/p>","images":false},"title":{"value":"Tank Driving - Windsurfing - RAT Train - Elder Announcement"},"version":1},{"date":{"d":11,"m":7,"y":2004},"datev":20040711,"first":{"name":"katie","value":"First Steps Unaided"},"info":{"content":"<p>In the morning I went with Mum to watch her run 3 miles at Blackheath for charity. We had a picnic with Grandpop and Grandma afterwards.<\/p><p>Mummy then went to bed to prepare for her night shift tonight. Daddy and I went round to the Fars. We all then went down to see the Frimley Carnival. It was bigger than ever. I had a go on the mini steam train with Daddy and Farmor, which I absolutely loved. I bounced on Farmor's knee all of the way. We watched the kids football and ate most of Daddy's Ice Cream.<\/p><p>In the evening I managed to walk 3 steps without any help for the first time. From the middle of the front room to the big sofa. I'm so clever. :)<\/p>","images":false},"title":{"value":"Run and Frimley Green Carnival"},"version":1},{"date":{"d":10,"m":7,"y":2004},"datev":20040710,"info":{"content":"<p>Laura had done a night so came in about 8am. We got ready and went round to the Fars for a birthday breakfast and to open presents and cards. Daddy got a spirit level from Mummy. Great! Anyway we proceeded on our mystery tour. So mysterious, mummy took us all over the place, she didn't even seem to know where we were going.<\/p><p>We eventually ended up at the Cotswold's Wildlife Park. We waited for a heavy shower to pass before getting out to see all the animals, which I loved. We saw tortoises, zebras, rhino's (which I was very interested in), leopards, an ostrich, some cheeky monkeys, pigs, goats, ducks, snakes, bats (which I wasn't sure about) and penguins.<\/p><p>We had a really nice time, and were all tired afterwards. So much so that we had a sleep when we got home. Mummy made a special Indian meal. At about 8pm me and mummy went to sleep.<\/p>","images":false},"title":{"value":"Daddy's 29th Birthday - Cotswold's Wildlife Park"},"version":1},{"date":{"d":8,"m":7,"y":2004},"datev":20040708,"info":{"content":"<p>Susan and Graham came over for Chinese and an Indian carefully prepared by Daddy!! We played Trivial pursuit and Uncle Graham won, and the girls came last. :( When I get older I make sure I'm cleverer than Mummy, so I'll have half a chance of winning.<\/p>","images":false},"title":{"value":"Susan and Graham over"},"version":1},{"date":{"d":3,"m":7,"y":2004},"datev":20040703,"info":{"content":"<p>We went with Farmor, Farfar and Oldemor to Finkley Down Farm near Andover. Another farm to add to Katie's list. There were plenty of animals to see. We held a rabbit. I liked getting reasonable close to the animals, but I didn't like to touch them, or them touching me. I loved the chickens as they made such cool noises, which I tried to imitate.<\/p><p>After our lovely picnic, we went to see the donkey's, horses, pigs and cows. We had a cup of tea in the tea shop before returning home.<\/p><p>In the evening Daddy, cycled to Nicks, then walked to the Tumbledown Dick in Farnborough with Nick and Martin, stopping off for a swift drink at the Prince of Wales on the way. He met Phil there and they saw an Iron Maiden tribute band. All black t-shirts and long hair. A sight not seen the 90s. Phil lost his pint of beer when he put it on the speaker and the base, bounced it off. A cracking night.<\/p>","images":false},"title":{"value":"Finkley Down Farm and Iron Maiden Tribute Band"},"version":1},{"date":{"d":27,"m":6,"y":2004},"datev":20040627,"info":{"content":"<p>We went over to the Weston's for a lovely Sunday lunch. Also Mum and Dad came round to watch Denmark lose to the Czech Republic in the Euro 2004 championships. :(<\/p>","images":false},"title":{"value":"Over to the Weston's"},"version":1},{"date":{"d":26,"m":6,"y":2004},"datev":20040626,"first":{"value":null},"info":{"content":"<p>Susan came round in the morning to drop off a present for Mummy. It was Trivial Pursuit, which was great as we have been wanting that for a long time. Fiona and Kelly popped over for a cup of tea to catch up which was nice.<\/p><p>The weather wasn't good but we went over to see the Royal Logistics Core show across the road. I absolutely loved the swings on a roundabout. After a bit of shopping we went to Peter and Andrea's birthday bash at the Basingstoke Canal.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/N0gHoD3wsvM\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Peter and Andrea's Birthday"},"version":2},{"date":{"d":25,"m":6,"y":2004},"datev":20040625,"first":{"name":"katie","value":"Ride On A Bike"},"images":3,"info":{"content":"<p>This year Mummy got a brand new mountain bike, helmets, bike rack and bike child seat. This means we can go on nice family bike rides. However, mummy doesn't do hills, so we are having to pick routes that are flat. What better than canals. Our mission is to do the whole of the grand union canal, so today we started at Brentford and rode up to Bulls Bridge in Hayes.<\/p><img src='images\/years\/2004\/2004_06_25-01-LauBDay-GrandUnionCanal.JPG' class='diaryImage' alt='Grand Union Canal ride' \/><p class='diaryImageCaption'>Grand Union Canal ride<\/p><img src='images\/years\/2004\/2004_06_25-04-LauBDay-GrandUnionCanal.JPG' class='diaryImage' alt='Grand Union Canal ride' \/><p class='diaryImageCaption'>Grand Union Canal ride<\/p><img src='images\/years\/2004\/2004_06_25-05-LauBDay-GrandUnionCanal.JPG' class='diaryImage' alt='Grand Union Canal ride' \/><p class='diaryImageCaption'>Grand Union Canal ride<\/p>","images":false},"title":{"value":"Laura's 28th Birthday - Grand Union Canal"},"version":1},{"date":{"d":23,"m":6,"y":2004},"datev":20040623,"info":{"content":"<p>We caught the train to Roskilde and walked through the town, getting Daddy a Denmark football top (from Ellie and Michael as a birthday present), towards the Viking boat museum. They were reconstructing a long ship from scratch using just using materials and tools that they would have used. Daddy could have spent a lot longer there, but we had to return and get ready to fly home. Daddy went to Oldemor's to help her get to the airport, whilst us lot went back to pack.<\/p><p>The flight home was OK, if delayed, and the Fars came to collect us. Daddy looked after Oldemor through the airport. He saved his legs by going on the 'buggy'.<\/p><p>Overall a good holiday, but I think we tired the Elder's out by trying to fit too much in.<\/p>","images":false},"title":{"value":"Denmark Holiday - Roskilde, travelling Home"},"version":1},{"date":{"d":22,"m":6,"y":2004},"datev":20040622,"info":{"content":"<p>We went to Carlsberg today and walked around the museum. We each had a voucher to sample of couple of the beers. Mmmm. Daddy and Michael could have stayed there all day. It was very good because it was all free.<\/p><p>In the afternoon we went to the zoo whilst Ellie and Michael went for a walk in Fredericksberg Havn. I loved the zoo. So many animals to see and wave to. But favourite was the fish again.<\/p><p>We bussed it to the swimming baths on Godhabsvej and went for a swim. The others thought it was a bit strict and cold. Daddy liked it as it was the place he went to when he was a child.<\/p><p>The boys stopped off at Radhuseplassen and took one of the free bikes and circled around the city centre for a while. Us girls went back to the flat. Lise came around to watch the Denmark V Sweden game and played card games. Jørgen met up with the boys and watched the game in Radhuseplassen along with 5,000 other Danes on a big screen TV. The atmosphere was great. Very patriotic and friendly. Denmark got a good result which meant they proceeded into the knock out stages. The boys celebrated in an Irish bar until the early hours of the morning.<\/p>","images":false},"title":{"value":"Denmark Holiday - Carlsberg, Zoo, Swimming, Radhuseplassen"},"version":1},{"date":{"d":21,"m":6,"y":2004},"datev":20040621,"info":{"content":"<p>Mummy, Daddy and I let Ellie and Michael have a lie in today so we went down to the beach bit close to the flat. We saw jelly fish in the clean water. We could see Sweden and the bridge that crosses the waters. We got the pastries and came back to wake the other 2 up.<\/p><p>We caught the bus, metro and train to Charlottelund, and walked through the park to get to the Aquarium. I love to see all the fish, although I was a bit scared of the bigger fish, especially the sharks!! Even though I banged on the fish tanks none of the fish seemed to want to speak to me.<\/p><p>We got a bus to Klampenborg and walked to Bakken, which is like an old fashioned theme park in the middle of the woods. A bit more basic than Tivoli, but equally as enjoyable. Daddy and Michael spent a long time in the Fun House. Kids!! Also they went on with mummy onto the old wooden roller coaster. Daddy also beat Michael at the football game. Well done Dad.<\/p><p>We relaxed on the beach for a while before returning home. We later went over to Lise and Jørgen summer house for traditional Danish smorbrød. Mormor was there to. We had frikadeller, herrings, shrimps and egg sandwiches. They were scrummy.<\/p><p>Afterwards we all went up to the Flat to watch England win against the Swiss<\/p>","images":false},"title":{"value":"Denmark Holiday - Aquarium, Bakken, Smorbrød"},"version":1},{"date":{"d":20,"m":6,"y":2004},"datev":20040620,"info":{"content":"<p>The weather started a little better today. After our Danish pastry breakfast, we ventured into the city centre again and met up with Lise and Jørgen. The ladies went to church, whilst me and the boys had a walk up Langelinie and had a relaxing beer by the water front.<\/p><p>We then all went to see the little mermaid and had our picture taken there. We said goodbye to Lise and Jørgen and continued along the water’s edge to the Palace and eventually Holmen's Church, where we caught a canal boat tour. The heavens opened and the wind was gusting. Michael spent most of the time under an umbrella trying to sleep. It wasn't pleasant at all and we all couldn't wait to get off. We headed for some food.<\/p><p>The weather improved and we made our way over to Christiana, the hippy town. It is a really weird place... especially to live there. A shanty town for the liberal minded.<\/p><p>After our little walk, we headed to Tivoli. Woo hoo. It was nice as ever. It was still light so we didn't actually see any of the light on, but it still feels a magical place. We had a few goes on some rides, including a really good roller coaster. Daddy went on the ride that drops you 150ft from the sky. He's a brave man. We headed home warily and quite happy for a rest.<\/p>","images":false},"title":{"value":"Denmark Holiday - Church, Little Mermaid, Canal Ride and Tivoli"},"version":1},{"date":{"d":19,"m":6,"y":2004},"datev":20040619,"info":{"content":"<p>We woke and got some morn brød from the baker and took the lot round the Lise and Jørgen summer house and had a traditional Danish breakfast. It was scrummy.<\/p><p>We then ventured into Radhuseplassen and started to walk up Strøget. The weather was terrible, windy and rainy. We popped into a few of the shops but I don't think Ellie and Michael were too impressed with the prices. C'est trop cher. We had a pølser from the pølservogn, which was tasty, then climbed up the Round Tower to see the views of Copenhagen.<\/p><p>Our tour continued towards Kongs Nytorg and Nyhavn, before catching a bus out from the centre to Pedersen's Famille Havn for a meal with Lise, Jørgen and Oldemor. We all chose the same dish, which was a sausage and bacon casserole. It was nice to see Mormor again. She was happy to see Katie and of course us lot.<\/p><p>We returned home, I went to bed, and everyone else relaxed watching the Euro championships<\/p>","images":false},"title":{"value":"Denmark Holiday - Copenhagen Tour"},"version":1},{"date":{"d":18,"m":6,"y":2004},"datev":20040618,"first":{"name":"katie","value":"Flying on a aeroplane"},"info":{"content":"<p>We went to Copenhagen with Ellie and Michael this time around and stayed at Lise and Jørgen's flat. Their first time to Denmark and mine! Daddy, Ellie and Michael all had to go to work during the day. It was going to be a bit of a rush to Gatwick. The Fars took us by car. After an initial scare that Ellie had her passport in a different name to the one on her tickets, we got on the plane. It was early evening which meant it was time for my bottle. As soon as I had that I settled down on the plane. I don't know what the fuss is about otherwise, plane flying is easy-peasy. The flight took an hour and forty minutes. It was a cloudy day, so we couldn't see much other than when we took off (over towards Maidstone) and when we landed.<\/p><p>We landed fine, and proceeded to make our way using the 2A bus to Postparken. Trouble was Mummy and Daddy couldn't remember where Lise and Jørgen lived. After a few circuits, we eventually were warmly greeted by our Danish friends. We had a good night's sleep<\/p>","images":false},"title":{"value":"Denmark Holiday - travelling"},"version":1},{"date":{"d":13,"m":6,"y":2004},"datev":20040613,"images":1,"info":{"content":"<p>In the morning we went over to the Fars to visit them for half an hour. Mummy and I went to church whilst daddy stayed at the Fars.<\/p><p>The BBQ party started in the afternoon. The girls stayed in the back garden sunning themselves, whilst 9 boys went to play gold at Windlemere. It was carnage on the golf course. Dawg almost got hit 2 or 3 times. Barrie was constantly in the bushes and swearing. He even swore at some innocent bystanders, thinking Daddy was there!! Anyway after a bit of help from daddy's cheat book he came second in the group. Mr Aves won it overall. After a spectacular entrance to the car park, and equally good handbrake turnout was ensured. 9 holes + a beer was completed in just over 3 hours! We got back to the abode, and started the BBQ - Mr Rowe got the first burger!!! Anyway just about finished in time for the football. What a game. England were 1-0 up until the 90 minute, when France managed to get two very late goals. It kind of killed the party a bit. Everyone was gutted.<\/p><img src='images\/years\/2004\/2004_06_13-03-EnglandFranceBBQ.jpg' class='diaryImage' alt='Watching England V France (Euro 2004)' \/><p class='diaryImageCaption'>Watching England V France (Euro 2004)<\/p>","images":false},"title":{"value":"England V France BBQ"},"version":1},{"date":{"d":12,"m":6,"y":2004},"datev":20040612,"images":1,"info":{"content":"<p>In the morning we went over to Clare Park, Farnham for Laura's hospital appointment. She was a lot happier when she came out. We then took a country drive through Crondall and Bentley which was very picturesque, and headed for Alice Holt Park. We went for a nice walk in there. We explored one of the walks and didn't go for all the fun, play stuff. Somewhere to come back to definitely.<\/p><img src='images\/years\/2004\/2004_06_12-10-AliceHolt.jpg' class='diaryImage' alt='Alice Holt Country Park' \/><p class='diaryImageCaption'>Alice Holt Country Park<\/p><p>The afternoon was spent preparing for the big BBQ tomorrow. Shopping, cleaning, getting stuff ready.<\/p><p>In the evening Karen and Richard came round to baby sit. They however, were supposed to be a hosting a night for their friends Justin and Lauren. So they done it our house. Anyway I kept walking up, so ended up sleeping in Karen's arms. Mummy and Daddy went off to watch the Harry Potter, Prisoner of Kaza... something or other film. Daddy loved it, mummy wasn't so sure.<\/p>","images":false},"title":{"value":"Alice Holt and Guildford"},"version":1},{"date":{"d":11,"m":6,"y":2004},"datev":20040611,"info":{"content":"<p>Charlotte looked after me today as Mummy was school nursing. In the evening mummy and daddy went out with Karen and Richard to the Guerka Cross, Nepalese restaurant in Fleet. It was quite strange as the village that Karen stayed in was close to the one that a couple of the Guerka's had grown up. They even knew the same people. Daddy would love to go there one day when I am older perhaps. The food was lovely, almost like an Indian really. Charlotte, Ellie and Michael baby sat f r me in the evening.<\/p>","images":false},"title":{"value":"Charlotte look after and Guerka Cross"},"version":1},{"date":{"d":6,"m":6,"y":2004},"datev":20040606,"info":{"content":"<p>Woke at 5:30am. All 3 of us went for a long walk behind the barracks. We found a secret road, that had no traffic. Not one car passed. Not on the map. It was deep in the woods going between one area of the barracks to another. It was a lovely hot day, and I managed to get a bit of sleep.<\/p><p>Daddy cleaned the cars inside and out, and mowed the lawns before we went to St Andrew's, Frimley Green to see Oliver's christening. We went back to Oliver's house for a celebration buffet and drink before collapsing back at home.<\/p>","images":false},"title":{"value":"Oliver's Christening"},"version":1},{"date":{"d":5,"m":6,"y":2004},"datev":20040605,"info":{"content":"<p>Daddy went up to Nicks house on the Friday night with Martin. They went for a few jars down the local pub. It was full of weird, young, country bumpkins. Nick really does fit in well in his new surroundings.<\/p><p>On Saturday, Daddy got a lie in. We took the customary long route to the NEC (mentioning no names, but Nick and Martin were the navigators). We eventually arrived, and boy did we do some laps. There was lots there to interest us, including the cars. Best stand was Subaru!! Nice to see the new Rolls Royce, and there were a couple of nice Seat's. The Ford stand had a massive Thunderbird show, which meant no one was looking at the cars. Anyway Nick has learnt a couple of things from the day. 1 - Buy a digital camera, 2 - Go to the Max Power show. Need we say more.<\/p><p>They stayed for about 5 hours. In the afternoon we sleepily, cruised down to Banbury to watch the England V Iceland game. We won 6-1. Dropped Nick off and went home.<\/p><p>Mummy and I went to Grandma and Grandpop's to stay the night. We went out with Grandpop shopping in the morning before returning to Surrey to take Mrs Oddie out<\/p>","images":false},"title":{"value":"Nicks and Motor Show"},"version":1},{"date":{"d":3,"m":6,"y":2004},"datev":20040603,"info":{"content":"<p>Grandma came to stay over for a couple of days. We done lots of fun things including going to the tri-lakes farm. There were lots of animals, which I love. We also went to visit some family. Daddy didn't come because he had to work. :(<\/p>","images":false},"title":{"value":"Tri Lakes"},"version":1},{"date":{"d":31,"m":5,"y":2004},"datev":20040531,"images":3,"info":{"content":"<p>We done some jobs in the morning, but then we decided to spend the day just us 3 out somewhere. Daddy suggested Swanage which went down well. Both Mummy and Daddy haven't been there probably for about 15 or 20 years. We drove down to Poole and caught the ferry across to Studland Bay. We didn't see any nudist sun seekers.... probably because there was no sun, just a spot of rain.<\/p><img src='images\/years\/2004\/2004_05_31-02-Swanage.JPG' class='diaryImage' alt='Having a kip on the way down' \/><p class='diaryImageCaption'>Having a kip on the way down<\/p><p>Swanage itself was busy, people playing on the sandy beach, and of course rain. A typical, old-time, English, family holiday feel about the place. We had a big ice cream and walked in the town to the old Victorian pier. It was really a glorified pontoon, with loads and loads of divers there. The weather was a bit grim, but I still enjoyed watching the boats come in, and generally noseying around... in a Oldemor type way! I also got my first whiff of seaweed and I wasn't impressed. I turned my nose up as if daddy had done a fart!<\/p><img src='images\/years\/2004\/2004_05_31-16-Swanage.JPG' class='diaryImage' alt='Swanage pier' \/><p class='diaryImageCaption'>Swanage pier<\/p><img src='images\/years\/2004\/2004_05_31-17-Swanage.JPG' class='diaryImage' alt='Reaction after first smell of seaweed' \/><p class='diaryImageCaption'>Reaction after first smell of seaweed<\/p><p>We slowly wandered back along the sea front, Daddy getting some local whelks before setting off towards Corfe Castle. It must be bank holiday weekend, as the weather was poor and the traffic even worse. We drove past Corfe Castle in the end, and headed off home.<\/p>","images":false},"title":{"value":"Swanage"},"version":1},{"date":{"d":30,"m":5,"y":2004},"datev":20040530,"images":1,"info":{"content":"<p>As usual I gave out the 6:30am alarm call for all to wake.... However, only mummy and daddy seemed to respond to this. Us 3 went for a walk down through the parks of Penarth down to the seaside bit. I managed to convince mummy and daddy that I should be able to crawl on the pier, which I did. It was again a lovely sunny, hot day. We returned for breakfast before going out for another walk at Cosmeston Lakes Country Park (same place as last time). I had a go at the swings, so did daddy and Vicky. We came back for a spot of lunch before adventuring to IKEA for a few bits. I've finally got some blackout blinds so hopefully I'll sleep a bit longer in the mornings. We returned home in the late afternoon and flaked out.<\/p><img src='images\/years\/2004\/2004_05_30-33-PenarthVickey.jpg' class='diaryImage' alt='Katie in Vicky’s back garden' \/><p class='diaryImageCaption'>Katie in Vicky’s back garden<\/p>","images":false},"title":{"value":"Over to Vickster's (2)"},"version":1},{"date":{"d":29,"m":5,"y":2004},"datev":20040529,"images":1,"info":{"content":"<p>Us lot and Ellie and Michael went over to see Vicky in Penarth. Before that we battled through the traffic. It was the Division 1 play off final between West Ham and Crystal Palace. It took us 5 hours from Alton to Pontypool!!!! We stopped off for a bit of Windsurfing in some really scenic location in the Welsh hills near Pontypool.<\/p><img src='images\/years\/2004\/WindsurfingLake.jpg' class='diaryImage' alt='Llandegfedd Reservoir' \/><p class='diaryImageCaption'>Llandegfedd Reservoir<\/p><p>Finally a chance for Daddy to do some windsurfing when it's either not blowing a gale, or cold and rainy weather. We did however struggle for some wind, but I think there was enough to get some surfing done, dudes.... Vicky met us there and us girls just chatted by the water's edge. I think daddy is finally making some progress on the board. Uncle Michael must have the patience of a saint teaching him. Us girls went back slightly early to Penarth, coz it was my feeding and bed time. The grown-ups had a nice evening in with Fajita's and wine. Vicky kept getting phone calls from her new fella, Paul. What a comfy bed we slept in. Vicky went out with Paul at about 11 and did not return until 4am!!!<\/p>","images":false},"title":{"value":"Over to Vickster's"},"version":1},{"date":{"d":28,"m":5,"y":2004},"datev":20040528,"first":{"name":"katie","value":"First teeth have come through"},"info":{"content":"<p>Mummy and Daddy can't quite believe it because I didn't seem to go through any teething process, although they might have been there for a while as I don't let mummy and daddy into my mouth very easily. Bring on the black jacks to chew on!!!<\/p><p>In the evening we went over to Alton for a Big Brother opening party, and a farewell 'Friends' party {boo hoo}. However, daddy, Michael and Richard went down the pub instead.<\/p>","images":false},"title":{"value":"Two teeth have come through, BigBro and Friends night"},"version":1},{"date":{"d":26,"m":5,"y":2004},"datev":20040526,"info":{"content":"<p>Mummy and Daddy at work, so Auntie Ellie had the pleasure of looking after me. We went to see Great Grandma. Mummy had her scan and everything seems to be OK, which was a relief of her mind. Daddy went off to play football in the evening and brought home Michael for din dins.<\/p>","images":false},"title":{"value":"Auntie Ellie looked after me"},"version":1},{"date":{"d":24,"m":5,"y":2004},"datev":20040524,"info":{"content":"<p>Mummy worked hard today - school nursing during the day and doing a night shift. Daddy was ill in bed, so Auntie Charlotte looked after me during the day. We went to see Great Auntie Sue.<\/p>","images":false},"title":{"value":"Auntie Charlotte looked after me"},"version":1},{"date":{"d":22,"m":5,"y":2004},"datev":20040522,"info":{"content":"<p>What a great day! Daddy woke up at Barrie house with the rest of the boys (Barrie, Martin, Nick and Michael) in the front room at about 5am.... everyone was on a bit of a high and excited for the day ahead. Daddy apparently looked a bit nervous, and instead of the Best Man looking after the groom, it was more like the other way round! The dam cat (Jinx Man) made sure they weren't going to sleep well. They managed to make their way over to Safeway's for breakfast, except Daddy, who couldn't eat. They then proceeded to go over to the hotel. Uncle Michael went back home to see Mummy and I. The hotel was ideal. Small enough to have exclusive ownership for the day, big enough to hold 60\/80\/100 guests. It was an old manor house from the 17th century. The gardens surrounding it, were in perfect order. We took a look around, saw the marquee around the back where the disco, meal and speeches were to take place. Barrie noticed he was still wearing his paint ridden work watch, and he had forgotten the money for the orchestra. So daddy made a trip home with him to get all the stuff together. We started to get ready at 11-ish. Daddy didn't know how to do his cravat or put cufflinks on! What a woos. Anyway they all posed for photo's before moving on to Odiham.<\/p><p>Meanwhile Mummy and I were at Auntie Ellie's getting ready. Back in Odiham the boys were in The Bell, for a swifty. Barrie had a pint of shandy (what a girl)! Anyway time was marching on and about half an hour before the wedding we decided to make our way up the hill to the church. The orchestra had already started to play... and Bazza was at last looking a little nervous. He spent most of the time in the front pew. It was nice for Daddy to see his old lollypop lady and friends and family. Farmor and Far were even there. Mummy and I eventually arrived and sat near the back.<\/p><p>The ceremony started just a little after 1:30pm, and Laura looked 'très bien'. Barrie didn't know whether he was allowed to look as she came down the aisle. Barrie and Laura exchanged smiles and the vicar commenced with the service. The Dunc-meister was chief camera man. Boy has he got a cheeky grin on him. Made the best men laugh throughout the service. Everyone done their bit. The fathers done their readings, James and I handed over the wedding rings and the bridesmaids looked good. Finally the proceedings ended, the happy couple walked back up the aisle and the Best Men, linked, arm in arm followed.<\/p><p>The happy couple posed for photo's outside, which if I haven't mentioned, was a lovely day weather wise. The confetti was sprinkled and the happy couple left in their old, black car towards to the reception, stopping off for a quick 10 minute breather.<\/p><p>Everyone got to the Hook House hotel safely (as far as we know!) and spilled out onto the lush lawns with their sparkling wine and orange juice. Barrie and Laura arrived and the hour photo session began. All sorts of photos were taken, including one where we had to hold Laura horizontally across our mid-rifts. Anyway Baz was steadily getting more grumpy that he had to smile in them! That boy doesn't like to smile too much!! He's probably taken up his whole year's supply of smiling up.<\/p><p>There was no time between the photo's and ushering the gatherings in for the wedding breakfast. This is when the best men were trying to sneak in all the props for their speech and getting everything ready. They looked remarkably relaxed, they even managed their meals. Mummy and I were on the same table as Daddy's friends and his mum and dad, as well as Ellie and Michael. We had melon for starter, chicken for main, and a choice between chocolate cake and fruit salad for pudding. The speeches started with David, Laura dad. He reminded everyone of Laura's mischiefness when she was a child. Bazza was then next to stand, and mentioned how it was Laura's dream, but his nightmare. I'm not sure if he was joking or not!! He also distributed some presents which was a nice touch and daddy got a 'Best Man' tankard. Then the attention turned to Daddy and James. Nervous. The first joke went off OK, the second even better, the picture gags were also a hit..... but it then seemed to dry up a bit on the laughs front. Still it is not all about the laughs. They gave a fair account of Baz and touched on all the right subjects. They stood for about 15 minutes before the nightmare over the past 14 months and especially last 3 months was over for them. People came up to them and said it went well.<\/p><p>Tables were cleared, beer could be consumed, and the evening guests began to arrive. The bouncy castle was a big hit for the kids. They certainly got their monies worth out of it. The cake was cut, and the disco man started the party. It was soon my bed time and luckily we had a room at the hotel for me to lie down in. Everyone took it in turns to come and baby-sit me during the night.<\/p><p>Auntie Susan and Graham turned up, as well as Grandpop and Grandma. Lots of chatting and drinking, and daddy even had a go on the bouncy castle with the rest of the boys. Unfortunately daddy received blows to the cheek, but Mr Aves managed to acquire a bloody nose. Mr King decided to come in with his knees at one point!!! He is dirt. Other highlights from the evening was when Joyce had so much to drink, she couldn't actually walk without assistance. Quite funny for us, but not for Steven or Joyce no doubt. Still people have laughed at daddy in the past, for similar misgivings. The evening guests had to finally leave around the 11pm mark, but the bar was re-opened for the hotel guests, of which there must have been up to 20 or so people. Daddy was absolutely knackered at 1am and finally turned in. A GOOD DAY HAD BY ALL.<\/p>","images":false},"title":{"value":"Barrie And Laura's Wedding"},"version":1},{"date":{"d":19,"m":5,"y":2004},"datev":20040519,"first":{"name":"katie","value":"Walked the length of the sitting room with the baby walker"},"title":{"value":"Katie walked the length of the sitting room with the baby walker"},"version":1},{"date":{"d":17,"m":5,"y":2004},"datev":20040517,"info":{"content":"<p>Both Mummy and Daddy were at work, so Auntie Charlotte looked after me. We found a new playground on our estate and Aunty Lindey came round to give Charlie her 18th present. We done plenty of walking.<\/p>","images":false},"title":{"value":"Auntie Charlotte looked after me"},"version":1},{"date":{"d":16,"m":5,"y":2004},"datev":20040516,"info":{"content":"<p>We got up early and went for an early morning stroll in the woods, heading towards the barracks. Mummy and I went to church while Daddy was digging out all the rubbish Barrett's had left in the garden!!! Daddy then went over to James's again!! to do some more work on the Best Man speech.<\/p><p>David and Louise came over in the late afternoon, which was nice, especially as they bought some chocolate cake for us all to eat. They are wanting babies as well.<\/p><p>Charlotte arrived a little later on as she is going to baby-sit me tomorrow. Daddy treated us all to a pizza. Yum, yum.<\/p>","images":false},"title":{"value":"Church, More Speech, David and Louise, Charlotte over to stay"},"version":1},{"date":{"d":15,"m":5,"y":2004},"datev":20040515,"info":{"content":"<p>Mummy worked a night, so I was solely under the influence of Daddy for most of the day. We first went to meet up with Farmor and go shopping with her, then back to the Fars for a bit of playtime, before going off to feed the ducks at Tomlins Pond. There was a really aggressive swan chasing the geese around. It was funny to see, as she never caught them. We then moved onto Lakeside School fete, where we got some cakies. Mmmm. After lunch we ventured back to wake mummy up and we all went to the swings. I love going on the swings. It makes me double smile.<\/p><p>We went over to Rake, near Liss for a Barn Dance in aid of Karen's sister, Rebecca's home. We met up with Mummy's parents and sister. It was a lovely sunny day and it was a nice relaxing atmosphere, although the music wasn't exactly the Foo Fighters!! It was a big house, accommodating about 20 or so adults with the same condition. It looked very nice and I especially liked all the things in the garden to play with. We got home had a sleep before Mummy had to go to work again<\/p>","images":false},"title":{"value":"The Fars, School Fete, Barn Dance"},"version":1},{"date":{"d":9,"m":5,"y":2004},"datev":20040509,"info":{"content":"<p>Daddy and Michael went to play a friendly game of football. It went to penalties and Daddy missed and lost Casuals the game!! They rushed over to Alton, where Mummy, I and Ellie were, and we had a mini birthday lunch for Michael, then went to the French market, where Daddy bought a smelly, dried sausage. We then had to rush back and take Mrs Oddie out.<\/p>","images":false},"title":{"value":"French Market"},"version":1},{"date":{"d":8,"m":5,"y":2004},"datev":20040508,"info":{"content":"<p>We walked up Leith Hill, but it was really muddy, so mummy and daddy carried me up. The weather was rainy, so we couldn't actually see the views unfortunately. After stopping in Dorking for a bit, we moved onto the Star pub for Charlotte's 18th birthday celebration. Ellie and Michael stayed over.<\/p>","images":false},"title":{"value":"Charlotte's 18th and Leith Hill"},"version":1},{"date":{"d":7,"m":5,"y":2004},"datev":20040507,"info":{"content":"<p>James came round to work with Daddy all day long on Barrie's best man speech. They have spent absolute hours and hours on it. I think they have got it to a state where they are 95% happy with it now.<\/p>","images":false},"title":{"value":"Best Man's Speech Prep"},"version":1},{"date":{"d":6,"m":5,"y":2004},"datev":20040506,"first":{"name":"katie","value":"Bottom audible burp!!"},"title":{"value":"Katie's first bottom audible burp!!"},"version":1},{"date":{"d":3,"m":5,"y":2004},"datev":20040503,"info":{"content":"<p>We got up early to get down to Hayling Island for a 9am start. Daddy and Uncle Michael setup the windsurf and got changed into their wet suits. They looked very funny. They were the only ones out in the water. Reason being, because it was early, it was wet and cold. Anyway Daddy had a short go and done OK. Michael done very well and towed Daddy around the sea quite quickly. Anyway Daddy got a bit cold and tired shortly afterwards and gave up. Mummy, Ellie and I had a couple of walks along the front while the boys were playing out in the sea. The weather got worse and worse, eventually the rain was coming in hard, fast and horizontal!! We gave up, and had fish and chips in the car and made our way home.<\/p><p>In the afternoon Daddy continued to put some extra beds in the garden whilst Mummy and I played. I am still not feeling too great. I wish my teeth would come through.<\/p>","images":false},"title":{"value":"Windsurfing"},"version":1},{"date":{"d":2,"m":5,"y":2004},"datev":20040502,"info":{"content":"<ul><li><i>afternoon<\/i>A group of us helped Great Granddad do his back garden fence. The weather was lovely and it was nice that we were all together. It was hard work, and by the time we had finished the men were already to have a snooze! Ellie and Michael came back to ours for a rest before the presentation night.\u000a        <\/li><li><i>evening<\/i>We all ventured over to the Nightingale in Ash for the Casuals Presentation night. Farmor and Farfar babysat for me. Mummy reversed into a post and then blamed Daddy for some reason. No damage was done. But Nick and Martin, our passengers laughed. Michael had lost his voice which was funny. Daddy came home with a few trophies and medals. He won 'Manager Player Of The Year' and got something for coming second in 'Players, Player Of The Year', and a medal for being a part of the most successful Casuals team ever, only by the fact we didn't get relegated, not because we won anything!! Anyway it was nice to see everyone enjoy themselves. Good fun.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Great Granddad Gardening and Casuals Presentation Night"},"version":1},{"date":{"d":1,"m":5,"y":2004},"datev":20040501,"info":{"content":"<ul><li><i>morning<\/i>Today was the annual Old Boys game event. Daddy was looking forward to this, and it was a chance for me to see him play football for once. Daddy got off to great start by smacking the old boys centre forward within 5 seconds (by accident). Barrie had a bad back so he was on the sidelines with Mummy and I. He's a funny man. We left at half time because it was getting a bit cold. The game ended up at 1-1. Daddy was naughty and stayed for a few drinks after. We went to Camberley to meet up with Grandma and Granddad.\u000a        <\/li><li><i>afternoon<\/i>In the afternoon Mummy and I chilled, whilst Daddy was putting a small path in the back garden. I think I am beginning the teething process as I have had a cold and not sleeping to well.\u000a        <\/li><li><i>evening<\/i>We went over to Ellie and Michael's in the evening for a nice meal. I loved it there as there was a new front room and kitchen to explore. We had fun playing together all of us. Daddy and Uncle Michael went out pubbing for 4 hours!!! We stayed the night over.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Old Boys Game - Alton visit"},"version":1},{"date":{"d":28,"m":4,"y":2004},"datev":20040428,"first":{"name":"katie","value":"Trip down the hospital"},"images":1,"info":{"content":"<p>This week is a chill out week. No best man speech to prepare, no football training, just relaxing.... until Miss Pickle decides she wants to scare us to death. She now is beginning to explore so much, it's difficult to keep up. On Monday Miss Pickle decided to fall off the bed head first, she seemed to go unconscious for a second or two, and Daddy called an ambulance. However, the 999 people don't have our address on their database. By the time it got round to explaining where we are it seemed she was OK again.<\/p><p>Then we have had her crawling into the en-suite shower, picking up the whole plug hole unit (thanks Barrett's for securing it. great job done!!). There was hair and yuck all over it. She decided to put this in her mouth.<\/p><p>Then today she was playing with a small snow globe, and it smashed as Daddy was changing Miss Pickle after bath time!! Perspex in the mouth and this nail varnish smelling liquid over her lips and maybe in her mouth. We rushed down to Frimley Park. Miss Pickle was wondering what was going on, as she wasn't crying or feeling any effects..... as if nothing happened. anyway we got the all clear and luckily nothing has damaged her.....YET.<\/p><p>We also got a passport photo done of her. She looks great.<\/p><img src='images\/years\/2004\/2004_04_28-PassportPhoto.jpg' class='diaryImage' alt='Passport mug shot' \/><p class='diaryImageCaption'>Passport mug shot<\/p>","images":false},"title":{"value":"Accident prone"},"version":1},{"date":{"d":26,"m":4,"y":2004},"datev":20040426,"info":{"content":"<p>Daddy had the day off work, so we had some nice playtime. We had invited some of Daddy's side of the family around for a birthday meal for Farmor. Daddy cooked it all himself. It was lovely weather and we sat outside and ate.<\/p>","images":false},"title":{"value":"Farmor's Birthday"},"version":1},{"date":{"d":24,"m":4,"y":2004},"datev":20040424,"info":{"content":"<p>While Daddy was still on the stag weekend, Me, mummy and mummy side of the family went down to Hastings for the day. It was great fun.<\/p>","images":false},"title":{"value":"Bazza Stag Weekend, Hastings"},"version":1},{"date":{"d":23,"m":4,"y":2004},"datev":20040423,"info":{"content":"<p>Daddy went off to Uncle Barrie's stag weekend in Newquay. He was going to drive the minibus, so hopefully he might come back in one piece! Mummy on the other hand went to Laura's Hen night at a restaurant called in Alcatraz in Camberley. Grandma who has been staying with Auntie Charlotte the past few days looked after me.<\/p>","images":false},"title":{"value":"Bazza Stag Weekend, Mummy to Laura's Hen, Leaving me with Grandma"},"version":1},{"date":{"d":18,"m":4,"y":2004},"datev":20040418,"info":{"content":"<p>Me and mummy went up to help the Anthony Nolan team at the London Marathon. Ellie and Michael came to. We were taking photos of the AN competitors and sticking name badges on them.<\/p>","images":false},"title":{"value":"London Marathon"},"version":1},{"date":{"d":17,"m":4,"y":2004},"datev":20040417,"info":{"content":"<p>We set off for Stansted for the 1pm wedding. Stansted looked lovely. Typical Kent village, sunny day, pub (which serves Hogs Back TEA), narrow lanes and a church on the hill. It was a lovely, small church holding just 90 in the congregation. Now the mission was to make sure Katie didn't squawk or cry too much throughout the wedding. She certainly was enjoying proceedings. So nosey!! The service was great. The vicar's sermon was more like a best mans speech! the vows were exchanged and Kelly and Fi were wed.<\/p><p>We sort of got lost on the way to the reception, but eventually found it. Helen, Nigel and Vicky were also invited for the whole day's proceedings. We had a lovely roast Lamb meal, and then onto the speeches. All of which were very good. Fiona's dad was proud of both of her daughters and the best man ribbed Kelly about his girly type name. It was getting passed Katie's bedtime so Laura took her back to her parents and returned later. She returned to the rest of the rabble who later turned up. It was nice to see the whole gang there. Jessica, John, William, Andrew, George, Karen and Richard. Probably the first time we have all been in the room together for a long, long time.<\/p><p>Our evening was curtailed at about midnight as we had a phone call saying that Katie was getting upset. We stayed at the Weston residence.<\/p>","images":false},"title":{"value":"Fiona And Kelly's Wedding"},"version":1},{"date":{"d":16,"m":4,"y":2004},"datev":20040416,"info":{"content":"<p>Andrew and George came down and we went over to the park and chatted in the afternoon. Lovely.<\/p>","images":false},"title":{"value":"Andrew And George Over"},"version":1},{"date":{"d":12,"m":4,"y":2004},"datev":20040412,"info":{"content":"<p>Daddy done some more Hiroshima in the front garden. He said he has re-seeded it and put some plants in. It just looks like a load of earth to me.<\/p>","images":false},"title":{"value":"Easter Monday"},"version":1},{"date":{"d":11,"m":4,"y":2004},"datev":20040411,"info":{"content":"<ul><li><i>morning<\/i>Daddy went to play his last league game of the season, whilst mummy and I went to church\u000a        <\/li><li><i>afternoon<\/i>The Weston's came over for a Turkey Easter meal. Yum yum. We then went over to Great Grandma's to meet the rest of the family for the afternoon.\u000a        <\/li><\/ul>","images":false},"title":{"value":"The Weston's come over for Easter meal"},"version":1},{"date":{"d":10,"m":4,"y":2004},"datev":20040410,"info":{"content":"<ul><li><i>morning<\/i>The weather was a bit glum.... well it was raining. We had to get out of the house, so that mummy could sleep, so we headed towards Bournemouth. However, both me and Daddy were still tired and I was I hadn't woke at 6:15!! We stopped off at Basingstoke for a quick nap in the car. When we woke, 15 minutes later, it was still raining, so we went off to Homebase in Basingstoke and played around there. It brightened up. Hooray.\u000a        <\/li><li><i>afternoon<\/i>So we ventured down to Bournemouth finally. It was busy, and they had a French market in the square with lots of nice looking food. We had a milkshake in our usual haunt, then made our way to the pier area. We sat by the promenade and daddy fed and watered me. It was really nice and relaxing. We then went into the arcades, but I didn't win any money! We hurried back home in time for mummy to wake up.\u000a        <\/li><li><i>afternoon<\/i>We rushed off to Coral Reef and had a great time nosing around. Much better than other pools we've been to.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Bournemouth and Coral Reef"},"version":1},{"date":{"d":9,"m":4,"y":2004},"datev":20040409,"info":{"content":"<p>Mummy had just done the first night of four in a row, so Daddy was going to look after me for the next few days. Our first day was spent lopping Farfar's tree down in his back garden. Daddy went higher than the house, without a harness. Some really big bits came down and amazing, we all didn't get injured and we kept all Farmor's plants intact. Auntie Susan looked after me while Daddy and Farfar where playing with the chain saws.<\/p>","images":false},"title":{"value":"Daddy The Lumberjack"},"version":1},{"date":{"d":4,"m":4,"y":2004},"datev":20040404,"info":{"content":"<ul><li><i>morning<\/i>Mummy and Ellie went to find a church in Alton for the early service. Daddy and Uncle Sloppy looked after me.\u000a        <\/li><li><i>afternoon<\/i>Whilst daddy and Farfar were playing in the Garden, Mummy and I took misses Oddie to see her son.\u000a        <\/li><li><i>evening<\/i>We went over to Farmor and Farfar for stew and dumplings. Mmmm. It was delicious. Susan and Graham were there to.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Church, Mrs Oddie and the Fars for Sunday Meal"},"version":1},{"date":{"d":3,"m":4,"y":2004},"datev":20040403,"images":1,"info":{"content":"<ul><li><i>morning<\/i>We went to Godstone Farm to have a look at the animals. I particularly loved the donkey and sheep. The weather shortened our stay, but I think I might become a farmer!\u000a        <\/li><li><i>afternoon<\/i>We went over to Sevenoaks to go swimming. I splash more than ever, and always on the look out to play with others of a similar age. I still enjoy eating all the swimming toys even though they are all wet.\u000a        <\/li><li><i>afternoon<\/i>We then went over to see my great grandparents and great, great grandparents grave! We all spoke to them to make sure they know we think about them a lot.\u000a        <\/li><li><i>evening<\/i>We zoomed over to Alton to stay the night around the Elder's. We had a lovely lasagne and we beat Michael and Ellie at trivial pursuit this time. That's 1-1 now.\u000a        <\/li><\/ul><img src='images\/years\/2004\/2004_04_03-GodstoneFarm.jpg' class='diaryImage' alt='At Godstone Farm' \/><p class='diaryImageCaption'>At Godstone Farm<\/p>","images":false},"title":{"value":"Godstone Farm to Alton"},"version":1},{"date":{"d":2,"m":4,"y":2004},"datev":20040402,"info":{"content":"<p>Mummy, E lie, Michael and Richard all went to see the Jesus film at the cinema. They all came back a bit sheepish. A bit violent by all accounts<\/p>","images":false},"title":{"value":"Cinema"},"version":1},{"date":{"d":29,"m":3,"y":2004},"datev":20040329,"images":2,"info":{"content":"<p>Mummy and I went off to help Ellie and Michael to move house from Liss to Alton. Their house is lovely, and finally their own, can do what they will with it.<\/p><p>Daddy came down after work to help a bit. We had Fish and Chips for dinner. Mmmm.<\/p><img src='images\/years\/2004\/2004_03_29-1-OnSwing.jpg' class='diaryImage' alt='Enjoying the swings {1}' \/><p class='diaryImageCaption'>Enjoying the swings {1}<\/p><img src='images\/years\/2004\/2004_03_29-2-OnSwing.jpg' class='diaryImage' alt='Enjoying the swings {2}' \/><p class='diaryImageCaption'>Enjoying the swings {2}<\/p>","images":false},"title":{"value":"Ellie and Michael move to Alton"},"version":1},{"date":{"d":28,"m":3,"y":2004},"datev":20040328,"info":{"content":"<ul><li><i>morning<\/i>Daddy went off to play football. He actually scored a goal for once, and Casuals won for once!! Mummy and I went to Church.\u000a        <\/li><li><i>afternoon<\/i>Daddy went over to David's to watch the Arsenal V Man Utd match.\u000a        <\/li><li><i>evening<\/i>Mummy had to work a night at the hospital.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Usual Sunday"},"version":1},{"date":{"d":27,"m":3,"y":2004},"datev":20040327,"first":{"name":"katie","value":"Mummy and Daddy's first night out together"},"info":{"content":"<ul><li><i>morning<\/i>Daddy went off to the Ideal Home Exhibition, whilst me and mummy went over to Ellie and Michael's to help them pack.\u000a        <\/li><li><i>evening<\/i>Karen and Richard kindly babysat me, so Mummy and Daddy could go out together. I think it's only their second time they've had a night out without me, certainly the first on their own without anyone else. They went to a pub in Compton.\u000a        <\/li><\/ul><p>Been noticing a bit of a change in Katie. The things that used to make her laugh or comfort her don't anymore, instead she loves to bang her pots together, she likes me making faces at her, she's always waving. She becoming a right little madam. If she doesn't get her way, well she lets you know about it. She also has become more dependent on Laura. If she goes out of the room, then she'll quite often cry<\/p>","images":false},"title":{"value":"Packing for Ellie and Michael and Mummy and Daddy's first night out together"},"version":1},{"date":{"d":21,"m":3,"y":2004},"datev":20040321,"first":{"name":"katie","value":"First full day without breast milk"},"info":{"content":"<ul><li><i>morning<\/i>In the morning Mummy, Ellie and I went off to church.\u000a        <\/li><li><i>afternoon<\/i>We went to Sarah's house for an NCT get together. This time all the Daddies were invited. Is was good to see a lot of the people back together again.\u000a        <\/li><li><i>evening<\/i>Later on we went over to Farmor and Farfar’s house to give mothers day's presents. Auntie Susan was there to.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Mothers Day"},"version":1},{"date":{"d":20,"m":3,"y":2004},"datev":20040320,"info":{"content":"<p>Again another yucky weather day. Farmor came round in the morning to see me and stayed for a cup of tea.<\/p><p>We decided to try to go to the Rainforest centre near Newbury. So we went off and went for a spot of swimming first,    which of course Katie loved. However, the weather was bad as usual, so decided just to get a spot of lunch and wander around the shops, before leaving back for home.<\/p><p>In the evening Ellie and Michael game over for a games evening. Unfortunately they beat mummy and daddy in game of Trivial Pursuit. Daddy had one too many   glasses of wine. hiccup, gulp, hiccup....sore head. Ellie and Michael stayed the night.<\/p>","images":false},"title":{"value":"Newbury"},"version":1},{"date":{"d":14,"m":3,"y":2004},"datev":20040314,"info":{"content":"<p>What a horrible days weather. Because Daddy hasn't been feeling very well, he had to pull    out of the Fleet Half Marathon that he had entered. He was sad at that, but little relieved as the weather was so windy, rainy and cold.    Anyway we went to see Row and Simon finish in 1hr 56mins, which was very nice.<\/p><p>We then all took Mrs Oddie to see her son. She had been broken into during the week. A man claiming to be from the gas board. Very sad.<\/p>","images":false},"title":{"value":"Yucky Weather"},"version":1},{"date":{"d":13,"m":3,"y":2004},"datev":20040313,"info":{"content":"<p>We went to a very small country park in Little Sandhurst (Ambarrow Court). It took all of 2 minutes to walk round, but mummy assured us there would be petting animals, a Victorian manor house, a buggy track and a butterfly farm. We must of blinked at the wrong time!<\/p><p>Afterwards we went to see Auntie Susan and Graham at their house. We had another walk down to the duck pond. Very nice.<\/p><p>After this Daddy went to watch the last bit of Camberley vs. Chertsey, in a disappointing 0-0 draw.   Grandma and Grandpop then came over to ours for a couple of hours to see me, which is always nice.<\/p>","images":false},"title":{"value":"Over to Auntie Susan's and Graham's"},"version":1},{"date":{"d":12,"m":3,"y":2004},"datev":20040312,"info":{"content":"<ul><li><i>afternoon<\/i>Went for a walk round California Country Park. We didn't last very long, as the weather was quite bad. It would be nice to go there when in the summer time.\u000a        <\/li><li><i>evening<\/i>Mummy and Daddy had some interesting homemade smoothies.\u000a        <\/li><\/ul>","images":false},"title":{"value":"California Country Park"},"version":1},{"date":{"d":11,"m":3,"y":2004},"datev":20040311,"info":{"content":"<ul><li><i>morning<\/i>Great Uncle Howard came over to visit, to give me a nice cross for a christening present. He also showed us some photo's from his trip to New Orleans and from the christening.\u000a        <\/li><li><i>afternoon<\/i>Helen and Sarah from the NCT came round. Daddy still sick in bed!\u000a        <\/li><\/ul>","images":false},"title":{"value":"Daddy home with Coldy-Fluy thing"},"version":1},{"date":{"d":10,"m":3,"y":2004},"datev":20040310,"info":{"content":"<ul><li><i>afternoon<\/i>Daddy was ill today so stayed at home. We had visits from Great Grandma and Granddad. Also Great Uncle John Garrett.\u000a        <\/li><li><i>evening<\/i>We went over to the Sanders new house over in Zebon Copse, Farnham for a nice meal.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Me l at Karen And Richards"},"version":1},{"date":{"d":9,"m":3,"y":2004},"datev":20040309,"info":{"content":"<p>We went out with Caroline this afternoon and walked to the Basingstoke Canal centre. It was such a long walk.<\/p><p>Farmor and Farfar came round in the evening and gave us a video tape of the Christening, last Christmas and Auntie Susan's birthday. It was weird to see how different I am now to back then.<\/p>","images":false},"title":{"value":"Watch christening video"},"version":1},{"date":{"d":8,"m":3,"y":2004},"datev":20040308,"info":{"content":"<p>James came over to do some more Best Man speech stuff with Daddy.<\/p>","images":false},"title":{"value":"James over"},"version":1},{"date":{"d":7,"m":3,"y":2004},"datev":20040307,"info":{"content":"<p>It was my special day. Mummy and Daddy wanted to officially introduce me to the church.... well ok mainly mummy. It happened at St Nicholas church in Southfleet. The reason why we have chosen a church so far from where we, and most of the congregation live is because we, or more accurately mummy has been going to that church from when she    was a little child and it holds special memories as it is the place mummy and daddy were wed. Three people were specially chosen to be my godparents. We decided to pick from outside of the family, as we reckon family members have already got a special role in my life. Kindly mummy's friends Helen and Karen, who are regular church go'ers have agreed to be Godmothers.    We were scratching our heads quite hard to find one of daddy's friends who was religious and responsible!!! In fact, none of daddy's friends are that religious, so daddy's best mate    (and best man at the wedding) Barrie has stepped into the role of 'The Godfather'!!<\/p><ul><li><i>morning<\/i>We woke fairly early and played in bed as usual. Then it got all very rushed (as usual) and we made it to the church, with only 10 minutes to spare! The church was   full. There was the normal congregation and my christening was integrated with it. It was a really nice service. Half way through, mummy, daddy and my godparents had to all stand    at the front and renounce all evil, which they luckily did. Clifford, the vicar then took me on a tour all around the church to welcome me to all the regular church go'ers. I was a very brave girl and didn't cry once. We had a few more hymns and a sermon, which I got a few mentions in before we headed over to the Woodlands pub for a bite to eat.\u000a        <\/li><li><i>afternoon<\/i>Everyone eventually got to the Woodlands where we had the hall upstairs to ourselves. We chilled and had a drink. It was nice for Mummy and Daddy to catch up with friends and family who they haven't seen for yonks. It was really nice atmosphere. Daddy gave a short speech (which he HATES doing) and toasted me! Way Hey. We   must have been there for 2.5 hours before everyone filtered out. Thank you to all those who came.\u000a        <\/li><li><i>evening<\/i>&gt;We went back to Grandma's and Grandpop's where we began to open all the lovely presents. We didn't realize how generous people had been until we got home. I got some religious bits, crockery, toys and even some money. Far too much stuff to put down here. We travelled back after a cup of tea. Farfar and Farmor came   round later to help me open the rest of the presents and cards. Overall a very good day, and thank you for all my presents. To cap the day off, mummy went to work a night shift at the hospital!!\u000a        <\/li><\/ul>","images":false},"title":{"value":"Katie's Christening"},"version":1},{"date":{"d":6,"m":3,"y":2004},"datev":20040306,"info":{"content":"<p>We had a nice day up in London visiting some museums. First we went to the Childhood museum in Bethnal Green. There were lots of toys there. Daddy beat mummy at connect 4.   We walked up and down the high street because mummy and daddy couldn't decide where to eat. They decided to get on to a double-decker bus, at the top, at the front. Me being nosey, loved   it up there! We got off at Mansion house, grabbed something to eat at Burger King, then walked on across the Millennium bridge.<\/p><p>We went into the Tate Modern. It was a huge building and in the foyer there was a massive half sun, that when projected on to the mirror made it look like a whole sun. It was wicked as    we could see ourselves in the mirrored ceiling. Well through the camcorder anyway. We trawled through the galleries mostly up on daddy's shoulders. I got lots of smiles and grins. Mummy was    like a small schoolchild in the nudes section. She giggled and couldn't appreciate the artistic value of the works of art. We   managed our way to the top of the building where there was a restaurant and we got some much need refreshments whilst admiring the view over St. Paul's and the Thames.<\/p><p>We walked across the Millennium bridge again and alongside Victoria embankment, past Temple, to Charing Cross station. After a bit of stationary train swapping, we were off   on our way back to Hither Green. We got in the car exhausted and drove to Grandma's and Grandpop's, where Auntie Ellie and Michael were. We had a meal and crashed out.<\/p>","images":false},"title":{"value":"London - Childhood and Tate Modern museum"},"version":1},{"date":{"d":5,"m":3,"y":2004},"datev":20040305,"info":{"content":"<p>The boys went down to the pub with Gazza, Nick, Phil and Marts. Whilst us girlies had a night in<\/p>","images":false},"title":{"value":"Ellie and Michael over"},"version":1},{"date":{"d":4,"m":3,"y":2004},"datev":20040304,"info":{"content":"<ul><li><i>afternoon<\/i>Sarah and Caroline came over for coffee\u000a        <\/li><li><i>evening<\/i>We all went round to Steven's new house in Bracknell. Very similar to ours.\u000a        <\/li><\/ul>","images":false},"title":{"value":"See Stevens New house"},"version":1},{"date":{"d":3,"m":3,"y":2004},"datev":20040303,"info":{"content":"<p>Mummy and Daddy really made me laugh today. I've never laughed soooo much<\/p><p>Michael came over to dinner then the boys went to play football<\/p>","images":false},"title":{"value":"Michael over for din dins"},"version":1},{"date":{"d":29,"m":2,"y":2004},"datev":20040229,"info":{"content":"<ul><li><i>morning<\/i>Me and mummy went to pick up her side of the family from the airport. They had just gone to the USA.\u000a        <\/li><li><i>afternoon<\/i>In the afternoon Michael and Daddy went off to play football. They are mad. It was cold!\u000a        <\/li><\/ul>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":25,"m":2,"y":2004},"datev":20040225,"info":{"content":"<p>We had a number of visitors for dinner. The boys went off to football training. The Sanders stayed over.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":24,"m":2,"y":2004},"datev":20040224,"info":{"content":"<p>Mummy worked a night shift, so Daddy looked after me during the night.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":22,"m":2,"y":2004},"datev":20040222,"info":{"content":"<ul><li><i>Morning<\/i>I went to church whilst Daddy played football.\u000a        <\/li><li><i>\u000a            Afternoon\u000a          <\/i>\u000a          Farmor and Farfar came to visit.\u000a        <\/li><\/ul>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":21,"m":2,"y":2004},"datev":20040221,"info":{"content":"<ul><li><i>Morning<\/i>It was a very cold day. We all went to Frimley Lodge park to go for a walk and feed the ducks on the canal. We also played on the swings for a bit and watched some small children's football match.\u000a        <\/li><li><i>Afternoon<\/i>Daddy done jobs (Gardening, Defrosting Freezer)\u000a        <\/li><li><i>Evening<\/i>Mummy worked a night shift, so Daddy looked after me during the night\u000a        <\/li><\/ul>","images":false},"title":{"value":"Frimley Lodge Park"},"version":1},{"date":{"d":19,"m":2,"y":2004},"datev":20040219,"info":{"content":"<p>Went swimming in the morning. Michael came round for dinner.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":18,"m":2,"y":2004},"datev":20040218,"info":{"content":"<p>Went to the clinic and I weigh 20lbs now. Went to see great grandma and granddad. Auntie Karen Sanders came to stay the night. Daddy played football.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":17,"m":2,"y":2004},"datev":20040217,"info":{"content":"<p>Mummy worked a night shift, so Daddy looked after me during the night.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":15,"m":2,"y":2004},"datev":20040215,"info":{"content":"<p>Farmor and Farfar came to visit. Mummy had to work a night-shift, so daddy looked after me during the night.<\/p>","images":false},"title":{"value":"At Home"},"version":1},{"date":{"d":14,"m":2,"y":2004},"datev":20040214,"images":1,"info":{"content":"<p>Me, Mummy, Karen and Ellie went shopping in Camberley, whilst Daddy and Michael went searching for Windsurfing lakes at Minley, Sandhurst, Bray and Staines. In the evening mummy got really drunk on the Wine. Daddy cooked a special valentines meal.<\/p><img src='images\/years\/2004\/2004_02_14-02a-Katie.JPG' class='diaryImage' alt='Katie Looking Happy' \/><p class='diaryImageCaption'>Katie Looking Happy<\/p>","images":false},"title":{"value":"Camberley Shopping"},"version":1},{"date":{"d":11,"m":2,"y":2004},"datev":20040211,"info":{"content":"<p>This was the final time that mummy had to work at the School nurses place. Today Ellie kindly looked after me<\/p>","images":false},"title":{"value":"Ellie look after me"},"version":1},{"date":{"d":8,"m":2,"y":2004},"datev":20040208,"info":{"content":"<p>The usual Sunday routine. Me and Mummy went to Church, whilst Daddy played golf with Michael, Howard and Richard. He lost badly! We had a Sunday roast, then played games in the afternoon<\/p>","images":false},"title":{"value":"Istead Rise Sunday"},"version":1},{"date":{"d":7,"m":2,"y":2004},"datev":20040207,"info":{"content":"<p>We all went swimming in the morning at the Arena. Daddy then watch Chertsey play Bideford in the last 16 of the FA Vase. We met up with him and went to Grandpop and Grandma's for a bite to eat before moving on to Karen and Richard casino night. We all put £5 in and we played Roulette and 3 card Bragg. Mummy and Daddy (Daddy really!!) won £40!!<\/p>","images":false},"title":{"value":"Karen and Richard's Casino Night"},"version":1},{"date":{"d":4,"m":2,"y":2004},"datev":20040204,"info":{"content":"<p>Mummy had her 4th day at working back as a school nurse. Daddy looked after me today. After clinic, in the afternoon we went to Farmor's school kitchen and had a look around. We then went to Frimley Lodge park to feed the ducks along the canal, and to play on the swings. It was great fun, although it was a bit cold.<\/p>","images":false},"title":{"value":"Daddy look after"},"version":1},{"date":{"d":31,"m":1,"y":2004},"datev":20040131,"info":{"content":"<p>We went into Gravesend to do some bowling. It seemed all of Grandma's family was there.<\/p>","images":false},"title":{"value":"Grandma and Grandpop's 30th Wedding anniversary"},"version":1},{"date":{"d":28,"m":1,"y":2004},"datev":20040128,"first":{"name":"katie","value":"My first night's sleep"},"info":{"content":"<ul><li><i>morning<\/i>Mummies 3rd time at Hayes and it was the turn of Great Grandma and Granddad to look after me in the morning.\u000a        <\/li><li><i>afternoon<\/i>In the afternoon Farmor and Farfar looked after me. It was so cold that we couldn't go out. There was snow!\u000a        <\/li><\/ul>","images":false},"title":{"value":"The Oldies look after me"},"version":1},{"date":{"d":21,"m":1,"y":2004},"datev":20040121,"info":{"content":"<p>Mummy had to work, so daddy looked after me for the first time during the day. We went to clinic in the morning, then went for a long drive close to Farnham in the afternoon. We then went to see Farmor and Farfar, and went to Tomlins Pond to feed the ducks.<\/p>","images":false},"title":{"value":"Daddy look after me"},"version":1},{"date":{"d":20,"m":1,"y":2004},"datev":20040120,"info":{"content":"<b>Things that puts a giggle on my chops<\/b><p \/><ul><li>Having a bath making big splashes and eating Nemo!<\/li><li>Kick my legs when I am open to the elements<\/li><li>Looking in the mirror (coz I am so worth it)<\/li><li>Playing hide and seek<\/li><li>Having a go in my baby bouncer<\/li><li>Being tickled in the ribs<\/li><li>\"I Love My Little Katie\" song being sung<\/li><\/ul><p \/><b>Things that make me sleep<\/b><p \/><ul><li>Being driven in the car<\/li><li>Quiet and dark (funnily enough)<\/li><li>After mummy has given me some booby milk<\/li><li>Being in bed with mummy and\/or daddy<\/li><li>When my family start telling me about how they used to look after mummy and daddy when they were a baby!!<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>Everything!!!<\/li><li>My toy tiger rattle<\/li><li>Yoghurts<\/li><li>Liver pure<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Playing with my toys<\/li><li>Rolling around on the floor<\/li><li>Putting anything I can into my mouth<\/li><li>Watching \"Roly Poly Ollie\"<\/li><li>Being taken out of the house<\/li><li>Fascinated by scrunching wrapping paper<\/li><\/ul>","images":false},"title":{"value":"Katie - What I'm like at 6 months-ish"},"version":1},{"date":{"d":17,"m":1,"y":2004},"datev":20040117,"info":{"content":"<p>We went for a nice walk in the crown estate at Virginia Water. We saw some ducks and a big totem pole.<\/p>","images":false},"title":{"value":"Virginia Water walk"},"version":1},{"date":{"d":14,"m":1,"y":2004},"datev":20040114,"info":{"content":"<p>Mummy had to go to work otherwise we would have had to pay loads of maternity pay back. So for the next 5 Wednesdays, I get the joy of others looking after me. Today's turn is Ellie<\/p>","images":false},"title":{"value":"Ellie look after me"},"version":1},{"date":{"d":13,"m":1,"y":2004},"datev":20040113,"first":{"name":"katie","value":"My first roll over"},"title":{"value":"Katie's first roll over"},"version":1},{"date":{"d":10,"m":1,"y":2004},"datev":20040110,"images":1,"info":{"content":"<p>We travelled by train up to London. Mummy went to the theatre to see Lion King with her side of the family, whilst me and Daddy went walking all over London it seemed.<\/p><img src='images\/years\/2004\/2004_01_10-London.JPG' class='diaryImage' alt='On Waterloo Bridge with Daddy' \/><p class='diaryImageCaption'>On Waterloo Bridge with Daddy<\/p>","images":false},"title":{"value":"London"},"version":1},{"date":{"d":4,"m":1,"y":2004},"datev":20040104,"first":{"name":"katie","value":"My first laugh"},"title":{"value":"Katie's first laugh"},"version":1},{"date":{"d":3,"m":1,"y":2004},"datev":20040103,"first":{"name":"katie","value":"My first \"Ma Ma\""},"title":{"value":"Katie says \"Ma Ma\""},"version":1},{"date":{"d":2,"m":1,"y":2004},"datev":20040102,"info":{"content":"<p>We decided to go out for a walk somewhere. We went along to first Bibury where we went for a little walk around this quaint village. We then mooched into Cirencester where we looked around the shops a bit, before returning home<\/p>","images":false},"title":{"value":"Cirencester"},"version":1},{"date":{"d":1,"m":1,"y":2004},"datev":20040101,"images":1,"info":{"content":"<img src='images\/years\/2004\/2004_01_01-06-NewYearsDay.jpg' class='diaryImage' alt='Having a good meal' \/><p class='diaryImageCaption'>Having a good meal<\/p>","images":false},"title":{"value":"New Years Day"},"version":1}],"version":837649442}