{"entries":[{"date":{"d":31,"m":12,"y":2005},"datev":20051231,"images":1,"info":{"content":"<p>In the afternoon we had a belated Christmas present opening with the Fars.<\/p><img src='images\/years\/2005\/2005_12_31-02-AtFars.JPG' class='diaryImage' alt='Belated Christmas' \/><p class='diaryImageCaption'>Belated Christmas<\/p><p>In the evening we all went over to Karen and Richard's to see the new year in. It was very nice. Enjoyed the wine, or was it port?, the food a bit hot for Daddy, and of course the boys won the games.<\/p><p>As midnight approached Rachel and Jon performed their 'fire dance' which was superb. Then we let off a dozen fireworks, which woke Katie and Joey (somehow Ben slept through). The evening seemed to go in a flash. It was so nice to relax with friends - sounds so middle aged.<\/p>","images":false},"title":{"value":"New Years Eve Party - Karen and Richards"},"version":1},{"date":{"d":26,"m":12,"y":2005},"datev":20051226,"images":2,"info":{"content":"<p>Ben has got a respiratory infection and the weather is pretty harsh outside, so the traditional 'go to the coast' day was scuppered.... well for mummy and Ben anyway.<\/p><p>Daddy and Katie had a nice day out together at Southend. We parked on the sea front and caught a train to the end of the burnt out pier. We then went on a toy taxi and bus, before sheltering in a cafe for a cup of tea and a glass of water. We braved it out into the shopping centre where Daddy bought a bright pink Barbie coat for Katie.<\/p><img src='images\/years\/2005\/2005_12_26-02-BoxingDaySouthend.JPG' class='diaryImage' alt='Katie with Southend Pier' \/><p class='diaryImageCaption'>Katie with Southend Pier<\/p><p>Helen popped over in the afternoon which was nice.<\/p><p>In the late afternoon the Barnett clan came over for traditional fun and games. Grandma and Granddad were on top, top form providing many inadvertent amusing remarks.<\/p><img src='images\/years\/2005\/2005_12_26-21-BoxingDaySouthend.jpg' class='diaryImage' alt='The Party' \/><p class='diaryImageCaption'>The Party<\/p>","images":false},"title":{"value":"Boxing Day - Southend and Party"},"version":1},{"date":{"d":25,"m":12,"y":2005},"datev":20051225,"images":5,"info":{"content":"<p>Mummy woke us up at 6am to open presents! Of course Katie opened her biggest, the kitchen, before any of the others, which meant she was not interested in any of the others! Any case we opened the presents and the stockings. After a bite of breakfast we made our way early over to the Weston household where the Elders where staying.<\/p><img src='images\/years\/2005\/2005_12_25-07-ChrsitmasDay.JPG' class='diaryImage' alt='Ben opening first present' \/><p class='diaryImageCaption'>Ben opening first present<\/p><p>We all went to church except Daddy, who caught up on some sleep and Uncle Michael who wasn't feeling very well (a dickie tummy).<\/p><img src='images\/years\/2005\/2005_12_25-09-ChrsitmasDay.JPG' class='diaryImage' alt='Mummies and Babies' \/><p class='diaryImageCaption'>Mummies and Babies<\/p><p>... then the main event - Christmas Lunch. A huge turkey, stuffing, parsnips, sprouts, potatoes, etc... A very nice meal prepared by Pop Pop.<\/p><img src='images\/years\/2005\/2005_12_25-11-ChrsitmasDay.JPG' class='diaryImage' alt='It’s a cracker' \/><p class='diaryImageCaption'>It’s a cracker<\/p><img src='images\/years\/2005\/2005_12_25-16-ChrsitmasDay.jpg' class='diaryImage' alt='Turkey-loni' \/><p class='diaryImageCaption'>Turkey-loni<\/p><p>After tidying up and a walk around the block, we opened some more presents. Wow We. Katie absolutely loved handing out all the presents. I think that was the bit she enjoyed more than anything.<\/p><img src='images\/years\/2005\/2005_12_25-24-ChrsitmasDay.jpg' class='diaryImage' alt='Hmm - Not sure about this' \/><p class='diaryImageCaption'>Hmm - Not sure about this<\/p><p>That took a while. We then played some board games in the evening... well DVD games actually.<\/p><p>The busy night ended up with all 4 of us in the same bed together! A bit of a squeeze, but lovely none the less.<\/p>","images":false},"title":{"value":"Christmas Day - The Weston’s"},"version":1},{"date":{"d":24,"m":12,"y":2005},"datev":20051224,"info":{"content":"<p>This year was a bit different. The Fars had gone to Denmark to see Oldemor. The first Christmas for Daddy without the Fars and a Danish Christmas meal :(. We wrapped presents and done some jobs in the morning. Later, Daddy and Katie went to try and find a swimming pool that was open - Farnborough. Daddy managed to smack his nose on the bottom of the pool whilst he was showing off doing a hand stand and slipping! Mummy rushed Ben to hospital as she was worried about his breathing. No problems though.<\/p><p>Steven popped around for a chat and a cup of tea, we went to bed and Daddy attempted to make a Danish Christmas meal. Not a great effort. In the end it was a pork chop, peas, boiled potatoes and caramelized potato.<\/p><p>We left out some milk, a mince pie, a carrot for Rudolph and some Reindeer dust on the front path for Father Christmas. It was so cute to see Katie believe in it all.<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":18,"m":12,"y":2005},"datev":20051218,"images":1,"info":{"content":"<p>We left Daddy at home wrapping Christmas Presents while the rest of us went to church. We went for a little gathering at the Fars, as this will be the last time we see them before they head off to Denmark for Christmas. It was our first chance to pen presents this year! Aunty Susan and Graham were there as well.<\/p><img src='images\/years\/2005\/2005_12_18-05-TheFars.jpg' class='diaryImage' alt='Farmor entertaining Benjamin' \/><p class='diaryImageCaption'>Farmor entertaining Benjamin<\/p><p>After a quick lunch we scooted up to London to see the lights down Oxford and Regent Street's. There was no contest. Regent Street were far better. Katie sat on Mummy's lap in the front so she could see everything. Ben slept all the way and back again.<\/p>","images":false},"title":{"value":"The Fars, Christmas Lights"},"version":1},{"date":{"d":17,"m":12,"y":2005},"datev":20051217,"images":1,"info":{"content":"<p>This year was a little strange. Some of the usual suspects were not able to come. However, we had the usual range of the:<\/p><ul><li>Boys cheating at 'Titles' (and still lost)<\/li><li>The men winning the general knowledge quiz<\/li><li>Tatty prizes<\/li><li>Michael being zonked by one of Daddy's drinks<\/li><li>And the normal, let's take the micky out of Martin..... this time over Ellen Macarthur and Charity Bracelets!<\/li><\/ul><img src='images\/years\/2005\/2005_12_17-06-ChristmasParty.JPG' class='diaryImage' alt='Laura and her troops' \/><p class='diaryImageCaption'>Laura and her troops<\/p><p>Anyway I think all had a good time, cameo appearances were made by Joey, Katie, Ben and Strictly Come Dancing!<\/p>","images":false},"title":{"value":"Annual Christmas Party"},"version":1},{"date":{"d":16,"m":12,"y":2005},"datev":20051216,"info":{"content":"<p>Christmas Dinners this week:<\/p><ul><li><i>Monday<\/i>Mummy, Ma Ma, Karen Teale, Rose Marks\u000a        <\/li><li><i>Tuesday<\/i>Mummy, Barnett’s'\u000a        <\/li><li><i>Wednesday<\/i>Mummy, Frimley Park Hosp. Night Staff\u000a        <\/li><li><i>Thursday<\/i>Mummy, Sarah and Caroline\u000a        <\/li><li><i>Friday<\/i>Daddy - FormScape Development\u000a        <\/li><\/ul>","images":false},"title":{"value":"Christmas Dinners"},"version":1},{"date":{"d":15,"m":12,"y":2005},"datev":20051215,"images":1,"info":{"content":"<p>Daddy took a half day from work and we all went along to the Canal Centre at Mytchett. Ellie, Joey, Caroline, Henry, Sarah and Oliver all came to. We caught a barge that took us 15 minutes up the canal to a wooded area. We followed the tinsel trail to Father Christmas' little helper. We entered his Grotto which was very well made out, with loads of bails of straw to sit on. Father Christmas told some stories, sang some songs and finally gave some presents out. It was really good. Katie was a bit tired, but seemed to be taking lots in. We took the 5 minute walk back to the barge and motored back for a cup of tea and a mince pie.<\/p><img src='images\/years\/2005\/2005_12_15-CanalCollage.jpg' class='diaryImage' alt='This year’s Christmas Tree effort' \/><p class='diaryImageCaption'>This year’s Christmas Tree effort<\/p>","images":false},"title":{"value":"Canal Ride - Father Christmas"},"version":1},{"date":{"d":11,"m":12,"y":2005},"datev":20051211,"images":1,"info":{"content":"<p>Daddy’s football was cancelled due to frost. In the afternoon we had a visit from the Fars and Great Grandma and Granddad. Afterwards we got the Christmas tree up and decorated.<\/p><img src='images\/years\/2005\/2005_12_11-KatieLauraXmasTree.JPG' class='diaryImage' alt='This year’s Christmas Tree effort' \/><p class='diaryImageCaption'>This year’s Christmas Tree effort<\/p>","images":false},"title":{"value":"Decs Go Up"},"version":1},{"date":{"d":10,"m":12,"y":2005},"datev":20051210,"info":{"content":"<p>Both Katie and Benjamin felt a bit ill today, so we weren't able to go out too much today. We did manage to go to the Deepcut Christmas Fare.<\/p>","images":false},"title":{"value":"Illness"},"version":1},{"date":{"d":6,"m":12,"y":2005},"datev":20051206,"first":{"value":"Ben taking Baby Rice"},"info":{"content":"<p>Both Katie and Ben are both developing well. Katie is a bossy little madam, straight out of mummy's mould. She has an excellent vocabulary, very loving, and she can remember things from weeks ago. However, if she doesn't get her own way, then she'll moan until mummy gives in. (which isn't very long). She normally goes to bed at 6:45pm, sometimes it takes a while for her to settle down. She wakes 2 or 3 times a night, until wake up time of anything between 6:15 and 6:45.<\/p><p>Ben is a lot more chilled then Katie was. He does cry and is sick more often, but he has the most gorgeous of smiley faces. He can be entertained by bumping him on your knee and tickling him. He has just become better at sleeping. He's always been good in the early evening - nothing wakes him. He'll then generally wakes at midnight and 5am, give or take a couple of hours!<\/p>","images":false},"title":{"value":"Katie and Ben's Development"},"version":1},{"date":{"d":5,"m":12,"y":2005},"datev":20051205,"info":{"content":"<p>Daddy had a half day and went up with Nick and Martin to London for a couple of beers at the Wellington and Sussex Arms.<\/p><p>Then went off to the main event at Brixton Academy to see the Prodigy. It was mental. Jumping, pushing, chanting. Superb.<\/p><p>Highlights:<\/p><ul><li>Martin's spilling the wine all over the table and most of my meal.<\/li><li>Nick throwing a spoonful of rice over Martin in the restaurant with the waiter watching. He quickly cleared the table!<\/li><li>Goading Nick to come off\/stay on the tube. He didn't make it. The doors shut across his body, he struggles free a bit, but his leg if defo stuck. Needed man off platform to pull him out.<\/li><li>Wiping the stolen rice spoon. 'Sniff and pass it on'<\/li><li>Pool: Nick nil! Buying that James a drink.<\/li><li>The cold, drenched t-shirt at the end.<\/li><\/ul>","images":false},"title":{"value":"Prodigy Gig"},"version":1},{"date":{"d":4,"m":12,"y":2005},"datev":20051204,"info":{"content":"<p>Daddy lost 10-1 at football this morning. We only had 9 men!<\/p><p>In the afternoon we went looking for bulls over the Ranges alongside Red Road. We didn't find one. Still it was a nice walk.<\/p><p>Charlotte was over to stay<\/p>","images":false},"title":{"value":"Ranges Walk"},"version":1},{"date":{"d":3,"m":12,"y":2005},"datev":20051203,"images":3,"info":{"content":"<p>We went down to Portsmouth with Ellie, Charlotte, Michael, Joey, Richard, Karen, John and Rachel. The Christmas Fair was held at the historic dockyard, with plenty of Christmas Stalls. We had a look at some of the boats, went on the merry go round and met Father Christmas.<\/p><img src='images\/years\/2005\/2005_12_03-04-PortsmouthXmasFair.jpg' class='diaryImage' alt='Katie - Spinnaker Tower' \/><p class='diaryImageCaption'>Katie - Spinnaker Tower<\/p><img src='images\/years\/2005\/2005_12_03-13-PortsmouthXmasFair.jpg' class='diaryImage' alt='Daddy, Ben and Father Christmas' \/><p class='diaryImageCaption'>Daddy, Ben and Father Christmas<\/p><img src='images\/years\/2005\/2005_12_03-16-PortsmouthXmasFair.JPG' class='diaryImage' alt='Katie by HMS Victory' \/><p class='diaryImageCaption'>Katie by HMS Victory<\/p>","images":false},"title":{"value":"Portsmouth Christmas Fair"},"version":1},{"date":{"d":27,"m":11,"y":2005},"datev":20051127,"images":1,"info":{"content":"<p>George had an early start. Ben and Daddy watched Match Of The Day, whilst the rest of the house were having a mini lye in.<\/p><p>We headed off to Chatsworth House, which has got to be the most impressive and grand house we've ever seen. It was set with some stunning surroundings. The house inside had lots of Christmas decorations which set a really warm and festive atmosphere.<\/p><img src='images\/years\/2005\/2005_11_27-08-AndrewGeorges.JPG' class='diaryImage' alt='Festive Chatsworth House' \/><p class='diaryImageCaption'>Festive Chatsworth House<\/p><p>Because of the night before and the cold weather, the kids were in bad form. so much so, we couldn't really relax and enjoy the place. Every room had impressive art on the walls and ceiling. We went to the stables which was lovely. There was a Christmas brass orchestra, and plenty of Christmas nik-naks to buy.<\/p><p>Somewhere defiantly to re-visit in warmer times.<\/p><p>After lunch, we made the long journey home. I think we may have put Andrew and George off having children. They were quite hard work.<\/p>","images":false},"title":{"value":"Andrew And Georges - Chatsworth House"},"version":1},{"date":{"d":26,"m":11,"y":2005},"datev":20051126,"images":1,"info":{"content":"<p>We bravely ventured the 160 mile journey up to the Peak District and visited Andrew and George's new, lovely house. It had some fantastic views, and a nice big garden. I'm not sure Andrew and George quite knew what they were letting themselves in for.<\/p><p>Anyway after a spot of lunch we headed into the cold and visited Matlock Farm. It was bitterly cold and empty. The animals in there were enthusiastic to see us and very vocal. Everyone was a scaredy pants and wouldn't stroke or feed the animals. The noisy pigs were Daddy's favourite, the trampoline was Katie's.<\/p><img src='images\/years\/2005\/2005_11_26-04-MatlockFarm-AndrewGeorgeKatieLaura.JPG' class='diaryImage' alt='Ben, Laura, Katie, Andrew and George At Matlock Farm' \/><p class='diaryImageCaption'>Ben, Laura, Katie, Andrew and George At Matlock Farm<\/p><p>We moved on to warmer places in the Caudwell Mill, 10 minutes down the road. We had a nice hot drink and a flap jack, which Katie decided to pour salt over!<\/p><p>We returned to the house and played some games and George made us all a nice dinner. We settled down to watch a bit of tele.<\/p><p>We had a bad night all together. Katie woke Ben up, and Ben woke Katie.<\/p>","images":false},"title":{"value":"Andrew And Georges - Matlock Farm and Mill"},"version":1},{"date":{"d":20,"m":11,"y":2005},"datev":20051120,"info":{"content":"<p>After church and football, Karen and Richard came around for a Sunday roast. We were joined later on by Ellie, Michael and Joey which was nice.<\/p>","images":false},"title":{"value":"Karen And Richard For Lunch"},"version":1},{"date":{"d":19,"m":11,"y":2005},"datev":20051119,"info":{"content":"<p>Daddy went over to Nigel's in Gillingham to change the chain and sprockets on his bike, replace the clutch cable and insert a bolt to secure the front wheel, as well as give the bike a scrub up.<\/p><p>Nigel was superb in helping out. His garage was fantastic.<\/p><p>In the meantime the rest of us went over to Southfleet church for their Christmas Fare where Pop Pop was Father Christmas, which Katie twigged straight away. Anyway she asked for a kitchen for Christmas.<\/p>","images":false},"title":{"value":"Motorbike Maintenance and Christmas Fare"},"version":1},{"date":{"d":13,"m":11,"y":2005},"datev":20051113,"images":2,"info":{"content":"<p>After church we whizzed off to Fishers Farm and met up with Farfar and Farmor. It was pretty cold. Katie, true to form was scared of the animals. Wouldn't go near them let alone touch them. We went for a tractor ride and there were plenty of swings, wendy houses and slides to go on. Katie didn't care much for the big inflatable slide. Always one to say she wants to try things, but when it comes to it, always seems to wimp out. Katie had a go on the boats with Mummy before we all got a bit too cold and returned to the cafe and play area for a cup of tea, cake and soft play.<\/p><img src='images\/years\/2005\/2005_11_13-11-FishersFarm.JPG' class='diaryImage' alt='Farfar and Ben!!' \/><p class='diaryImageCaption'>Farfar and Ben!!<\/p><img src='images\/years\/2005\/2005_11_13-02-BenMartin.JPG' class='diaryImage' alt='Daddy and Ben' \/><p class='diaryImageCaption'>Daddy and Ben<\/p>","images":false},"title":{"value":"Fishers Farm"},"version":1},{"date":{"d":12,"m":11,"y":2005},"datev":20051112,"info":{"content":"<p>In the morning we went off to get baby Grace (Claire and James's new arrival) a little present.<\/p><p>We made some cakes, then went out with Ma Ma and Pop Pop. We had a coffee at the Star pub, then went on to Horton Country park. We had a picnic and went for a nice walk, ending up next to a children's farm. We saw a fake Farfar (big, black pig) in the field!!<\/p>","images":false},"title":{"value":"Horton Country Park"},"version":1},{"date":{"d":10,"m":11,"y":2005},"datev":20051110,"images":1,"info":{"content":"<woops rating=\"7\" woopstitle=\"Loppers and Angle Grinder to Fix Washing Machine\"><p>We had a spot of bother with the washing machine. I tipped it up and the drive belt was lying on the floor. Fitted the belt back on after half an hour of putting the belt on blind. Came off.... came off again! Grrrr.<\/p><p>Needed easier access from the back, so got the angle grinder out. Making good progress, but then a spark hit my eye brow and thought better put some eye protection on. I had no glasses, so turned to my bike helmet. The grinder made a heck of a noise and woke Katie up. Laura brought her down, crying her eyes out, seeing me with an angle grinder, a load of mess and commotion and a bike helmet on! I think I may have given her nightmares that night.<\/p><img src='images\/years\/2005\/2005_11_10-WashingMachneDIY.JPG' class='diaryImage' alt='Holey Washing Machines!!' \/><p class='diaryImageCaption'>Holey Washing Machines!!<\/p><p>Anyway I had to quit the angle grinder and thought how I was going to cut the other two sides. Ended up retrieving the loppers from the garage and cutting my way through the rest. Finally had to make the hole bigger, and eventually fixed it right. The only problem now is that the washing machine doesn't fit flush because the metal bits stick out of the back!!!<\/p><\/woops>","images":false},"title":{"value":"DIY - Washing Machine"},"version":1},{"date":{"d":6,"m":11,"y":2005},"datev":20051106,"info":{"content":"<p>Nick, Martin, Michael and Joey came around to see the mighty reds beat Chelsea. First defeat in almost a year for Chelsea.<\/p><p>Charlotte stayed over the night.<\/p>","images":false},"title":{"value":"Boys Around For Man Utd V Chelsea"},"version":1},{"date":{"d":5,"m":11,"y":2005},"datev":20051105,"info":{"content":"<p>Katie had a great time playing with Ella. Dancing and running around. She actually stayed and watched the fireworks (I think only because Ella was doing that as well).<\/p>","images":false},"title":{"value":"Great Grandma's 80th"},"version":1},{"date":{"d":4,"m":11,"y":2005},"datev":20051104,"info":{"content":"<p>We went over to Istead Rise for Pop Pops firework evening. Needless to say Katie and Ben didn't last very long before crying off!!<\/p><p>Daddy meanwhile went to a quiz night at the football club and came joint first with Farfar.<\/p>","images":false},"title":{"value":"Fireworks and Quiz"},"version":1},{"date":{"d":3,"m":11,"y":2005},"datev":20051103,"images":1,"info":{"content":"<img src='images\/years\/2005\/2005_11_03-02-KatieInTub.JPG' class='diaryImage' alt='Katie in the tub' \/><p class='diaryImageCaption'>Katie in the tub<\/p>","images":false},"title":{"value":"Bathing"},"version":1},{"date":{"d":31,"m":10,"y":2005},"datev":20051031,"images":1,"info":{"content":"<p>We got dressed up with Ella and Auntie Lindey and went 'Trick or Treating' around the Fars, Great Grandma's and Auntie Sues. Ben saw Great Uncle Peter for the first time. We managed a good haul of sweeties!!<\/p><img src='images\/years\/2005\/2005_10_31-KatieHaloweenDress.JPG' class='diaryImage' alt='Spooky' \/><p class='diaryImageCaption'>Spooky<\/p>","images":false},"title":{"value":"Halloween"},"version":1},{"date":{"d":30,"m":10,"y":2005},"datev":20051030,"first":{"name":"katie","value":"Count to 10 (no help, no missing numbers out)"},"info":{"content":"<p>After church we ventured to the London Wetlands Centre. It was a bit disappointing for the admission fee. I guess because of the time of year there weren't that many varieties about. Lots of ponds, pigeons and mallards.<\/p><p>We finished our walk just in time for the heavens to open. We went inside and there were quite a few interactive games and activities for Katie to do. Katie made two smiley faces from paper plates.<\/p><p>In the evening Charlotte came around to stay.<\/p>","images":false},"title":{"value":"London Wetlands Centre"},"version":1},{"date":{"d":23,"m":10,"y":2005},"datev":20051023,"info":{"content":"<p>We went off to church. Daddy and the boys were very naughty and missed football and didn't bother to ring! Daddy feels really terrible for letting the team down.<\/p><p>In the afternoon we went over to Karen and Richards for a lovely Sunday lunch. We went for a walk to the swings and to see the horses.<\/p>","images":false},"title":{"value":"Sunday Lunch Around the Sanders"},"version":1},{"date":{"d":22,"m":10,"y":2005},"datev":20051022,"first":{"value":null},"images":2,"info":{"content":"<woops woopstitle=\"Katie drowning\" rating=\"9\"><p>In the morning we went swimming at the Arena. We got changed and Daddy said he was going to the toilet, however, Mummy hadn't heard. She went in with Benjamin. Katie was unsupervised and had jumped into the swimming pool. Somehow her armbands had come off.<\/p><p>Daddy returned to the swimming pool and Mummy was screaming 'Where's Katie'. We looked around and she was lying on her back, no armbands, scrabbling to keep afloat. A man was over looking and said she was doing well. We just got her in time. Goodness knows how long Katie was like that for. What a scary incident though.<\/p><img src='images\\years\\2005\\2005_10_22-01-drowning.jpg' class='diaryImage' alt='Katie Drowning' \/><p class='diaryImageCaption'>Katie Drowning<\/p><\/woops><p>Anyway we had a good time swimming otherwise and Katie had regained her confidence by the end of the session.<\/p><p>In the afternoon Daddy went off with the boys down to meet up with Charlotte in Bournemouth, whilst the rest of us went to Karen's, with Ellie and Joey.<\/p><p>Daddy felt a bit ill that night!!<\/p><img src='images\/years\/2005\/2005_10_21-00-Benjamin.JPG' class='diaryImage' alt='Bengelmin' \/><p class='diaryImageCaption'>Bengelmin<\/p>","images":false},"title":{"value":"Swimming Disaster and Bournemouth"},"version":1},{"date":{"d":16,"m":10,"y":2005},"datev":20051016,"images":1,"info":{"content":"<p>Daddy had his first full competitive game of the season. A 2 hour slog-a-thon in centre midfield with those awful boots. Anyway it went to penalties and Casuals go through to the next round. The rest of us went to church.<\/p><p>In the afternoon we went for a walk, fed the ducks and played on the swings at Dinton Pastures country park.<\/p><img src='images\/years\/2005\/2005_10_16-01-DintonPastures.jpg' class='diaryImage' alt='Dinton Pastures' \/><p class='diaryImageCaption'>Dinton Pastures<\/p>","images":false},"title":{"value":"Football Marathon and Dinton Pastures"},"version":1},{"date":{"d":15,"m":10,"y":2005},"datev":20051015,"first":{"name":"benjamin","value":"Swimming"},"info":{"content":"<p>Daddy and Katie went over to Farfar and Farmor's to see Joan, Gert, Mads and Sophie who were staying on holiday for a week.<\/p><p>Later that morning we all took Benjamin for his first swim. We went to the Arena. Ben at first cried but then loved noseying around. He took a couple of mouthfuls of water, but he was fine.<\/p><p>Katie was jumping in without armbands and Mummy, reckons Daddy let her go under water for too long. Daddy reckons that is the only way to learn. Anyway Katie seemed OK with it all and loved playing in the pool.<\/p><p>Katie and Daddy done some gardening and went for a long walk to the swings.<\/p><p>Pop Pop, Ma Ma, Ellie, Michael and Joey all came around for dinner and a game of Trivial Pursuit, which of course the boys won. Ma Ma and Pop Pop stayed over.<\/p>","images":false},"title":{"value":"Family Visits and Swimming"},"version":1},{"date":{"d":9,"m":10,"y":2005},"datev":20051009,"images":2,"info":{"content":"<p>Football and Church in the morning.<\/p><img src='images\/years\/2005\/2005_10_09-03-KatieStrawberryDress.JPG' class='diaryImage' alt='Katie's Strawberry Dress' \/><p class='diaryImageCaption'>Katie's Strawberry Dress<\/p><p>We then rushed up to London as we were using Daddy's meal ticket on going to the Rain Forest Cafe, mainly as a treat for Katie. However, she was 'scared' in there. The thunder, the elephants, the guerrillas and even the butterflies frightened her.<\/p><img src='images\/years\/2005\/2005_10_09-02-RainForestCafe.jpg' class='diaryImage' alt='Impression of an Elephant' \/><p class='diaryImageCaption'>Impression of an Elephant<\/p><p>We had a nice meal, quite expensive for what it is though.<\/p><p>We walked along:<\/p><ul><li>Carnaby Street<\/li><li>Soho (which wasn't very appropriate)<\/li><li>Leicester Square (which had some film premiere with Colin Firth and Emma Thompson)<\/li><li>Trafalgar Square<\/li><li>and what felt like most of Mayfair.<\/li><\/ul>","images":false},"title":{"value":"Rain Forest Cafe"},"version":1},{"date":{"d":8,"m":10,"y":2005},"datev":20051008,"info":{"content":"<p>In the morning Daddy and Katie done some gardening for about an hour. Daddy then had his first proper motorcycling maintenance task: Tightening the chain.<\/p><p>Meanwhile mummy was busy putting her hand in the blender whilst making biscuits. She of course panicked and thought her fingers had gone, called her Grandparents to come over. In the end she had a tiny nick!<\/p><p>After lunch Auntie Susan and Farmor came over and we went out to both sets of swings on the estate.<\/p><p>Daddy then went off to watch the England V Austria match with the boys in Wokingham.<\/p><p>The evening was spent watching the Road To Perdition. Daddy gave it 7\/10. Not a nice ending.<\/p>","images":false},"title":{"value":"Visitors and England Game"},"version":1},{"date":{"d":2,"m":10,"y":2005},"datev":20051002,"images":2,"info":{"content":"<p>In the morning Daddy went to lose a Hampshire Cup game 5-3, and the rest of us went to church.<\/p><p>We headed over to Alton for Joey christening, held at St Lawrence church. There were 2 other children being christened. Daddy was a godfather along with Howard and Jenny.<\/p><img src='images\/years\/2005\/2005_10_02-ChristeningKrew.JPG' class='diaryImage' alt='Joseph + Parents + Godparents' \/><p class='diaryImageCaption'>Joseph + Parents + Godparents<\/p><img src='images\/years\/2005\/2005_10_02-JosephChristening.jpg' class='diaryImage' alt='Great Jab Shot' \/><p class='diaryImageCaption'>Great Jab Shot<\/p><p>The service went well and we all headed back to the Elder household for a celebration party. Uncle Michael's speech was ace!!<\/p>","images":false},"title":{"value":"Joseph George Elder - Christening"},"version":1},{"date":{"d":1,"m":10,"y":2005},"datev":20051001,"images":1,"info":{"content":"<p>Daddy made his first serious motorbike trip on the motorway over to Istead Rise. He met up with Pop Pop and Howard and went off to see Charlton V Spurs. They got to the ground early. The atmosphere was good, had good seats and best of all a good match. Charlton were 2-0 up, and then had the match stolen from them, and lost 3-2! Afterwards the boys ventured to Plumbsted Working Men's club for a spot of ale. The motorbike trip home was interesting in the dark and wet!<\/p><p>Meanwhile the rest of us went over to Ellie and Michael's. Michael looked after Katie, whilst the others went to a NCT sale. Katie enjoyed herself and was well behaved!!<\/p><img src='images\/years\/2005\/2005_10_01-BenjaminSmiling.jpg' class='diaryImage' alt='Benjamin Has Just Began Smiling' \/><p class='diaryImageCaption'>Benjamin Has Just Began Smiling<\/p>","images":false},"title":{"value":"Charlton V Spurs - Elders"},"version":1},{"date":{"d":28,"m":9,"y":2005},"datev":20050928,"info":{"content":"<p>Well sort of. Benjamin was put in the cot around 8 or 9 o'clock and woke from 2am to 3am, after which is spent the rest of the night in Mummy and Daddy's room!<\/p>","images":false},"title":{"value":"First Night In Cot"},"version":1},{"date":{"d":25,"m":9,"y":2005},"datev":20050925,"info":{"content":"<p>Church in the morning. We then went with the Elders over to the West’s for Sunday lunch. It was quite an event. Bazza was still half way building the downstairs area, so there was a stud wall and lots of pipes and wires hanging around! Ideal for kids and especially the Gays! Well Daddy almost brought the pipe work down when he stumbled over a bit of stud and went crashing into the pipes with all his weight. Luckily there was a bit of scaffold wedging up the ceiling that stopped him from falling completely over!<\/p><p>The meal was lovely, but if it wasn't Freya crying for food or tiredness, it was Benjamin. Katie was going nuts at being stuck indoors and poor Joey was projectile vomiting big styley.<\/p><p>It was good to see everyone again, but I don't think we're really fit for visiting people.<\/p><p>Both Joey and Freya have got fantastic smiles.<\/p>","images":false},"title":{"value":"Bazza Mayhem"},"version":1},{"date":{"d":24,"m":9,"y":2005},"datev":20050924,"info":{"content":"<p>Auntie Susan had given Daddy some golf lessons for his 30th birthday, and today was the day he was going to take them. He went to the Marriott Hotel where he had 2x45 minute lessons. Daddy has now got a completely new grip, told not to slouch, and told to push the club through. The lessons were other side of a free lunch, anything from the menu, and an uninterrupted listen to his favourite 'Fighting Talk' on Five Live!<\/p><p>He met up with the rest of us who had gone down with Ma Ma and Pop Pop to help Charlotte settle in at her new digs in Abbott Road, Charminster. It's only a 5 minute walk from where Daddy lived 8 or 9 years ago. A trip down memory lane. TIP: Winton high street is rubbish for shopping!<\/p><p>Charlotte has got a nice big house, sharing with 5 others. Her room is small and it was quite a job to fit everything in, but some things have already had to go. We haven't seen the other house mates yet. I think Charlotte, although a little apprehensive, will love the partying down there.<\/p>","images":false},"title":{"value":"Golf and Charlotte Moving In At Uni"},"version":1},{"date":{"d":19,"m":9,"y":2005},"datev":20050919,"info":{"content":"<b>Things that puts a giggle on my chops<\/b><p \/><ul><li>Nothing yet, although tickling the chin or playing nose rubs kinds of makes him smile.<\/li><\/ul><p \/><b>Things that make me sleep<\/b><p \/><ul><li>Being driven in the car<\/li><li>After mummy has given me some booby milk<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>My cuff!!!<\/li><li>Milk<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Shivering my bottom lip when crying<\/li><li>Crying<\/li><li>Being sick<\/li><li>Starring at the banisters or the arm of the swing chair.<\/li><li>Swinging in the swing chair<\/li><li>Sleeping<\/li><\/ul>","images":false},"title":{"value":"Ben at 6 weeks - What I'm like"},"version":1},{"date":{"d":18,"m":9,"y":2005},"datev":20050918,"images":1,"info":{"content":"<p>After church we went down to Brighton for the afternoon. The weather continues in it's fine vain of form. We bought lunch at the Cornish Pasty shop and went to the beach to eat it and watch the weirdo's go by. There were lots of things going on, on the beach from bands playing music, to people playing various sports. It was even hot enough for people to sunbath. Daddy popped off to find some clothes, but found nothing, except for a birthday present for Auntie Susan. The rest of us went for a quick walk along the beach. We hurried back for tea.<\/p><img src='images\/years\/2005\/2005_09_18-02-Brighton.JPG' class='diaryImage' alt='Pasties On Brighton Beach' \/><p class='diaryImageCaption'>Pasties On Brighton Beach<\/p>","images":false},"title":{"value":"Brighton"},"version":1},{"date":{"d":17,"m":9,"y":2005},"datev":20050917,"images":1,"info":{"content":"<p>We headed west towards Bristol Zoo. It was a nice zoo, animals behind glass cages which you could go right up to. Mummy and Katie's favourite animal was the Gorilla (or grilla), Daddy's was the toucan, for its colourful, vivid beak. Benjamin enjoyed the day asleep!<\/p><img src='images\/years\/2005\/2005_09_17-05-BristolZoo.jpg' class='diaryImage' alt='Spot The 'Grilla'' \/><p class='diaryImageCaption'>Spot The 'Grilla'<\/p>","images":false},"title":{"value":"Bristol Zoo"},"version":1},{"date":{"d":14,"m":9,"y":2005},"datev":20050914,"info":{"content":"<p>Daddy has had a few incidents on the bike so far...<\/p><ul><li><i>1<\/i>Dropped bike on to Laura's car whilst trying to get out of the garage. No Damage\u000a        <\/li><li><i>2<\/i>Scratched with handle bars rubbing up against someone else’s car.\u000a        <\/li><li><i>3<\/i>At T-Junction, stopped. No cars around, but just lost balance making bike and myself hit the deck. Must have been comical if someone saw it\u000a        <\/li><li><i>4<\/i>Today managed to make loud sounded skid with my front wheel. Amazing I didn't go over.\u000a        <\/li><li><i>5<\/i>Topped a ton\u000a        <\/li><li><i>6<\/i>Misjudged exit out of work car park. Accelerated too quickly and arc'ed over to other side of the road. Luckily nothing came the other way.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Motorbike incidents so far..."},"version":1},{"date":{"d":11,"m":9,"y":2005},"datev":20050911,"images":1,"info":{"content":"<p>Pop Pop and Daddy started us off very early. It was a lovely peaceful time of day. The sun hadn't risen fully, so we sailed in the half light on a calm Medway, with container depots, gas towers and distant street lamps from Southend as a view. Bliss.<\/p><p>As Mummy, the 'mota, mota' queen had gone back to sleep, we attempted putting the sails up. However, we were going against the tide and were only doing 1.4 knots!!! So 'mota' it was. We sailed passed a huge container ship from Japan that was being unloaded. Absolutely massive. It had at least 12x16x9 (1728) large containers on it. I wonder what was on it. The rest of the crew eventually appeared to enjoy the rest of the cruise. It was a bit cold on deck for Benjamin, but Katie enjoyed waving to other boats and going up and down the steps. 3 hours after we departed Queenborough, we moored in Gillingham Marina.<\/p><img src='images\/years\/2005\/2005_09_11-Ma MaKatie.JPG' class='diaryImage' alt='Yachting is a fun old game' \/><p class='diaryImageCaption'>Yachting is a fun old game<\/p><p>We stopped off for a spot of lunch at Ma Ma's before returning home in the early afternoon. Daddy and Katie went swimming again for over an hour whilst Mummy and Benjamin watched. A very tiring, demand, but enjoyable weekend.<\/p>","images":false},"title":{"value":"Sailing up the Medway and Swimming"},"version":1},{"date":{"d":10,"m":9,"y":2005},"datev":20050910,"images":2,"info":{"content":"<p>Possibly our busiest day ever. We drove down to the coast and first stopped off at St Margaret Bay where we saw the white cliffs of Dover, and threw stones on the beach. Daddy I think enjoyed that more than anyone. He was skimming the stones across the others to see them smash up and rebound in different directions. We say some big boats (ferries). We had our doughnuts before setting off to Deal. It was difficult to park, so we ended up nearly in Sandwich. We found a nice spot on the beach and had our picnic. It was fun to see the waves crashing in, although Katie was a bit scared of them.<\/p><img src='images\/years\/2005\/2005_09_10-StMargretsBay.JPG' class='diaryImage' alt='White cliffs of Dover' \/><p class='diaryImageCaption'>White cliffs of Dover<\/p><p>After our picnic we went to visit 2nd Cousins; Alan, Lynda and Sharon. It was a lovely afternoon in their back garden. It wasn't long before Katie was running around the garden and Alan left to hold Benjamin. Farfar and Farmor turned up a little later on as did Sharon who has now moved in around the corner with Shwan. David has now moved to Hemel Hempstead with his girlfriend. Otherwise the family are fit and well.<\/p><img src='images\/years\/2005\/2005_09_10-LyndaKatie.JPG' class='diaryImage' alt='Lynda playing with Katie' \/><p class='diaryImageCaption'>Lynda playing with Katie<\/p><p>We moved on to the third leg of our day towards the Isle of Sheppey, where we were going to sleep on Ma Ma and Pop Pops yacht. We had dinner at the pub on the corner (Daddy had Muscles). For some reason we all went to bed at about 8:30pm. Daddy began by sleeping outside, before it became too cold. Space was at a premium. Mummy, Katie and Benjamin had a bed to themselves. However, the night was filled with children crying, feeding and wanting cuddles off mummy. Needless to say when the alarm went off at 5:30am there was some relief.<\/p>","images":false},"title":{"value":"White Cliffs of Dover, Deal Beach, Alan and Linda's, On to the Yacht"},"version":1},{"date":{"d":9,"m":9,"y":2005},"datev":20050909,"images":1,"info":{"content":"<p>This week Charlotte has come over to stay for a few days. We've been down to Bournemouth to sort her accommodation out before her nursing course starts in a couple of weeks.<\/p><p>Also this week Daddy received a commendation from work, for all the hard work he has put in recently. He's been given an extra day's holiday and £50 for a meal.<\/p><p>In the evening we battled through the M25 traffic to get to Istead Rise and stayed overnight.<\/p><img src='images\/years\/2005\/2005_09_08-DaFamily.JPG' class='diaryImage' alt='The squad' \/><p class='diaryImageCaption'>The squad<\/p>","images":false},"title":{"value":"Over to Istead Rise"},"version":1},{"date":{"d":4,"m":9,"y":2005},"datev":20050904,"first":{"name":"katie","value":"Stayed up to watch a thunderstorm"},"info":{"content":"<p>Super humid for Casuals first game of the season, lucky 1-1 draw. The rest of us went to church<\/p><p>In the afternoon Daddy and Katie went swimming as Ben and Mummy watched. We popped around to the Fars and played in the back garden for a bit.<\/p><p>During the night there was a big storm with lots of lightening. Katie stayed up to watch it with Daddy for a bit.<\/p>","images":false},"title":{"value":"Swimming and the Fars"},"version":1},{"date":{"d":3,"m":9,"y":2005},"datev":20050903,"info":{"content":"<p>Yet another hot muggy day. We spent the morning at Beddington Park near Croydon where we went for a long walk and of course a go on the swings. We popped into a pub in Whyteleafe before we continued onto 'Auntie Fonas' (as Katie pronounces her) 30th birthday party.<\/p><p>It was good to catch up again with people. Karen and Richard were there as well as Helen and Nigel. 10 out of 10 for Kelly's organization and 11 out of 10 for Fee's mum's super fruit cocktail sticks and raspberry pavalova. Mmmm.<\/p>","images":false},"title":{"value":"Fee's 30th"},"version":1},{"date":{"d":2,"m":9,"y":2005},"datev":20050902,"info":{"content":"<p>Some very practical presents, plus Daddy got Mummy a big bunch of flowers, whilst Mummy gave some nice food treats for Daddy.<\/p><p>A sign of the times, but Mummy and Daddy stayed in to watch a DVD, but both fell asleep in front of it within half an hour!<\/p>","images":false},"title":{"value":"5th Wedding Anniversary"},"version":1},{"date":{"d":29,"m":8,"y":2005},"datev":20050829,"images":2,"info":{"content":"<p>It was another glorious day weather wise. We decided to head down to Bournemouth for another day at the beach. We started off around the shops, before having our picnic in winter gardens, which was nice.<\/p><img src='images\/years\/2005\/Bournemouth-25-2005_08_29.JPG' class='diaryImage' alt='Digging fortresses to stop them Germans' \/><p class='diaryImageCaption'>Digging fortresses to stop them Germans<\/p><p>We then hit the beach where we played in the sea for a bit, then spent ages making a big sea defence wall. However, the sea never made it up to us. After our ice cream we promenaded on the pier before returning home with Fish and Chips!<\/p><img src='images\/years\/2005\/Bournemouth-26-2005_08_29.JPG' class='diaryImage' alt='On the Pier' \/><p class='diaryImageCaption'>On the Pier<\/p>","images":false},"title":{"value":"Bournemouth Beach"},"version":1},{"date":{"d":28,"m":8,"y":2005},"datev":20050828,"images":1,"info":{"content":"<p>Church and football were order of the day. In the evening James and Emma came over to see Benjamin. They are well, and are soon to move into a house in Farnborough.<\/p><img src='images\/years\/2005\/Benjamin-03-2005_08_28.JPG' class='diaryImage' alt='Benjamin Big Boy' \/><p class='diaryImageCaption'>Benjamin Big Boy<\/p>","images":false},"title":{"value":"James and Emma Over"},"version":1},{"date":{"d":27,"m":8,"y":2005},"datev":20050827,"first":{"name":"katie","value":"Wee wee in the potty on my own"},"images":1,"info":{"content":"<p>It was carnage on the Basingstoke Canal today as we went out for Rachel's birthday. We were in the boat with Karen and Richard, and the boys took us into the brambles more times than I care to remember. They were rubbish rowers. Mummy went potty when Daddy stood up in the boat, and Richard got an earful for not turning the boar around. A nice relaxing trip up the canal! Other than that it was quite peaceful and Katie and Benjamin both enjoyed themselves.<\/p><img src='images\/years\/2005\/2005_08_27-09-OdihamRowing.JPG' class='diaryImage' alt='I wish I was on that boat' \/><p class='diaryImageCaption'>I wish I was on that boat<\/p><p>We had a picnic with the rest of the crew, Jon, Jason, Becky, Rachel, Ellie, Joey and Michael at Odiham castle, which was good. We played around the castle ruins all afternoon; hide and seek, and houses.<\/p><p>In the evening, just before bath time, Katie ran up to mummy and showed her the state of the potty. Katie had taken the initiative to wee wee in the potty without us prompting her. Well done Katie.<\/p>","images":false},"title":{"value":"Row Row Row The Boat"},"version":1},{"date":{"d":22,"m":8,"y":2005},"datev":20050822,"info":{"content":"<p>It was Farfar's birthday treat to take Katie out for the afternoon. They went to Auntie Shirley's house in Haslemere where they saw all her farm animals. Although it can't be believed, Katie was a good girl.<\/p>","images":false},"title":{"value":"Katie Out With The Fars"},"version":1},{"date":{"d":21,"m":8,"y":2005},"datev":20050821,"first":{"name":"benjamin","value":"Went to church"},"info":{"content":"<p>Whilst it was Daddy's first game of the season for Casuals, it was also Benjamin's first trip to church. That boy will soon learn. Daddy was busy losing 6-2 with Casuals, although the boys played well in the second half.<\/p><p>In the afternoon Daddy took Katie swimming, and began deflating the arm bands in order for her to try harder whilst floating in the pool. All Katie was interested in was doing full on dives into the swimming pool.<\/p>","images":false},"title":{"value":"First Casuals Game"},"version":1},{"date":{"d":20,"m":8,"y":2005},"datev":20050820,"info":{"content":"<p>We travelled up to Wellplace Zoo in Oxfordshire. It was a small place with many parrots. It wasn't that big, but Katie enjoyed herself. We had our picnic there.<\/p><p>In the afternoon we walked around Henley and had an ice cream by the river.<\/p>","images":false},"title":{"value":"Wellplace Zoo"},"version":1},{"date":{"d":18,"m":8,"y":2005},"datev":20050818,"images":1,"info":{"content":"<p>It was a gorgeous day. Up into the high twenties. So we ventured down to the beach at West Wittering. It took a while to get there. Daddy and Benjamin walked from East Wittering so not to pay the expensive parking! How tight.<\/p><p>Anyway Daddy and Katie had fun in the sea, jumping the waves, making sand castles on the beach and playing with the ball. Katie absolutely loved it and could have spent a whole holiday there. Mummy and Benjamin on the other hand were chilling on the sandy beach. Both Katie and Daddy had a bit of sun burn by the end of the day.<\/p><img src='images\/years\/2005\/2005_08_18-11-WestWittering.JPG' class='diaryImage' alt='Where's the sea gone?' \/><p class='diaryImageCaption'>Where's the sea gone?<\/p>","images":false},"title":{"value":"Down to the Beach at the Witterings"},"version":1},{"date":{"d":17,"m":8,"y":2005},"datev":20050817,"info":{"content":"<p>We returned back home from Istead Rise to see the health visitor for the first time. Benjamin is doing fine and his weight is just under the 91st percentile. He has put on 18 ounces in 12 days! Even Auntie Lat can't compete with that! Only joking Char.<\/p><p>In the afternoon we went over to Frensham Ponds with the Fars and played in the water again, which Katie absolutely loved. She is quite happy to play in the water by herself. She had a routine of running into the water until she falls over, goes back to the beach part where someone has dug a little pool and run in again, and again and again.<\/p>","images":false},"title":{"value":"Frensham Ponds"},"version":1},{"date":{"d":16,"m":8,"y":2005},"datev":20050816,"info":{"content":"<p>Auntie Ellie was going for a job interview at Sainsbury’s so we went over to baby sit Joey. We took him for a walk around the duck pond. He's such a happy, well behaved boy.<\/p><p>We raced over to Istead Rise where we met up with Anna and Helen. We then went to Swanley Park where we went on the train ride, played in the paddling pool, went on the huge playground, went on the ladybird fairground ride and had an ice lolly pop. The weather was scorching.<\/p><p>In the evening we stayed over at Ma Ma's house.<\/p>","images":false},"title":{"value":"Joey baby sit and Swanley Park"},"version":1},{"date":{"d":15,"m":8,"y":2005},"datev":20050815,"images":1,"info":{"content":"<p>In the morning we all met up with Ellie and Joey to do the weekly food shop.<\/p><img src='images\/years\/2005\/2005_08_15-02-KatieJoey.JPG' class='diaryImage' alt='Katie and Joey' \/><p class='diaryImageCaption'>Katie and Joey<\/p><p>In the afternoon we went around to see Mrs Oddie. We felt very sorry for her as she was very lonely and poor. Her house was in a bit of a state. Sad to see. Anyway she held Benjamin all the time we were there which I think made her day.<\/p><p>Later in the afternoon Katie helped Daddy doing jobs around the shops.<\/p>","images":false},"title":{"value":"Mrs Oddie"},"version":1},{"date":{"d":14,"m":8,"y":2005},"datev":20050814,"info":{"content":"<p>In the morning Caroline, Henry and Fiona came over to see little Benjamin, followed by Great Grandma and Grand ad in the afternoon.<\/p><p>Later on we went over to Auntie Lindey's for tea. It was so nice to see Katie and Ella playing nicely together. Ella is a really well mannered, friendly girl. Katie is learning to play with others a bit more nicely now. Top marks on the jelly Auntie Lindey.<\/p>","images":false},"title":{"value":"A few more visits"},"version":1},{"date":{"d":13,"m":8,"y":2005},"datev":20050813,"info":{"content":"<p>In the morning we went over to the Fars. At last Daddy and Katie went on the bike there.<\/p><p>After lunch Daddy stayed home to sort out the mortgage and heating problem, whilst the rest of us went over to the Elders, where Auntie Charlotte, Ma Ma and Pop Pop all were.<\/p>","images":false},"title":{"value":"Over to the Fars, then the Elders"},"version":1},{"date":{"d":12,"m":8,"y":2005},"datev":20050812,"info":{"content":"<p>We had lots of visitors today, who came around to see little Benjamin. Still cards and presents are arriving which is really nice.<\/p><p>In the afternoon Katie had her haircut.<\/p>","images":false},"title":{"value":"A day of visitors, Benjamin's birth registration"},"version":1},{"date":{"d":11,"m":8,"y":2005},"datev":20050811,"first":{"name":"ben","value":"Day trip"},"images":1,"info":{"content":"<p>The Fars came around for their first viewing of Benjamin. They had just got back from seeing Oldemor in Denmark.<\/p><p>We then headed north towards Kidderminster, and had our first proper family day out at a safari park. It was a long old journey, but Benjamin was a good boy sleeping (as per usual) all the way.<\/p><p>After lunch on top of the hill, watching the 'no nos' (rhinos) trot around, we started the drive around the park. It was really good, Katie absolutely loving it. The distinguishing feature about this park was that you were able to feed some of the animals. So there were giraffes and deer poking their heads into cars for food. We really appreciated how big giraffes really are. They are massive.<\/p><p>We then went into the amusements area where there were more animals to be seen, including the hippo lake. Katie's long lasting memory from the day is when she got trapped with mummy with a bat fluttering around them. They both screamed and were very scared. We took a ride on the train and went to the sea lion show. Katie was getting very tired and grumpy so we left before the end for the 2.5 hour trip home.<\/p><img src='images\/years\/2005\/2005_08_11-21-WestMidlandsSafariPark.JPG' class='diaryImage' alt='No nos' \/><p class='diaryImageCaption'>No nos<\/p>","images":false},"title":{"value":"West Midlands Safari Park"},"version":1},{"date":{"d":10,"m":8,"y":2005},"datev":20050810,"info":{"content":"<p>Oldemor had another stroke today. It was quite a mild one, but she was gripping onto cups and glasses very tightly. She came out of hospital within a day.<\/p>","images":false},"title":{"value":"Oldemor another stroke"},"version":1},{"date":{"d":9,"m":8,"y":2005},"datev":20050809,"first":{"name":"katie","value":"Fall down the stairs"},"images":6,"info":{"content":"<p>We were getting rid of so many jobs. Daddy and Katie spent all morning cleaning the car and motorbike which was great fun. Katie decided it would be a good idea to scrub next doors fence as well! After the midwife and lunch we went to meet up with Ellie and Joey for fizzy kids. Katie had loads of fun.<\/p><p>Later on, Katie fell down three quatres of the stairs. It was bound to happen one of these days. She is quite fearless and adventurous at the moment, which is great to see in some respects.<\/p><img src='images\/years\/2005\/2005_08_09-01-Ben4Days.JPG' class='diaryImage' alt='Katie not impressed by Benjamin's crying' \/><p class='diaryImageCaption'>Katie not impressed by Benjamin's crying<\/p><img src='images\/years\/2005\/2005_08_09-02-Ben4Days.JPG' class='diaryImage' alt='Katie thinks Benjamin's crying is funny' \/><p class='diaryImageCaption'>Katie thinks Benjamin's crying is funny<\/p><img src='images\/years\/2005\/2005_08_09-03-Ben4Days.JPG' class='diaryImage' alt='Oh oh. It’s the Katie kiss approach' \/><p class='diaryImageCaption'>Oh oh. It’s the Katie kiss approach<\/p><img src='images\/years\/2005\/2005_08_09-04-Ben4Days.JPG' class='diaryImage' alt='Phew a soft landing' \/><p class='diaryImageCaption'>Phew a soft landing<\/p><img src='images\/years\/2005\/2005_08_09-05-Ben4Days.JPG' class='diaryImage' alt='A nice stroke' \/><p class='diaryImageCaption'>A nice stroke<\/p><img src='images\/years\/2005\/2005_08_09-06-Ben4Days.JPG' class='diaryImage' alt='..and finally a cuddle' \/><p class='diaryImageCaption'>..and finally a cuddle<\/p>","images":false},"title":{"value":"Car wash and Fizzy Kids"},"version":1},{"date":{"d":8,"m":8,"y":2005},"datev":20050808,"info":{"content":"<p>Again in the morning we were all getting over the backlog of jobs that have seemed to have accrued. Mummy and Katie went off for a while down the shops, whilst Daddy had some one on one time with Benjamin. In the afternoon Daddy took Katie off to Coral Reef, whilst Mummy and Benjamin tried to catch up on some sleep. However, the midwife came around. Katie could quite literally spend all day in Coral Reef. She went down the flumes again. Her favourites are the smaller slides which jumps down, goes down backwards or on her tummy.<\/p><p>Barrie, Laura and Freya popped over to see us in the afternoon. Finally we seem to be getting into a routine.<\/p>","images":false},"title":{"value":"Coral Reef"},"version":1},{"date":{"d":7,"m":8,"y":2005},"datev":20050807,"images":1,"info":{"content":"<p>We did jobs on Sunday morning. The boys (that's Daddy and Benjamin!) , typically watched the end of a memorable 2nd Ashes match. England won by 2 runs!<\/p><p>Both Susan and Graham popped over to see us, before Daddy took Katie off for the weekly food shop, back again at the Meadows! Benjamin and Mummy got about half an hours sleep before the midwife came to see us. She said everything looked to be in order. Ellie, Michael and Joseph turned up, as did Uncle John Garratt, Great Grandma and Grand ad, Ma Ma, Karen and Richard.<\/p><p>Benjamin didn't have a good night’s sleep. I think it wasn't until 3 or 4 o'clock before he finally settled down.<\/p><img src='images\/years\/2005\/2005_08_07-23-Ben2days.JPG' class='diaryImage' alt='A south paw then!' \/><p class='diaryImageCaption'>A south paw then!<\/p>","images":false},"title":{"value":"Lots of visitors"},"version":1},{"date":{"d":6,"m":8,"y":2005},"datev":20050806,"info":{"content":"<p>Mummy wanted to come home from hospital as soon as possible, even though the nursing staff wanted her to stay in for 48 hours, due to the 'Strep B'. Daddy and Katie came<\/p><p>She and Benjamin were discharged at about 11am. Daddy went over to Farnborough North to pick up some Hungarians who were interested in Mummy's car. Not only did Daddy pick them up from the station, they also stuck around for 2 hours inspecting the car and sorting out insurance!! Anyway they bought the car for the full asking price and they knew of all the defects, so we were happy to finally sort that out. Afterwards Laura was desperate to get some nursing bra's so Benjamin. So for Benjamin's first outing we went to the Meadows! Great. The meadows on a Saturday with a one day old baby. We also got some provisions in from Tesco before returning home.<\/p><p>Karen was a life saver and brought round dinner (Cottage Pie) which she had prepared at home. I can't say how much we appreciated it, not having a proper meal for a day or so.<\/p><p>Later on in the evening we had visits from Ma Ma, Grandpop, Uncle Howard and Charlotte. A pretty stressful day all in all.<\/p><p>Benjamin slept like a dreamboat. We put him down at 10:30, he woke for a feed at 11:30pm and then went all the way around to 4:30am for his next feed.<\/p><p>We don't think Katie really understands that Benjamin is a part of the family. She gives him kisses and strokes him, and says 'Benjamin wake up!'. She also wants Daddy to take Benjamin in order for Mummy to pick her up. She doesn't have a problem with Joey as such, but mummy and daddy are not given her as much attention.<\/p>","images":false},"title":{"value":"Back Home From Hospital, Selling the car and Shopping"},"version":1},{"date":{"d":5,"m":8,"y":2005},"datev":20050805,"first":{"name":"benjamin","value":"Appearance into the world"},"images":6,"info":{"content":"<p>By 1 o'clock mummy's contractions were back on track and she was taking on gas and air. An examination had taken place. The cervix wall was quite thick, and was only 3cm dilated. Mummy was not happy at this news, thinking that she was going be in for a long labour like Katie.<\/p><p>The contraction were getting stronger and by 2 o'clock mummy was on the pethadene. Daddy was continually giving support, words of encouragement, back massages and more importantly a hand, a finger to squeeze, a neck to strangle, and a face to scratch!!! By 3:30am mummy was pleading for her mother and for an anaesthetist to give her an epidural. The pain was so much mummy was reduced to pleading like a little girl would do for her dollies or something she really wanted. She was desperate for some pain relief. However, the midwives and daddy wanted to steer away from this. By 4:20am, mummy was fully dilated and time had come to push. It was a difficult half an hour, but finally the head popped out after 2 or 3 pushes. It was an amazing sight for daddy to see the little baby's head. However their seemed to be a complication and Daddy was asked to ring the buzzer for outside help. 2 or 3 pushes later the rest of the baby was born, with the umbilical cord wrapped around its head. The cord was cut by the nurse, and as they quickly rushed it over to the ressuitere. Daddy noticed it was a boy. The sister who had joined us give a dose of narcane to resuscitate the baby. Mummy and Daddy were both really worried, but also quite emotional that they had given birth to a baby boy. We were assured he would be OK. A second dose of narcane did bring him round.<\/p><p>He was cleaned up and checked over. Mummy then gave birth to the placenta 5 minutes after Benjamin was born, and then mummy and Benjamin had their first cuddle. Daddy had one as well. He weighed in at a might 9lbs 2oz, but he really didn't look that big.<\/p><p>He didn't look that battered and bruised. He had a slight cone head, and the eyes were puffed up, otherwise he had petite facial features. His hands looked like old mans, his scrotum was swollen and feet were really spread as if his toes were stretched. He had a slight tongue tie, like Katie, and he seems to have two bottom holes, one sealed up. He took to the breast straight away which was a great news.<\/p><p>Mummy then had to have 2 stitches, before we were left alone as a three.<\/p><p>Jane and Vicky were superb midwives, and we were very lucky to have them.<\/p><p>Over the next 4 hours we made our phone calls. The Fars were out in Denmark at the time. Mummy had a bath and we packed up and were ready to move over to the maternity ward. Mummy was settled in, and Daddy returned back home, where Charlotte, Ellie and Ma Ma looked after me. Daddy went to bed to get some sleep for a few hours, whilst mummy done the same. Because mummy had 'Strep B', Benjamin was under close observation. At one point his temperature went right down, so he was wrapped up well and had an electric blanket over him.<\/p><p>Daddy returned with Katie and the Weston girls at 3pm, for their first viewing. At first Katie thought it was Joey lying in the cot, but she soon was told and she gave him a kiss. She was more concerned with hiding in the curtains than seeing Benjamin.<\/p><p>We had Great Grandma and Grand ad, Auntie Sue and Karen come to visit as well. It was chucking out time at 5pm, for rest and meal time. Daddy returned home with me and fed and bathed me before putting me to bed. Daddy fell asleep and was awakened by Karen who kindly baby sat, whilst Daddy returned back to Hospital, going via McDonalds to get Mummy a Big Mac (The hospital food wasn't all that)!!!<\/p><p>Auntie Susan came to visit as well as Laura who had just finished her shift. Daddy left at 9pm, leaving Mummy to look after Benjamin. Benjamin was quite noisy for a while, disturbing the rest of the ward, so mummy got one of the midwives to settle him.<\/p><img src='images\/years\/2005\/2005_08_05-01-Benjamin.JPG' class='diaryImage' alt='First ever picture of Benjamin' \/><p class='diaryImageCaption'>First ever picture of Benjamin<\/p><img src='images\/years\/2005\/2005_08_05-02-Benjamin.JPG' class='diaryImage' alt='Mummy and Benjamin on Labour bed' \/><p class='diaryImageCaption'>Mummy and Benjamin on Labour bed<\/p><img src='images\/years\/2005\/2005_08_05-03-Benjamin.JPG' class='diaryImage' alt='The proud parents' \/><p class='diaryImageCaption'>The proud parents<\/p><img src='images\/years\/2005\/2005_08_05-04-Benjamin.JPG' class='diaryImage' alt='What a big chap' \/><p class='diaryImageCaption'>What a big chap<\/p><img src='images\/years\/2005\/2005_08_05-05-Benjamin.JPG' class='diaryImage' alt='Disco moves' \/><p class='diaryImageCaption'>Disco moves<\/p><img src='images\/years\/2005\/2005_08_05-06-Benjamin.JPG' class='diaryImage' alt='A south paw then!' \/><p class='diaryImageCaption'>A south paw then!<\/p>","images":false},"title":{"value":"Benjamin Alan Uhrskov Gay"},"version":1},{"date":{"d":4,"m":8,"y":2005},"datev":20050804,"info":{"content":"<p>Today started like any normal day. Daddy went off to work, whilst mummy and I had a busy day scheduled. We went off to a country park over towards Leatherhead with Ma Ma, Ellie and Joseph. Mummy was getting mild contractions during the day, but this wasn't unusual over the last few days. Daddy went to football training.<\/p><p>When daddy got back from football training, mummy's contraction begun. She had a bath, but they were becoming more regular and sharper as time went on. We pulled auntie Charlotte from a pub in Gravesend to come and look after me, before mummy and daddy made the trip to Frimley Park Hospital at about 11:30pm. They were given room J, were under the care of student nurse Vicky K and Jane Palmer. They were very friendly and supportive midwives.<\/p><p>Approaching midnight, mummies contractions had in fact eased to one every 5 minutes, and wondered whether going to hospital was really necessary.<\/p>","images":false},"title":{"value":"Into labour"},"version":1},{"date":{"d":31,"m":7,"y":2005},"datev":20050731,"info":{"content":"<p>Today baby Gay No.2 was due. However, just like me, he or she is going to be late. Mummy and Daddy can't decide on a name for a boy. If it is a girl she will be called Charlotte Grace Uhrskov Gay.<\/p><ul><li><i>Daddy's Boy Names<\/i>Kristian\u000a        <\/li><li><i>Daddy's Boy Names<\/i>Jesper\u000a        <\/li><li><i>Daddy's Boy Names<\/i>Benjamin\u000a        <\/li><li><i>Mummy's Boy Names<\/i>Samual\u000a        <\/li><li><i>Mummy's Boy Names<\/i>Thomas\u000a        <\/li><li><i>Mummy's Boy Names<\/i>James\u000a        <\/li><li><i>Mummy's Boy Names<\/i>Adam\u000a        <\/li><li><i>Mummy's Boy Names<\/i>Harry\u000a        <\/li><\/ul><p>Whilst we were at church, Daddy put my animal blind up.<\/p><p>In the afternoon we trekked over to Reading and walked along the Thames and played in this wicked playground. The surface was all sandy and they had water and water troughs to play with. There were some steep slides which I braved!<\/p><p>We then walked into town where the shops were. We bought some treats and a pair of new armbands.<\/p>","images":false},"title":{"value":"Reading"},"version":1},{"date":{"d":30,"m":7,"y":2005},"datev":20050730,"info":{"content":"<p>The weather has been pretty poo all week, and today was no exception. After lunch we went to Coral Reef with Ellie, Michael and Joey. I loved it there. Daddy took me on the big flumes, which I wanted to go on again and again. I loved all the little ancillary pools, in and out, in and out. We even went on the rapid river without being held. I am becoming so confident in the water with the arm bands. Daddy reckons I should now try and actually do some swimming!!!<\/p><p>Afterwards we all went back and had a cup of tea. Farfar popped around in the evening.<\/p>","images":false},"title":{"value":"Coral Reef"},"version":1},{"date":{"d":24,"m":7,"y":2005},"datev":20050724,"info":{"content":"<p>Mummy and I went to church, whilst Daddy went to play golf in the pouring rain with Michael and Martin.<\/p><p>In the afternoon we were supposed to have a family BBQ, but due to the bad weather we had 20 people inside the house, which was pretty manic. Anyway we had a very good time and it was nice to see everyone. Ma Ma stayed over the night.<\/p><p>I got loads of presents including some goldfish from Uncle Martin.<\/p><ul><li><i>height<\/i>88 cm\u000a        <\/li><li><i>weight<\/i>2 stones exactly\u000a        <\/li><\/ul>","images":false},"title":{"value":"2nd Birthday - Family Party"},"version":1},{"date":{"d":23,"m":7,"y":2005},"datev":20050723,"info":{"content":"<p>As my birthday treat we went up to London Zoo. We caught the choo choo train from Woking and then tubed and bussed it to the zoo.<\/p><p>We wandered around the giraffes, then the aviary, penguins, lions, tigers, gorilla and finally the aquarium. I loved looking at all the animals.<\/p><p>The zoo was not nearly as impressive as the other zoo's and safari parks we'd been to. In fact it was quite embarrassing how old and run down it looked. It seemed that only half the enclosures had animals in them!<\/p><p>Still, we decided to walk back to the tube through Regents Park. The Ashes (cricket) was being beamed live from Lords to a big screen in the park, so there were loads of people around. It was a very nice stroll.<\/p>","images":false},"title":{"value":"2nd Birthday - London Zoo"},"version":1},{"date":{"d":22,"m":7,"y":2005},"datev":20050722,"images":5,"info":{"content":"<p>Oliver and I had a joint 2nd birthday party in the back garden. We had Ella, Joey, Summer, Henry, Joshua and of course Oliver playing toys and games in the back garden. Even Daddy managed to come for a bit. I got many nice presents. The party went on for 5 hours, culminating in birthday cakes for the birthday children.<\/p><img src='images\/years\/2005\/2005_07_22-02-KatieBirthday2ndFriends.JPG' class='diaryImage' alt='In My Spanish Dress' \/><p class='diaryImageCaption'>In My Spanish Dress<\/p><img src='images\/years\/2005\/2005_07_22-03-KatieBirthday2ndFriends.JPG' class='diaryImage' alt='Party Food' \/><p class='diaryImageCaption'>Party Food<\/p><img src='images\/years\/2005\/2005_07_22-06-KatieBirthday2ndFriends.JPG' class='diaryImage' alt='Summer Blowing Raspberries' \/><p class='diaryImageCaption'>Summer Blowing Raspberries<\/p><img src='images\/years\/2005\/2005_07_22-11-KatieBirthday2ndFriends.JPG' class='diaryImage' alt='Working down t pit' \/><p class='diaryImageCaption'>Working down t pit<\/p><img src='images\/years\/2005\/2005_07_22-13-KatieBirthday2ndFriends.JPG' class='diaryImage' alt='Preparing For A Game Of Pass The Parcel' \/><p class='diaryImageCaption'>Preparing For A Game Of Pass The Parcel<\/p>","images":false},"title":{"value":"2nd Birthday - My Friends"},"version":1},{"date":{"d":17,"m":7,"y":2005},"datev":20050717,"images":2,"info":{"content":"<p>In the morning we went to church, whilst Daddy went to pick the Fars from their trip to Denmark. They had been moving stuff from Oldemor's flat into her new home.<\/p><p>We decided to split the birthday parties up this year as we felt it might be too much to do one big one. So this is the first of three, which included mummy's and daddy's friends.<\/p><p>We went to Frensham Ponds for a picnic. The weather was absolutely scorching, almost too hot to walk on the sand. Daddy and I played lots in the water.<\/p><p>In the evening mummy was in 'nesting mood' man she was like a machine going around spring cleaning. Me and Daddy just chilled and played.<\/p><img src='images\/years\/2005\/2005_07_17-01-FrenshamPonds.JPG' class='diaryImage' alt='The Crew' \/><p class='diaryImageCaption'>The Crew<\/p><img src='images\/years\/2005\/2005_07_17-02-FrenshamPonds.JPG' class='diaryImage' alt='Playing In The Sand' \/><p class='diaryImageCaption'>Playing In The Sand<\/p>","images":false},"title":{"value":"2nd Birthday - Mummy's and Daddy's Friends"},"version":1},{"date":{"d":16,"m":7,"y":2005},"datev":20050716,"images":1,"info":{"content":"<p>Mummy and I went from Istead Rise down to Eastbourne, whilst Daddy was dying in Michael and Ellie's car. He practically fell out of their car. A bit of a hangover, which soon went after a bit of fresh sea air.<\/p><p>We met up with Grandpop and Howard who are sailing around the south coast at the moment. We walked along the pier, had lunch in a cafe, played on the beach (I loved paddling in the sea), went for a boat trip to Beachy Head, and walked along the promenade to the marina. The weather was perfect and we had a real nice relaxing time.<\/p><img src='images\/years\/2005\/2005_07_16-08-Eastbourne.JPG' class='diaryImage' alt='Eastbourne Beach' \/><p class='diaryImageCaption'>Eastbourne Beach<\/p>","images":false},"title":{"value":"Eastbourne"},"version":1},{"date":{"d":15,"m":7,"y":2005},"datev":20050715,"info":{"content":"<p>Mummy and I went over to see Karen and Summer and stayed over at Ma Ma's house for the night.<\/p><p>Daddy went out with his friends up to London in the afternoon. He met up with Barrie, James, Martin, Nick and Steve at Farnborough station. They met Michael at Waterloo. They then proceeded on a pub crawl, which took in a poker club, mid route.<\/p><ul><li><i>pub 1<\/i>Trafalgar (Waterloo)\u000a        <\/li><li><i>pub 2<\/i>Slug and Lettuce (Bank)\u000a        <\/li><li><i>pub 3<\/i>Weatherspoons (Old Street)\u000a        <\/li><li><i>pub 4<\/i>Gutshot Club - Poker club (Clerkenwell Road)\u000a        <\/li><li><i>pub 5<\/i>Weatherspoons (Old Street)\u000a        <\/li><li><i>pub 6<\/i>Spread Eagle (Shoreditch High Street)\u000a        <\/li><li><i>pub 7<\/i>Japanese selling beer on tap (Shoreditch)\u000a        <\/li><li><i>pub 8<\/i>Browns (Shoreditch)\u000a        <\/li><\/ul><p>The poker club was superb. Really tense because they played against proper players who liked to play strictly to the rules. It was welcoming enough. Daddy lasted longest out of the boys, which wasn't very long really. Dawg, Michael and James even played on an unofficial cash table, whilst the rest of us battled on the chess boards. definitely a place to go back to in the future.<\/p><p>The Spread Eagle was an interesting place with weird looking rockers. A band played some really loud music, which Daddy got into. The others wanted to leave.<\/p><p>The 'crawl' ended sloppily at Browns. The main aim of the game was to avoid putting a quid in the pot!<\/p><p>Managed to catch the last train home. Dawg was well and truly out of it. We managed to almost strip him and tie him to the train seat. A good time had by all.<\/p><p>In the meantime Oldemor moved back from hospital where she was recovering from a broken hip to her new permanent residence in Gentofte.<\/p>","images":false},"title":{"value":"30th Birthday - Boys Night Out and Oldemor Moves To New Home"},"version":1},{"date":{"d":14,"m":7,"y":2005},"datev":20050714,"info":{"content":"<p>Karen had kindly organized a baby shower for us. It was really good fun. Karen's sister and mum, Ma Ma, Charlotte, Ellie, Joseph and Laura came along.<\/p><p>Daddy had gone to the Reading Beer and Jazz festival in Reading with work.<\/p>","images":false},"title":{"value":"Baby Shower - Reading Beer Festival"},"version":1},{"date":{"d":10,"m":7,"y":2005},"datev":20050710,"images":1,"info":{"content":"<p>Daddy's birthday proper. Mummy and Daddy returned back to Istead Rise, after a lovely breakfast at the hotel, whilst I went to church at St Nicholas.<\/p><p>In the afternoon we said goodbye to one set of grandparents and said hello to the other. The Fars met us at Chartwell, Winston Churchill’s home. Daddy and Farfar were really interested looking around the place, learning a bit more about the person. The house was in a lovely setting over-looking south Kent\/East Sussex. There was even a croquet lawn with members playing, which Farfar couldn't resist to go and poke his awe into.<\/p><p>We had a picnic and some birthday cake there and the weather was très hot. Daddy had bad hay fever.<\/p><p>We finally returned home knackered, and a pool of water on the floor. Now the freezer was added to the list of washing machine and boiler which all didn't work. Daddy sorted the dodgy electrics and spent his birthday evening defrosting the freezer!!!<\/p><img src='images\/years\/2005\/2005_07_10-11-BirthdayChartwell.JPG' class='diaryImage' alt='Chartwell' \/><p class='diaryImageCaption'>Chartwell<\/p>","images":false},"title":{"value":"30th Birthday - Chartwell (NT)"},"version":1},{"date":{"d":9,"m":7,"y":2005},"datev":20050709,"images":1,"info":{"content":"<p>Still a surprise, Daddy drove on the M25 dangerously close to Istead Rise. I know, it's going to be a weekend with the in-laws!!! No, well yes for me. At last a rest from the parents, and out with the grandparents who give me loads of treats. We went off to the zoo and played loads.<\/p><p>Meanwhile mummy and daddy went to Blackheath and strolled through the park and around the market, before taking a river cruise up the Thames to Westminster, weaving past an old traditional boat race on the way. From Westminster they caught a bus to Hempstead Heath and walked to the top of the hill with views all over London. The weather by now was heating up.<\/p><p>The next part of the surprise was still to come. We took the 'scenic route' to Kensington where Mummy had booked a 5 star hotel, called The Rembrandt, just opposite the Victoria and Albert museum. It was a lovely hotel, although Mummy wasn't impressed by the upgraded, executive room.<\/p><p>After a little rest, the party moved on to the West End. Due to the bombings earlier in the week and a fire that closed the road in Piccadilly we saw quite a lot of Hyde Park Corner, a place where Mummy doesn't ever want to go back to. Only 10 minutes late for the St Martin's theatre performance of the Mousetrap. It was really good and quaint to be back in the theatre again. Daddy really does enjoy plays so much more than musicals.<\/p><p>The night ended with a stroll around late night London and a pizza from a restaurant in Leicester Square. A very enjoyable day.<\/p><img src='images\/years\/2005\/2005_07_10-04-BirthdayChartwell.JPG' class='diaryImage' alt='Daddy outside the V and A' \/><p class='diaryImageCaption'>Daddy outside the V and A<\/p>","images":false},"title":{"value":"30th Birthday - London"},"version":1},{"date":{"d":8,"m":7,"y":2005},"datev":20050708,"images":2,"info":{"content":"<p>Daddy had a busy week at work, so it was nice for him to go out to the Bee in Windlesham with the Fars. He got a Denmark football training top which was really nice. Unknown to daddy the meeting was contrived. As Daddy was at the pub, we were preparing a surprise BBQ with his friends. Daddy got a shock when he came through the garden gate to see Barrie, Laura, Ellie, Michael, Joseph, Karen, Richard, Martin and Steven waiting for him. Unfortunately it was too late for me. Anyway the BBQ went well, and the evening ended with a race night, which Mummy won.<\/p><img src='images\/years\/2005\/2005_07_08-SlopSuprise.jpg' class='diaryImage' alt='Surprise!!' \/><p class='diaryImageCaption'>Surprise!!<\/p><img src='images\/years\/2005\/2005_07_08-KatieJoey.jpg' class='diaryImage' alt='Cousin Joey' \/><p class='diaryImageCaption'>Cousin Joey<\/p>","images":false},"title":{"value":"30th Birthday - BBQ"},"version":1},{"date":{"d":3,"m":7,"y":2005},"datev":20050703,"images":2,"info":{"content":"<p>Today was a family celebration of Daddy's 30th birthday. We drove to South Kensington after church and me up with the rest of the immediate family.<\/p><p>For some of us younger members it was the poshest restaurant we had been to. Our starters were various pickled herrings, with a boiled egg, topped with caviar! Of course Mummy didn't have any of it, but Daddy absolutely loved it. Daddy and Charlotte had a traditional schnapps to wash this down. Then began the civilized scrum to the buffet section. There was salmon in various guises, halibut, breaded plaice, roast pork, roast beef, frikadeller, dried sausage, ham and salads.<\/p><p>Most of us went up for a couple plates worth. We also had a nice pudding. We hope everyone enjoyed themselves. It was nice that the families intermingled.<\/p><img src='images\/years\/2005\/2005_07_03-02-MartinLauraDenTops.JPG' class='diaryImage' alt='Mummy and Daddy Are Vikings' \/><p class='diaryImageCaption'>Mummy and Daddy Are Vikings<\/p><img src='images\/years\/2005\/2005_07_03-33-LundumsMeal.JPG' class='diaryImage' alt='Mummy and I at Lundums' \/><p class='diaryImageCaption'>Mummy and I at Lundums<\/p>","images":false},"title":{"value":"30th Birthday - Lundums Meal"},"version":1},{"date":{"d":2,"m":7,"y":2005},"datev":20050702,"info":{"content":"<p>We spent the day with the Elders. We went off to the Aldershot Army show where I had a go on some fairground rides, saw a motorbike display team and horsey show. We had a nice picnic.<\/p><p>Later in the afternoon we popped back to Alton then, went over to Basingstoke and assumed that there was free entry to a farm open day. It wasn't, so we made our way to Uncle Martin's BBQ. We had some nice food, but later left for Alton to go to bed.<\/p><p>It was left to the boys (Daddy, Michael, Martin, Nick, Steve, Icey) to play 2 games of poker which Daddy both won. Daddy caught a lift with Nick and slept over at the Fars.<\/p>","images":false},"title":{"value":"Aldershot Army Show and Poker Night"},"version":1},{"date":{"d":28,"m":6,"y":2005},"datev":20050628,"first":{"name":"katie","value":"Wee Wee in the toilet"},"info":{"content":"<p>Mummy had started me on potty training yesterday. 3 we we's on the floor yesterday, as many today, but went one better, as the chocolate sauce was also produced. Just as we were going to give up I done my first wee wee on the toilet.<\/p><p>We had lots of visitors today including, Uncle John Garrett, Ellie, Joey, Laura and Freya.<\/p>","images":false},"title":{"value":"Toilet training"},"version":1},{"date":{"d":27,"m":6,"y":2005},"datev":20050627,"first":{"name":"katie","value":"Fell asleep by myself"},"info":{"content":"<p>Today was the start of a new bedtime regime. No more spending an hour in bed with mummy. We now start in my bed, and daddy reads me scary Hans Christian Anderson stories. After about an hour I finally fell asleep and didn't wake until 7am!<\/p>","images":false},"title":{"value":"Bentime regime change"},"version":1},{"date":{"d":26,"m":6,"y":2005},"datev":20050626,"info":{"content":"<p>We went to Port Lymphe Zoo, with Ma Ma, Pop Pop and lat. Had an ice cream, played in the sand pit. Saw elephants (doing a big poo), rhinos, gorillas and bison.<\/p>","images":false},"title":{"value":"Port Lymphe Zoo"},"version":1},{"date":{"d":25,"m":6,"y":2005},"datev":20050625,"info":{"content":"<p>Mummy and I were over in Gravesend. After Daddy's phone call from Denmark, we went to spend some of Mummy's birthday vouchers in Bluewater.<\/p><p>The 'Strawberry Fair' was being run again at Southfleet church where we helped run the bowls stall. Charlotte and I had tigers painted on our faces which was wicked.<\/p><p>In the evening we chilled out and watched dirty dancing 2, which was the biggest pile of rubbish ever.<\/p>","images":false},"title":{"value":"Mummy's 29th Birthday"},"version":1},{"date":{"d":24,"m":6,"y":2005},"datev":20050624,"info":{"content":"<p>Daddy was still out in Denmark visiting Oldemor in her new, but temporary old people’s home in Husum (Copenhagen). There were some happy and sad moments. Farmor had remarked how spritely and how much more 'with it', Oldemor seemed to be, recalling a story when Farmor had picked up dog muck from her playschool days. We also managed to get her to laugh, and she herself showing her dry sense of humour, teasing Farmor.<\/p><p>There were bits that Daddy found hard to take. When they arrived at the home there was a communal brunch. The woman opposite, looked and behaved half dead, eyes shut, opening a tiny fraction infrequently and not responding to Farmor's hello's. There was another lady shouting and complaining about the service, whilst another was shouting to go back home and wanting her mother. It was desperately sad, and to think Oldemor went off to the zoo just a couple of months ago, and now to be classified with these others.<\/p><p>Oldemor's room is a bit sparse, so Farmor and Daddy put some pictures on the wall, brought some ornaments and of course some flowers to brighten the place up. She has a little hall way, with a wardrobe, a toilet and her room has a window facing some other flats, a TV that she can't operate and an electronic bed. The room could do with some carpet, as it sounds very hollow. Still it is temporary and we can only hope she gets somewhere nicer soon.<\/p><p>Farmor had to leave early on Sunday, so Daddy went over to visit and this time managed to take Oldemor out to Mossel Lake where they had 'cafe og wienerbrød'. It was so nice to see her out and breathing some fresh air, seeing children and others jogging or cycling again. However, on the last day Daddy was there she was getting so much better, that she was confused why she was there. She couldn't understand that she lived there and not at Kaerholmen. Daddy was frequently asked where she lived, and what time are we going back. It was so sad.<\/p><p>Her short term memory is bad at times, but otherwise you could have a normal conversation with her. On the Saturday she may have forgotten that she couldn't walk and tried to get out of the wheelchair and fell to the floor. I just wouldn't like to think how long it took the staff to notice she was on the floor. Many tears were shed. Only after you have been to see her can Daddy appreciate how different Mormor is. Only to think 2 months ago, she had her independence<\/p><p>Still Farmor is going to get back out there again in 2 weeks time. I hope we can go and see her as soon as my brother or sister is allowed to fly. By then she'll hopefully be in more permanent and nicer surroundings.<\/p>","images":false},"title":{"value":"Daddy and Farmor to visit Oldemor"},"version":1},{"date":{"d":19,"m":6,"y":2005},"datev":20050619,"info":{"content":"<p>It was Fathers Day, and Daddy was treated to a lie in and a cooked breakfast in bed! Whilst mummy and I were at church, daddy went to play golf in Crondall with Martin, Dog and Michael.<\/p><p>We went around the Fars for a surprise lunch, then to Frimley Lodge Park for their fun day. We then all rushed over to get the motorbike and watched daddy ride home on it whilst we followed behind.<\/p>","images":false},"title":{"value":"Father’s Day"},"version":1},{"date":{"d":18,"m":6,"y":2005},"datev":20050618,"info":{"content":"<p>Wow, what a hot day. 32 degrees centigrade. We set out in the morning for the next bit of our Thames ride from Sunbury Lock. It was a glorious day, all manner of boats on the river, couples promenading, fisherman camped out and us! All Daddy heard for the first half of the trip was \"picnic\", \"picnic\". Straight out of mummy's mould. Anything that I saw and could say the word, I said: \"Lots of boats\", \"Lovely house\", \"byke\"....<\/p><p>We stopped off just passed Hampton Court Palace for a nice picnic and to wave at some boats. Another pasting of sun cream and we were off again heading eastwards. We made it to Kingston where we popped in and saw James in Clarkes. He said business was down today because it is so hot. He gave us a nice cool, bottle of water before we carried on. \"Annie Van, Annie Van\" was the cry into Daddy's other van. An \"Annie\" is an Ice Cream.<\/p><p>We finally stopped at Teddington Lock for an \"Annie\" and Daddy turned around to cycle all the way back again to where we'd dropped the car off. I think we were by the river for 5 hours or so, and the heat had tired me out.<\/p><p>Daddy and Uncle Howard went over to Chalfont St Giles to look at a motorbike. It was in good nick and they decided to put a deposit down. It is a red, CB500S, T Reg, 22,500 miles.<\/p><p>When they got back they had a nice BBQ to cap off a busy day.<\/p>","images":false},"title":{"value":"Thames Ride Part III, Bought Motorbike"},"version":1},{"date":{"d":12,"m":6,"y":2005},"datev":20050612,"images":1,"info":{"content":"<p>Mummy and I went to church, leaving dad to do jobs.<\/p><p>Because of time pressures now, and the imminent arrival, today is the last time we are doing Mrs Oddie, which is a great shame. However, we have done it for now 3 or 4 years.<\/p><p>Later on we went swimming. Mummy did 16 lengths. Whilst I was on a free reign in the pool.<\/p><img src='images\/years\/2005\/2005_06_12-NewHaircut.jpg' class='diaryImage' alt='Thames Ride' \/><p class='diaryImageCaption'>Thames Ride<\/p><p>In the evening Daddy went to watch Star Wars III with Susan and Graham. He thought it was excellent. 10 out of 10 for entertainment. Defo makes up for the previous three.<\/p>","images":false},"title":{"value":"Church, Last Mrs Oddie, Swimming"},"version":1},{"date":{"d":11,"m":6,"y":2005},"datev":20050611,"images":2,"info":{"content":"<p>Today we cycled from Chertsey to Sunbury lock along the Thames. It was a lovely ride which included getting the expensive ferry across the river at Shepperton (for £5!). There were plenty of rowers out and I loved noseying into other people’s business and seeing the world go past on the bike. Mummy done ever so well considering how pregnant she is. Dad rode back to get the car. Certainly a ride to continue next time.<\/p><img src='images\/years\/2005\/2005_06_11-ThamesRide.jpg' class='diaryImage' alt='Thames Ride' \/><p class='diaryImageCaption'>Thames Ride<\/p><p>After lunch Mummy went for her facial in Camberley, whilst Daddy and I went over to play at the Fars. Again we camped out in the back garden, had some food and went looking for my favourite.... SPIDERS. We didn't actually find any this time.<\/p><img src='images\/years\/2005\/2005_06_11-AtDaFars.jpg' class='diaryImage' alt='Thames Ride' \/><p class='diaryImageCaption'>Thames Ride<\/p><p>I went for my, now traditional bowl haircut later in the afternoon. I look like a dim kid!<\/p>","images":false},"title":{"value":"Thames Bike Ride, Fars, Haircut"},"version":1},{"date":{"d":5,"m":6,"y":2005},"datev":20050605,"info":{"content":"<p>Whilst mummy and I went to church, Daddy went out with Uncle Howard and Farfar to get a helmet, jacket, trousers and boots for the bike. Fully kitted up in red and black. Dented the wallet by another £500! Still at last daddy is in a position to get a bike now.<\/p><p>All the boys came around for a cup of tea. After a late lunch, we went swimming. Daddy lets me free a lot more than mummy. Mummy couldn't watch, so she went to do 16 lengths!! We were very impressed. I impressed Daddy with my kick, kick, kick. I can kick to the side of the pool now.<\/p><p>We popped over to Auntie Susan afterwards, then came home. I was grizzlely because I hadn't had a good night's sleep or an afternoon nap.<\/p><p>Charlotte came over after I went to bed to pick her car up.<\/p>","images":false},"title":{"value":"Motorbike Gear, Swimming"},"version":1},{"date":{"d":4,"m":6,"y":2005},"datev":20050604,"info":{"content":"<p>In the morning we went to look at Motorbike clothes for Daddy, then we realized we needed Uncle Howard's help so went over to Wickes to see him. After we went to get some of my bedroom bed covers and curtains.<\/p><p>In the afternoon we wanted to go to a farm. However, one was shut, the other not open to the public, so we ended up playing in Farnham Park for quite a while. There was a wicked slide there.<\/p><p>We quickly dashed over to see Steven and Joyce and congratulate them on their engagement.<\/p>","images":false},"title":{"value":"Farnham Park, congratulate Steven and Joyce"},"version":1},{"date":{"d":1,"m":6,"y":2005},"datev":20050601,"info":{"content":"<p>£550 later, Daddy passed his motorbike exam first time - As all good riders do apparently!! The test went OK. The examiner seemed to think I had problems going around corners, taking them like an HGV truck would. i.e. swinging out in the wrong direction to give as much space as possible to make the turn. He said he almost failed me for it, but didn't consider it to be bad enough in the end.<\/p><p>Next step is to find a bike, get the helmet, leathers and boots. Sell the white Corolla and away we go!<\/p><p>In the evening the Fars rang up from Denmark to say that they have had a meeting with a doctor, an occupational health and physiotherapist and the outlook doesn't look to hopefully for Oldemor. It would seem she is not making very quick progress with her leg and it would seem she will not be able to walk or stand without a lot of help. It would seem that her days at Kaerholmen have passed, and she will need to go into a home. On the up side she seems happy enough in hospital, if a little tired and confused sometimes. Daddy hopes to go out to Denmark in a few weeks time to see how she is.<\/p>","images":false},"title":{"value":"Motorbike Test Passed and Oldemor's condition"},"version":1},{"date":{"d":30,"m":5,"y":2005},"datev":20050530,"info":{"content":"<p>Daddy went off with Martin, Michael and Richard to play golf at Merrist Wood, whilst us girls went over to do some shopping and to see Auntie Lindey and Ella.<\/p><p>In the afternoon the Elder krew stayed for a BBQ which was yummy.<\/p>","images":false},"title":{"value":"Bank holiday Monday"},"version":1},{"date":{"d":29,"m":5,"y":2005},"datev":20050529,"info":{"content":"<p>Mummy and I went to church leaving daddy to continue decorating.<\/p><p>In the afternoon we went to a National Trust house, Basildon Park. It was quite an interesting stately home, but they are getting a bit same-ish now. Still enjoyed it.<\/p><p>In the evening Daddy went over to Martin's for a BBQ.<\/p>","images":false},"title":{"value":"Basildon Park (NT)"},"version":1},{"date":{"d":28,"m":5,"y":2005},"datev":20050528,"info":{"content":"<p>In the morning we went to see how much further the path went along the Deepcut side of the canal.... as it happens not a lot. Anyway we continued on the Pirbright side and walked along for half an hour or so before turning around and heading back.<\/p><p>We went around to Great Grandma's for lunch. Daddy continued to decorate my new room, whilst the rest of the gang went to see Uncle John Garratt.<\/p><p>In the evening Mummy and I took Charlotte and Ma-ma to Gatwick for their Majorca holiday.<\/p>","images":false},"title":{"value":"Deepcut Walk Pt 2"},"version":1},{"date":{"d":27,"m":5,"y":2005},"datev":20050527,"info":{"content":"<p>Sad, but true. Mummy's idea. Anyway Daddy was up to his usual tricks on the BBQ. i.e. Flames emanating from the gas hose. Karen, Richard, Michael, Ellie and Joseph came over to enjoy the 13 nutters going into the big brother house.<\/p>","images":false},"title":{"value":"Big Brother BBQ"},"version":1},{"date":{"d":22,"m":5,"y":2005},"datev":20050522,"info":{"content":"<p>Managed to get just over 70mph out of the bike today, although was brazing myself a bit going around the shallow corners and battering against the wind. Just love opening that throttle to get some acceleration. At one with the elements!<\/p><p>Mummy and I done church, saw Farmor and Farfar and took Mrs Oddie out.<\/p>","images":false},"title":{"value":"Continued Motorcycling...."},"version":1},{"date":{"d":21,"m":5,"y":2005},"datev":20050521,"info":{"content":"<p>The weather wasn't great today so restricted Mummy and I to only go for some short walks.<\/p><p>Daddy on the other hand was on a 6 hour motorbike training course. In the morning there were showers and blustery conditions so it was quite interesting out on the roads. In the afternoon he progressed onto the 500cc bike which was cool, although didn't go too fast as he was with a girl who was struggling a bit on a 125cc.<\/p><p>Mummy worked a night.<\/p>","images":false},"title":{"value":"On to the 500cc's"},"version":1},{"date":{"d":20,"m":5,"y":2005},"datev":20050520,"info":{"content":"<p>We dropped off the keys to Linda and Mike who were very hospitable and drove along the coast into Torquay stopping at the marina and at Meadfoot Beach.<\/p><p>Proceeding home, we stopped off at the National Trust's, Stourton Gardens and House and walked around the big lake. It was very picturesque, with plenty of colours and smells in the plants and trees. However, I was getting tired and we left for home, via the supermarket to get the weekly food shop.<\/p><p>Overall we had a great holiday. It was so nice to spend some time together as a family without any distractions. We all had plenty of fun and lots of laughs (usually at my expense!!)<\/p>","images":false},"title":{"value":"Back Home and Stourton (NT)"},"version":1},{"date":{"d":19,"m":5,"y":2005},"datev":20050519,"first":{"name":"katie","value":"My first sand castle"},"info":{"content":"<p>We looked around Paignton before catching the 7 mile, steam train trip along the coast to Kingswear. We got a face full of soot when we stuck our head out of the window! We arrived and queued for the passenger ferry across the Dart to Dartmouth. We wandered around the town, sat and had our lunch on a bench by the river side, then caught a river and harbour cruise which lasted an hour. The highlight was seeing the Castle guarding the mouth of the river. It looked pretty dramatic. Dartmouth had a Mediterranean feel with multicoloured, old, houses terraced along the hill, with narrow streets and just local shops. A Refreshing change.<\/p><p>We got the train back to Paignton, entertaining a few grannies on the way.<\/p><p>We jumped in the car, driving back to Dartmouth, kind of killing a pigeon on the way. He flew into the side of the car. I just saw him in my mirrors desperately trying to get out of the busy road. Poor old thing. We left him, assuming he'd be soon run over. The car ferry across the Dart from Kingswear was very basic, a pontoon that was pushed along by a tug. By now the weather was poor. Windy and rainy. We persevered, and surprise, surprise we were the only ones on the beach. Katie made her first sand castle. Daddy got his feet, shoes and socks wet when he tried to clean the bucket in the sea! We didn't stay long and returned home via a fish and chip shop, and flaked out reasonably early again.<\/p>","images":false},"title":{"value":"Paignton to Dartmouth Steam Train and Blackpool Sands"},"version":1},{"date":{"d":18,"m":5,"y":2005},"datev":20050518,"first":{"name":"katie","value":"Stung by stinging nettle"},"images":2,"info":{"content":"<p>We headed west, through the horrendous morning traffic of Totnes towards Dartmoor. We climbed and meandered through the villages of Buckfast, Holne and Two Bridges. We stopped a few times to look at the panoramic views, Dartmoor horses and sheep. One horse turned her back to us and wiggled her bum across the gate. We drove the breadth of Dartmoor, across towards Tavistock.<\/p><p>After two hours we arrived at Lydford Gorge. The NT woman looked a little surprised that we were going to take Katie with us as there were supposedly steep, narrow pathways. We plodded on the 3 mile walk. Katie was in step heaven. Steps up, step down. On the way to the waterfall we were quite high up the gorge. We couldn't see the rapids for all the trees and foliage. We eventually clambered down to see the waterfall which was quite high, but not a great deal of water. The trek back was dangerous in parts and ran along the rapids. There weren't many guard rails, so I was carried a lot of the way. The rapids and scenery were superb. We loved it. It was capped off with Devils Cauldron, which almost like a cave with a waterfall and a lagoon running down to the next set of rapids and lagoon. It was quite spectacular.<\/p><img src='images\/years\/2005\/2005_05_18-LydfordGorge.JPG' class='diaryImage' alt='How much have I enjoyed today?' \/><p class='diaryImageCaption'>How much have I enjoyed today?<\/p><p>After 3 hours of walking we finished the walk. We stopped off for a spot of lunch and a cup of tea.<\/p><p>We drove to Castle Drogo, which was back in Dartmoor again. A bit of a weird place. The last castle to be built in England in 1910-1930. I still didn't quite understand the need for a castle in the middle of nowhere at a time when castles were outdated by 100's of years. We walked around and it was more like a stately home. We spent an hour or so there before returning back to the cottage.<\/p><img src='images\/years\/2005\/2005_05_18-KatiePinkBench.JPG' class='diaryImage' alt='How much have I enjoyed today?' \/><p class='diaryImageCaption'>How much have I enjoyed today?<\/p><p>Here is a list of things I say which make mummy and daddy laugh.<\/p><ul><li>Wee Bomp Lide (Slide, then wee-bomp is the noise of going down and then landing)<\/li><li>'ello boyz<\/li><li>Woosies (sweets)<\/li><li>animols (animals)<\/li><li>Booey (balls or boulders)<\/li><li>hooray, hooray (start of the song hooray-hooray, holi-holiday<\/li><li>Naughty Daddy<\/li><li>Sorry (even when I haven't done something wrong. I was saying sometimes when I went passed people.<\/li><\/ul>","images":false},"title":{"value":"Dartmoor, Lydford Gorge (NT), Drogo Castle (NT)"},"version":1},{"date":{"d":17,"m":5,"y":2005},"datev":20050517,"first":{"name":"katie","value":"Whole day without any sleeps and grizzles"},"images":1,"info":{"content":"<p>The best zoo we've been to. It had a lovely atmosphere, in a lovely setting. Not too busy, clean and lots of animals that were lively.<\/p><p>I absolutely loved all the animals. Fascinated by them all. I think I could have watched the lion, tiger and gorillas all day long. Mummy and Daddy had to drag me away.<\/p><p>The highlight was definitely watching the lion being fed, and hearing his roar on numerous occasions from around the park. It sounded fantastic.<\/p><p>Here are the animals I know and saw today.<\/p><ul><li>Rar (lion, tiger), cheetah, bison, raf (giraffe), tortoise, epbet (elephant), nono (rhino), bear, deer, monya (monkey), zebra, hippo, grilla (gorilla)<\/li><\/ul><img src='images\/years\/2005\/2005_05_17-KatieSmiling.JPG' class='diaryImage' alt='How much have I enjoyed today?' \/><p class='diaryImageCaption'>How much have I enjoyed today?<\/p>","images":false},"title":{"value":"Paignton Zoo"},"version":1},{"date":{"d":16,"m":5,"y":2005},"datev":20050516,"images":2,"info":{"content":"<p>Daddy decided to take the scenic route down to Paignton, going down via the A31!! We stopped off at Bridport to get some lunch and took it with us down to Seatown, a small beach, dwarfed by the Golden Cap on the west side, and equally impressive inclines to the east.<\/p><p>We walked past the moo's to the tip of the first hill, then the second, then the third, Thorncombe Beacon. We planned to have our picnic there, but because of all the dung, there were so many flies we couldn't sit and eat. For some reason we took the pushchair with us, just for that extra test. Mummy done ever so well considering she is 7 months pregnant! By the time we got back to the beach we were sweating buckets.<\/p><img src='images\/years\/2005\/2005_05_16-ThorncombeBeacon.JPG' class='diaryImage' alt='On top of Thorncombe Beacon, Seatown' \/><p class='diaryImageCaption'>On top of Thorncombe Beacon, Seatown<\/p><p>We had our picnic on the beach, touched the water and played at the river\/lake. Trying to hit the Fosters can.<\/p><img src='images\/years\/2005\/2005_05_16-SeatownBeach.JPG' class='diaryImage' alt='Modelling on Seatown Beach' \/><p class='diaryImageCaption'>Modelling on Seatown Beach<\/p><p>Daddy drove as we had a sleep. He still decided to take the scenic route, and went via Sidmouth, which was full of old biddies, on our way to Exeter and finally to Paignton.<\/p><p>We arrived mid afternoon by Linda, who showed us around our cottage. It was a lovely maisonette within the main house grounds. Just right for us.<\/p><p>We popped out for some shopping and went to Torquay and walked along the quay.<\/p>","images":false},"title":{"value":"Torbay Holiday - Setting Off"},"version":1},{"date":{"d":15,"m":5,"y":2005},"datev":20050515,"info":{"content":"<p>Daddy had his first proper motorbike lesson \/ test. Him and 3 others done some training in the car park before hand, then let loose on to the roads.<\/p><p>He rode around Frimley and Farnborough and got up to 50mph!! Anyway he passed. Also he was being used for a DVD about motorbike testing. So he'll become a star!!<\/p><p>In meantime Mummy and I went over to Gravesend to see Clifford's last service at Southfleet church. He's been there for 27 years and married mummy and daddy.<\/p>","images":false},"title":{"value":"CBT Motorbike - Clifford's Last Service"},"version":1},{"date":{"d":14,"m":5,"y":2005},"datev":20050514,"info":{"content":"<p>In the morning we went down to the canal and walked along the Deepcut side of the canal towards Brookwood. We saw the other end of the military area. It was pretty cold for May.<\/p><p>In the afternoon we went down to St. Andrews church fete and met up with Great Grandma and Great Grandpa. Having not liked the bouncy caste before, I now love it.<\/p><p>Afterwards, we popped over to see the Fars at their home.<\/p>","images":false},"title":{"value":"Canal Walk, Church Fete, The Fars"},"version":1},{"date":{"d":8,"m":5,"y":2005},"datev":20050508,"info":{"content":"<p>I was still not feeling great and we all didn't get a good night’s sleep. Anyway Daddy had his traditional 'Old Boys' game of football in the morning. He scored a goal and they won 4-1. A lot of the girlfriends and wives turned up. It was good to see some of the old boys again: Mike, Tim, Pete. We stayed for a while having a drink and having a laugh as usual with Bazza.<\/p><ul><li>He claims that on my birthday that we are going to \"drop Jonah off at a roundabout at one of Barnett's houses for bow\"!!! comprendez?<\/li><li>He found Nemo in Badshot Lea with Doris!!<\/li><\/ul><p>In the afternoon we briefly went over to the Star pub in Leatherhead to celebrate both Michael and Charlotte's birthdays.<\/p><p>I was not in good shape and Mummy had a night shift, so we went to bed early. Mummy and Daddy were getting very worried. I was so hot.<\/p>","images":false},"title":{"value":"Old Boys and Still Got A Temperature"},"version":1},{"date":{"d":7,"m":5,"y":2005},"datev":20050507,"first":{"name":"katie","value":"Got a temperature"},"info":{"content":"<p>Our mission today was to do a bit of a reccy for Daddy's 30th birthday outing with the boys. The plan is to go to Shoreditch and surrounding area for the day.<\/p><p>We caught the tube from Turnham Green and eventually got to Shoreditch and walked around, taking some snaps of local watering holes. We stopped off for a bite to eat, before travelling south of the river to Greenwich, visiting our traditional 'pie and mash' shop and having a gander in the market.<\/p><p>However, I really wasn't on form today. I was extremely quiet, tired and irritable. Mummy and Daddy were worried about me. So we ended by catching a Docklands Light Railway back to the city and got home as quick as possible.<\/p><p>In the evening Ellie and Michael came over to baby sit, whilst Mummy and Daddy went with Helen, Nigel, Fi and Kelly to TGI Fridays in Guildford. Fi told us that she and Kelly are expecting a baby Christmas Time, which is great news. Hopefully another potential friend for Katie and Jesper!! Daddy also was getting put off taking up motorcycling from Nigel and Kelly. The stories they were coming out with worried Daddy a bit.<\/p>","images":false},"title":{"value":"EastEnders and TGI Fridays"},"version":1},{"date":{"d":2,"m":5,"y":2005},"datev":20050502,"images":1,"info":{"content":"<p>We went down and met the Elders in Southsea. We had a picnic and a nice walk along the prom and pier.<\/p><p>In the evening Mummy, Charlotte and myself went down to Gravesend, whilst Daddy and Farfar worked in the front garden trying to level it and reseed parts of the lawn.<\/p><img src='images\/years\/2005\/2005_05_01-SouthseaBeach.jpg' class='diaryImage' alt='Katie On Southsea Beach' \/><p class='diaryImageCaption'>Katie On Southsea Beach<\/p>","images":false},"title":{"value":"Southsea"},"version":1},{"date":{"d":1,"m":5,"y":2005},"datev":20050501,"info":{"content":"<p>In the afternoon we went off to Heathrow to pick Auntie Charlotte, who has been travelling for the past 8 months around Asia, New Zealand and Australia. She's gutted to back and likes the bumming around lifestyle.<\/p><p>We got back home, with the Elders and Daddy done a BBQ. We looked at loads of lovely photos. Great Grandma and Grand ad came around. Charlotte stayed around the night.<\/p>","images":false},"title":{"value":"Charlotte Home Again"},"version":1},{"date":{"d":30,"m":4,"y":2005},"datev":20050430,"first":{"name":"katie","value":"World Cup Event"},"info":{"content":"<p>In the morning we went over to Notcuts as they were opening their new pet centre. To help promote they got some birds of prey in and some bugs. On the way in Dawn French walked behind us. I think she went straight to the restaurant through an officials door.<\/p><p>Anyway I managed to touch a snake, a python!! It was felt like leather. In the new pet centre there was a photographer who took some pictures of us. We thought we might be in the paper.<\/p><p>On the way home, into Dettingen Park, we saw signs for 'World Cup Event'. Intrigued, we went and had a look to see what it was. In the army field, there was an international line-up of orienteer’s! The Danes of course were the best. :)<\/p><p>After lunch we went to Laleham and had a really nice cycle ride along the Thames to the other side of Staines. It was really sunny, and the houses looked lovely along there. Mummy and I played on the swings whilst Daddy cycled back to get the car.<\/p>","images":false},"title":{"value":"Notcuts, Orienteering, Thames Bike Ride"},"version":1},{"date":{"d":24,"m":4,"y":2005},"datev":20050424,"info":{"content":"<p>We had a busy day today. Mummy and I went to church, whilst daddy started on bodging a new shelf in the wardrobe. In fact I was impressed by his DIY this time. It stayed up, and was level!<\/p><p>In the afternoon daddy had a 2 hour motorbike induction lesson. It was great. He learnt:-<\/p><ul><li>first putting the bike on and off its stand. Easier said than done to begin with!<\/li><li>Eventually moved on to actually riding the bike in first gear, for 10 yards.<\/li><li>Then turning around cones<\/li><li>Usage of gears. 1st, 2nd, 3rd and back down again<\/li><li>Finally ended with some clutch control.<\/li><\/ul><p>Very good. Daddy has signed up to take up a full course of lessons. Gulp.<\/p><p>Mummy and I in the meantime were taking Mrs Oddie.<\/p><p>Later in the afternoon, Daddy and I went over to see the Fars. We went for a walk to the pond and back. We chatted to Dave and Rita, next door, Barrie's dad, and finally with Stuart Climpson's parents. It was the first time I spoke to them probably since I was 15 or 16. Stuart has got a little girl, only a month old.<\/p><p>Mummy had a night shift later on. :(<\/p>","images":false},"title":{"value":"Motorbike Training"},"version":1},{"date":{"d":23,"m":4,"y":2005},"datev":20050423,"info":{"content":"<p>We said goodbye to 'Ma Ma' and 'Pop Pop' in the morning.<\/p><p>In the afternoon we went over to the Elders. Me and the boys went down to the local swimming pool. I impressed Daddy on how independent I was in the swimming pool. With my arm bands on I could kick my way back to the steps. Also I didn't need to be help continually. I think I must have drank half of the pool though. Both Daddy and I stayed in there for over an hour which is a record.<\/p><p>Mummy and 'Auntie Ear', went to an NCT sale and got some goodies.<\/p><p>We played round a bit at Ellie and Michael's, had some din dins, bath, the normal routine.... then Mummy and Daddy beat the Elders at Triv! :) We returned home after a nice day late that night.<\/p>","images":false},"title":{"value":"Over to the Elders"},"version":1},{"date":{"d":22,"m":4,"y":2005},"datev":20050422,"info":{"content":"<p>Mummy went out with her side of the family to see Voulez Vous, an Abba tribute band.<\/p><p>Carol and Gerry stayed over the night.<\/p>","images":false},"title":{"value":"Voulez Vous"},"version":1},{"date":{"d":21,"m":4,"y":2005},"datev":20050421,"info":{"content":"<p>Oldemor had a mild stroke this morning. Inger had to get a man to cut the door chain open. Oldemor was still in bed.<\/p><p>She was rushed to Hvidorve Hospital. She is paralysed down one side. All very worrying. Anyway she has still got her mind, and is in good spirits.<\/p><p>Farmor is planning to go out and visit her, Friday week.<\/p>","images":false},"title":{"value":"Oldemor Stroke"},"version":1},{"date":{"d":18,"m":4,"y":2005},"datev":20050418,"info":{"content":"<p>Got an email from David today to tell us that Benjamin Humphreys was born today. Both Louise and Ben are doing fine. Wonderful news, and we're so happy for them all.<\/p><p>That takes this year’s count to 3 so far:-<\/p><ul><li>Freya West<\/li><li>Joseph Elder<\/li><li>Ben Humphreys<\/li><\/ul><p>Still to come are:-<\/p><ul><li>Paul and Sarah Deer (Due in July)<\/li><li>Our baby obviously (Due in July)<\/li><li>Mat and Melinda Barnett (Due in October)<\/li><li>Andy and Kerry Vince (Due in October)<\/li><li>Claire and James Pragassen (Due in November)<\/li><\/ul><p>...and 4 people from my work (Gary, Peter, Andy and Mousan), plus some from Laura's work<\/p>","images":false},"title":{"value":"Benjamin Humphreys Born"},"version":1},{"date":{"d":17,"m":4,"y":2005},"datev":20050417,"info":{"content":"<p>In the morning mummy, myself, Ellie and Joseph went to church, whilst Daddy went to play football over at the polo fields. Uncle Michael almost got into a fight at the football after he fouled someone.<\/p><p>In the afternoon we met up with the Fars and Auntie Susan at Tri Lakes and walked around looking at the farm animals, which was good. The slides that were there were more interesting than the animals. I think I am a slide-aholic!<\/p><p>Later in the afternoon we went to Frimley Lodge Park and met up with the Barnett's for a quick half an hour.<\/p><p>Grandma took back the Micra as Auntie Charlotte is back next couple weeks.<\/p><p>Daddy spoke to Claire on the phone for the first time for probably about a year. It was good to catch up again.<\/p>","images":false},"title":{"value":"Trilakes Farm and seeing the Barnett's"},"version":1},{"date":{"d":16,"m":4,"y":2005},"datev":20050416,"first":{"value":null},"images":1,"info":{"content":"<p>This walk is straight out of Mummy's top organisational, planned mornings.<\/p><p>Daddy drove us over to Carshalton. Even though Mummy had supposedly look up the place where we were going to, she hadn't so we didn't know exactly where we were going. Anyway we eventually found 'The Oak Park', Carshalton. We started walking, but of course Mummy needed the toilet straight away. So we headed towards the cafe first. We now started properly. A lovely park. However, we didn't see much of it as Mummy was convinced that the walk was to take out of the park. So we clambered over the style gate into a farmer’s field. We had to pick Katie up, because where there weren't brambles and stinging nettles, there were deep ruts, nice for you to turn your ankle in! We reached the top of the hill and the views were amazing. The farmer had laid out all this polythene sheeting on his crop of something, I assume to protect it from the local wildlife. On the horizon Highdown and Downview prison could be seen.<\/p><p>No matter, we could see some horses in the next field, so we quickly trotted over to see them. They were enclosed, so we could go close enough to give them a stroke. They were like shire horses. Anyway we decided to get a photo as Katie loved photo's. As Mummy took the photo, daddy step back on to the fence. It was an electric fence!!! Arrgghh. So we have a face of Daddy just when he's being electrocuted. Certainly got the heart racing.<\/p><p>Out of the field we went onto a main road, with no paths, just fast vehicles! Great conditions for a 21 month year old.<\/p><p>We dived into the next field and Mummy made us walk up this hill. Daddy insisted there would be a dead end at the top. Mummy of course doesn't listen to Daddy's expert advice. Of course Daddy was right and 15 minutes later we waded through the long, wet grass back to where we were. The only direction open us was east. However, this was going towards a mobile home park. As we got closer there were kids playing football, with Irish accents. It was like a scene out of Snatch! Anyhow we curbed the foul mouthed boys, covering up Katie's ears and made our way around the back of the estate hoping to reach the main road again.<\/p><p>All of a sudden a pit or bull (or related) came scarpering from the camp, that was it. Mummy too scared to carry on down the path, so we had to go back again this time making our way through the mobile village. We were immediately accosted by some Irish, gyppo kids. \"Who are you?\". Nice. Anyway we hurriedly walked through the camp, back to the main road, then another 20 minute walk back to the park and the car! What a disastrous scenic, relaxing walk.<\/p><p>We drove across to Purley hoping to catch Fi and Kelly. However, we couldn't get hold of them, so sat in Tesco car park, eating a nice lunch that Daddy got us.<\/p><p>We then decided to go down the M23 to the coast. Brighton was the first idea, then Worthing, but finally we settled at stopping at Littlehampton.<\/p><p>We walked by the mouth of the River Arun. There was a small scaled fun fair there. I wouldn't go on the car roundabout ride, finally settling on a 10 minute go on the trampoline. I loved it. Had a great time on there.<\/p><p>We had an ice cream on the beach and walked down to touch the sea, then back again. We walked swiftly back to the car, then back home.<\/p><img src='images\\years\\2005\\2005_04_16-19-Littlehampton.JPG' class='diaryImage' alt='Littlehampton Beach' \/><p class='diaryImageCaption'>Littlehampton Beach<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/wq9MX3HFxDc\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Scenic Walk - Yer Right and Littlehampton"},"version":2},{"date":{"d":11,"m":4,"y":2005},"datev":20050411,"first":{"value":null},"info":{"content":"<p>I'm really developing my language skills at the moment. At least an extra word a day I am learning. \"Solider\", \"Purse\", \"Water\", \"Food\".<\/p><p>I can also string a couple of words together and on Sunday Daddy asked \"How do you do?\" and shock my hand, and I replied \"How do you do?\" back again!!! I say \"Bye Bye Daddy\" when daddy goes off to work now as well.<\/p><p>My favourite toy at the moment is the wooden farm set. I get mummy or daddy to get bread so I can feed it to the wooden ducks!<\/p><p>I love to play at the swing park and going to farms.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/kUbe37vGCJ4\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"My Development"},"version":2},{"date":{"d":10,"m":4,"y":2005},"datev":20050410,"info":{"content":"<p>Today we split into two camps. The girls went to church and then on to a nice zoo in Hounslow before trekking back down to Alton.<\/p><p>The boys on the other hand met up with Nick and Martin and went off to the Superbikes at Thruxton. It was a great day out. We stood by the 'complex'. a series of S bends. We saw a number of off's including a double off, where one rider was none too pleased and started to punch the other rider whilst they had their helmets on. The stupidest thing you'll likely to see.<\/p><p>We also managed to see a pastie get smashed up, for other reasons!<\/p>","images":false},"title":{"value":"Superbikes and Hounslow Farm"},"version":1},{"date":{"d":9,"m":4,"y":2005},"datev":20050409,"info":{"content":"<p>In the morning we went a different way to get to IKEA, Wembley! We were looking for ideas and bits for Katie's new room. Our new arrival will have Katie's current room. We were thinking of decorating it in a jungle theme seeing Katie loves animals. However, our trip was unsuccessful. Coming out with just a plant, and a hot dog each! I loved playing on all of the furniture and the IKEA slide.<\/p><p>After our sleep, the Elders came over. They got a really rubbish film out for us to watch, which we gave up on. They stayed over the night.<\/p>","images":false},"title":{"value":"Elders Over"},"version":1},{"date":{"d":8,"m":4,"y":2005},"datev":20050408,"info":{"content":"<p>At last we invited the Sanders over for a meal..... well mummy concocted a curry dish of sorts. Actually it was very nice.<\/p><p>We have learnt from today's lesson:<\/p><ul><li>that mummy's 5 times table isn't great.<\/li><li>Mummy can't add up or multiply simple numbers without using her fingers.<\/li><li>Mummy wonders when fire was invented!<\/li><li>How many pennies in £100?<\/li><\/ul><p>I forget the other classics. Not the brightest tool in the box. :)<\/p>","images":false},"title":{"value":"Sanders Over"},"version":1},{"date":{"d":4,"m":4,"y":2005},"datev":20050404,"info":{"content":"<p>Mummy got the date wrong for Bubpups second scan. So we all rushed to the hospital. Thankfully the baby appears to be healthy, even larger than normal. Mummy is hoping it's not going to be too big!<\/p><p>We finally got the key sorted out on Corolla at a cost of £270! Daddy is wanting to take up motorcycling again.<\/p>","images":false},"title":{"value":"Scan No.2"},"version":1},{"date":{"d":3,"m":4,"y":2005},"datev":20050403,"info":{"content":"<p>Had church in the morning. After a delicious Sunday lunch we headed over to Alton and met up with the Elders. We walked over to the Watercress line where we saw a train with a Thomas face on it. Not sure which of the steam trains out of Thomas The Tank Engine it was supposed to be. Anyway Katie enjoyed it. We walked back, getting a messy chocolate ice cream on the way<\/p><p>We headed over to Martin's for the grand releasing of his fish into his new pond. There was a nice BBQ and we met up with Martin's mother, sister, her boyfriend, Barrie and Laura and a few of his neighbours.<\/p>","images":false},"title":{"value":"Steam Trains and Fish Releasing BBQ"},"version":1},{"date":{"d":2,"m":4,"y":2005},"datev":20050402,"info":{"content":"<p>It was a nice weekend's worth of weather. In the morning we quickly went over to see Farfar for a cup of tea and to pick up the National Trust tickets.<\/p><p>We went to Jacobs Well first to play at a really good swing park, before moving on to a National Trust place in Guildford called Dapdune Wharf. It was quite a small site. We went on a lovely boat trip up and down the Wey Navigation to the centre of Guildford and back again. It was so relaxing and peaceful and Katie loved looking out.<\/p><p>After wandering around the mini Island, we went home for lunch and a sleep.<\/p><p>Later in the afternoon we went over to Chertsey to watch them play Kingsbury. We won 2-0. Both teams were reduced to 10 men. It was nice to see a lot of old faces down there. Carol, Mervyn, Clive and Pat in particular.<\/p><p>After dinner Daddy went out with Martin and Nick to Reading for a bit of pub crawl. They had a bit of a games evening. Playing pinball, pool and table football.<\/p>","images":false},"title":{"value":"Dapdune Wharf, Chertsey and Reading"},"version":1},{"date":{"d":28,"m":3,"y":2005},"datev":20050328,"first":{"value":null},"images":1,"info":{"content":"<p>We done the Monday food shop in the morning. It was nice a quiet in Asda.<\/p><p>Daddy drove up to Turnham Green where we caught the tube to Kensington High Street and proceeded to walk to Hyde Park. We fed the ducks and had some lunch ourselves, before trotting over to the Natural History Museum. Because it was a bank holiday it was packed inside. The queue for the Dinosaur section was too long for us to queue for. Daddy felt the exhibits were a bit out dated now. Katie kind of enjoyed it, seeing all the animals, even though they were stuffed or sprawled on display.<\/p><p>We walked across to South Kensington tube and had an Ice Cream. I just love my Callipo's. Belisimo!<\/p><p>We caught a very crowded bus to Green Park. Walked through to St James's park and watched the wildlife, and played in the playground for a bit. I enjoyed the slide and swing. I even played in the massive sea of sand. Before now I've always been a bit wary of sand.<\/p><p>We had done quite a bit of walking today...... We walked back up through Pall Mall and caught a bus back to Hammersmith, where we got the tube back to the car and then home.<\/p><p>Running a bit late, Farfar came around for dinner, as Farmor had left yesterday for Copenhagen. A long day.<\/p><img src='images\\years\\2005\\2005_03_28-01-StJamesPark.JPG' class='diaryImage' alt='The swings in St. James Park' \/><p class='diaryImageCaption'>The swings in St. James Park<\/p>","images":false},"title":{"value":"Natural History Museum"},"version":2},{"date":{"d":27,"m":3,"y":2005},"datev":20050327,"info":{"content":"<p>We were having the Weston's over for a spot of Easter lunch. We frantically got everything ready, including setting up a Easter Egg hunt in the back garden. 44 eggs to hide in a sparse garden!<\/p><p>It was a lovely lunch. Strangely enough I managed to find most of the eggs in the back garden! Later on we moved on to the Great Grandparents house to meet with the rest of the Barnett family. It was lovely afternoon. Daddy took me to the swings behind Great Grandma's house.<\/p>","images":false},"title":{"value":"Easter Egg Hunt"},"version":1},{"date":{"d":26,"m":3,"y":2005},"datev":20050326,"info":{"content":"<p>We had a bit of a nightmare day really. In the morning we went to Maidenhead to get Mummy a new car. Before hand we went to the river and fed the ducks. We finally got Mummy's car at £2250. Mummy and Daddy had a big row, but made up by the evening.<\/p>","images":false},"title":{"value":"Bought New Corolla"},"version":1},{"date":{"d":25,"m":3,"y":2005},"datev":20050325,"info":{"content":"<p>Mummy's car key is on the verge of cracking in two. In fact we've had a lot of hassle this week over the key. We've spoken to Toyota and they say it'll cost £300 to fix! Daddy sought alternatives even going to a welder at 6am to see if we could do a cut n'shut job on it. No luck. The key is stuck in the ignition at the moment!<\/p><p>Anyway once the key and ignition barrel have been replaced we are going to sell the car. The idea is to get Mummy and new 5 door car so that it is easier for the family to get around. It'll be tough to get 2 kids in a three door car. Anyway in the morning we decided to clean the Corolla together. Katie was more interested in scrubbing the road and fence than the car. But it must of been heaven for her, helping mummy and daddy doing the cleaning!!<\/p><p>In the afternoon Daddy and I went around to the Fars by bike, cutting through the woods. It was the first time this year that I went on the bike and I loved it. Daddy was bit worried if I was or not. I definitely don't like having the helmet on my head. I think I spent most of the time trying to get it off!<\/p><p>Later on in the afternoon we had a meal. Auntie Susan and Graham turned up to. It was a Danish meatloaf meal. Very nice.<\/p><p>We found out that Mat and Melinda are pregnant with their first. due date is sometime in October.<\/p>","images":false},"title":{"value":"What a Cracking Key"},"version":1},{"date":{"d":20,"m":3,"y":2005},"datev":20050320,"info":{"content":"<p>In the morning Daddy played in a good game of football against top place, Bentley and drew 2-2. Mummy and I went to church.<\/p><p>In the afternoon we took Mrs Oddie out. We felt so sorry for her, especially when Mummy had to say that we were giving up taking her. She had sellotaped her sandals, where they had broken. Poor lady.<\/p><p>We walked over to the park and played there for a while. I was going down the slide head first! I'm such a brave girl.<\/p><p>We went around to Karen and Richards for a Sunday meal. It was lovely.<\/p>","images":false},"title":{"value":"Karen and Richards"},"version":1},{"date":{"d":19,"m":3,"y":2005},"datev":20050319,"first":{"value":null},"images":2,"info":{"content":"<p>Some of my big teeth are starting to come through now which has meant I've been grotty for the past day or so. The weather had turned a couple of weeks ago from snow and prolonged freezing temperatures to 20 degree sunshine, shorts and t-shirt weather.<\/p><p>I'm getting into the habit of waking between 5:30 and 6am in the morning at the moment! Mummy insists on her way of parenting, and daddy wants to do it differently! Mummy wins out at the moment. She'd da boss.<\/p><p>We were heading for the beaches of Bournemouth, stopping in at the Queen Mary collage to book up Katie's swimming lessons. However, we think due to teething, I was not having a good time of it. Then mummy came up with the idea of going to Marwell Zoo. Surprisingly Katie seemed to understand that we were going to a zoo and cheered up no end.<\/p><p>We got in and first headed towards to penguins, the giraffes and various other animals. After lunch we saw zebras and tigers which I loved. \"Hi Ya\", \"Hi Ya\".. Hor Horrr. There were loads of animals, and it was good to see them actually move around, and see them close up as well.<\/p><p>We managed to get to the far end of the park. We had done a lot of walking and it was getting quite warm, so we had ice creams. I had a Callipo which I dropped on the floor. That was it. I was so upset and distressed, coupled with my tiredness, I was inconsolable. We had to head out of the park.<\/p><p>As Alton was kind on our way home, we decided to pop in and see the Elders on the way home. We stole a cup of tea from them, said hello to Joseph, before getting home for tea and bath time. It was a long, and very enjoyable day.<\/p><img src='images\\years\\2005\\2005_03_19-15-MarwellZoo.JPG' class='diaryImage' alt='Picnic at Marwell Zoo' \/><p class='diaryImageCaption'>Picnic at Marwell Zoo<\/p><img src='images\\years\\2005\\2005_03_19-18-MarwellZoo.JPG' class='diaryImage' alt='Smile Katie' \/><p class='diaryImageCaption'>Smile Katie<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Vmtf78P27bs\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Marwell Zoo and the Elders"},"version":3},{"date":{"d":17,"m":3,"y":2005},"datev":20050317,"first":{"name":"katie","value":"Said my name - KATIE"},"title":{"value":"Katie said her own name"},"version":1},{"date":{"d":12,"m":3,"y":2005},"datev":20050312,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning mummy went off again to another toddlers sale, this time with Lorraine. Daddy and I first went to do the recycling together. This took us ages, but after 40 minutes we ventured into Sainsbury’s to get some fruit for super juicing. As a treat for being a good girl daddy then took me over to Frimley Lodge park and played on the adventure playground. Off course 'bubby' came along to. It was pretty cold, and we went home to meet up with Mummy and have some lunch.<\/p><p>After my sleep, mummy and I went to Gravesend to go to the Barn Dance which was organised by Grandma in aid for the Anthony Nolan Trust. I absolutely loved it there. Dancing until gone 9 o'clock.<\/p><p>Daddy on the other hand went out to celebrate Steve's second 30th party. One for his friends this time. It was held in Reading and it was good to see some old faces again. There was Daddy, Barrie, Michael, Martin, Phil Rowe and Anna, Martin Bigg, Steve Laidlaw and his girlfriend, Chris Lomas, and of course Steve and Joyce.<\/p><img src='images\\years\\2005\\2005_03_12-02-KatieFairyOutfitSmaller.JPG' class='diaryImage' alt='Katie in her fairy outfit' \/><p class='diaryImageCaption'>Katie in her fairy outfit<\/p>","images":false},"title":{"value":"Barn Dance and Stevens 30th in Reading"},"version":2},{"date":{"d":8,"m":3,"y":2005},"datev":20050308,"info":{"content":"<p>We went over with the Elders to Chertsey. The girls and Joseph went over to Staines town centre to have a look around and we were quite impressed. The boys on the other hand went to the auctions at Chertsey. Uncle Michael bought some stuff, some of it unfortunately broken. Daddy bought 27 hard disks for £20, and a DAB radio for £12.<\/p>","images":false},"title":{"value":"Chertsey Auction"},"version":1},{"date":{"d":5,"m":3,"y":2005},"datev":20050305,"first":{"value":null},"images":3,"info":{"content":"<p>We had a busy day today. In the morning mummy went off to an NCT sale and bought me a Dyson and cleaning trolley! I absolutely loved them. Daddy and I on the other hand went off first to the library to pick some new books up, then off to collect Farmor’s mother’s day present from the sorting office. We popped into see Farfar on the way home.<\/p><p>After lunch we drove up to Syon Park in Brentford. We went to the butterfly house which was amazing at first when the butterflies didn't come close. There were so many, and they weren't afraid of us. Daddy picked a few of them up. Some were very colourful, whilst others were difficult to see as they were camouflaged. There was also a small aviary and some fish. The leaf cutting ants were amazing. Watching them go along with bits of leaf on their back. All was not well, when they came fluttering towards me. I only last 10 minutes at a time before I cried too much. I think I have the same phobia as mummy.<\/p><p>We spent about an hour in their in total. Next door was an aquatic centre. It was brilliant in there as well. We saw giant tortoises, monkeys, big fish, and there was a man showing off all the animals in the cages to the children there. He got out a millipede, a scorpion and finally a big boa constrictor snake. Of course I was too scared to touch them myself. However, I did have a good wander around and almost inadvertently touched the snake as the man was presenting! In both places we visited the climate was very warm and humid. Daddy went onto one of the chairs and tried to have a snooze for 20 minutes. It was so nice to hear all the different animals. It sounded like a jungle.<\/p><img src='images\\years\\2005\\2005_03_05-ButterflyPlace.jpg' class='diaryImage' alt='Syon Park' \/><p class='diaryImageCaption'>Syon Park<\/p><p>Soon after we returned home, Grandma, Grandpop and Uncle John Garratt came around to see me. They showed off their recent New Zealand photos off.<\/p><p>Today was cousin Steven's 30th birthday. Mummy and Daddy went down to the Quays to celebrate it with him and the Barnett family, whilst Auntie Susan came around to baby sit me. He got lots of presents. They had a meal and a nice time.<\/p><img src='images\\years\\2005\\2005_05_03-24-Steve30th.jpg' class='diaryImage' alt='Steve's 30th' \/><p class='diaryImageCaption'>Steve's 30th<\/p><img src='images\\years\\2005\\2005_05_03-57-Steve30th.jpg' class='diaryImage' alt='Daddy and nephew Joey' \/><p class='diaryImageCaption'>Daddy and nephew Joey<\/p>","images":false},"title":{"value":"Syon Park and Dawgs 30th"},"version":3},{"date":{"d":27,"m":2,"y":2005},"datev":20050227,"info":{"content":"<p>Ellie and Joseph came with us to church, whilst daddy and Michael went to play football. Uncle Michael scored an own goal as they lost 3-2!<\/p><p>In the afternoon we went around to the Fars where Ron had Sunday lunch and stayed for the afternoon. He such a laid back, nice man. He stayed for about 6 hours.<\/p><p>At the moment my favourite thing is a program called '64 Zoo Lane', or as I know it 'six-six'. I love playing on the CBeebies site as well. I am a little bundle of joy, so mummy and daddy say.<\/p>","images":false},"title":{"value":"Uncle Ron"},"version":1},{"date":{"d":26,"m":2,"y":2005},"datev":20050226,"info":{"content":"<p>It's still cold and snowy. In the morning we went in to Camberley to sort some bits and pieces out and done the recycling which took about half an hour. We've taken the house off the market now as well.<\/p><p>In the afternoon, after mummies and my sleep, we went over to Basingstoke to swim at the Queen Mary College. This is where we've just signed up for swimming lessons for me, for after Easter. Apparently they are a very good swimming school.<\/p><p>Mummy had a night shift, whilst daddy and Farfar were on the computer until midnight sorting out family tree stuff.<\/p>","images":false},"title":{"value":"Swim"},"version":1},{"date":{"d":22,"m":2,"y":2005},"datev":20050222,"first":{"name":"katie","value":"Real Snow Experience"},"images":2,"info":{"content":"<p>Today I went out on the park to play in the snow. However, I hated being on the snow and wanted to get straight off it. When we returned the pavement, I wouldn't move until all the snow was removed from my boots!!! Once that was done, I put my arms up and said 'Cold', 'Cold'!<\/p><img src='images\/years\/2005\/2005_02_23-KatieInSnow.jpg' class='diaryImage' alt='In the snow' \/><p class='diaryImageCaption'>In the snow<\/p><img src='images\/years\/2005\/2005_02_24-06-Katie.jpg' class='diaryImage' alt='Looking Up' \/><p class='diaryImageCaption'>Looking Up<\/p>","images":false},"title":{"value":"Snow"},"version":1},{"date":{"d":20,"m":2,"y":2005},"datev":20050220,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy got up at 5:45am to take David finally to Heathrow. Today he was emigrating to Australia. Louise went a couple of weeks ago and has found a house, and has setup things.<\/p><p>Daddy tried to make sure they had a laugh on the way to the airport, to avoid any thought, or emotions. They checked in and waited for James and Joshy. They came and they all sat in the coffee shop and had a laugh for an hour or so. Finally it was time to see David go through the departures gate. I wonder if we'll see him again? I hope so. We defiantly would love to go to Australia. The only problem is having young kids and the expense. I'd want to make sure if we are spending loads of money, that the kids will be old enough to remember the trip.<\/p><p>Afterwards Daddy wet over to the Fars to help with replacing one of the sides of the gardens fences. It was bitterly cold. Zero degrees (as snow was falling at some points).<\/p><img src='images\\years\\2005\\2005_02_05-03-ReplacingFences.jpg' class='diaryImage' alt='Fencing' \/><p class='diaryImageCaption'>Fencing<\/p><p>On the other hand me, mummy, and the Elders went to Heathrow to welcome back the Weston trip to New Zealand. They had a great time out there.<\/p><p>We also took Mrs Oddie to see her son in the afternoon.<\/p><p>In the evening mummy and daddy watched Maverick, which was a nice, easy film to watch.<\/p>","images":false},"title":{"value":"David Emigrates, Fencing, Weston's Home From NZ"},"version":2},{"date":{"d":19,"m":2,"y":2005},"datev":20050219,"info":{"content":"<p>In the morning mummy and I went with Lorraine and Joshua to a sale at the Catholic church. Daddy on the other hand was helping shift some dishwashers from David's 3rd floor flat. Nice! It was strange to see the flat all empty. David had been there since 1978! He was emigrating to Oz.<\/p><p>Ellie, Michael and Joseph came around for a greasy lunch and spent the early part of the afternoon around, chatting and mucking about. It was Daddy's first proper cuddle with Joseph. He sleeps during the day and is awake at night. He looks a lot like Uncle Michael.<\/p><p>In the evening Daddy sorted out the new DVD recorder.<\/p>","images":false},"title":{"value":"David Clear Out, Church Sale, Elders Over For Lunch"},"version":1},{"date":{"d":14,"m":2,"y":2005},"datev":20050214,"first":{"name":"katie","value":"Valentines Card (from Joshua)"},"info":{"content":"<p>Mummy and Daddy exchanged cards and presents. Mummy got a lovely silver necklace. Daddy got a pound shop t-shirt!! I got a card from Joshua next door which was very nice. My first Valentines card.<\/p><p>Farmor came around to baby sit, whilst the adults went out to the Villa Romane in Frimley. It was a nice night out.<\/p>","images":false},"title":{"value":"Valentine’s Day"},"version":1},{"date":{"d":13,"m":2,"y":2005},"datev":20050213,"info":{"content":"<p>No football this week. Mummy and I went to church though. In the afternoon we went over to see the Fars which was nice. I was impressing them how I could count. Well I can randomly say 2 and 6! Six is my favourite. And I know who Farmor and Farfar are now.<\/p>","images":false},"title":{"value":"An Easy One"},"version":1},{"date":{"d":12,"m":2,"y":2005},"datev":20050212,"info":{"content":"<p>We went over to Notcuts to see some owls and creepy crawlies. We were all impressed with the Eagle Owl. It was big, with a huge wingspan.<\/p><p>In the afternoon, daddy tried to fix the washing machine. It's got a leak. He wasn't very successful. He flooded half the kitchen and managed to drop the machine on his feet, making them bleed. Ouch!!<\/p><p>In the evening Daddy went to Ascot by bike and train, for David's emigration farewell. It was nice to meet up with Stuart and James again. I wonder if Daddy will ever see them again. Anyway Daddy had a good night out.<\/p>","images":false},"title":{"value":"Owls and Creepy Crawlies"},"version":1},{"date":{"d":11,"m":2,"y":2005},"datev":20050211,"info":{"content":"<p>Mummy and Daddy went out with David to see Oceans 12 at Bracknell cinema. It has got to go down as one of the worst films in history. It was so cringingly bad!!!! Shocking.<\/p>","images":false},"title":{"value":"Oceans 12"},"version":1},{"date":{"d":9,"m":2,"y":2005},"datev":20050209,"info":{"content":"<p>Mummy went off to do some market research at Tesco. This gave an opportunity for the Fars to come over and get me ready for bed. We played a bit first then they gave me a bath. I think it was the first time they have seen me in the bath. They then got me dressed for bed, and they tried to give me a bottle, but I wanted Daddy to give that to me. They done very well, and I got to bed on time. Daddy was also able to be strict with me, when going to bed. Instead of sleeping with me until I fall asleep in mummy and daddy's bed, he gave me 10 minutes, then put me in my cot. I cried for a bit, but then settled down quite quickly.<\/p>","images":false},"title":{"value":"Fars to send me to bed"},"version":1},{"date":{"d":6,"m":2,"y":2005},"datev":20050206,"info":{"content":"<p>Grandpop, Grandma and her parents came around to see me in the afternoon. Grandma like playing with me. She said she would get me a proper horse when I am older.<\/p><p>Afterwards we left Daddy behind, but we went over to Alton to see Joseph again.<\/p>","images":false},"title":{"value":"Weston-Barnett visiting"},"version":1},{"date":{"d":5,"m":2,"y":2005},"datev":20050205,"info":{"content":"<p>We went to a play centre over in Hook for a couple of hours. It was good there.<\/p><p>In the afternoon we went over with Barrie, Laura and Freya to see the Elder clan. Who would have thought it we would all have kids! All in the same place. We're all OLD!<\/p><p>Daddy made some nice super juices in the evening.<\/p>","images":false},"title":{"value":"Hook, Joseph and Freya"},"version":1},{"date":{"d":2,"m":2,"y":2005},"datev":20050202,"info":{"content":"<p>We all went over to see Joseph in Alton.<\/p>","images":false},"title":{"value":"Visit Joseph Elder"},"version":1},{"date":{"d":1,"m":2,"y":2005},"datev":20050201,"first":{"value":null},"images":1,"info":{"content":"<p>Wow what a busy day. In the morning daddy took a half day to go to the auctions with Farfar.<\/p><p>Ellie rang to say her contractions had started in the morning. Mummy and I went over to support Ellie where we could. However, Ellie was progressing quite quickly so Michael drove her to hospital. Her waters broke in their nice new car!!!<\/p><p>Joseph George Elder was 8lbs 4oz and born at 2:20pm. Ellie bravely didn't take any pain relief.<\/p><p>In the late afternoon, we all went to see little Freya for the first time. She was a little cutie. We all had a cuddle. Mrs West was very relaxed with her new baby.<\/p><p>In the evening Mummy went over to see little Joseph at Winchester Hospital. Both sets of parents, Laura, Sue and Richard all went to see him.<\/p><p>Daddy saw Man Utd beat Arsenal in an epic match.<\/p><img src='images\\years\\2005\\2005_02_XX-01-Joseph.jpg' class='diaryImage' alt='Joey Elder' \/><p class='diaryImageCaption'>Joey Elder<\/p>","images":false},"title":{"value":"Joseph George Elder Born - First view of Freya West"},"version":2},{"date":{"d":31,"m":1,"y":2005},"datev":20050131,"info":{"content":"<p>Susan came over for a chat and cup of tea.<\/p>","images":false},"title":{"value":"Susan came over"},"version":1},{"date":{"d":30,"m":1,"y":2005},"datev":20050130,"info":{"content":"<p>After a 38 hour labour, Laura gave birth at midday to a healthy, 8lbs 15oz baby girl. I spoke to Bazza who was on a high.<\/p><p>We played football this morning and played badly.<\/p>","images":false},"title":{"value":"Freya Born"},"version":1},{"date":{"d":29,"m":1,"y":2005},"datev":20050129,"first":{"value":null},"info":{"content":"<p>Went for a swim today at the Arena. Barrie rang a few times to get advice on what to do with Laura. Laura went to hospital this morning.<\/p>","images":false},"title":{"value":"A Swim - Laura West goes into Labour"},"version":2},{"date":{"d":28,"m":1,"y":2005},"datev":20050128,"info":{"content":"<p>David and Louise came over for part of the evening. Louise was leaving to emigrate to Australia tomorrow.<\/p>","images":false},"title":{"value":"Louise’s last night in the UK"},"version":1},{"date":{"d":24,"m":1,"y":2005},"datev":20050124,"images":3,"info":{"content":"<p>Today I am 18 months old. Happy Birthday And A Half to me!! This means a complete change of wardrobe. Don't ask! Mummy takes baby clothes sizes absolutely literally. The day I am 18 months, means I start wearing 18-24 month sized clothes. All the 12-18 months now go in the loft!<\/p><p>In the afternoon we all went down to Frimley Park Hospital to see if the baby inside mummy's tummy was alright. Everything is fit and healthy. The crown-rump length was at around the 75th percentile mark. We got a couple of pictures.<\/p><img src='images\/years\/2005\/2005_01_24-01-BabyNo2.jpg' class='diaryImage' alt='Bubbop 1st picture' \/><p class='diaryImageCaption'>Bubbop 1st picture<\/p><img src='images\/years\/2005\/2005_01_24-02-BabyNo2.jpg' class='diaryImage' alt='Bubbop 1st picture' \/><p class='diaryImageCaption'>Bubbop 1st picture<\/p><img src='images\/years\/2005\/2005_01_24-02-KatieDrawing.jpg' class='diaryImage' alt='Katie drawing all by herself' \/><p class='diaryImageCaption'>Katie drawing all by herself<\/p>","images":false},"title":{"value":"BubBobs Scan - 18 months Old"},"version":1},{"date":{"d":23,"m":1,"y":2005},"datev":20050123,"info":{"content":"<p>Football and Church in the morning. Karen and Richard came around in the afternoon. I was so happy when Auntie Karen brought me some chocolate.<\/p>","images":false},"title":{"value":"The Usual Bits"},"version":1},{"date":{"d":22,"m":1,"y":2005},"datev":20050122,"info":{"content":"<p>We decided to go to Cambridge for the day. It was a long journey and stopped off at Wimpole Hole Farm. I got very scared of seeing the piggies being fed. I was physically shaking. The pigs were squealing so loud. Daddy was very brave in feeding the goats. We're all scaredy cats really. Daddy was afraid they would bite him, or eat his fingers.<\/p><p>We made it to Cambridge. It got a bit stressy at lunchtime, because I was crying the shops down. We eventually made it to the park area and had a picnic, but it was bitterly cold. We gazed around the market and looked for a hat and scarf for me.<\/p><p>Mummy and Daddy gave up with me in the end. I just wasn't happy. So we made it home just in time for dinner.<\/p>","images":false},"title":{"value":"Cambridge"},"version":1},{"date":{"d":16,"m":1,"y":2005},"datev":20050116,"info":{"content":"<p>We left early from Ellie and Michael's, and went back home to play then go to church. Daddy had football in the afternoon, whilst we went food shopping. Later in the afternoon we went over to Alton again and spent the evening with the Elders. The boys went off to the Pyramids in Portsmouth to see a band called Athlete. They were very good. Daddy said he wants to change his hair style to something more grungy (longer, messed up look!)<\/p>","images":false},"title":{"value":"Football - Church - Athlete"},"version":1},{"date":{"d":15,"m":1,"y":2005},"datev":20050115,"info":{"content":"<p>We were recommended to go and visit Heathrow Visitor centre. \"You can spend all day there\". So we thought we'd leave early, pack a picnic, then Daddy go on to football direct. That means we had to drive up separately.<\/p><p>We got to the Visitor centre and there were about 50 or so plane spotters there. It was a particularly pleasant day. Cold and overcast. We couldn't understand the fascination. Anyway inside the Visitors centre were one or two things to keep Katie amused for about 15 minutes. Then we went to the viewing lounge. All very interesting, again only for 15 minutes. Daddy listened to some very interesting Plane spotter conversations. Plane types, where different planes were, where they've been. We hurried out before sleepiness took over!<\/p><p>Because we travelled back home, Daddy had to drive all the way back to Hayes to watch Chertsey play. He arrived to see Brook House reserves take on Beaconsfield reserves!!! Dipstick daddy got the wrong venue! To make matters worse Daddy took mummy's purse by accident, stopping her doing the shopping, and he got stuck in a traffic jam on the way home!!<\/p><p>In the evening we took Great Grandma over to Alton, as we all went over to celebrate the coming of the Elder baby. At last I'll get a little cousin soon. Mummy is obsessed at finding what names have been chosen for little Wayney. She goes on and on.<\/p><p>I settled down for bed, whilst the other party guests arrived. The girls played lots of games and swapped birth stories, whilst the men folk went down the pub to play darts and pool. We stayed over the night which was very nice.<\/p>","images":false},"title":{"value":"Heathrow and Hayes Disasters - Ellie's Baby Shower"},"version":1},{"date":{"d":14,"m":1,"y":2005},"datev":20050114,"info":{"content":"<p>Daddy went over to Martin's for a poker night. It was more of a chilled clayed back evening. Very good. They had 2 games. Daddy won the first, but the Choosers, wine and beer impaired him in the second game.<\/p><p>Daddy got a headache coz the boys took his pillow away whist he was landing in bed!!! And Steve thought Alex Ferguson was dead and blamed José Marinho!!<\/p>","images":false},"title":{"value":"Poker Night"},"version":1},{"date":{"d":13,"m":1,"y":2005},"datev":20050113,"images":1,"info":{"content":"<img src='images\/years\/2005\/2005_01_13-KatieInBox.jpg' class='diaryImage' alt='Katie In Teddy Box' \/><p class='diaryImageCaption'>Katie In Teddy Box<\/p>","images":false},"title":{"value":"Naughty Picture"},"version":1},{"date":{"d":12,"m":1,"y":2005},"datev":20050112,"info":{"content":"<p>Daddy went over to David and Louise's to play Star Wars on the XBox. He was told that David's Visa had come through and that they were planning to leave within a month. Louise leaving ASAP and David on the 12th Feb. So soon. It will be sad to see them go.<\/p>","images":false},"title":{"value":"David’s Visa Came Through"},"version":1},{"date":{"d":9,"m":1,"y":2005},"datev":20050109,"info":{"content":"<p>Church for me and mum, and daddy played football. Got beat 4-0 and got a black eye for his trouble. Someone studded daddy on the bridge of the nose and eye.<\/p><p>The people cancelled viewing our house. Very annoying. The Fars came around to watch the last of Yeading V Newcastle and to play with me. I was on top form, dancing for ages.<\/p><p>We all flaked out pretty early in the evening.<\/p>","images":false},"title":{"value":"The Usual"},"version":1},{"date":{"d":8,"m":1,"y":2005},"datev":20050108,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning we went to an inner city type farm in Morden. It was quite small, but Katie enjoyed it, especially seeing the children going around in horses. Trouble was the weather was atrocious. Cold and very windy. We had to give up in the end because we were worried about Kit Kat, especially as she will not leave a hat and gloves on her for more than a minute.<\/p><p>In the afternoon Daddy prepared the house and garden for some people who were going to view the house on Sunday. In the evening we watched Supersize Me, which was a bit of an eye opener to fast food.<\/p><img src='images\\years\\2005\\2005_01_08-01-KatieDaddy.JPG' class='diaryImage' alt='Daddy and Katie' \/><p class='diaryImageCaption'>Daddy and Katie<\/p>","images":false},"title":{"value":"Inner City Farm"},"version":2},{"date":{"d":2,"m":1,"y":2005},"datev":20050102,"first":{"value":null},"images":1,"info":{"content":"<p>After Mummy and I went to church we drove up to London and parked along Piccadilly again. Great parking spot. Anyway we walked across Piccadilly Circus, through Leicester Square where there was a fairground. We then ventured into the National Portrait Gallery.<\/p><p>We weren't too sure what to expect. Daddy saw a picture of Kiera Knightly which made him happy. There were loads of paintings \/ drawings. The modern era was weird because half of them were just ordinary shots of people. Didn't seem to be special people or photographs. Perhaps we're all philistines when it comes to art!<\/p><p>Anyway, I was quite happy running up and down the halls, shouting daddy, daddy. We visited all the floors seeing some very old portraits.<\/p><p>We quickly moved on to Trafalgar Square were we took some snaps and chilled for a bit. Mummy was surprised to see tourists there! Because it is only the centre of the best country of the world (after Denmark of course).<\/p><p>After the shock of seeing tourists, our mystery tour us to the Thames where we walked along the new Hungerford bridge on the west side, passed the Millennium Wheel, across Westminster bridge, down Whitehall, Across Horse Guards parade and back to the car. I was very cold and upset so we rushed the last bit, but it was nice to get out amongst the busy crowds.<\/p><img src='images\\years\\2005\\2005_01_02-07-London.JPG' class='diaryImage' alt='Thames' \/><p class='diaryImageCaption'>Thames<\/p>","images":false},"title":{"value":"London Walk and National Portrait Museum"},"version":2}],"version":-241128887}