{"entries":[{"date":{"d":31,"m":12,"y":2006},"datev":20061231,"info":{"content":"<p>After church and lunch we visited the Fars after their return from Copenhagen. Farfar had set a big train track upstairs which spanned three rooms. It was hard to say who enjoyed it the most, Farfar, Daddy, Katie or Ben. Ben wasn't as interested as I thought he would be. Katie on the other hand played with it for quite some time.<\/p><p>An impromptu party had been organised at our house for New Years Eve. The Elders thought it best not to hold it this year as Lily celebrates midnight every night... if you know what I mean.<\/p><p>The Fars, Great Grandad, Great Grandma and Uncle Peter came over for some Mummy style quizzes and food. We played Family Fortunes, Mr and Mrs, Rapidough and Millionaire. We drank and ate our way till midnight and sang the customary Old Lang Syne.<\/p><p>Katie and Ben slept through.<\/p>","images":false},"title":{"value":"Fars and New Years Eve Party"},"version":1},{"date":{"d":30,"m":12,"y":2006},"datev":20061230,"info":{"content":"<p>After ferrying the kids around shops for the past 2 days, we devoted the day to what they wanted to do. Katie decided swimming, and we think that Woking is the best place as it has a shallow bit, and a double small pool with slide, a Jacuzzi and a show flume, a lazy river and it's not too expensive or packed out.<\/p><p>Charlotte came over to stay the night and we watched Sense and Sensibility in the evening. Exactly the same as Pride and Prejudice!<\/p>","images":false},"title":{"value":"Woking Swim"},"version":1},{"date":{"d":28,"m":12,"y":2006},"datev":20061228,"info":{"content":"<p>Mummy had set loads of jobs she wanted doing over the next few days. Tiles, table and chairs, fridge freezer, bathroom cabinet, garage tidy up. Poor Daddy!<\/p>","images":false},"title":{"value":"Jobs"},"version":1},{"date":{"d":27,"m":12,"y":2006},"datev":20061227,"info":{"content":"<p>After an unsuccessful trip to Bluewater, the West clan came over to play and swap presents. They had a nice Christmas.<\/p>","images":false},"title":{"value":"West’s Over"},"version":1},{"date":{"d":26,"m":12,"y":2006},"datev":20061226,"info":{"content":"<p>Although pretty cold, we travelled eastwards to Canterbury to wander about. Starting at the Norman castle we raced up the tor, Katie won. We continued along the wall and into the town.<\/p><p>We toured the Cathedral for quite some time.... It was pretty interesting, well Ben fell asleep, but we marvelled at the size of the place and secret rooms and side chapels. We had a pizza before returning to the tor for a spot of fun in the children's maze which had a slide in the middle as a prize.<\/p><p>We returned to Istead Rise in time for the Barnett Boxing Day party.<\/p>","images":false},"title":{"value":"Canterbury and Boxing Day Barnett Party"},"version":1},{"date":{"d":25,"m":12,"y":2006},"datev":20061225,"images":2,"info":{"content":"<p>6am and Father Christmas had been. We all went into Katie's room and the three wheeled pushchair 'Just like Auntie Ellie's' was unwrapped. 'Just what I needed. It’s not too big, or not too small, just perfect' commented Katie in an excited voice. Apparently the suitcase which came next was also 'just what I needed'. Katie must have been exceptionally good as Father Christmas had delivered her loads of presents.<\/p><p>Ben also did very well, although was too young to appreciate it. This has to be the first year that Katie did kind of appreciate what she was given.... as much as children do.<\/p><p>We then sat on Mummy and Daddy's bed to see what they had been given. Katie opened most of these presents.<\/p><p>After breakfast, we moved on to the presents under the tree, which were all from friends. Katie hadn't lost her enthusiasm and was very happy to pass to presents out. She got a lovely pair of pink boots from Auntie Karen which she was particularly fond of.<\/p><img src='images\/years\/2006\/2006_12_25-03a-XmasDay.jpg' class='diaryImage' alt='Morning Presents' \/><p class='diaryImageCaption'>Morning Presents<\/p><p>8:30 and we were ready to leave for Ma Ma and Pop Pops. Straight off to yet another church service at St Nicolas.<\/p><p>The BIG Christmas lunch was BIG. Turkey, three stuffing’s, sprouts with Chestnuts, roast potatoes and probably a lot more which I cannot remember. Well we all failed to get through half of what was on the plate.<\/p><img src='images\/years\/2006\/2006_12_25-22a-XmasDay.jpg' class='diaryImage' alt='Weston Present Opening' \/><p class='diaryImageCaption'>Weston Present Opening<\/p><p>After, the now traditional, walk around the block, we began on the mammoth Weston present giving. Lots of lovely presents.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2006},"datev":20061224,"images":2,"info":{"content":"<p>Mummy was trying to break the record for going to church. Three times today! Some sort of religious thing must be happening! The weather wasn't great today, an between praying sessions we were allowed to play on the swings which was good fun. Katie and Ben are really starting to play with each other now... and nicely to.<\/p><p>Daddy cooked a traditional Danish Christmas Meal. Roast Pork, caramelized potatoes, red cabbage and veg. Auntie Susan and Graham came over to eat with us as well.<\/p><img src='images\/years\/2006\/2006_12_24-13a-XmasEve.jpg' class='diaryImage' alt='Traditional Danish Christmas Meal' \/><p class='diaryImageCaption'>Traditional Danish Christmas Meal<\/p><p>After Dinner the main event began with the Present opening. Katie was extremely excited. She was very good and handed some of the presents out. Just ones to and from Susan and Graham.<\/p><p>It was nice to open presents on Christmas Eve when it's all dark outside, just before bed.<\/p><img src='images\/years\/2006\/2006_12_24-16a-XmasEve.jpg' class='diaryImage' alt='Opening Presents with Susan and Graham' \/><p class='diaryImageCaption'>Opening Presents with Susan and Graham<\/p><p>We sprinkled reindeer food on the path and hoped Father Christmas wouldn't get stuck in our chimney. We put our stockings at the end of our bed and went to sleep.<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":22,"m":12,"y":2006},"datev":20061222,"info":{"content":"<p>Today was my last of my 4 week stint at Softalk. I can say I'm happy to leave. The past week has been murderous not only in the journey into work, where my gloves and jacket had ice on it where it was so cold, but the work itself was dull, dull, dull! Still I don't blame Softalk. They needed some work doing and I was there to do it. I owed them after mucking them around. Still I left unceremoniously, and it's all experience and makes me less scared of leaving a company if it should need to happen again. Not like FormScape where I just didn't do it, because I've not had to really do it before. It has made me think I'm not a one company man.<\/p><p>Onto the next position at CNL. Not nearly enough holiday time. Not enough preparation.<\/p>","images":false},"title":{"value":"Last Day at Softalk"},"version":1},{"date":{"d":21,"m":12,"y":2006},"datev":20061221,"info":{"content":"<p>Mummy Katie and Ben went to stay with Ma Ma and Pop Pop for a couple of days. While we were there Mummy left Katie and Ben with Ma Ma while she went to Bluewater shopping centre to get some last presents with Auntie Charlotte. It was very busy. In the evening Mummy and Ma Ma went out for dinner with Auntie Karen and Rose.<\/p>","images":false},"title":{"value":"Bluewater"},"version":1},{"date":{"d":18,"m":12,"y":2006},"datev":20061218,"info":{"content":"<p>\u000a        In the evening Daddy went to the Prince Of Wales with Barrie, Michael, Nick, Martin, Richard, Weave and Phil C for a couple of Christmas drinks. Managed to get the Casuals stats. Click\u000a        <a href=\"casuals.xls\">\u000a          here\u000a        <\/a>\u000a        to see them all.\u000a      <\/p><p>The Casuals Stats..<\/p><table cellspacing=\"5\"><tr><th>Apps Pos<\/th><th>Name<\/th><th>Debut<\/th><th>Lge Apps<\/th><th>Lge Goals<\/th><th>Cup Apps<\/th><th>Cup Goals<\/th><th>Total Apps<\/th><th>Total Goals<\/th><\/tr><tr><td>7<\/td><td>Phil Rowe<\/td><td>08\/09\/1991<\/td><td>227<\/td><td>40<\/td><td>59<\/td><td>11<\/td><td>286<\/td><td>51<\/td><\/tr><tr><td>9<\/td><td>Martin Aves<\/td><td>05\/09\/1993<\/td><td>202<\/td><td>10<\/td><td>58<\/td><td>7<\/td><td>260<\/td><td>17<\/td><\/tr><tr><td>14<\/td><td>Nick King<\/td><td>05\/09\/1993<\/td><td>130<\/td><td>2<\/td><td>34<\/td><td>0<\/td><td>164<\/td><td>2<\/td><\/tr><tr><td>16<\/td><td>Martin Gay<\/td><td>10\/09\/1995<\/td><td>117<\/td><td>13<\/td><td>37<\/td><td>4<\/td><td>154<\/td><td>17<\/td><\/tr><tr><td>18<\/td><td>Gary Fletcher<\/td><td>14\/01\/1996<\/td><td>115<\/td><td>10<\/td><td>30<\/td><td>4<\/td><td>145<\/td><td>14<\/td><\/tr><tr><td>25<\/td><td>Barrie West<\/td><td>28\/04\/1996<\/td><td>81<\/td><td>66<\/td><td>26<\/td><td>20<\/td><td>107<\/td><td>86<\/td><\/tr><tr><td>29<\/td><td>Steve Barnett<\/td><td>11\/09\/1994<\/td><td>74<\/td><td>6<\/td><td>20<\/td><td>1<\/td><td>94<\/td><td>7<\/td><\/tr><tr><td>53<\/td><td>Michael Elder<\/td><td>08\/09\/2002<\/td><td>35<\/td><td>2<\/td><td>10<\/td><td>0<\/td><td>45<\/td><td>2<\/td><\/tr><tr><td>99<\/td><td>James Ball<\/td><td>07\/12\/1997<\/td><td>11<\/td><td>1<\/td><td>1<\/td><td>0<\/td><td>12<\/td><td>1<\/td><\/tr><tr><td>146<\/td><td>Richard Sanders<\/td><td>23\/01\/2005<\/td><td>3<\/td><td>0<\/td><td>1<\/td><td>0<\/td><td>4<\/td><td>0<\/td><\/tr><\/table>","images":false},"title":{"value":"Casuals Christmas Drinks"},"version":1},{"date":{"d":17,"m":12,"y":2006},"datev":20061217,"info":{"content":"<p>After church we rushed over to the Fars where Ben was dropped off. We then went off to Camberley Civic Hall. We weren't allowed to call it a 'Pantomime' as somehow Katie has been told that is scary! Instead it was a 'show'.<\/p><p>We got to our seats, which were right near the front and settled down. The room darkened and Katie had to sit on Mummy's lap. The Peter Pan production began and we were impressed by the stage and acting. We enjoyed it lots. Katie was gripped.<\/p><p>The first half seemed to last about an hour, and the Frimley Green Pre-School got a mention from one of the actresses. We had some sweets and drink at half time before returning. A little way into it Capt. Hook was about to hook one of the goodies! Katie got all scared and started crying and wanted to go home. Fortunately we were patient enough with her and managed to watch it till it's conclusion.<\/p><p>We returned back to the Fars for a cup of tea and a little play. Ben initially cried when we had left him, but was very happy to be playing with Farmor and Farfar.<\/p>","images":false},"title":{"value":"Pantomime - Peter Pan"},"version":1},{"date":{"d":16,"m":12,"y":2006},"datev":20061216,"info":{"content":"<p>Numbers were down this year for our annual Christmas Party. Just Karen, Richard, Helen, Nigel and Ellie. A sign of the times I think. We didn't even hear back from Vicky. Maybe she is going the same way as Jessica and losing touch with us.<\/p><p>Anyhow we had a good time with the usual games, the usual attempts to cheat from the boys and slightly alternative buffet of hot dogs, bacon and crispy duck!<\/p><p>It was great to see everyone together, especially Helen and Nigel who travelled along way.<\/p>","images":false},"title":{"value":"Our Christmas Party"},"version":1},{"date":{"d":15,"m":12,"y":2006},"datev":20061215,"first":{"name":"katie","value":"Katie's Nativity Play"},"images":1,"info":{"content":"<p>Katie, for some reason wanted to be a 'star' in her first ever play. She said she was a 'star' before she was even given the role. Anyway we were called in from the Christmas Fair. Farfar and Great Grandma and Grandad also managed to make it.<\/p><p>After selling 35 sacks of reindeer food in the Christmas Fair, we trundled across to the playschool hall where there were loads of parents and grandparents looking proudly on at their offspring.<\/p><p>Katie had a small role at the back of the group of children. She stood up with 2 other stars and briefly twinkled her fingers in front of her. Mummy and Daddy were so proud of her. She was so concentrated and into the play and kept looking across at her entourage proudly. She sang all the songs. Honestly our hearts melted.<\/p><p>The performance overall lasted 10 minutes which Daddy managed to video all. Afterwards the cast sang Jingle Bells and Father Christmas danced in and handed presents. Again Katie was very well behaved and waited patiently for her turn. She managed to bump into another girl on the way up fall over. Dusted herself down, politely took the present from F.C., posed for a photo and came over for a cuddle. A lovely morning.<\/p><img src='images\/years\/2006\/2006_12_15-07-KatieNativity.jpg' class='diaryImage' alt='Whose A Star?' \/><p class='diaryImageCaption'>Whose A Star?<\/p><p>In the afternoon Daddy went to see the guys at CNL for a quick rundown on what he will be initially tasked with. It will be initially get used to the product, basically bug fixing, although this will include learning VB.NET. After a month or so Daddy will be moving onto learning ASP.NET and helping provide a web front end to the IP Security Product.<\/p>","images":false},"title":{"value":"Katie's Nativity Play, CNL"},"version":1},{"date":{"d":14,"m":12,"y":2006},"datev":20061214,"images":1,"info":{"content":"<p>Yesterday we put our Christmas tree up and decorations... only to hear in the night that it had fallen over with a crash and unfortunately a smash. Our prized \"Katie Baby\" Bauball had broke!<\/p><p>Anyway Daddy took a half day from work and met up with us and Joey for a little trip down the Basingstoke Canal to see Father Christmas. We got off the boat and searched for his hut through the woods. Katie followed the tinsel trail to Father Christmas's hut. Joey at this point bawled his eyes out.<\/p><p>In the evening Daddy met up with his old colleagues from FormScape to have a natter and a few Christmas drinks.<\/p><img src='images\/years\/2006\/2006_12_14-06-CanalSantaKatie.jpg' class='diaryImage' alt='Katie with another Father Christmas' \/><p class='diaryImageCaption'>Katie with another Father Christmas<\/p>","images":false},"title":{"value":"Father Christmas Canal Trip - FormScape Xmas Drinks"},"version":1},{"date":{"d":12,"m":12,"y":2006},"datev":20061212,"info":{"content":"<p>Auntie Karen and Summer came over and we went to see Father Christmas in Camberley town centre. Mummy paid Eight pounds for Katie and Ben to see him. They went in and Katie happily told Father Christmas she would like some boots please but Ben screamed and screamed so Mummy had to go out and leave Katie in there with Auntie Karen and Summer!<\/p>","images":false},"title":{"value":"Fars Christmas With Karen"},"version":1},{"date":{"d":10,"m":12,"y":2006},"datev":20061210,"images":1,"info":{"content":"<p>After church we went over to the Fars for a special Christmas Lunch. As they are going to Denmark this Christmas again we decided to have the traditional Christmas Eve meal today. Beautiful Roast Pork! Scrummy.<\/p><p>Auntie Susan and Graham were also there and we got to open our first Christmas presents of the year. Katie was so excited and wanted to open everyone’s. She really enjoyed getting presents. Still a bit young for Ben.<\/p><p>Anyway Katie got a lovely wooden castle where she and mummy re-enacted the story where the prince turns into a frog... Can't remember the name of the story now!<\/p><p>Ben got some Lego which I think Graham should have received going on the enthusiasm he showed for it!<\/p><img src='images\/years\/2006\/2006_12_10-10a-FarsXmasLunch.jpg' class='diaryImage' alt='Katie and Farmor Meow' \/><p class='diaryImageCaption'>Katie and Farmor Meow<\/p>","images":false},"title":{"value":"Fars Christmas Lunch"},"version":1},{"date":{"d":9,"m":12,"y":2006},"datev":20061209,"info":{"content":"<p>In the morning we went to Camberley to do even more Christmas shopping!<\/p><p>It was Ella's 4th birthday (well on Monday really) and we were invited to her party at Fizzy Kids in North Camp. This is a softplay area. Daddy enjoyed getting stuck in the ball pool. The children just ganged up on him. He sought refuge with Benny Boy in the under 4's area! It was pretty manic and Katie was whizzing around the place. The kids absolutely loved it. The afternoon was polished off nicely with a party meal and finally cake and a goody bag.<\/p><p>In the evening Mummy and Daddy made a start on the hundred or so presents that need wrapping. Wow I think this year is a record. Daddy is well chuffed having sorted out most of his presents.<\/p>","images":false},"title":{"value":"Ella's 4th Birthday Party"},"version":1},{"date":{"d":4,"m":12,"y":2006},"datev":20061204,"info":{"content":"<p>As Usual we were doing our food shopping in the supermarket. Ben sitting in the trolley seat, Katie helping (or is it dictating?) Mummy pick what items to buy this week. All of a sudden a big crash, bang, wallop as Katie decided to climb the side of the trolley. Katie, Ben and the trolley went tumbling to one side on to the floor! Screams, cries and an upset Mummy. People crowded around, fussing and offering assistance. Although sweet, we just wanted as little fuss as possible and to slip out of the supermarket unnoticed. Oh yes, no one was hurt fortunately. Initial shock caused the screams and crying.<\/p>","images":false},"title":{"value":"Off Your Trolley"},"version":1},{"date":{"d":2,"m":12,"y":2006},"datev":20061202,"images":4,"info":{"content":"<p>We met Ma Ma and Pop Pop at Woking pool to go swimming. We had lunch first in the cafe and then went in. Ben loved it, because he could run around the edge, neither Katie, Ben or Joey liked the wave machine, and Joey was the only one who liked the flume.<\/p><p>In the late afternoon we went to see Lily for the first time and she was gorgeous. Looks so much like Auntie Ellie with the softest skin in the world. Auntie Charlotte stayed the night and we stopped off for a takeaway pizza which was a treat for Katie.<\/p><img src='images\/years\/2006\/2006_12_02-28-LillyBirth.jpg' class='diaryImage' alt='Katie with Lily' \/><p class='diaryImageCaption'>Katie with Lily<\/p><img src='images\/years\/2006\/2006_12_02-23-LillyBirth.jpg' class='diaryImage' alt='Weston Family Line-up' \/><p class='diaryImageCaption'>Weston Family Line-up<\/p><img src='images\/years\/2006\/2006_12_02-27a-LillyVisit.jpg' class='diaryImage' alt='The Photography Team' \/><p class='diaryImageCaption'>The Photography Team<\/p><img src='images\/years\/2006\/2006_12_02-28a-LillyVisit.jpg' class='diaryImage' alt='Ben Model Posing' \/><p class='diaryImageCaption'>Ben Model Posing<\/p>","images":false},"title":{"value":"Visiting Lily"},"version":1},{"date":{"d":1,"m":12,"y":2006},"datev":20061201,"images":2,"info":{"content":"<p>We got a call from Ellie at about 8pm to say that her waters had broken and that they were going to hospital. Michael brought Joey around to sleep.<\/p><p>Ellie had a couple of mini-contractions on the way over so it was close. In fact she gave birth to Lily at 10pm, with just gas and air. Lilly arrived fit and at a healthy 8lbs. Ellie was fine although a little tired. Lilly latched on straight away and was a hungry girl.<\/p><p>Congratulations to Michael, Ellie and Joey for bringing us a little niece and cousin into the world.<\/p><img src='images\/years\/2006\/2006_12_01-09a-LillyBorn.jpg' class='diaryImage' alt='Lily kicking and screaming' \/><p class='diaryImageCaption'>Lily kicking and screaming<\/p><img src='images\/years\/2006\/2006_12_01-12-LillyBorn.jpg' class='diaryImage' alt='Lily having a snooze' \/><p class='diaryImageCaption'>Lily having a snooze<\/p>","images":false},"title":{"value":"Lily Marie Elder Born"},"version":1},{"date":{"d":30,"m":11,"y":2006},"datev":20061130,"info":{"content":"<p>\u000a        Last Friday 5pm, I got a call to say I've got the job at<a href=\"http:\/\/www.softalkltd.com\">Softalk<\/a>. First day was good, although the travelling was a nightmare. Biking to Maidenhead on a Monday morning took over an hour. They are not so flexible with working hours here so not too sure how Daddy can get round this. Anyway Daddy is into my first task which is to provide an \"Install Shield\" type installer so they can get certified on Windows. Urrghh! Still it's refreshing to get into something new and a blank canvas so to speak. Also Daddy doesn't need to bug anyone too much.\u000a      <\/p><p>Some of the people there were a bit 'holier than now'. 'Customers are stupid' type attitude and small snipes at each other. I thought I was working with a bunch of women. The two owners, Simon and Stuart are very nice and very much into the business. You can feel the stress from them for the company to do as well as possible. When I say 'stress' I probably mean focused which I like.<\/p><p>Bear with me, this is related..... anyway over the weekend the top box on my bike fell off without trace! So Daddy bought a new one on eBay and to cut a long story short he went to collect it from the bloke straight after work...... From Hastings!!!!!! It took 3 hours to get down there, this wasn't helped when I ran out of petrol on the M4 by Slough. Didn't get home last night until 11pm! So after another 1 hour+ trip into work on Tuesday morning in the rain Daddy felt slightly jaded.<\/p><p>Still raining in the evening travelling home and the fuse blew twice for my headlights. It was pitch black and Daddy didn't have another spare fuse, so had to revert to his old trick of tailgating cars in order to see where to go! Had to do this from the other side of Bracknell. Didn't get home until 7pm.<\/p><p>Wednesday the fun and games with the bike deepened when on the way home the fuse went again, but also the starter fuse went so I had no power. RAC came out, and had a go at fixing it by the Fighting Cocks pub, Bagshot, where there were several fights going on. Anyway he couldn't fix the problem, so called a tow truck out and finally got home at 11:30pm.<\/p><p>Thursday was spent getting the bike sorted. Found a really good \/ useful bike repairer in Aldershot which was satisfying. They sorted me out for £180.<\/p><p>Then Friday.... well wait for the next diary entry for that one. All in all a very horrible week up till Thursday. Weather, job and motorbike.<\/p>","images":false},"title":{"value":"Softalk, Motorbike Woes"},"version":1},{"date":{"d":26,"m":11,"y":2006},"datev":20061126,"info":{"content":"<p>In the afternoon we went to Windlesham Christmas fair at Farmor's newish school that she cooks for. It was pretty crowded and a lot of posh people there.<\/p>","images":false},"title":{"value":"Windlesham Christmas Fair"},"version":1},{"date":{"d":25,"m":11,"y":2006},"datev":20061125,"info":{"content":"<p>Daddy lost his top box today from the back of his bike. He went to the post office, once arrived he found it had gone!<\/p><p>We went over to Farnborough to look for some floor tiles for the kitchen, then on to Redfields garden centre to see Father Christmas where we met up with Karen, Ellie, Michael and Joey.<\/p><p>Mr F.C. turned up in a horse drawn sleigh with a couple of elves and Mother Christmas. He was the most realistic Father Christmas we have seen for a while.<\/p><p>We de-camped to Karen's for a cup of tea before returning home with the Elders for a fry up. Susan and Graham came around later in the afternoon and the kids went out to play in the big puddle outside the house.<\/p>","images":false},"title":{"value":"Father Christmas"},"version":1},{"date":{"d":23,"m":11,"y":2006},"datev":20061123,"info":{"content":"<p>Well it has now been a month now since Daddy was made redundant from FormScape. It has not been easy, but at least there is light at the end of the tunnel.<\/p><p>A month ago Daddy could not contemplate looking for another job. Zero preparation. No CV, a need to mug up on C++, interview techniques, employment agents and technical test.... all this with a whiff who is constantly pressurising.<\/p><p>Daddy decided to tackle one problem at a time. First the CV. Karen helped Daddy construct a CV which took 25 hours to write from scratch.<\/p><p>A week was then spent on mugging up on C++, specifically on threading. Daddy submitted his CV to a handful of sites and a number of recommended employment agents. The two main sites that got the most leads were cwjobs and planetrecruit.<\/p><p>Daddy also contacted his old CEO, Keith Bloodworth seeing if he had any jobs or interest. He did and Daddy went for an interview, which was rather strange as 85% of it was spent them demoing their product to me. It was very impressive.<\/p><p>Had other interviews with Imagineer (Guildford), Softalk (Maidenhead), Aircom (Leatherhead) and NDS (Staines). Daddy also had tests with Barclays Capital in the city. Daddy grew more and more confident with each interview. Each were quite different. Softalk interrogated my MFC and threading experience for a total of 4.5 hours verbally and a day’s coding test, whilst Imagineer was an 1.5 hour chat!<\/p><p>All companies were offering salaries lower than that of FormScape's.<\/p>","images":false},"title":{"value":"Job Hunting"},"version":1},{"date":{"d":19,"m":11,"y":2006},"datev":20061119,"info":{"content":"<p>After church we arranged to go for lunch at the Dixon household. We started off fine. Katie and Ben were very playful and we had to keep a firm eye that nothing in the house would get broken or ruined. The lunch was scrummy, but both children mis-behaved which was rather embarrassing. However, this was not unexpected and it has made Daddy realise that we really have to tighten the reigns. Katie is such a fussy, whiney eater. Every day we have problems at dinner time. Ben is just so messy and impossible to feed without a high chair.<\/p><p>Anyway we decided to escape and go for a walk along the beach and pier. We had a nice cup of tea, but again Katie and Ben were playing up.<\/p><p>We spoke to Sharon about her impending wedding. All quite exciting, but I think Linda is taking over the organisation of it all.<\/p><p>We had fun and games again on the way home when the car overheated! Grrrr. Took us 3 hours to get home.<\/p>","images":false},"title":{"value":"Dixons Of Deal.... nightmare"},"version":1},{"date":{"d":18,"m":11,"y":2006},"datev":20061118,"info":{"content":"<p>We drove over to Southfleet for their Autumn fete. Pop Pop posed as Father Christmas in a darkened room. Katie sort of guess it was Pop Pop as he didn't do a good job of disguising his voice. It was funny to see her face as she was trying to work out if we were telling the truth when we said it wasn't him. We seriously don't want the dream to go just yet! Ben on the other hand balled his eyes out.<\/p><p>We bought some tat and headed back to the Weston household for lunch. Afterwards we went down to Cascades for a spot of swimming which Ben particularly liked as he could run around in the shallow end.<\/p>","images":false},"title":{"value":"Southfleet Autumn Fete"},"version":1},{"date":{"d":12,"m":11,"y":2006},"datev":20061112,"images":1,"info":{"content":"<p>Derek had kindly said he'd take a look at the car which meant that we had fun and games getting to church and getting to Karen and Richard's. Ben's blasted child seat just didn't want to leave the car!<\/p><p>The lunch was magnificent! Yum, yum. Making my tummy rumble at the thought of it. Anyway after lunch we walked over to Redfields and had a little look around all the Christmas stuff . Naughty Karen bought me some lovely things.<\/p><p>We chilled out (as much as you can with Katie and Ben) and had a cup of tea and made our way home before Benny the Destructor and Katie Whiney pants destroyed the Sanders abode.<\/p><img src='images\/years\/2006\/2006_11_12-02a-KR-KatieFatherXmas.jpg' class='diaryImage' alt='Katie, meet Father Christmas' \/><p class='diaryImageCaption'>Katie, meet Father Christmas<\/p>","images":false},"title":{"value":"Karen and Richards Lunch"},"version":1},{"date":{"d":11,"m":11,"y":2006},"datev":20061111,"images":2,"info":{"content":"<p>Well yesterday we came down to Gravesend to see Karen and Summer and stayed over at Ma Ma and Pop Pops.<\/p><p>We ventured up to Greenwich Park. We walked through to see the very tame squirrels, fed the ducks and saw the deer and then the highlight.... the super, big playground! Katie and Mummy were trying to run away from Daddy and Ben, but the boys caught up!<\/p><p>Walking into Greenwich we happened to pass a sweet shop near the market! Funnily enough the girls were hungry and happened to stumble into the shop. The boys on the other hand were told they were not allowed their pie and mash from Goddard’s until Daddy gets a job! One rule for the girls another for the boys.<\/p><img src='images\/years\/2006\/2006_11_11-06-Greenwich.jpg' class='diaryImage' alt='Sweets anyone?' \/><p class='diaryImageCaption'>Sweets anyone?<\/p><p>We then had races down and up the foot tunnel and had our lunch at Island Gardens on a picnic bench. It was cold.<\/p><p>We carried on passed a kiddies football match, where one 10 year old, sithed another and then a pushing match ensued. Quite funny really, although the Premiership has got a lot to answer for!<\/p><p>Mudchute Farm is a funny old place. Not sure who runs it. Just seem to be prisoners and kids there. Perhaps I am being a little unfair. Ben enjoyed the donkeys, Katie the horses of course and Daddy the pigs.<\/p><img src='images\/years\/2006\/2006_11_11-08a-Greenwich.jpg' class='diaryImage' alt='Ahh - Benny and Chip-Chop' \/><p class='diaryImageCaption'>Ahh - Benny and Chip-Chop<\/p><p>The weather was getting cold, so we decided to head back the couple of mile back to the car.<\/p><p>On the way home Daddy luckily noticed that the temperature gauge was off the maximum. We pulled off at the next junction, but the engine cut out before we could get to a garage. We walked into Leatherhead to get some water from the supermarket. Back at the car Daddy filled the radiator expansion bottle, however it was pretty full beforehand! Mmmm.<\/p><p>We carried on and just managed to get off the motorway at Chertsey before the engine cut out again. This time Daddy poured water into the actual radiator and it was like Mount Vesuvius! Steam, water and what looked like oil spluttering back out again! Oh Oh. Oil in the radiator. Head Gasket? Anyway we stopped a couple of times further before finally making it home.<\/p><p>In the evening Katie and Mummy went off to Ellie's baby shower. Katie, who hadn't slept all day, was a good girl and stayed up until 11pm.... stuffing herself with sweets, crisps and nik naks! She was in her element. She's far too grown up.<\/p><p>Daddy on the other hand had organised a trip out with the FormScape boys in Guildford. Surprisingly quite a few turned up which was nice. Everyone was kind and wanted to know how Daddy was doing.<\/p>","images":false},"title":{"value":"Greenwich, Car Overheats, Ellie's Baby Shower, FormScape Reunion"},"version":1},{"date":{"d":5,"m":11,"y":2006},"datev":20061105,"info":{"content":"<p>Katie, Mummy and Ben drove to a really nice pub in Oxted for Great Grandma's 81st birthday party. Ma Ma, Pop Pop, Auntie Ellie, Joey, Auntie Charlotte, Auntie Sue and Uncle Richard, Uncle Howard, Steven and Joyce, Uncle John Garrett, and Great Grandad were there. Katie had sausage and chips and Mummy and Ben shared lasagne.<\/p>","images":false},"title":{"value":"Great Grandma's 81st Birthday"},"version":1},{"date":{"d":4,"m":11,"y":2006},"datev":20061104,"images":1,"info":{"content":"<p>Starting to get cold now and are original plan of going to Harrods to see the Christmas parade didn't happen because we would have needed an exceptionally early start.<\/p><p>So instead we went down to Longleat again to use the tickets up - so a nice cheap day for the unemployed family!<\/p><p>First we went into the best maze in the world we reckon! We split into teams, Boys V Girls. Girls found the middle in about 15 minutes, Boys about 30 minutes. However the tables were turned when we had to get out. Katie got a bit hysterical when she got trapped in! No surprise there then.<\/p><p>We went in the excellent castle adventure playground area where I think the kids could have stayed for hours and hours. There was a soft play area, swing park and an ariel trail thingy which Katie was very keen on.<\/p><p>After our picnic, we went in the bat cave and saw the parrot show, which Katie was amazed at. So funny watching her face as the parrots were performing their tricks. Not really clapping or smiling, just a dropped jaw as if she couldn't believe what she was seeing!<\/p><p>We finished off with a go on the tea cup ride and a tour around Postman Pats village. A great time without actually having to see any animals really.<\/p><img src='images\/years\/2006\/2006_11_04-10a-Longleat.jpg' class='diaryImage' alt='Postman Pat and his black and white kids!' \/><p class='diaryImageCaption'>Postman Pat and his black and white kids!<\/p><p>In the evening we went out with Farmor, Karen and Richard and the West crew to the fireworks over in Fleet. Katie was very excited and talked and talked about which are her favourites, which other peoples favourites were. We got there, all waiting for the first firework. Up they went.... down came the tears, from both Katie and Ben. We persisted for about 5 minutes before we had to make our way out of the arena and hide behind the shops! Wimps the pair of them.<\/p>","images":false},"title":{"value":"Longleat and Fireworks"},"version":1},{"date":{"d":2,"m":11,"y":2006},"datev":20061102,"info":{"content":"<p>After Katie's pre-school we drove to Auntie Helen's house (getting completely lost on the way)! Auntie Fiona and Thomas met us there and we had a play and then walked to the swings, it was freezing but a great park.  We then went to Ma Ma and Pop Pop's house and gave Pop Pop his presents, which Katie opened, had a lovely meal, cooked by Auntie Charlotte and a lovely chocolate birthday cake. We stayed the night, Mummy, Katie and Ben cuddled up together, it was lovely.<\/p>","images":false},"title":{"value":"Pop Pops Birthday"},"version":1},{"date":{"d":31,"m":10,"y":2006},"datev":20061031,"images":2,"info":{"content":"<p>The day started with pre-school for Katie and then she had her first swimming lesson. She was brilliant. She got so much praise from the instructors and she went in with them all on her own while Mummy and Ben watched from the side. Mummy felt so proud of her as she swam on her back and front and jumped in.<\/p><p>From swimming Katie put on her Batgirl outfit and Ben his cat costume and we went to Farfar and Farmor’s and Great Grandma and Grandad’s trick or treating. Joey came to dressed as a spider. Great grandma had a few of her neighbours for us to visit too, so they all managed to fill up their big pumpkin buckets that Ma Ma had bought them with lots of sweets.<\/p><img src='images\/years\/2006\/2006_10_31-12a-Halloween.jpg' class='diaryImage' alt='Knock, Knock - Trick Or Treat' \/><p class='diaryImageCaption'>Knock, Knock - Trick Or Treat<\/p><p>From there we came home and Oliver, Henry, Joshua, Poppy and James came over for a little tea all dressed up. Katie really enjoyed the evening as well, we had four lots of tick or treaters knock on the door and she gave them the sweets we had bought for them. What a busy day!<\/p><img src='images\/years\/2006\/2006_10_31-08-Halloween.jpg' class='diaryImage' alt='Halloween Tea Party' \/><p class='diaryImageCaption'>Halloween Tea Party<\/p>","images":false},"title":{"value":"Fancy Dress Party and First Swimming Lesson"},"version":1},{"date":{"d":30,"m":10,"y":2006},"datev":20061030,"info":{"content":"<p>We met Auntie Ellie and Joey at Birdworld, as Auntie Ellie had  a buy one get one free voucher. We saw the penguins being fed and saw vultures, flamingos, and ostrich it was good. There was also a little farm and an underwater world with a crocodile which Katie loved. We had a picnic and an ice-lolly that Katie wanted even though it was freezing. As it was Halloween season there was a grotto with ghosts and fake spiders etc. that were moving, which they all loved and wanted to go through again and again. We had a lovely day.<\/p>","images":false},"title":{"value":"Birdworld"},"version":1},{"date":{"d":29,"m":10,"y":2006},"datev":20061029,"images":1,"info":{"content":"<p>After church and Daddy's Sunday lunch we scooted down to the coast for the afternoon. Southsea front is a nightmare to get to. We remember last time the traffic. Oh well, we got there and it was a sunny day.<\/p><p>Some dared to get their feet wet in the sea, whilst others took photos! It was freezing. We skimmed stones. Ben's throwing accuracy has little to be desired, most thrown in a random direction, not necessarily towards the sea. The boy is a menace.<\/p><img src='images\/years\/2006\/2006_10_29-06a-Southsea.jpg' class='diaryImage' alt='Dipping Toes In' \/><p class='diaryImageCaption'>Dipping Toes In<\/p><p>We meandered to the pier along the painted pavement lines. There was a small swimming pool thingy which had high walls. Mummy let him try and get in, but thought the walls were too high. WRONG! Ben managed to go head first into the water, soaking him through! Other people on the pier were amazed that he could get in. Some just laughed. A bit embarrassing. Mummy had to take him back to the car and get changed!<\/p><p>In the meantime Daddy and Katie went on the only amusement on the pier which was a bouncy castle, followed by the playground train.<\/p><p>After a Callipo (on a very cold day) we went to the huge swing park, then home.<\/p>","images":false},"title":{"value":"Southsea"},"version":1},{"date":{"d":28,"m":10,"y":2006},"datev":20061028,"info":{"content":"<p>Daddy and Benny continued on their ride up the Grand Union Canal from Uxbridge to Harefield.<\/p>","images":false},"title":{"value":"Grand Union Bike Ride"},"version":1},{"date":{"d":27,"m":10,"y":2006},"datev":20061027,"info":{"content":"<p>Today we met Auntie Ellie and Joey at Alice Holt country park for a picnic, it was so muddy. There was some lovely equipment to climb on. Katie and mummy climbed a big tall tower and went inside a giant owl. We had a lovely walk and a go on the swings. From there we went to a garden centre to look at the Christmas decorations and then for a final visit to Great grandma and Grandad's. Ben and Mummy nipped Great grandma to the library, while Katie and Ma Ma stayed with Great Grandad. In the evening Mummy, Daddy, Ma Ma, Pop Pop, Auntie Ellie, Auntie Charlotte, Auntie Sue and Uncle Richard went to see the Counterfeit Stones an Camberley theatre which was great. We had a meal first. Mummy, Auntie Sue and Ma Ma were dancing! Uncle Michael babysat.<\/p>","images":false},"title":{"value":"Counterfeit Stones"},"version":1},{"date":{"d":26,"m":10,"y":2006},"datev":20061026,"info":{"content":"<p>We took Great Grandma to have her hair cut as Great Grandad is still in hospital and then we went for lunch in Tesco. Ma Ma bought Katie, Ben and Joey a Pumpkin bucket ready for next week. Then we went to Camberley as Great Grandma wanted to go to Primark. While Ma Ma, Great Grandma and Katie went there Mummy and Ben went to Boots for some nappies, when we met up again, Ma Ma and Great Grandma had bought Katie a pair of Patent leather black boots which Mummy did not approve of but Katie loved. She has such a love for shoes at the moment, we have to try them on every shop we go to.  We then went to see Great Grandad who was a lot better. In the evening the hospital called to say we could go and pick Great Grandad up so Katie went with Ma Ma to do this and they had a great time. Katie did not stop talking apparently.<\/p>","images":false},"title":{"value":"Ma Ma staying"},"version":1},{"date":{"d":25,"m":10,"y":2006},"datev":20061025,"info":{"content":"<p>Ma Ma came to stay for three days as it was half term, but unfortunately Great Grandad was rushed to hospital with a bad stomach ulcer which made him very ill. We went in to see him in the afternoon but Katie was a bit scared as he didn't look himself so we went for a walk while Great Grandma and Ma Ma sat with Great Grandad. Then we went to see Uncle John Garratt who has been ill as well and we did his shopping for him.<\/p>","images":false},"title":{"value":"Great Grandad in hospital"},"version":1},{"date":{"d":23,"m":10,"y":2006},"datev":20061023,"images":1,"info":{"content":"<p>After a scare of losing the car keys, we ventured through the undulating, picturesque Peak District to the touristy Castleton. There we dared to go in one of the many caves, Peak Cavern (aka Devils Arse). It was quite an impressive approach as the river ran alongside us, and cliffs towered over the top.<\/p><p>Katie told us to be careful as we might get attacked by bears! Let’s hope not. The guide was very animated which made the tour in the caverns that much more atmospheric. There was a huge opening to the cave, and some parts required us to crouch right down to pass. We had to be careful not to get wet as there was quite a bit of 'rain' falling down. Benny Boo was even getting into it all.<\/p><p>We took a country road through a place called Hope and stopped off for a picnic at the side of the road. We could see for miles. It was lovely.<\/p><p>Back into Castleton for part 2 - Peveril Castle. Wow what a steep walk to even get there. This time we had to be careful of 'giants'. The castle was pretty much ruined 500 years ago so there was not much to see. However, we enjoyed the trek there and looking around the grounds and the keep. Katie won a sticker for finding 8 squires and knights!<\/p><p>After a lolly and a coast around the souvenir shops we got in the car and all dozed as Daddy drove onto the next stop, Matlock Bath. It was so sweet as Katie sang herself to sleep in the car. Singing one minute, eyes closed the next.<\/p><p>Here we just perused the shops, walked by the river and of course went on some much needed 'swing park' therapy.<\/p><p>As a complete contrast to yesterday, Katie and Ben were great and a joy to be with.<\/p><img src='images\/years\/2006\/2006_10_23-01-Castleton.jpg' class='diaryImage' alt='Castleton Montage' \/><p class='diaryImageCaption'>Castleton Montage<\/p>","images":false},"title":{"value":"Peak Cavern, Peveril Castle, Matlock Bath"},"version":1},{"date":{"d":22,"m":10,"y":2006},"datev":20061022,"images":1,"info":{"content":"<p>Katie was very excited at the prospect of going on holiday, mainly because we promised her fish and chips and to stay in a hotel overnight.<\/p><p>We got up a little after 6am and set off, arriving at George and Andrews house at 11. The weather wasn't great, a little cold and a little rainy.<\/p><p>We stopped for a cup of tea, wandered down to see the horses, cows and unwelcomed dogs, then had some lunch before heading off to the tram museum.<\/p><p>The museum had a load of old trams, which Daddy enjoyed, as well as a playground, where Benny fell off the roundabout and a soft play area.<\/p><img src='images\/years\/2006\/2006_10_22-03-AndrewGeorges.jpg' class='diaryImage' alt='Katie getting some good numbers!' \/><p class='diaryImageCaption'>Katie getting some good numbers!<\/p><p>We had a go on the tram which went up to the old quarry. Ben and Katie were definitely not on their best behaviour today. They were testing the patience of all the adults I think.<\/p><p>We returned back to Andrew and Georges for some lovely fish and chips, before heading to our hotel in Alfreton.<\/p>","images":false},"title":{"value":"George, Andrew and the Tram Museum"},"version":1},{"date":{"d":21,"m":10,"y":2006},"datev":20061021,"images":2,"info":{"content":"<p>Farmor was not feeling very well, so just Farfar and Joyce bought over some cakes and stayed for a cup of coffee and some playtime. We also managed to go and feed the fish in the crescent.<\/p><img src='images\/years\/2006\/2006_10_21-05-FarfarJoyce.jpg' class='diaryImage' alt='Joyce, Farfar and Katie' \/><p class='diaryImageCaption'>Joyce, Farfar and Katie<\/p><p>In the afternoon we went over to the West’s, which was entertaining as ever. We went to the swings and the boys stayed to watch some park football.<\/p><img src='images\/years\/2006\/2006_10_21-02-BenKatieFreya.jpg' class='diaryImage' alt='Cooking West’s' \/><p class='diaryImageCaption'>Cooking West’s<\/p>","images":false},"title":{"value":"Joyce and the West’s visits"},"version":1},{"date":{"d":20,"m":10,"y":2006},"datev":20061020,"info":{"content":"<p>Today was a reliving end to a hellish week. Monday we were officially bought out by Bottomline Technologies, a Nasdaq, American competitor. It was mentioned that up to 20 members of staff in the UK were to be made redundant. Quite a high figure as there were only 60 odd employees. Of course I was worried, but we in development thought we wouldn't be hit to hard! How wrong we were, as we were announced into Tuesday that 10 in our room were to go, 3 of which from Development!<\/p><p>Wednesday and Thursday were spent deliberating who was to go.... and this was a terrible time. Kind of akin to waiting to see if you were going to be hanged or not. I guessed I was in the bottom 4 and giving myself a %25 chance of staying. However, the wait was agonising and I couldn't work \/ think. Mentally draining. Because of UK law, management couldn't just choose someone and march them out like in the US, we had to be given reasons for redundancy and a scoring criteria was set out marking each individual in 30 different areas of the job.<\/p><p>David Winkworth was first to go on Thursday night and as soon as I knew that, my chance diminished to 99% chance of ending my days.<\/p><p>Funnily enough, I came to terms with this within an hour or so on Thursday night and felt happy as the pressure was off.<\/p><p>However, my mood turned into sadness on Friday morning as I waited and waited to get my cards. Just couldn't handle it. I was finally called into a room with Debbie and Darren and given the news.<\/p><p>My redundancy terms were<\/p><ul><li><i>Consultancy Period<\/i>1 week\u000a        <\/li><li><i>Notice<\/i>9 weeks (1 week for every year worked)\u000a        <\/li><li><i>Holiday owing<\/i>1 week\u000a        <\/li><li><i>Redundancy<\/i>9 weeks (1 week for every year worked - not taxable)\u000a        <\/li><\/ul><p>Overall I reckon I will be given between 5 and 6 months normal pay. This is a great relief and may end quite beneficial for us.<\/p><p>Did I agree I should go? Well maybe, maybe not. I agree I am the worst probably technically out of the 9. However, I can't believe that I am in the bottom 3 for personality traits or product knowledge. Anyway I have accepted the decision and not looking forward to the job seeking process, but I am looking forward to a fresh environment and challenge.<\/p><p>As part of my preparation for getting a job I need to obviously get a CV written. Currently I have nothing. Also, and maybe more importantly I need to gem up in quite a few areas in order to impress an interviewer and maybe more importantly get my confidence levels a lot higher, as currently I don't feel great.<\/p><p>On Wednesday the share money from the buy-out hit our account which equated to the equivalent of another 6 months’ salary. So not all bad at the end of the day. For me to get on with my career, I needed to leave FormScape, and the only way that was going to happen was for something like this. So I guess I am trying to say this can be seen as a blessing in disguise...... just hope it doesn't turn into a nightmare.<\/p><p>I would like to think that I get a number of interviews before Christmas. If I don't get a job by March then I guess questions will need to be asked why... and perhaps I ought to turn to something else. e.g. drilling!<\/p>","images":false},"title":{"value":"FormScape Buy Out - Shares and Redundancy"},"version":1},{"date":{"d":15,"m":10,"y":2006},"datev":20061015,"images":1,"info":{"content":"<p>Whilst Mummy and Katie were enjoying themselves at church, Daddy and Ben continued their journey north along the Grand Union canal, starting at Cowley, where they had left off a couple of weeks back.<\/p><p>Merrily on their way, unknown to them they had a puncture! Daddy hoped it was a slow puncture and asked a bargeman to lend us a pump. We continued another half a mile or so only to find the tyre had gone down even quicker! It was a 2 mile walk back to the car! Still, the weather was pleasant. It was a nice walk back.<\/p><p>In the afternoon we headed to Windsor Great Park and had a nice walk around.<\/p><img src='images\/years\/2006\/2006_10_15-05-KatieBenLaura-WindsorPark.jpg' class='diaryImage' alt='Windsor Great Park' \/><p class='diaryImageCaption'>Windsor Great Park<\/p>","images":false},"title":{"value":"Grand Union Bike Ride, Windsor Great Park walk"},"version":1},{"date":{"d":14,"m":10,"y":2006},"datev":20061014,"images":1,"info":{"content":"<p>In the morning we tootled into Camberley dropping Katie and Mummy off at the Arena for Elaina's birthday. They had setup a bouncy castle and soft play, but we considered it a bit old for Ben. Ben and Daddy went off to do some 'man' shopping at the butcher shop!<\/p><img src='images\/years\/2006\/2006_10_14-05-KatiePartyDress.jpg' class='diaryImage' alt='Party Outfit' \/><p class='diaryImageCaption'>Party Outfit<\/p><p>In the afternoon we Ben and Daddy came over and we went swimming still at the Arena. We also managed to pick up a Woolworths catalogue which Katie, in her womanly ways, began circling items she would like for Christmas. Apparently she was doing her homework!<\/p><p>Ben is continuing to be quite grizzlely at the moment, and we're not sure why. It could be the MMR jab last week, or that teeth are coming through. He's not eating like a good boy either. The spots that are all over his body are still there, but the doctor just said come back in a month. He's not seen his condition before, rather worryingly.<\/p>","images":false},"title":{"value":"Yelaina Birthday, Swimming"},"version":1},{"date":{"d":8,"m":10,"y":2006},"datev":20061008,"info":{"content":"<p>Daddy went to Chertsey in the morning to play in front of 150+ spectators in a charity match in aid of Derek Belsey (ex Chertsey Manager) who has terminal cancer. Daddy enjoyed the game, especially as it was played on the hallowed turf of Alwyns Lane. Big Pitch + Long Grass + No Right Midfielder + Unfit anyway = Exhausted.<\/p><p>The rest of us went to Church. Katie went with the big boys and girls to Sunday school.<\/p><p>In the afternoon we went to Herne Bay and dipped our toes in the sea and had chips! Ma Ma also naughtily bought Katie some new shoes.<\/p>","images":false},"title":{"value":"Herne Bay, Derek Belsey Charity Football Match"},"version":1},{"date":{"d":7,"m":10,"y":2006},"datev":20061007,"images":1,"info":{"content":"<p>After making a short trip into Camberley we went to Sophie's birthday party at Runabout, Pyestock.<\/p><p>We then rushed down to see Ma Ma and Pop Pop. We were a bit late for Diggerland, so went for a nice walk in Camer Park.<\/p><img src='images\/years\/2006\/2006_10_07-04-GerryCarolKatieBenLaura.jpg' class='diaryImage' alt='Logging Heck' \/><p class='diaryImageCaption'>Logging Heck<\/p><p>In the evening we stayed up late and watched Cinderella for the first time which made Katie cry!<\/p>","images":false},"title":{"value":"Sophie's Party, Camer Park"},"version":1},{"date":{"d":6,"m":10,"y":2006},"datev":20061006,"info":{"content":"<p>The rest of the company were told today that the company was subject to a trade sale. Basically we are being taken over by a Nasdeq listed company but yet to know who.<\/p><p>What this all means for Daddy is that the shares and share options are finally liquidated, but also his job potentially is under threat depending on what the new owners decide to do with us. The sale has not gone through yet, but it is only a matter of time. A sad time really, but business is business and things must move on.<\/p>","images":false},"title":{"value":"FormScape Take Over"},"version":1},{"date":{"d":30,"m":9,"y":2006},"datev":20060930,"images":2,"info":{"content":"<p>Mummy again had her Community Responder course, leaving Daddy to look after us. We dropped mummy off and walked into Frimley Green. Katie and Daddy held hands and chatted and sang songs most of the way there which was nice for Daddy.<\/p><p>At the library Katie just picked the first 7 books she found, which isn't very good. Ben on the other hand was going around the library pulling all the books off the shelves and squawking loudly. Daddy was a bit out of control. Still we managed to get some books and Katie got a sticker as she is part of the book club.<\/p><p>We then decided to walk to the Fars. Only Farfar was in and we played lots in the front room.<\/p><p>We got a lift back home and rushed our lunch and getting change to scooted down to the church in Sevenoaks. We arrived just in time and walked straight pass Grace. She is so different to Georgia, I couldn't believe it. Claire was in fine, bubbly form as usual and helped us along during the day.<\/p><p>The church service was quite informal it felt although none of us will really know as Daddy was chasing us around the church pews most of the time. Ben was squashing grapes on the cushions and squeezing under the pews whilst Katie found it funny to keep moving seat! Ben filled his nappy at the beginning of the service and stank, whilst Katie needed the toilet. So Daddy took us all outside, got the potty from the car and perched Katie at the side of the road to do her business, whilst trying to stop Ben from running into the road! This parenting lark is not easy when there is just the one of you.<\/p><img src='images\/years\/2006\/2006_09_30-01-GracePragassenChristening.jpg' class='diaryImage' alt='Grace being Christened' \/><p class='diaryImageCaption'>Grace being Christened<\/p><p>The service lasted under 30 minutes and there was a nice warm atmosphere. After the service we made the short trip to the lovely looking village of Chipstead, where the Pragassen's lived. There was some food laid on at the George and Dragon where we spent the rest of the afternoon.<\/p><p>We played in the garden with Georgia and her cousin which was nice. Georgia has grown into a confident, cracking girl. Unrecognisable from when we last saw her, 2.5 years previous.<\/p><p>We managed to chat to both Claire and James and everything seemed to be going very well. It's good to see them again and we really do need to meet up more often.<\/p><p>There were plenty of other children under 5 there for Katie to play with. She was quite taken with Daniel and they chatted and played very nicely together. It was nice to see.<\/p><img src='images\/years\/2006\/2006_09_30-08-GracePragassenChristening.jpg' class='diaryImage' alt='Katie was very keen on Daniel' \/><p class='diaryImageCaption'>Katie was very keen on Daniel<\/p><p>After Champagne and cake we made our way back home late back to mummy. Daddy just about managed and found it very rewarding. A lovely, tiring day.<\/p>","images":false},"title":{"value":"Grace Pragassen's Christening"},"version":1},{"date":{"d":23,"m":9,"y":2006},"datev":20060923,"images":3,"info":{"content":"<p>We went with the Weston clan to Longleat Safari Park. We met up before hand and converged into two cars. It was pretty busy and again unseasonally hot.<\/p><p>Benny boy was loving it to begin with, sticking his head out of the window to the giraffes, camel and zebras. Katie had seen it all before of course.<\/p><p>We quickly made our way to the naughty monkey area. Well our car ariel got ripped off. Gee thanks. Plus sabotage from the other car as they planted a cookie on our back windscreen wiper. There was only a little bit of damage.<\/p><img src='images\/years\/2006\/2006_09_23-42-Longleat.jpg' class='diaryImage' alt='Monkey on our backs' \/><p class='diaryImageCaption'>Monkey on our backs<\/p><p>Anyway I don't think Ben knew what to quite make of them being so close. He took it in his stride, but was very interested in them. Katie noticed they had red bottoms!<\/p><p>Unfortunately one of the tigers died in the summer (who we had seen on the TV programme), so there was just the one tiger which we didn't get a great view of which was a bit of a shame. However, it was at least a bit more lively than the lazy pride of lions where were basking in the midday sun.<\/p><p>Our 1 hour plus tour of the animals ended with us in need of our picnic.<\/p><p>Daddy and Ben went to see the racing cars in the car park which was nice. We ate our picnic, played a bit of bally before making our way to the trip on the boat.<\/p><img src='images\/years\/2006\/2006_09_23-14-Longleat.jpg' class='diaryImage' alt='Ben impressed with the cars' \/><p class='diaryImageCaption'>Ben impressed with the cars<\/p><p>The lake was filled with Sea Lions and a couple of hippos. We were thrilled to see the Sea Lions jump out of the water alongside the boat.<\/p><p>The hippos and gorilla's on the island were a bit disappointing as they barely moved. Still we returned to the old terra cotta (as Del Boy says). We split in two. Us kiddies and mummies went to the Postman Pat village which we all enjoyed. It was a model village where you could press buttons to make some of the models move. The others went on the 'stimulator' as Mummy put it! A real back breaker.<\/p><img src='images\/years\/2006\/2006_09_23-27-Longleat.jpg' class='diaryImage' alt='Ice cream kids' \/><p class='diaryImageCaption'>Ice cream kids<\/p><p>We went on the train around the park, then into Pets Corner where some of us touched\/stroked a snake. Well Joey almost out pythoned the python by giving it a could squeeze. 'Joey in a china shop'. Some unmentionables were too scared to even touch the snake.<\/p><p>We finally went on the tea cup ride. Katie said this was her favourite part of the day. Pop Pop made a great impression on the girl in his cup. She looked thrilled.<\/p><p>We raced home for fish and chips then straight to bed.<\/p>","images":false},"title":{"value":"Longleat Safari Park"},"version":1},{"date":{"d":17,"m":9,"y":2006},"datev":20060917,"images":2,"info":{"content":"<p>In the morning Katie and Mummy went to (boring) church, whilst Daddy and Ben continued on the Grand Union trail, starting where we last left off in Cranbrook (just by the Bulls Bridge).<\/p><p>We can't say it was the most picturesque of rides, but it must have been quite an experience for Ben riding past the factories with the different industrial smells and sounds and the sheer size of some of the places. There was a lot of rubbish in places as well. We even went passed a hangout for what I can only assume were drunks or druggies.<\/p><p>There were plenty of style type gates, which was particularly awkward to begin with until Daddy tried, lifting the bike with one hand, whilst swinging on the gate support with the other and swinging Ben over the water whilst still on the bike. I think Mummy would have gone mad if she knew (she never reads this anyway).<\/p><p>It was a really hot 22+ degrees which for the middle of September is quite something. Anyway we were restricted by time and only made it to Cowley Recreation ground (see Google Earth) where we stopped off and played in the swing park.<\/p><img src='images\/years\/2006\/2006_09_17-04-GrandUnionWindsor.jpg' class='diaryImage' alt='Grand Union' \/><p class='diaryImageCaption'>Grand Union<\/p><img src='images\/years\/2006\/2006_09_17-07-GrandUnionWindsor.jpg' class='diaryImage' alt='Oh So Grand Ben' \/><p class='diaryImageCaption'>Oh So Grand Ben<\/p><p>We made our way back in the Hayes direction twice as quick as our outward journey. Ben was quite quiet and serious on the back.... chilling and taking it all in Daddy likes to think.<\/p><p>In the afternoon we went over to Windsor Great Park and stopped off to the National Carriage Riding championships. It was funny to see people all dressed up riding the lovely horses around. We sneaked in and went by the main arena. Only later did we discover we had to pay. Ooops never mind. Again Ben really got excited when he saw the animals.<\/p>","images":false},"title":{"value":"Grand Union Canal, National Carriage Championships"},"version":1},{"date":{"d":16,"m":9,"y":2006},"datev":20060916,"images":1,"info":{"content":"<p>Mummy was at her Community Responder course, leaving Daddy being responsible for us! We took Farmor and Auntie Susan to visit Odds Farm. It was a nice day and we were excited when we got in and saw the rabbits and guinea pigs. We both climbed in the pen to feed the rabbits and even stroked them!<\/p><p>We jumped around on the hail bails and played on the cars before making our way outside to catch the end of the sheep race. There were lots of playgrounds there, so I think we were more interested in that than the animals.<\/p><p>We caught the midday tractor ride, then had lunch (whilst playing on the playground). We continued around and Katie almost fed the goats. Ben surprisingly said 'go', meaning 'goats'. Another word to add to his vocabulary.<\/p><p>We saw Farfar in the piggy enclosure, and saw a lovely big horse (whose breed escapes me). We ended with a talk on the rare breeds of goat that were there. Over all Ben really enjoyed getting close to the animals, and felt proud when he stroked the rabbits.<\/p><img src='images\/years\/2006\/2006_09_16-16a-OddsFarm.jpg' class='diaryImage' alt='The Odds' \/><p class='diaryImageCaption'>The Odds<\/p>","images":false},"title":{"value":"Odds Farm"},"version":1},{"date":{"d":13,"m":9,"y":2006},"datev":20060913,"info":{"content":"<p extra=\"phrase\">I want to coin the phrase 'Blue Light Surfing'. It's when an ambulance or police car has got it's blue lights on and all the cars pull to one side giving space for them to go through. It also gives space for me to follow right behind as well. Very handy for getting through traffic fast.<\/p>","images":false},"title":{"value":"Blue Light Surfing"},"version":1},{"date":{"d":10,"m":9,"y":2006},"datev":20060910,"info":{"content":"<p>Mummy, Katie and Boo went to meet Ma Ma and Pop Pop at Reigate Park. We had a picnic and then fed the ducks. We didn't have any bread but a kind man took pity on us and made his daughter give us some of her bread! We had a go on the swings and then had a much needed ice cream as it was very hot. Boo had a lolly but preferred to eat the stick, much to Pop Pops horror as the lolly melted down Ben's arm (Pop Pop hates sticky mess)! Mummy then got stung  on the back of her leg by a wasp as she bent down to put Katie's shoes back on and it did hurt. We had a walk round the park and went back to the swings before coming home.<\/p>","images":false},"title":{"value":"Reigate Park"},"version":1},{"date":{"d":9,"m":9,"y":2006},"datev":20060909,"info":{"content":"<p>Sarah went into labour today, and so we babysat Oliver. We went to the swings, played football and games at home.<\/p><p>Sarah gave birth to a little baby girl, Sophia at Frimley Park.<\/p>","images":false},"title":{"value":"Oliver over"},"version":1},{"date":{"d":8,"m":9,"y":2006},"datev":20060908,"info":{"content":"<p>Daddy sometimes takes on his Bike up to the community centre and back. Real slow. On this occasion Daddy took Ben over, however, this time the Police happened to be passing by<\/p><p>\"You are joking aren't you?\", barked out of the Police car by a police woman. Anyway Daddy was very apologetic and had to return Ben home on foot before coming back for the bike! Anyway I think that has put paid to our little rides. :(<\/p>","images":false},"title":{"value":"Police Stop"},"version":1},{"date":{"d":3,"m":9,"y":2006},"datev":20060903,"images":1,"info":{"content":"<p>Church and Photo scanning in the morning.<\/p><p>The afternoon turned out really nice. 25 degrees. We headed to Staines to a playground we visited a couple of years ago. Anyway there was a really cool water park bit where there were fountains spurting water up. Benny took a while to get used to it and enjoy it. Katie on the other hand was in and out and sitting on the fountains. Katie brought her 'big girls bike' and we rode to feed the ducks and go on the playground. Playground are the kids favourite form of entertainment at the moment.<\/p><img src='images\/years\/2006\/2006_09_03-01-Staines.jpg' class='diaryImage' alt='Splash, splash, splash' \/><p class='diaryImageCaption'>Splash, splash, splash<\/p>","images":false},"title":{"value":"Staines (Ashby) Playground"},"version":1},{"date":{"d":2,"m":9,"y":2006},"datev":20060902,"images":1,"info":{"content":"<p>Today Mummy had her first lesson to be a community emergency response lady, so she was training with a defibrillator, doing CPR and the such like.<\/p><p>This left Daddy, with a hangover to take us out. We went to the Fars where we played quite a bit before heading to Bracknell and the Look Out. We had a mooch around the 'Go Ape' ariel assault course which Farmor confidently said she wanted to go on for her 60th. We then saw some of the longer, higher abseil runs which turned her enthusiasm a bit I think.<\/p><p>We had lunch at the playground which we all enjoyed. Benny turned a few of the ladies heads again with his smile. Katie loved going around the big wooden castle.<\/p><img src='images\/years\/2006\/2006_09_02-KatieBen.jpg' class='diaryImage' alt='Katie and Ben having a rocking time' \/><p class='diaryImageCaption'>Katie and Ben having a rocking time<\/p><p>We then popped across the road to Coral Reef which was packed. Katie loved her mini slide whilst Daddy took Ben on the 'Family' flume which Ben enjoyed which was a relief.<\/p><p>It was 6 years ago that Mummy and Daddy got married. Tonight they went to the Wings restaurant, which is on the boat at the Lakeside complex for a Chinese meal. It was lovely, especially with a pianist playing in the corner. We got a shock when the bill came to £100. Fortunately this was for another table. Mummy went for a vegetarian option, whilst Daddy went for the Dumplings and Tropical Duck!<\/p>","images":false},"title":{"value":"Coral Reef, Look Out - 6th Wedding Anniversary"},"version":1},{"date":{"d":1,"m":9,"y":2006},"datev":20060901,"images":1,"info":{"content":"<p>We went to the farm today with a few of Katie's playschool friends and their mums. It was a lovely day. Ben loved the animals. Katie loved the swings as usual and the trampolines. She groomed a big pony and stroked a mouse which Amelia held. We had a nice picnic and didn't get home until late.<\/p><p>Daddy went to the Prince Of Wales (or Princess Of Wales as Baz calls it) for the Casuals RIP do. It was great to see so many faces not seen for a while. Barrie was waiting for Daddy with a pint. The drinking went a little too well. Anyway Gary, Nick, Martin and Phil all also turned up half an hour early! I repeat there was 6 of us half an hour early! Mike Collis, Age Williams, Phil C, Dave Weaver, Dawg, Vincey and Paul Deer turned up. It was like the good old days. Barrie and Gary on top form. It was nice to see a video of Gary's twins. They did look ever so cute. We got chucked out late and Daddy proceeded to meander home on his push-bike. The night ended predictably with a couple of hurls and having to sleep downstairs on the floor! One day Daddy will grow up!<\/p><img src='images\/years\/2006\/2006_09_01-Casuals.jpg' class='diaryImage' alt='Casuals Farewell' \/><p class='diaryImageCaption'>Casuals Farewell<\/p>","images":false},"title":{"value":"Finkley Down Farm - Casuals Reunion"},"version":1},{"date":{"d":31,"m":8,"y":2006},"datev":20060831,"info":{"content":"<p>Ma Ma came over for the day and we took her to Wizzy world. It was good but as it was the school holidays it was packed and with lots of big children and it was also so hot in there. Ma Ma enjoyed taking Katie round, and Oliver and Henry came later, they all played so well, waiting for each other. After this we popped in to see Uncle Howard at Wicks, Freya's to drop off the gazebo and Great Grandma and Granddad’s house.<\/p>","images":false},"title":{"value":"Wizzy World"},"version":1},{"date":{"d":30,"m":8,"y":2006},"datev":20060830,"info":{"content":"<p>We went to Gravesend in the morning to do a few jobs then we went to New Barn Park. We got the little train to the swings which Ben loved. Joey and Katie went in the little paddling pool while Ben ate his lunch. We went in the swing park, had a lolly pop (Ben had mine) and then Mummy had to really persuade Katie to go on the little chair merry-go-round because she wanted to go on the teacups. Once she was on it though she shouted \"I love this ride mummy\" which was good because they were always mummy’s favourite as well. Joey went on it as well and he wasn’t sure at first but then he saw Katie laughing and he was fine.<\/p>","images":false},"title":{"value":"New Barn Park"},"version":1},{"date":{"d":29,"m":8,"y":2006},"datev":20060829,"info":{"content":"<p>We went to see Auntie Karen and Summer today, Auntie Ellie and Joey came too. Katie loves it so much there because Summer has got such lovely toys indoor and out. After that we went to Ma Ma and Pop Pop's (or popadoodles as Katie calls him). We had tea and a bath, then Ben went to sleep but Katie wouldn't. Mummy and Pop Pop were due to go to the cinema and Katie was more than happy to stay up and watch Bambi with Ma Ma and Auntie Ellie with a little treat. Apparently she loved the film and only had to hide twice under the covers with Ma Ma! Mummy and Pop Pop really enjoyed the film Snakes on a Plane.<\/p>","images":false},"title":{"value":"Summer's House"},"version":1},{"date":{"d":28,"m":8,"y":2006},"datev":20060828,"images":1,"info":{"content":"<p>We travelled down south and met with Joey and Uncle Michael at Marwell Zoo. It was nice for Daddy and Michael as they don't spend enough time with all us under 4's! Anyway the relatively expensive admission did not match the number and quality of animals. The lions had left the zoo, the cheetahs were asleep, the tigers were hiding! Anyway we lapped around the park in the train and enjoyed the rhinos and giraffes the most.<\/p><p>Mummy's highlight was when she took Joey on the roundabout-chair ride.<\/p><img src='images\/years\/2006\/2006_08_28-14-MarwellZoo.jpg' class='diaryImage' alt='Katie, Joey and Ben' \/><p class='diaryImageCaption'>Katie, Joey and Ben<\/p>","images":false},"title":{"value":"Marwell Zoo"},"version":1},{"date":{"d":27,"m":8,"y":2006},"datev":20060827,"images":1,"info":{"content":"<p>Farfar had invited Shirley and Michael, Ron and Maureen, Graham's Parents, Ma Ma and Pop Pop and half a dozen Railway men to celebrate his 60th birthday.<\/p><p>The weather held off and Graham had prepared an excellent BBQ'ed pork, slow cooked for 3 hours to go along with Farmor's excellent culinary efforts. We sat on long tables and tucked in. Katie and Ben were amusing themselves with the toys in the back garden.<\/p><p>After Farfar's speech we had desert and we went with Ma Ma, Pop Pop, Ellie and Joey to the swings opposite the hospital, which was a bit further away than we thought.<\/p><p>It was nice to see everyone, particularly Uncle Ron who we don't see so often. He is very laid back and easy to talk to.<\/p><p>We left for home about 6-ish. Daddy returned later to help wash up and the railway crew were still going strong at 9pm! A lovely day.<\/p><img src='images\/years\/2006\/2006_08_27-09-Farfar60thParty.jpg' class='diaryImage' alt='Garden Party' \/><p class='diaryImageCaption'>Garden Party<\/p>","images":false},"title":{"value":"Farfar's 60th Birthday Party"},"version":1},{"date":{"d":26,"m":8,"y":2006},"datev":20060826,"images":1,"info":{"content":"<p>Mummy was supposed to be doing her training to be a community emergency response lady, but yet again that was cancelled due to others pulling out. So instead the four of us went up to London.<\/p><p>After we finally parked in Turnham Green, we caught a double decker (yes Daddy they're are double deckers this far out of the West End!) to Notting Hill gate and entered Hyde Park.<\/p><p>We first hit the very different playground. Sort of a playground for the rich. A lot of local 'lar de das'. There was a huge wooden ship which Daddy and Katie climbed to the top of the mast and pretended to be pirates! There were wigwams and the usual slides and swings.<\/p><p>\u000a        We walked down to the<a href=\"http:\/\/www.royalparks.gov.uk\/parks\/hyde_park\/diana_memorial.cfm\">Diana's Memorial Fountain<\/a>and dipped out feet in the freezing cold water. We stopped here for our picnic, before making our way to\u000a        <a href=\"http:\/\/www.travellondon.com\/templates\/attractions\/gallery_Speakerscorner.html\">\u000a          Speakers Corner\u000a        <\/a>\u000a        .\u000a      <\/p><p>We all went on Bob Wilson's old fashioned carrousels which we all enjoyed. Katie and Ben also went on the small roundabout.<\/p><p>We went passed the mini Arc De Triomphe (Marble Arch) and walked along Oxford and Regent's street. We got Ben's first pair of shoes in Clarks and wafted around Hamley's. Katie got stuck in the Barbie section with Mummy, whilst Daddy and Ben were watching the radio controlled cars and playing with the trains! Stereotypical eh?<\/p><p>We bussed it back again and wearily made our way back home.<\/p><img src='images\/years\/2006\/2006_08_26-09-London.jpg' class='diaryImage' alt='Us at the Diana Memorial Fountain' \/><p class='diaryImageCaption'>Us at the Diana Memorial Fountain<\/p>","images":false},"title":{"value":"Hyde Park - Oxford and Regent Street"},"version":1},{"date":{"d":22,"m":8,"y":2006},"datev":20060822,"images":2,"info":{"content":"<p>We went around to the Fars to celebrate his 60th birthday with a birthday breakfast. Katie helped open his presents. We got him a steam train driving lesson on the Watercress line.<\/p><img src='images\/years\/2006\/2006_08_22-04-FarfarBDay.jpg' class='diaryImage' alt='Biker Ben' \/><p class='diaryImageCaption'>Biker Ben<\/p><img src='images\/years\/2006\/2006_08_22-12-FarfarBDay.jpg' class='diaryImage' alt='Katie and Farfar opening presents' \/><p class='diaryImageCaption'>Katie and Farfar opening presents<\/p><p>A number of amusing conversations<\/p><ul><li><i>katie<\/i>I don't need to worry about the cars.\u000a        <\/li><li><i>mummy<\/i>Why is that\u000a        <\/li><li><i>katie<\/i>If I get squashed, Ma Ma will pump me up again!\u000a        <\/li><\/ul><p>Another one...<\/p><ul><li><i>katie<\/i>Play with me\u000a        <\/li><li><i>mummy<\/i>I can't, I'm feeding Ben\u000a        <\/li><li><i>katie<\/i>Daddy won't mind doing that! Play with me.\u000a        <\/li><\/ul><p>Well thanks Katie at least Daddy knows what he is good for.<\/p>","images":false},"title":{"value":"Farfar 60th Birthday"},"version":1},{"date":{"d":20,"m":8,"y":2006},"datev":20060820,"info":{"content":"<p>Mummy, Katie and Boo went to Virginia Water for a walk today. Katie took her bike and we had a lovely time. We fed the ducks and picked some blackberries. In the end we had to race back to the car as it started to pour with rain and on the way back a dog ran up to us, scaring Katie and making her wobble off her bike.<\/p><p>Went over to Martin's who done a very good BBQ. Daddy managed to infect Ellie, Michael, Barrie, Laura, Freya and Richard with his cold-stomach bug!<\/p><p>It was good to catch up again.<\/p>","images":false},"title":{"value":"Virginia Water and Martin Aves BBQ"},"version":1},{"date":{"d":16,"m":8,"y":2006},"datev":20060816,"info":{"content":"<p>Jørgen took us to the airport. This time the checks not so stringent. The Fars were on the same flight to and we managed to get seats all together. The Fars enjoyed entertaining Katie with colouring and stuff.<\/p><p>Charlotte came to pick us up which was very kind and got told by Katie not to drop her h's.<\/p><ul><li><i>charlotte<\/i>How are you Ka'ie\u000a        <\/li><li><i>katie<\/i>It's Katie, not Ka'ie!\u000a        <\/li><\/ul>","images":false},"title":{"value":"Denmark Holiday - Plane Home"},"version":1},{"date":{"d":15,"m":8,"y":2006},"datev":20060815,"info":{"content":"<p>Mummy and Daddy were under the weather today. Therefore they felt it best not to visit Oldemor which was a real shame. So in the morning we took a walk around the beach area close to the flat. Farfar thankfully came over to help out.<\/p><p>We then went a very scenic route to meet up with Farmor at the main line station for some lunch. We tried to get some Calpol for Ben, but was told that it is prescription only. Thankfully we didn't need it in the end.<\/p><p>Tivoli was our next stop. The Fars had kindly paid for the entrance and for Katie to go on all the rides.<\/p><p>Katie went on the cars twice, the planes twice where she could control her altitude, a motorbike and a boat on the lake. Lise and Jørgen joined with up with us later on.<\/p>","images":false},"title":{"value":"Denmark Holiday - Tivoli"},"version":1},{"date":{"d":14,"m":8,"y":2006},"datev":20060814,"first":{"value":null},"images":1,"info":{"content":"<p>The zoo was possibly the kids favourite day. We arrived mid-morning and circled the old zoo. We first saw the polar bear and brown bear, restless, standing on its hind legs. A big mother. We saw a huge bull elephant in one enclosure who was trying to cause mischief with all his lady relatives who were in another part. There was a large development program to build the elephants a new enclosure. Katie of course loved the animals, but Ben was now beginning to also show a real interest. Flapping arms and high pitched squeals told us that he enjoyed it. We saw tigers, lions, leopards, sea lions, etc..<\/p><p>We later went under the tunnel to the Children’s Zoo. Ben's favourite were the Tasmanian Devil's, which are the only ones to be found outside Australia apparently. They ferret around and cause mischief, just like Ben! There were all the usual farm yard type animals as well as giraffes and zebras.<\/p><p>We later circled the park once more this time in the train to say goodbye to all the animals.<\/p><woops rating=\"7\" woopstitle=\"Evacuation of bus in rush-hour Copenhagen\"><p>On the bus coming back from the Zoo in the rush hour. Bus full of commuters and I'm sitting next to nice looking blonde! The stomach turned, apologized to the lady and rushed to the front of the bus about to ask the driver to stop..... but too late..... Weeerrrr, weeerrr, chunder, chunder.<\/p><p>I tried to catch the mashed nectarines so not to make too much mess in the bus. My head slumped over, I look across to the bus driver with my eyes pleading at him to stop and open the doors..... he blanked me and continued to throw up twice more.<\/p><p>Up the entrance doors of the bus, on the floor, all over my t-shirt and trousers. Nice! He eventually stopped, I hopped out, lent up against some house and continued what I obviously hadn't finished off. Katie was crying at the sight of me hurling. I'd woke Ben up, who now was also crying. The bus continued with the Lau and the screaming kids with people giving Laura evil looks.<\/p><p>The bus driver contacted 'control' and was told to return to the garage immediately. The 40 or so people on the bus had to all get out and catch the next bus which I had later got on! Thought in the interests of Danish\/Anglo relations I'd hop off!<\/p><img src='images\\years\\2006\\2006_08_14-01-bus.jpg' class='diaryImage' alt='Copenhagen Bus' \/><p class='diaryImageCaption'>Copenhagen Bus<\/p><p>Daddy ended up being sick 5 times in the end.... once at both ends at the same time.<\/p><p>Also Katie wasn't happy with the situation and wanted to go home.<\/p><ul><li><i>katie<\/i>I want to go home.\u000a    <\/li><li><i>mummy<\/i>We can't go home darling. All the pilots have gone to bed.\u000a    <\/li><li><i>katie<\/i>We go and wake the 'pirates' up.       \u000a    <\/li><\/ul><\/woops>","images":false},"title":{"value":"Denmark Holiday - Zoo"},"version":1},{"date":{"d":13,"m":8,"y":2006},"datev":20060813,"images":1,"info":{"content":"<p>We popped over to Lise and Jørgen’s summer house for a Danish Sunday breakfast. Pastries and rolls<\/p><p>The weather continued to be a problem when we dropped Lise, Mummy and Farfar off at St Albans, whilst we went with Daddy and Jørgen to see the little mermaid. But the heavens opened and we all got soaked. Still Katie liked the Mermaid and it was lucky she didn't slip into the sea for a swim. Despite the weather there seemed to be loads of tourists mainly from Eastern Europe.<\/p><p>As we were so wet we returned to the flat to get changed before venturing to Herlev to see Oldemor.<\/p><p>Oldemor was in good form. Daddy made her laugh anyway when he tried her glasses on! She didn't seem to comprehend that her 2 great grandchildren had entered the room, or at least didn't show much emotion, but we were to expect that, and we hoped that we wouldn't over awed her. We had some dinner, but didn't spend more than an hour or so with her. She was quite happy knitting.<\/p><p>We made the long journey home, pleased having spent some time with Oldemor.<\/p><img src='images\/years\/2006\/2006_08_13-EllenMartinBen.jpg' class='diaryImage' alt='Ben and Oldemor meet' \/><p class='diaryImageCaption'>Ben and Oldemor meet<\/p>","images":false},"title":{"value":"Denmark Holiday - Church and Oldemor"},"version":1},{"date":{"d":12,"m":8,"y":2006},"datev":20060812,"info":{"content":"<p>Currently there is a high state of security surrounding airplane flights from London and today the queues were long at 6am! We had to skip the queue at check-in, and where you go through the metal detector. Even Katie got frisked, although Ben did not. I supposed it gives some sort of comfort that there are stringent checks. Overall we were just 15 minutes late.<\/p><p>Lise and Jørgen came to pick us up and take us to their flat which they kindly gave us for our holiday. We unpacked, and headed straight for town on the 2A bus.<\/p><p>The weather was changeable, but we walked through the city centre unscathed on to the Round Tower. There Katie enjoyed hiding in the little cave holes and jumping out on the rest of us.<\/p>","images":false},"title":{"value":"Denmark Holiday - Airport Fun and Roundtower"},"version":1},{"date":{"d":11,"m":8,"y":2006},"datev":20060811,"info":{"content":"<p>Came home today, stopping in Lymington for a swim and Winchester services for lunch. Mad rush to get some washing done as off to Denmark at 4:30 tomorrow!<\/p>","images":false},"title":{"value":"Camping Holiday - Swimming"},"version":1},{"date":{"d":10,"m":8,"y":2006},"datev":20060810,"info":{"content":"<p>We went to Bournemouth today. We parked at Canford Cliffs and had lunch on the beach and a play in the sand. Mummy, Katie and Auntie Charlotte braved the cold sea right up to our shoulders, which Katie loved and wouldn't let us get out. Then Joey and Ben slept in the double buggy and Katie in the single one and we walked all the way to Bournemouth. Katie had a go on the trampolines and Katie and Joey went on the Carousel. We had our daily ice cream and caught the land train back to Durly Chime where we had tea in a pub and walked the long way back with both Katie and Ben tired and wanting Mummy to cuddle them all the way! Not a very good night’s sleep, Benny must have kept the whole campsite awake! I think it was getting more uncomfortable as the duvets were very flat from sleeping on them so much.<\/p>","images":false},"title":{"value":"Camping Holiday - Bournemouth"},"version":1},{"date":{"d":9,"m":8,"y":2006},"datev":20060809,"info":{"content":"<p>\u000a        We met Lynne and Rachel at some<a href=\"http:\/\/www.lymington.biz\/whattodo\/everton.asp\">water gardens<\/a>which were nice but quite small, so went on to a nice beach and had lunch and a paddle. Katie assured us that she had seen a swing park as we drove into the car park, none of us believed her but we humoured her and went to where she said and sure enough there was a fantastic park all grassy which was great for Ben. We went back to the campsite for a walk to see the New Forest ponies and for tea. Not such a good night’s sleep, Benny was quite unsettled.\u000a      <\/p>","images":false},"title":{"value":"Camping Holiday - Water Gardens"},"version":1},{"date":{"d":8,"m":8,"y":2006},"datev":20060808,"info":{"content":"<p>\u000a        We went to the<a href=\"http:\/\/www.dorset-heavy-horse-centre.co.uk\/\">Heavy Horse Centre<\/a>today. It was great that Katie had a go in a little cart pulled by a Shetland pony much to the surprise of us all. She also went in their stable and groomed them with brushes and so did Benny which he enjoyed, but I'm not sure if the horse did. Ma Ma, Katie, Ben, Joey and Auntie Ellie also went in a cart pulled by a Shire horse. Mummy enjoyed looking around the Romany caravan that was there. We then went back to the tent and had a lovely BBQ with Uncle Howard, Uncle Richard and Auntie Sue, and had another good night’s sleep all snuggled up.\u000a      <\/p>","images":false},"title":{"value":"Camping Holiday - Heavy Horse Centre"},"version":1},{"date":{"d":7,"m":8,"y":2006},"datev":20060807,"info":{"content":"<p>Daddy went to pick Farfar up this morning, 25 minutes before his train leaves. He arrived and Farfar was still in pants and socks..... TV on from the night before (as he fell asleep in front of the tele) and suitcase still to be packed!!! Daddy asks what he can do to help and wants Daddy to address an envelope for some football club errand!!!!!! Can he be any worse? Anyway, fortunately the train was late, so he got to Gatwick in time.<\/p><p>We set off early for our holiday to the New Forest. Girls only (except for Joey and Benny and possibly Toby too). We all met at Winchester service station for a coffee and a go on the swings. Ma Ma bought Katie and Joey a frog deck chair each, ready for our camp fires! We got to the campsite, it was packed and it took a while to find a nice spot. We put the tents up in about an hour. While Mummy, Auntie Charlotte and Auntie Ellie put the tents up Ma Ma took Katie for a ride on her scooter and they found a blackberry bush and for the rest of the holiday Katie became obsessed with riding her scooter round the berry bush. Katie has actually become very good on her scooter and whizzed around really fast loving it. We then went off to Lymington for lunch. We ate baguettes by the harbour but there wasn't much to do, so we left and found a nice beach to sit on. From there we bought fish and chips and ate them outside the tent. We all went for a shower which Benny hated and sobbed his eyes out. Then we all cuddled up in the tent and had a surprisingly good night’s sleep!<\/p>","images":false},"title":{"value":"Oh Dear Farfar - Holmsly Camping Holiday"},"version":1},{"date":{"d":6,"m":8,"y":2006},"datev":20060806,"images":2,"info":{"content":"<p>After church we went over to Gravesend for Summer's 2nd birthday which was in her back garden. There were loads of goodies, but by far the favourite for Katie and Ben was the colourful Wendy House.<\/p><p>Karen and Bradley's next door neighbours who are foster parents were there. They had just received a pair of twin boys who were born at 1 pound each to a 14 year old girl who gave them up straight away. They were very active, but remedial 3 year olds. I just think what special people they are to take on someone else’s kids and care for them so well. I can only admire them and wish them luck.<\/p><p>We enjoyed chasing after the kids for a few hours, it was so hot.<\/p><img src='images\/years\/2006\/2006_08_06-10-SummersBday.jpg' class='diaryImage' alt='Katie Attitude' \/><p class='diaryImageCaption'>Katie Attitude<\/p><img src='images\/years\/2006\/2006_08_06-16-SummersBday.jpg' class='diaryImage' alt='Ben' \/><p class='diaryImageCaption'>Ben<\/p>","images":false},"title":{"value":"Summer's 2nd Birthday Party"},"version":1},{"date":{"d":5,"m":8,"y":2006},"datev":20060805,"images":2,"info":{"content":"<p>It was Ben's first birthday. As is customary we all piled into Mummy and Daddy's bed and helped Ben open his presents. What a lot of toys he got. Mummy and Daddy got a big yellow truck which Ben loved to climb into!<\/p><p>In the afternoon we had some family and friends over for a Benny Boo BBQ party. It was pretty manic, but very enjoyable. Katie thought it was her birthday with all the presents. The children played in the big paddling pool, and the adults played games like Musical Islands and Pass The Parcel! The party ended with birthday cake and 'goody bags'.<\/p><p>Thank you everyone for their presents.<\/p><img src='images\/years\/2006\/2006_08_03-02-KatieNurse.jpg' class='diaryImage' alt='Junior Nurse Gay' \/><p class='diaryImageCaption'>Junior Nurse Gay<\/p><img src='images\/years\/2006\/2006_08_05-05-BenBday.jpg' class='diaryImage' alt='Birthday and his truck' \/><p class='diaryImageCaption'>Birthday and his truck<\/p>","images":false},"title":{"value":"Ben's 1st Birthday Party"},"version":1},{"date":{"d":31,"m":7,"y":2006},"datev":20060731,"info":{"content":"<p>We met Ma Ma and Auntie Charlotte at the Star Pub for a drink, then we drove in convoy to Horton Country Park where we had a lovely picnic (Ma Ma had brought Katie chocolate cornflake cakes, her favourite).<\/p><p>Next, we went for a walk and saw the horses and some of the other farm animals, which Ben really enjoyed. We found a really good swing park and then went and had an ice-lolly. After that we drove to Henry's for his birthday tea party. Katie was the only girl amongst eight boys!<\/p>","images":false},"title":{"value":"Henry's Party"},"version":1},{"date":{"d":30,"m":7,"y":2006},"datev":20060730,"images":1,"info":{"content":"<p>After a turbulent morning we decided to go off to Dorset. Originally we were to go to Lullworth Cove, but as we were skirting around Bournemouth at midday, we thought it was getting a bit late to make the longer journey, so we decamped a mile or two to the west of Bournemouth at a place called Canford Cliffs.<\/p><p>Still with the sandy beaches, but with much less people. The sand was so soft, it felt like walking on flour. Again we had our picnic on the beach. It didn't seem the warmest of days as it was pretty blustery and cloudy. However, mummy and Katie were first to brave the sea. Katie didn't want to be left to her our devices, she needed Mummy to hold her. Ben didn't even like standing in the water. That was a definite no, no. Daddy and Ben were making pits in the sand. At least this time Ben has seemed to learn not to eat the sand all the time.<\/p><p>We all went for a nice walk along the water’s edge and back along the promenade, of course to get Katie an ice cream. We had a really nice time again and dreamed of one day owning one of the beach huts.<\/p><img src='images\/years\/2006\/2006_07_30-07-CanfordCliffs.jpg' class='diaryImage' alt='Enjoying the sandy beach' \/><p class='diaryImageCaption'>Enjoying the sandy beach<\/p>","images":false},"title":{"value":"Canford Cliffs"},"version":1},{"date":{"d":29,"m":7,"y":2006},"datev":20060729,"images":1,"info":{"content":"<p>Another hot and sunny day and we decided to go off to Horsham and try out the Pavilion swimming pool which Ellie and Michael recommended to us. It was fantastic. Just right for Katie and Ben. They had 3 separate pools all reasonably shallow. One of the pools had an exit outside to the rapid river area. Ben is still not 100% comfortable with the water just yet. He looks so shocked when water splashes his face, even though he's used it in the bath. Katie on the other hand just loves playing and jumping in off the sides. She doesn't ever fancy learning or trying to swim that much, I assume that's seen as too boring. Katie Nemo and Daddy Nemo played lots together and we could have stayed in there for a lot longer.<\/p><p>After the swim we went and played on the very modern and large playground just outside the swimming pool. However, we were hungry and were desperate for our lunch so we tootled off for part 2 of our day.<\/p><p>We drove to just outside Horsham to a small village called Baynards. We found a nice village green type place to stop and eat. Locals must of wondered what on earth was going on.... just like we would think if someone came to stop and eat a picnic on Frimley Green! We treated ourselves to using the picnic hamper, mainly to impress Katie, but she didn't seem that bothered by it.<\/p><p>Now mid-afternoon we went to search for the start of our 4.25 mile walk which we got out of our book (Thanks Steven and Joyce). We wondered if we were ever going to finish in time. Still we marched on along a disused railway line, through lots of stiles, which is not easy with a double buggy, some woods and some farmers fields, some of which were populated with cows, much to the annoyance of Katie and Mummy (who are scared off them). On one occasion the cows started to approach us Mummy ran off, leaving Daddy and Katie with the pushchair. Gee thanks Mum. Daddy then started to approach the cows in return, waved his arms and made very loud moo noises. Not sure who was most scared the cows or the rest of us!<\/p><img src='images\/years\/2006\/2006_07_29-07-BaynardsWalk.jpg' class='diaryImage' alt='Where are we going?' \/><p class='diaryImageCaption'>Where are we going?<\/p><p>After only getting lost a couple of times we finally made it back to the car and raced home! A lovely day out just the four of us!<\/p><p>One thing we have really noticed this weekend is that Ben seems to laugh at a lot of things without us having to try and make him laugh. We go along sometimes and we just here this chuckle in the back. We haven't got a clue what he is laughing at. He's a real boy. He loves airplanes, tractors and to do lots of poo's.<\/p>","images":false},"title":{"value":"Horsham and Baynards Walk"},"version":1},{"date":{"d":26,"m":7,"y":2006},"datev":20060726,"info":{"content":"<p>Today we went to meet Auntie Lindy and Ella at Hayling Island and it was one problem after another. First Mummy got the time of Katie's doctor’s appointment wrong so we missed it, then we got stuck in traffic (taking two hours to get there), then we couldn't find Auntie Lindy, then Mummy couldn't find a cash point and didn't have any money for parking and then her shoes got washed away in the sea while we were paddling. Mummy had to spend the rest of the day walking around the fair ground in bare feet. Katie went on two rides, Ella had no fear and went on everything she could and Ben went on his first carousel ride and was terrified. Mummy got so upset as she could just see his little head poking out of the car with tears down his face. She asked the man to stop it but he said it was near the end and she had to wait, it was horrible. We had an ice lolly and came home.<\/p>","images":false},"title":{"value":"Hayling Island Disaster Day"},"version":1},{"date":{"d":24,"m":7,"y":2006},"datev":20060724,"info":{"content":"<p>Katie woke up at 6:30 (Mummy had been awake for ages, so excited about giving Katie her bike), and opened her presents in Mummy and Daddy's bed. She opened her new pink bike and loved it and wanted to go out and ride it there and then. We met Auntie Ellie and Joey to do the weeks shopping and get last minute food for the party. Great Grandma and Great Granddad came over with loads of presents, including a bell and water bottle for the bike, which mummy attached. Then we went for a ride on Katie's new bike and she was a natural, so good at it, with her little helmet she looked gorgeous.  Then at 15:30 Katie’s friends arrived for the party. Ma Ma and Pop Pop had bought Katie and Ben a bouncy castle and paddling pool and the children loved it. Oliver, Henry, Joey, Joshua, Poppy, James Natasha, Ella and Freya. We played pass the parcel, had tea complete with jelly and ice cream and then Katie blew out the candles on her Fifi Flower Tot cake, that Mummy had bought as she is a disaster at cakes. Farfar and Farmor and Auntie Susan came over later with more presents, and Uncle Howard and Susie.<\/p>","images":false},"title":{"value":"Katie's Party"},"version":1},{"date":{"d":23,"m":7,"y":2006},"datev":20060723,"images":1,"info":{"content":"<p>Daddy was scuba diving again so Mummy, Katie and Ben had a lovely day together at home. We went to church first and then while Ben slept, Mummy and Katie blew up Katie's new bouncy castle and paddling pool that was an early birthday present from Ma Ma and Pop Pop. It took ages, we also went through Katie's wardrobe and threw out lots of old clothes and put new ones in, Katie loved doing this. Ben then woke up and hated the noise of the electric pump blowing up the castle so Mummy had to cuddle him and try to set the castle up. Ben and Katie loved the castle once it was up although Katie was a little boisterous and Knocked Ben a couple of times while attempting roly polleys. We then went to Oliver’s house for a little birthday party which was lovely.<\/p><img src='images\/years\/2006\/2006_07_23-55-ScubaHorseaIs.jpg' class='diaryImage' alt='The Scuba Crew' \/><p class='diaryImageCaption'>The Scuba Crew<\/p>","images":false},"title":{"value":"Oliver's Party"},"version":1},{"date":{"d":22,"m":7,"y":2006},"datev":20060722,"info":{"content":"<p>Daddy was scuba diving, so Mummy Katie and Ben went to Greenwich Park with Pop Pop. We saw the deer and Katie tried unsuccessfully to stroke a  few squirrels. We fed the ducks, had a lovely picnic and went on the pedalos. Katie loved dipping her hand in the water and Benny crawled all over the boat, very fidgety. Then we went on the swings buy unfortunately somebody kicked a ball at Katie and she fell over and was so upset. Pop Pop cheered her up by buying us all a lolly. We went under the Thames in the tunnel, Katie loved the steps but when we came up it was pouring with rain, so we went back and walked through the market, Mummy bought Katie some sweeties in an old fashioned sweet shop.<\/p>","images":false},"title":{"value":"Scuba Diving - Greenwich Park"},"version":1},{"date":{"d":21,"m":7,"y":2006},"datev":20060721,"info":{"content":"<p>Today was Katie's end of term party. There was a bouncy castle with a slide, hotdogs and party food. For Some of the children, this was their last playschool before going on to infant school and their mummy’s were crying. Ben and Mummy had a coffee and biscuit (Ben had water and Mummy's biscuit) with the other Mummy's but was able to watch Katie through the window and see her playing which was wonderful.<\/p>","images":false},"title":{"value":"Playschool Party"},"version":1},{"date":{"d":20,"m":7,"y":2006},"datev":20060720,"info":{"content":"<p>We went to see Auntie Karen and Summer today. It was so hot. We played in the paddling pool, on the bouncy castle and ate ice lollies, it was a really lovely afternoon. Afterwards we went to Ma Ma and Pop Pops to sleep. Ma Ma babysat while Mummy and Pop Pop went to the cinema. Katie and Ben both woke up and when Mummy got home at 11:30 she found Ma Ma playing with Katie and Ben.<\/p>","images":false},"title":{"value":"Summer’s House"},"version":1},{"date":{"d":16,"m":7,"y":2006},"datev":20060716,"info":{"content":"<p>Katie's friend Natasha (from playschool) was 3 today and celebrated by having her birthday party at Fizzy Kids with about a dozen of her playschool friends.<\/p><p>Katie loved it..... and was over excited with her friend Robert. They ran all over the place and played together nicely. Katie seems quite popular with her playschool friends which gives a nice warm feeling inside. The girl is growing up and has made friends without Mummy and Daddy forcing her.<\/p><p>Ben liked playing in the bubble car which Daddy raced him around in. The session ended with a party meal. All the traditional chocolate biscuits, jam tarts, sandwiches and cake were all there. The 1.5 hours flew by.<\/p><p>In the hot afternoon when went for a short walk up Old Guildford Road. It's a long bumpy track which we've never got to the end of before now. It was a relaxing end to the weekend.<\/p>","images":false},"title":{"value":"Natasha's Birthday Party"},"version":1},{"date":{"d":15,"m":7,"y":2006},"datev":20060715,"images":3,"info":{"content":"<p>Today was really hot and sunny. As we haven't been out just us 4 for a while we decided to go down to the seaside and have some fun. We parked up in Portslade and walked along the promenade towards Brighton.<\/p><p>We stopped off for a picnic lunch along the way on the beach. Ben was more interested in eating the pebbles off the beach than his proper lunch! We tried to get into the sea a little bit. Ben didn't enjoyed it. I think the waves and the splash was too much for him.<\/p><p>We continued along until we hit the paddling pool just by the West Pier. It was packed but Katie and Ben both loved playing in the water and of course all the ancillary play stuff.<\/p><p>We moved on past the vibrant bars and entertainment which was happening along to the pier. A great fan of Bournemouth we may be, but Brighton has certainly got a better pier (which is free!). We stuck our faces through the funny board...<\/p><img src='images\/years\/2006\/2006_07_15-34-Brighton.jpg' class='diaryImage' alt='Pier Entertainment' \/><p class='diaryImageCaption'>Pier Entertainment<\/p><p>... and managed to play with Noddy. Katie had a go on a couple of the carousel rides. There are so many new attraction there now. The log flume being the latest. Katie looked kind of anxious at that one!<\/p><img src='images\/years\/2006\/2006_07_15-35-Brighton.jpg' class='diaryImage' alt='Ben making friends wit Noddy' \/><p class='diaryImageCaption'>Ben making friends wit Noddy<\/p><img src='images\/years\/2006\/2006_07_15-47a-Brighton.jpg' class='diaryImage' alt='On Brighton Pier' \/><p class='diaryImageCaption'>On Brighton Pier<\/p><p>Time really did fly past and it was getting a bit late to return by foot. So instead we caught a bus back. Katie I think gave the bus a running commentary from the front of the top deck of what we saw. She was little Miss Chatterbox.<\/p><p>We returned home to Fish and Chip supper, and a phone call to find where we were as we were supposed to be babysitting Joey! Woops. We had a great day out.<\/p>","images":false},"title":{"value":"Brighton Beach"},"version":1},{"date":{"d":14,"m":7,"y":2006},"datev":20060714,"images":1,"info":{"content":"<p>Today we went to Bocketts Farm with Katie's preschool and had an excellent day. It was lovely and hot and all of Katie's friends were there. Ben really loved the animals, especially the sheep until one baaed so loudly and really upset him! We went on a tractor ride and saw pig racing. The play area was fantastic. Katie went on the trampoline and slides and playhouses while Ben was in his element because there were lots of tunnels to crawl in which he can’t get enough at the moment. There was a great bouncy pillow as well like a giant bouncy bed which all the children loved. We all met for a picnic and an ice cream and at the end of the day Katie went on an electric tractor and was really good, steering it all around the track better than mummy could have, I think. We stayed a bit later than most to go in the soft play bit and we had great fun as Ben can do everything in there, there is no sand or bark chippings to eat either which is what normally happens in the outdoor parks!<\/p><img src='images\/years\/2006\/2006_07_14-33-BockettsFarms.jpg' class='diaryImage' alt='Farrrrmer Katie' \/><p class='diaryImageCaption'>Farrrrmer Katie<\/p>","images":false},"title":{"value":"Bocketts Farm with Playschool"},"version":1},{"date":{"d":12,"m":7,"y":2006},"datev":20060712,"info":{"content":"<p>Katie was invited to Eva's birthday party, a little girl from pre-school. There was a bouncy castle (which Ben loved), a paddling pool, a two story wendy house (which Katie loved) bikes, scooters, a seesaw, a trampoline and a swing. Katie and Ben had such a wonderful time. They played Pass the parcel and had lovely food and the weather was boiling.<\/p>","images":false},"title":{"value":"Eva's Birthday"},"version":1},{"date":{"d":10,"m":7,"y":2006},"datev":20060710,"info":{"content":"<p>Daddy got a lot of nice clothes and vouchers for his birthday.<\/p><p>In the evening Mummy and Daddy went to Bracknell for a meal in Frankie and Jerry's then on to watch Pirates Of The Caribbean II which was excellent.<\/p>","images":false},"title":{"value":"Daddy's Birthday"},"version":1},{"date":{"d":9,"m":7,"y":2006},"datev":20060709,"images":2,"info":{"content":"<p>Katie and Mummy were taking part on the Pre-school float for the Frimley Green carnival. They dressed up as princesses!<\/p><p>In the morning Mummy went to help dress the float. The weather was a bit dodgy but come the afternoon it brightened up.<\/p><p>We went around to the Fars for a rushed, but lovely lunch. Auntie Susan and Graham, along with the Fars, Ma Ma, Ellie, John Garratt and Grandma and Granddad all came to line the busy streets. The procession commenced from Balmoral Drive and wound its way down to the Green and up to Lakeside.<\/p><img src='images\/years\/2006\/2006_07_09-18-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Princess Mummy and Katie' \/><p class='diaryImageCaption'>Princess Mummy and Katie<\/p><p>There must have been about 40 kids on the float all dressed as princes and princesses. They all looked beautiful. When Katie saw us she beamed a huge smile. She was so happy.<\/p><img src='images\/years\/2006\/2006_07_09-21-FrimleyGreenCarnival.jpg' class='diaryImage' alt='The Float' \/><p class='diaryImageCaption'>The Float<\/p><p>We then made our way to a very busy and loud green to look at the stalls and watch the entertainment in the middle. We couldn't quite believe the huge number of people that were there and that had lined the streets. It was very nice to see.<\/p>","images":false},"title":{"value":"Frimley Green Carnival"},"version":1},{"date":{"d":8,"m":7,"y":2006},"datev":20060708,"info":{"content":"<p>While Benny had his morning nap, Mummy, Katie, Ma Ma and Great Grandma went shopping. We started with a coffee and a huge chocolate muffin and then went and bought some clothes for mummy, a birthday present for daddy and Ma Ma bought Katie a voice changing microphone. After the shopping, Katie went and had lunch at Great Grandmas with Ma Ma. They also had an ice cream in the garden as it was lovely and sunny. Mummy went home to see Ben and to try and find her old bridesmaids dress in the loft ready to be a princess in the carnival with Katie tomorrow.<\/p>","images":false},"title":{"value":"Girlie shopping"},"version":1},{"date":{"d":3,"m":7,"y":2006},"datev":20060703,"info":{"content":"<p>Mummy, Katie, Auntie Charlotte, Auntie Ellie and Joey went over to California Country Park for a picnic today. The weather was absolutely boiling but there was lots of shade. Auntie Charlotte brought lots of lovely food and then we went for a walk round the lake and fed the ducks. Unfortunately the swimming pool bit was shut so we could not swim which would have been lovely to cool down but we had an ice lolly and a play on the swings and the indoor play area.<\/p>","images":false},"title":{"value":"California Country Park"},"version":1},{"date":{"d":2,"m":7,"y":2006},"datev":20060702,"info":{"content":"<p>In the early, early morning Daddy and Ben went to explore the woods on the other side of the army barracks. Ben spent most of his time trying to get his bike helmet off!<\/p><p>After church we had Sunday lunch and playtime in the back garden.... Although the temperature was approaching 32C! Wow. So we didn't last too long there!<\/p><p>Later in the afternoon we popped over to see Steven and Joyce, then went swimming at Bracknell. Benny boy loves bouncing on the water.<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":1,"m":7,"y":2006},"datev":20060701,"info":{"content":"<p>Pop Pop stayed over last night and we all went over to Ellie and Michaels house, except Daddy to go and see it for the first time.<\/p><p>In the afternoon we popped over to the church fete in Frimley Green. We were surprised to see Tim Peacock and Lorraine, Dan and Joshua. Even managed to chat to the vicar about the football!<\/p><p>In the afternoon we piled around Barrie and Laura's for a World Cup BBQ. The Elders and James were there to.<\/p><p>It all ended a bit sloppy. We lost the football and the host got drunk! However, the children loved playing in the paddling pool and bouncy castle.<\/p>","images":false},"title":{"value":"Church Fete - England v Portugal"},"version":1},{"date":{"d":30,"m":6,"y":2006},"datev":20060630,"info":{"content":"<p>Ellie, Michael and Joey were moving across town to a bigger house due to their impending second born. Daddy, Charlotte, Sue and Graham helped out.<\/p>","images":false},"title":{"value":"Ellie and Michael Move House"},"version":1},{"date":{"d":25,"m":6,"y":2006},"datev":20060625,"images":1,"info":{"content":"<p>We had a lovely picnic over at Frimley Lodge Park. There were lots of people there. Almost all of Laura's Mum's family and some of Mummy's school friends also came along which was very nice.<\/p><img src='images\/years\/2006\/2006_06_25-16-LauBday.jpg' class='diaryImage' alt='Frimley Lodge Park' \/><p class='diaryImageCaption'>Frimley Lodge Park<\/p><p>The boys went to play cricket and football whilst the ladies and babies chatted!<\/p><p>Mummy appreciated all the presents and felt so lucky to get so many.<\/p><p>Later on some of the boys came over to watch England scrape a 1-0 win in the World Cup.<\/p>","images":false},"title":{"value":"Mummy's 30th Birthday"},"version":1},{"date":{"d":24,"m":6,"y":2006},"datev":20060624,"images":1,"info":{"content":"<p>We popped over to the RLC Open Day just over the green. It was really hot. Katie, Oliver and Henry all went on some of the fair rides. Joey and the Fars also were there. We stayed and watched the motorcycle display team.<\/p><img src='images\/years\/2006\/2006_06_24-51-RLCOpenDay.jpg' class='diaryImage' alt='Katie and Oliver sharing a tea cup' \/><p class='diaryImageCaption'>Katie and Oliver sharing a tea cup<\/p>","images":false},"title":{"value":"Royal Logistics Corps Open Day"},"version":1},{"date":{"d":22,"m":6,"y":2006},"datev":20060622,"info":{"content":"<p>Swimming was order of the day. We headed to the south-west part of the city on the Metro and attempted to go in the Aquaboulevard. It boasted loads of slides, a huge replica whale, outdoor areas, sun loungers, basically a place where you could spend the whole day. Trouble is we only had half a day. The cost was 25 Euros an adult! We would have reluctantly gone in, but our hand was forced when they said they wouldn't admit under 3's!<\/p><p>So we got back in the Metro headed to Place De Italie again this time to buy Daddy some Speedo style swimming trunks. Mmmm. Cheapest we could find.<\/p><p>We went to Reuilly swimming pool which we had seen the day before..... What we hadn't seen is the notice to say as from today that it was closed for renovation work!! Arrgghh. So Daddy with his Del Boy French managed to ask a non-English speaking local where the nearest swimming pool was. Mummy got the directions all wrong. She muddled ‘Tout Droit’ with ‘A Droit’. Anyway the route took us an extra mile or so along the viaduct garden route all the way to where the ring road circles Paris! By this stage we were a little demoralized at all of the travelling to find a sodding swimming pool.<\/p><p>\u000a        We arrived to find that this was an<a href=\"http:\/\/www.cnparis.net\/\">outdoor pool<\/a>for professional swimmers !! Still after our hot dog lunch, Katie and Daddy ventured in. The pool was laned off with 40 or so people go up and down, up and down. We phaffed around to find swimming caps and eventually made it in to the warm pool. Katie loved in there and we managed to do 2 lengths without out too much help. Daddy is a bit worried about Katie's lack of swimming skills so he always barks out kick, kick, kick and arms out like a butterfly. We're not sure if she has got it yet.\u000a      <\/p><p>We were in there for 45 minutes and got out at 1pm. We were now in a rush to get to the train station in time.... We also had to cross Paris to the hotel in order to get our suitcases. In the end Daddy rushed back to the hotel, whilst the rest of us went to check in at Gard Du Nord. We re-united with Daddy in the departure lounge, when Mummy had realized that she had left the rucksack with the metal detector people.... Anyway passports were taken as the second potential security incident occurred (1st when we left pushchair under the Eiffel Tower unattended for an hour or so).<\/p><p>The train journey home was a sad one as we had really enjoyed our holiday. Again we only had 2 seats for the four of us.<\/p><p>In the train Mummy was hungry and wanted to know if she could eat a bit of Katie:<\/p><ul><li><i>Mummy<\/i>Can I eat one of your arms. You only need one.\u000a        <\/li><li><i>Katie<\/i>No I need my arms\u000a        <\/li><li><i>Mummy<\/i>Can I have one of your ears?\u000a        <\/li><li><i>Katie<\/i>No I need I need my ears to hear\u000a        <\/li><li><i>Mummy<\/i>Can I eat your nose?\u000a        <\/li><li><i>Katie<\/i>No I need my nose\u000a        <\/li><li><i>Mummy<\/i>Why do you need your nose?\u000a        <\/li><li><i>Mummy<\/i>For picking!!\u000a        <\/li><\/ul><p>We made it back on time in to Waterloo where we got a train back to Woking where Farmor and Farfar came to pick us up. We were tired out with the travelling and slept very quickly. Later on the Fars brought around some Fish and Chips for us.<\/p>","images":false},"title":{"value":"Swimming Nightmare - Back Home"},"version":1},{"date":{"d":21,"m":6,"y":2006},"datev":20060621,"images":2,"info":{"content":"<p>After breakfast we Metro'ed it to Place De La Concorde. It was pretty hot. We first headed through Jardin Du Tuileries, got wet on the fountain spray and on to the Louvre. We circled the glass Pyramide. We did think that it looked out of place with the fine buildings around it.<\/p><img src='images\/years\/2006\/2006_06_21-46-LouvreArcTriomphe.jpg' class='diaryImage' alt='Louvre' \/><p class='diaryImageCaption'>Louvre<\/p><p>We turned and headed back passed Concorde up the Champs-Élysées. There were plenty of the top shops either side. The weather got decidedly chilly as we neared the top of the hill and the Arc De Triomphe. The traffic was fairly busy and we travelled the underpass to the middle of the large Marble Arch! We could see all the way back to Place De La Concorde. The Eiffel tower wasn't that far away either,<\/p><p>We had a lovely lunch again..... well again Mummy ordered a burger and then didn't eat it!<\/p><img src='images\/years\/2006\/2006_06_21-58-LouvreArcTriomphe.jpg' class='diaryImage' alt='Arc Du Triomphe' \/><p class='diaryImageCaption'>Arc Du Triomphe<\/p><p>We headed back to the hotel to get some warmer clothes, then headed to the East of the city towards Bastille.<\/p><p>From the Bastille we took the pretty viaduct garden path to Jardine De Reuilly where Katie and Ben played in the playground. Worrying about Katie eating junk food and trying to find somewhere that would serve some pasta we decided to catch the metro to Place De Italie. However, the girls had to give up and eventually had a McDonalds again!!! Daddy wasn't pleased.<\/p><p>We headed home for another late night.<\/p>","images":false},"title":{"value":"Concorde, Tuiles Jardin, Louvre, Champs-Élysées, Arc De Triomphe, Bastille, Place D'Italie"},"version":1},{"date":{"d":20,"m":6,"y":2006},"datev":20060620,"images":3,"info":{"content":"<p>Today we decided to see a bit more of the city and took the bus to just the other side of the Seine. There were tons of police around and they had shut the road. The art museum, Musee du Quai Branly was opened by President Jacques Chirac and Kofi Annan. Anyway it didn't really interest us and we brisked passed on to Tour De Eiffel.<\/p><p>We didn't quite know what to do with the pushchair so decided just to dump it under the tower. At this time of the morning there were not that many people about. We went to the cleanest toilets in Paris as Benny the pooing machine had again filled his nappy. We queued in the longest queue and paid to go up in the lifts, then found where you can walk up the first two levels.<\/p><p>Daddy walked up the first two flights, with Ben on his shoulders. You could see quite a lot of Paris from here. Katie spotted some carrousel’s which we had to keep looking out for at each level we reached. The views were great views across the city. You could see the Sacré Coeur, Arc Du Triomphe. Miles and miles. Some classic Mummy comments on the Eiffel Tower:<\/p><ul><li><i>Mummy comment<\/i>Earlier confused Eiffel Tower with a lamppost!\u000a        <\/li><li><i>Mummy comment<\/i>Thought the structure was a golden colour!\u000a        <\/li><li><i>Mummy comment<\/i>She argued that it was taller than the Empire State Building. Just to prove Daddy is right (as always):-\u000a          <i>\u000a            It held the title of tallest building in the world until 1931, when New York City built the Empire State Building. Source:<smallcaps>http:\/\/www.etrav.com\/pathways\/html\/eiffeltower.asp<\/smallcaps><\/i><\/li><li><i>Mummy comment<\/i>The tower we could see was the Telecom tower in London!!!\u000a        <\/li><\/ul><p>We queued to go up in the lift from the second level. As the lift rose, Mummy and Daddy's knees began to wobble a bit. It wasn't a pleasant journey as the structure thinned out towards the top. The lifts don't go up vertically, they are at a slight angel due to the  shape of the tower. We finally hit the top and looked around in the inside gallery. Then we climbed some more steps and went to the outside viewing gallery. Mummy and Daddy were a bit uncomfortable especially when Katie was leaning against the railings. Still you could see even more from up here. We didn't spend long up there and got the lift back to level 2 and walked down all the steps to the bottom.<\/p><p>We went to look for the pushchair and noticed it had gone! Oh dear. The police had removed it, so Daddy went to get it! Woops. We know nobody would have stolen it. It was in such a state. Food stains all over it.<\/p><p>We went to the nearby play ground, then had our picnic in the park next to the Eiffel Tower. We were constantly hassled by these so called Bosnian girls who were basically begging. In the end we had to tell them to go away, almost pinching the yoghurt we were feeding Ben with out of our hands. They were clean and had clean clothes on so I wasn't falling for it. Come to think of it, there were quite a lot of beggars throughout our holiday. So you could see were genuinely homeless, most were con-artists.<\/p><p>Katie wanted to go on the carrousel’s that we saw from the tower. So we had a go on 2 of them! Even Benny Boo had a go. We walked to the Trocadero and got some pictures of us in front of the Eiffel Tower.<\/p><img src='images\/years\/2006\/2006_06_20-44-EiffelTower.jpg' class='diaryImage' alt='Eiffel Tower' \/><p class='diaryImageCaption'>Eiffel Tower<\/p><img src='images\/years\/2006\/2006_06_20-40-EiffelTower.jpg' class='diaryImage' alt='On the carrousel' \/><p class='diaryImageCaption'>On the carrousel<\/p><p>\u000a        We walked eastwards back along the Seine to Place De La Resistance (just had to write that as that is Del Boy sating I think). Anyway there was the sewer museum there (\u000a        <a href=\"http:\/\/europeforvisitors.com\/paris\/articles\/paris-sewers-museum.htm\">\u000a          Le Musee des Egouts\u000a        <\/a>\u000a        ). We got down there and Katie took some water from the bottle and was told she wasn't allowed to drink it for risk of the bacteria attacking it! Comforting to know! Anyway we walked through the tunnels and saw the sewage gushing past. Mummy thought it smelt bad. Daddy didn't mind it. We walked around in about half an hour and rose to some fresh air.\u000a      <\/p><p>Continuing eastwards we saw the impressive Musee de l'Armee building by Invalides.<\/p><p>Next northwards on the Metro to Moulin Rouge. Not that impressed with it, especially as it seemed to be in a bit of a seedy area. We had a quick peek inside the reception area, then took a long walk back to the hotel over Monmartre hill<\/p><img src='images\/years\/2006\/2006_06_20-48-EiffelTower.jpg' class='diaryImage' alt='Moulin Rouge' \/><p class='diaryImageCaption'>Moulin Rouge<\/p><p>We cleaned ourselves up at the hotel and bussed it to Place De Clichy where we had earlier seen the Hippo restaurant. We try to keep it cheap, as we were on a budge. Daddy decided not to eat, and we thought that Katie's meal wouldn't come with chips. Alas, Mummy's burger was well done, but not well done enough so Daddy had to eat it (which turned out to be a Horse burger anyway), and Mummy went without. Katie's meal turned up with a large plate of chips. Ben on the other hand was impressing one of the young lady waitresses. Impressed so much she wrote her name and phone number on a bit of card and gave it to her! Good work Benny boy. A chip off the old block. Let the ladies do the chasing. It all ended embarrassingly as the other waitresses laughed at how little money was spent.<\/p><p>We crawled into bed quite late in the end. Mummy and Daddy stayed up to watch England draw disappointingly with Sweden 2-2, with the sound muted!... and Mummy muted!<\/p>","images":false},"title":{"value":"Eiffel Tower - Sewer Museum - Moulin Rouge"},"version":1},{"date":{"d":19,"m":6,"y":2006},"datev":20060619,"images":2,"info":{"content":"<p>We got up normal time, embarrassingly had breakfast with a naughty Katie and headed on the metro to the Zoo. On the way Daddy had lost the wallet. Panic set in for about a minute when the guard came running down the stair to find me! Phew.<\/p><p>The metro at 9am on a Monday morning going into the city was surprisingly quiet. Also the Parisians need to be introduced to escalators in their underground system! Not fun carrying the double buggy around.<\/p><p>Daddy also boobed when we got off the train. He went through the automatic gates to drop the bag and Ben off and then couldn't go back to get the pushchair. Eventually he worked out where the motion sensors were and climbed-jumped over to get the pushchair.<\/p><p>The zoo was a small stroll away, slightly out of the city. We could see the man made mountain a long way away and we were getting excited as to what we were going to encounter.<\/p><p>It cost just £6 for us all to get in..... Absolute bargain. Tight Daddy almost fell over in amazement to how cheap it was. However, there was a reason to the cheapness! There were hardly any bloody animal there!<\/p><p>The place reminded us of London Zoo. Old 60's style under a lot of renovation work because of it. And because of it there were no animals. we couldn't even go up the mountain to see the views. It was quite depressing really, especially as the animals that were there didn't seemed to be kept to English high standards! There were some goats stuck half way up a mountain!! (because they were mountain goats)... Seriously the one and only huge Sea Lion had funny teeth and was on his own. One seal just wouldn't get up even though it was feeding time.... It was like the Rab C Nesbitt of the seal world. The penguins had their water moat drained... and the hippo was just showing us his bottom (reminded me of Dawg) as he was munching his grass<\/p><img src='images\/years\/2006\/2006_06_19-20-NotreDam.jpg' class='diaryImage' alt='Chatty old lady' \/><p class='diaryImageCaption'>Chatty old lady<\/p><p>We departed within 2 hours and headed to the nearby park to eat our lunch. Katie needed the toilet, so Daddy helped squat her by a tree. Daddy's arm and leg got wet! Having to think what to do next, Mummy and Daddy thought of going to see the Notre Damm.<\/p><p>Taking the metro we all got in except for Daddy who had to take another carriage because of the buggy. We sailed off, leaving Daddy standing. Now it is one of those situations: Do we get off next stop, Do we get off and go back, or do we just go to where Daddy said we needed to go. We took the last of those options, and thankfully we met up again at Strasbourg St Denis. That was a bit of luck as Daddy had all the bags, money and tickets. This was doubly important as Ben Hiroshima’ed.<\/p><p>Daddy took Ben into McDonalds to get his nappy changed. However, there was no baby change facility which made things very tricky for the useless Daddy. Anyway when they came out, fair enough Ben nappy was changed, but he still had poo on his trousers and poo all over Daddy's t-shirt! Pooo-ey. Katie really didn't want to be near Daddy now.<\/p><p>We decided to walk from here down to 'City'. Daddy's nightmare day continued as he led us all down what seemed the fat lady’s, red light district. If you liked them fat or old then this street was for you. It was an eye opener for Mummy and Daddy, we were oblivious to what was going on. We walked and walked until we found a map and we weren't quite going in the direction we hoped. We entered the pedestrianized, shopping area and eventually a park with a children’s garden and men playing boules.<\/p><p>We crossed the Seine, Katie had an ice cream, Daddy pointed out the Eiffel Tower to mummy, who claimed 'I wasn't expecting it to look like that. I thought it was a gold building!!'.... I know it beggars beyond belief at the lack of knowledge mummy has! Anyway we finally hit the Notre Damm. We piled inside with the hundreds of others. Farfar can't go inside because he has a 'thing' about tall ceilings... Well you can't argue against that. It was very high up. We done a lap and was amazed at all the stained glass windows. We tried to go up on to the roof but the queue for that was far too long.<\/p><img src='images\/years\/2006\/2006_06_19-23-NotreDam.jpg' class='diaryImage' alt='Chatty old lady' \/><p class='diaryImageCaption'>Chatty old lady<\/p><p>So we decided to eat. Mummy insisted that Katie would only eat chips. Daddy refused to accept that and ate a baguette thingy and Mummy and Katie had a McDonalds!<\/p><p>We caught the Metro from Chatelet and walked back to the Hotel. Katie was shattered. Mummy got her showered and bed, whilst Daddy fed Ben, then went on an hour long walk around Montmartre again! It really is a nice area of Paris. Glad we are staying here.<\/p>","images":false},"title":{"value":"Zoo - Notre Damm"},"version":1},{"date":{"d":18,"m":6,"y":2006},"datev":20060618,"images":2,"info":{"content":"<p>Finally after a few months planning we were off to France. However, Mummy thought we were going to Lille for 1 night, instead Daddy had planned Paris for four. It was Daddy's intention to see how long he could leave it before letting Mummy that we were not staying in Lille for 1 night.<\/p><p>We left Waterloo still not at our seats as Daddy got us on the wrong carriage. We finally bundled in our two seats for 4 people! The plan was that as we had kept Ben awake all this time that he was at least to go to sleep. Nope! Little Man didn't want any of it. Katie bored and Ben tired and not wanting to go to sleep made our journey a long one.... and for Daddy one spent in the luxury of by the toilets as to not upset any of the other passengers.<\/p><p>We quickly raced passed Gillingham bridge and soon entered the tunnel. Katie had kept re-iterating how she didn't want to go through the tunnel.... But it passed without much comment.<\/p><p>We soon arrived at Lille and Mummy still was none the wiser. We started to get off, then Daddy mentioned that he couldn't be bother and that we might as well stay on to Paris. Woo Hoo. Mummy was happy and sad. Obviously happy to be going to Paris. Sad to have to entertain us for another hour! At least Ben slept for part of this.... It was a shame as we didn't get much opportunity to see any of the countryside really.<\/p><p>The heat hit us as we stepped outside the air conditioned train. We eventually got our Paris Visite tickets (£40 for 5 days for 2 adults, Kids - Free) and lugged our luggage out of station, to find bus 31. It was quite comical Mummy taking us and seeing Daddy struggle getting 2 suitcases, a rucksack and the double buggy on and off the bus. It only took 10 minutes to get to the hotel which looked from the outside. It was the Hotel Eden, Montmartre.<\/p><p>We checked in and made our way up to the fifth floor in the smallest lift in the world (fits 4 people at a squash), into a small triple room. Saying that it had a nice bathroom, a great view from the balcony and the staff were helpful.<\/p><p>By now it was late afternoon, so we unpacked and made our way to Sacré Coeur. Daddy told Mummy that we were going to stay a little longer than 1 night, which Mummy was relived about. All this effort and all this way for just 24 hours in Paris! Non.<\/p><p>Sacré Coeur was some cathedral at the top of Monmartre Hill. Anyway that is what we thought. It was a really nice walk. As begun climbing the million or so steps some old German-French lady spoke to us.... Well Mummy anyway. She kept repeating herself like old people do. She was very sweet saying that. After about 10 minutes we managed to free ourselves to continue the climb. The views behind us were terrific. Katie loved climbing all those steps. She was in her element. Ben was just smiling at all the ladies. Daddy and Ben make a great team with the ladies. Ben pulls them, Daddy just looks and smiles.<\/p><img src='images\/years\/2006\/2006_06_18-19-Montmartre.jpg' class='diaryImage' alt='Chatty old lady' \/><p class='diaryImageCaption'>Chatty old lady<\/p><p>We hit the top and not only was there the impressive Sacré Coeur but a whole quaint village, although it was all for the benefit of tourists. Still we bought it and loved it. We walked around the cafes, bistros and outdoor restaurants. We entered the Cathedral, circled it and promptly got out as there was a service in progress! The view on the other side of the church were even better. We could see Paris, although none of the famous landmarks.<\/p><img src='images\/years\/2006\/2006_06_18-22-Montmartre.jpg' class='diaryImage' alt='Chatty old lady' \/><p class='diaryImageCaption'>Chatty old lady<\/p><p>There was a funicular down the other side of the hill to a little play area for us. For some reason we were not interested in the carrousel which was a shame. Next mission was to get some dinner. We eventually found a cafe-restaurant where we had an Italian meal. Great come to France to get Italian. Time was really marching on and it was well passed our bedtime.... We retraced our steps and within about half an hour we were back in the hotel, getting showered and being naughty and not sleeping! The room was très chaud!<\/p><p>Daddy popped off to the traditional French bar next door and watched The French draw 1-1 with South Korea. Beer was twice as expensive as in England, but the atmosphere and hospitality, down to the small bowl of crisps was twice as good.<\/p>","images":false},"title":{"value":"Surprise Surprise - Paris"},"version":1},{"date":{"d":16,"m":6,"y":2006},"datev":20060616,"info":{"content":"<p>Mummy, Katie and Benny met up with some of Katie's playschool friends and their mummy’s for a picnic in Frimley Lodge park. It was a lovely sunny day and after the picnic we played on the swings and all had a lolly.<\/p><p>It was nice for Katie to play with her friends outside of playschool and nice for mummy to meet some people and get more involved with Katie’s playschool. Last night mummy went to the committee meeting and volunteered for the job of wages and is now worried it’s going to be really difficult and be way above her head!<\/p>","images":false},"title":{"value":"Playschool Picnic"},"version":1},{"date":{"d":11,"m":6,"y":2006},"datev":20060611,"info":{"content":"<p>We went to church as Daddy tidied the last bits from yesterday. The weather continued to be scorching.<\/p><p>In the afternoon Daddy took Katie on a quick bike ride through the woods to see the Fars quickly.<\/p><p>We then rushed to the Parish lunch with Grandma, Granddad and Charlotte. We played with Poppy and James.<\/p><p>Later in the afternoon Ma Ma and Pop Pop came around to play.<\/p>","images":false},"title":{"value":"Parish Lunch"},"version":1},{"date":{"d":10,"m":6,"y":2006},"datev":20060610,"info":{"content":"<p>It was an early start as we were experiencing some really hot and sticky weather and the excitement of today's game made Daddy at least not able to sleep too well.<\/p><p>We had organised a BBQ, world cup party. The boys and some of the girls camped in the front room, curtains shut as we watched an initially exciting game.... especially as we went 1-0 up early doors.<\/p><p>However, the heat seemed to get to the players and the game wilted in the heat into a bit of a disappointing affair. Sven and his tactics are very strange. Just hope for better to come in the next games.<\/p><p>Bazza won the sweepstake and Daddy sparked the BBQ up.... which with the slight gas leak also sparked the wooden BBQ frame a light as well! Ooops. A few duck rolls later the BBQ was good to go with Dogs Costco burgers and our flavoured sausages.<\/p><p>The kids had turned the garden into a playground and the lawn was getting burnt to death. However, all seemed to enjoy themselves. The festivities ended with a world cup quiz game on the TV, which Chopper shone on.<\/p><p>Mummy, Ellie and Joyce stopped in for Big Brother, as Daddy, Michael and Steve went to Dave Weaver's 40th birthday bash. We turned up in shorts and t-shirt, everyone else was dressed smart!<\/p>","images":false},"title":{"value":"England V Paraguay - World Cup"},"version":1},{"date":{"d":3,"m":6,"y":2006},"datev":20060603,"first":{"name":"ben","value":"Lots of goo-goo'ing and gar-gar'ing."},"info":{"content":"<p>Ben is really developing quick. He can stand holding on to something and is progressing with his balance. He's attempting to speak with goo-goo'ing... and sometimes we think he's weighed in with the odd very garbled word which if you mangle it a bit turns into a 'Dadda' or something. He's also ever so playful. He initiates games of peek-a-boo, loves playing with doors, anything that Katie has and of course his pots and fridge magnets. He's braver than Katie when we went on a fairground ride. He has three sleeps: between 9am-11am, a short one in the afternoon and then goes down at about 7:15pm, wakes a couple of times during the night and is rocking and rolling between 6am and 7am.<\/p><p>He's a bit of a dude when it comes to music. He will sometimes start bopping his head like one of those Churchill dogs in backs of peoples cars. So cute.<\/p><p>Daddy went to watch football, so Mummy, Katie and Ben went to meet Oliver and Sarah in Godalming to watch the carnival. However when we got there mummy realised her phone wasn't charged and therefore could not get hold of Sarah to meet up. We watched the carnival procession, one float was squirting water at us which Katie and Ben loved as we were so hot. This is the first time Katie has seen a carnival and she loved waiting for it and watching the lorries and dancers and a great big pooh bear go past.<\/p><p>Silly Mummy forgot her purse as well so we couldn't have an ice-cream or a go on the bouncy castle, much to Katie's annoyance. We stopped on the way home though at Frimley Lodge Park and fed the ducks and went on the swings, which was lovely.<\/p><p>In the evening Joey and Uncle Michael and Auntie Charlotte came for a BBQ. Mummy was supposed to baby-sit Joey buy he was having none of it and wanted nobody but his daddy.<\/p><p>A little later the boys went off to play poker over at Uncle Stevens house. Nick won £100.<\/p>","images":false},"title":{"value":"Godalming Carnival"},"version":1},{"date":{"d":2,"m":6,"y":2006},"datev":20060602,"first":{"name":"benjamin","value":"Wave (at Great Granddad and Grandma)"},"title":{"value":"Ben's first wave"},"version":1},{"date":{"d":30,"m":5,"y":2006},"datev":20060530,"first":{"name":"ben","value":"Climbed halfway up the stairs"},"images":1,"info":{"content":"<p>Not having much money at the moment we wanted to do something free, so we borrowed the National Trust cards from Farfar and Farmor and drove to Petworth house.<\/p><p>We got there at 10:20 and it didn't open until 11:00 so we went round Petworth village and found a brilliant swing park which Katie and Ben loved. We had a doughnut and Katie had a gingerbread man. We then went to the house and first walked around the grounds and had our picnic.<\/p><p>There was a special thing for children where we had to find letters on posts and make up a word with a chocolate prize if completed. Katie loved walking around with her clip board finding the letters and she looked absolutely gorgeous doing it. The house was nice although the bedrooms were shut but we got to see the servants block which mummy always finds interesting.<\/p><img src='images\/years\/2006\/2006_05_30-13-PetworthHouse.jpg' class='diaryImage' alt='Katie filling in quiz' \/><p class='diaryImageCaption'>Katie filling in quiz<\/p><p>On the way home we stopped in Shalford village to see a National Trust watermill but it was shut so we went for a walk but gave up as Katie wanted to go in the pushchair or be carried by mummy and Ben didn't want to be carried he wanted to be on the ground. After about twenty minutes of carrying Katie, mummy’s arms were aching so much we turned around and came home.<\/p><p>Ben also managed to get himself halfway up the stairs this morning, unsupervised! Needless to say the stair gates are going up.<\/p>","images":false},"title":{"value":"Petworth House"},"version":1},{"date":{"d":29,"m":5,"y":2006},"datev":20060529,"images":1,"info":{"content":"<p>Barrie, Laura and Freya came over and caused mayhem. It was good to see them.<\/p><img src='images\/years\/2006\/2006_05_29-18-FreyaJoeyKatieBen.jpg' class='diaryImage' alt='Ben, Katie and Joey' \/><p class='diaryImageCaption'>Ben, Katie and Joey<\/p>","images":false},"title":{"value":"Freya and Joey over to play"},"version":1},{"date":{"d":28,"m":5,"y":2006},"datev":20060528,"first":{"name":"ben","value":"First kiss (Mummy)"},"info":{"content":"<p>We tootled up to London after church and parked up near Claridges (near Bond St) and took a nice long walk through Oxford Street and up to Regents Park. It was quite a nice day and eventually navigated ourselves around to one of the busy playgrounds.<\/p><p>As it took us so long, as soon as we arrived we had to leave! Well Daddy jogged back with Ben in the pushchair. Ben absolutely loved it. Leaning forward, big smile, arm out sideways and fingers wiggling. We went back through Marylebone High Street which Daddy loved. Katie and Mummy had a great time in the busy playground.<\/p>","images":false},"title":{"value":"Regents Park"},"version":1},{"date":{"d":27,"m":5,"y":2006},"datev":20060527,"images":2,"info":{"content":"<p>Despite the weather forecast, Mummy convinced us to go! However, we kind of got diverted from our course and it took 2.5 hours to get there.<\/p><p>The zoo itself was superb. It was almost built like a theme park with its fake rocks. Fortunately there were quite a bit of undercover bits. First up the orang-utans. We got very close to them. Just the width of the glass away. The rain got stronger so we went on the fairground ride, which Ben loved and Katie hated and had a short play in the soft play area.<\/p><p>We then saw the meercats being fed, penguins swimming under water, some piranhas and some parrots.<\/p><p>We went into the sea lion section, which had a large glass tunnel which we could go in and watch the sea lions swimming around us. This was superb and really caught Katie and Ben's attention.<\/p><img src='images\/years\/2006\/2006_05_27-21-ColchesterZoo.jpg' class='diaryImage' alt='Sea lion Tunnel' \/><p class='diaryImageCaption'>Sea lion Tunnel<\/p><p>The rain persisted as we made our way to the Siberian tiger which was roaming around it's pen. Fantastic to see. We had to cross a really long rope bridge to see the lemurs which Katie loved. We also had a close look at the tigers. Amazing to get so close, amazing to see them moving around as well. So many places we've been to where they have been difficult to see or see them do anything.<\/p><img src='images\/years\/2006\/2006_05_27-30-ColchesterZoo.jpg' class='diaryImage' alt='The 'Phants' \/><p class='diaryImageCaption'>The 'Phants<\/p><p>We headed towards the outside bits, where we saw a baby elephant stuck in a mud hole. The concerned parents came over to help push him out. They were loving the conditions. We also saw some rhino's, one of which was pushing a boulder, just like in 64 Zoo Lane. There was also a Zeedonk... half zebra, half donkey!<\/p><p>We again went inside and saw a small hippo, some leaf carrying ants, and the quickest tortoises you're likely to see. Daddy had a feeling they were on steroids, the way they were lapping their enclosure.<\/p><p>We then went to see the Amur Tigers (or 'orange' tigers as Katie called them) being fed and some spider monkeys who were quite active and came right up to the glass to have a closer look at us.<\/p><p>All in all the weather spoilt it a bit, but definitely would love to go back again on a sunny day. Probably the best zoo we've visited, topping the one down at Paignton.<\/p>","images":false},"title":{"value":"Colchester Zoo"},"version":1},{"date":{"d":26,"m":5,"y":2006},"datev":20060526,"images":2,"info":{"content":"<p>Daddy was off work and we went around the Fars to play.<\/p><img src='images\/years\/2006\/2006_05_26-16-Fars.jpg' class='diaryImage' alt='On Ya Bike' \/><p class='diaryImageCaption'>On Ya Bike<\/p><img src='images\/years\/2006\/2006_05_26-22-Fars.jpg' class='diaryImage' alt='Trolleyed' \/><p class='diaryImageCaption'>Trolleyed<\/p>","images":false},"title":{"value":"Round The Fars"},"version":1},{"date":{"d":23,"m":5,"y":2006},"datev":20060523,"first":{"name":"benjamin","value":"Ben stands up"},"title":{"value":"Ben stands up"},"version":1},{"date":{"d":21,"m":5,"y":2006},"datev":20060521,"images":1,"info":{"content":"<p>Farfar had organised a 5 a-side tournament at Chertsey which Daddy entered the Casuals team into. The squad was:-<\/p><ul><li>Daddy<\/li><li>Uncle Michael<\/li><li>Martin A<\/li><li>Steven B<\/li><li>Nick K<\/li><li>Richard S<\/li><li>David Weaver<\/li><\/ul><p>The weather was appalling, heavy showers. Farfar's job wasn't made easy with the weather, being let down with some help, being let down with some teams arriving late and not at all. Poor Farfar.<\/p><img src='images\/years\/2006\/2006_05_21-08-ChertseyFives.jpg' class='diaryImage' alt='Casual Fives In Action' \/><p class='diaryImageCaption'>Casual Fives In Action<\/p><p>Anyway we rotated who played so as to make it fair.<\/p><ul><li><i>played<\/i>1\u000a        <\/li><li><i>won<\/i>0\u000a        <\/li><li><i>draw<\/i>1\u000a        <\/li><li><i>lost<\/i>3\u000a        <\/li><li><i>for<\/i>1\u000a        <\/li><li><i>against<\/i>8\u000a        <\/li><li><i>points<\/i>1\u000a        <\/li><\/ul><p>Needless to say we finished bottom of our group of 5. Pretty frustrating as we didn't play well. At least we got to see Daddy score Casuals one and only goal (from the centre kick)!<\/p><p>Mummy, Katie and Ben went swimming with Ma Ma, Pop Pop and Auntie Charlotte. Mummy took Joey down the flume and was really scared as it was faster than she remembered but Joey seemed to enjoy it. Ben was too small to go on and Katie has been totally put off flumes by Daddy taking her on one that was too fast and she could not be persuaded to go on. There is a little slide there which she loves though and she spent most of the time on that.<\/p><p>Katie also hates the wave machine much to Pop Pops annoyance as he first wanted to take her on the flume, then in the waves and she would have none of it, she didn’t mind the sweeties he bought her at the end though!<\/p>","images":false},"title":{"value":"Chertsey Fives and Swimming"},"version":1},{"date":{"d":20,"m":5,"y":2006},"datev":20060520,"images":2,"info":{"content":"<p>We met up with Auntie Karen and Richard in Bournemouth, at the pier, and spent the day with them. The weather was like a typical April day, blustery and cold.<\/p><p>However, this was not to deter us from hitting the beach and playing in the sand. Karen lead us into making a brilliant sand car that Ben and I could sit in and drive! It had seats in the back for grownups as well.<\/p><img src='images\/years\/2006\/2006_05_20-24-Bournemouth.jpg' class='diaryImage' alt='Ben and Katie in sand car' \/><p class='diaryImageCaption'>Ben and Katie in sand car<\/p><p>Ben squelched his hands and feet into the sand for the first time properly and didn't quite know what to make of it I think.<\/p><p>We took lunch in the overpriced Harry Ramsden's then Katie had a go on the trampolines which she loves to show off on. We then walked through Winter Gardens where there was the Elephant Festival. We sat had some ice cream and watched some Bangra dancing and a music act which had gymnastic type routines in it.<\/p><p>Time was running out but we wanted to treat Karen and Richard to their first Shakeaway milkshakes. Mmmm. As Katie would say 'D-E-L-ICIOUS.<\/p><img src='images\/years\/2006\/2006_05_20-37-Bournemouth.jpg' class='diaryImage' alt='Shakeaway' \/><p class='diaryImageCaption'>Shakeaway<\/p><p>We drove straight to Ellie and Michaels where we played a bit and had a scrummy dinner. Ben was playing up and not taking a bottle, so after about 1.5 hours Mummy resorted to the boob. We don't say this many times about Ben, but he's a naughty boy!<\/p>","images":false},"title":{"value":"Bournemouth with the Sanders"},"version":1},{"date":{"d":13,"m":5,"y":2006},"datev":20060513,"info":{"content":"<p>In the morning we took a long walk to Heatherside to get fresh bread, which Daddy is well into at the moment, and of course to play on the swings. Daddy bumped in to Jenny Finch who he hasn't seen for absolutely ages. She was in good form.<\/p><p>Later in the afternoon we scuttled over to Baz's where they laid on a good BBQ. It was also FA Cup Final day so the boys were watching the footie whilst the girls played.<\/p><p>James and us got Baz, 3x15 minute water skiing lessons at the Quays.<\/p>","images":false},"title":{"value":"Bazza 30th BBQ"},"version":1},{"date":{"d":8,"m":5,"y":2006},"datev":20060508,"info":{"content":"<p>Daddy returned from Butlins exhausted. The rest of us came home from Ma Ma and Pop Pops and went to Wizzy World soft play with Daddy. We had a great time racing down the slide, Katie managed to win every time and we weren't letting her, she is very quick. Ben loved it too, now he is crawling he can really enjoy it and actually play on the equipment which was wonderful to see.<\/p><p>In the evening Mummy and Daddy went out with Barrie and Laura to celebrate Bazza's 30th birthday. We went for a nice meal at the Heron On The Lake, Fleet.<\/p>","images":false},"title":{"value":"Wizzy World - Baz's 30th Meal"},"version":1},{"date":{"d":7,"m":5,"y":2006},"datev":20060507,"info":{"content":"<p>We all went up to see Auntie Christine, Sarah and Kerry in Colchester. We had a lovely meal in a pub and Katie, Ben and Joey went in the Wacky Warehouse soft play. Afterwards we went back to Auntie Christine's house where Katie had us all in hysterics. Auntie Christine loves jokes and had lots of joke toys, one being a little box with a voice saying \"help me I'm stuck in here, please get me out\". Katie really believed that a little man was stuck in there and got upset when Pop Pop couldn't get him out, then she wanted us to take it to a policeman. There was also a 'voice changer machine' and Katie sang nursery rhymes in funny voices. There was a plastic man who pulled his trousers down when you pressed a button and a dancing flower Katie really loved it all.<\/p>","images":false},"title":{"value":"Auntie Christine's"},"version":1},{"date":{"d":6,"m":5,"y":2006},"datev":20060506,"info":{"content":"<p>Joey woke up at 05:45, waking Ben who then woke Katie, so it was a really early start (poor Ma Ma and Pop Pop!) Auntie Ellie and Mummy took Katie Ben and Joey to feed the ducks after breakfast leaving Ma Ma and Pop Pop to tidy up. It's amazing how messy the house gets with three small children. We all then met up in Gravesend and  Ma Ma bought Ben a 'Thomas the Tank Engine' ball and Katie a Barbie doll. We had a coffee and muffin in the shopping centre while we watched Katie and Joey on the slide.<\/p><p>After lunch Ma Ma made Pop Pop do the gardening but Katie loved helping, using a pair of scissors or (sizzles as Katie calls them) to prune a bush and helping Ma Ma sort out a bag of Auntie Ellie, Auntie Charlotte and Mummy's old garden toys, finding lots of interesting things to us all.<\/p><p>When Ben woke we went to Trosley country park for a walk and a go on the trim trail and then it was off to Auntie Helen's thirtieth birthday party. While we were there Ben scratched poor little Thomas' face and left a horrible red mark. Ben was probably trying to get his own back as normally its other children doing that to him, it’s not often he comes across somebody smaller than him.<\/p>","images":false},"title":{"value":"Trosley Park"},"version":1},{"date":{"d":5,"m":5,"y":2006},"datev":20060505,"images":1,"info":{"content":"<p>Daddy went to Bognor with his friends for the weekend, so Mummy, Katie and Benny went to Ma Ma and Pop Pop's house with Auntie Ellie and Joey. We went Friday afternoon, stopping to see Auntie Karen and Summer first. It was a boiling hot day and we went to Woodlands park and played on the swings and had a really long ice pop which amazed Katie. Katie and Summer had a great time playing together.<\/p><p>The Butlins weekend for Daddy was good. 11 went: Daddy, Dawg, Michael, Barrie, Avez, Nick, Dave H, Steve H, Martin Bigg, James, Icey.<\/p><p>Memorable for:<\/p><ul><li><i>Bazza<\/i>Talking on the phone, thinking it was Emma, and not recognizing his own wife's voice!!\u000a        <\/li><li><i>Slop\/Bazza<\/i>Kicking the bottle and hitting Bazza on the head in the night club\u000a        <\/li><li><i>Dave H<\/i>Epic destruction of the toilet seat, toilet roll holder, falling asleep on the toilet for an hour at least\u000a        <\/li><li><i>Steve H<\/i>Spanking a whole girls rugby team on the bare bot\u000a        <\/li><li><i>Slop<\/i>Getting ambushed in the swimming pool. Left naked asking a lady lifeguard to retrieve trunks\u000a        <\/li><li><i>Slop<\/i>Eating frozen pie, even though the butcher said it was not\u000a        <\/li><li><i>Slop<\/i>Breaking off from pool, cue ball screams off the table smacking into James's new camera. Oops\u000a        <\/li><li><i>Bazza<\/i>Continuous 11am-3am Fosters drinking unbelievable. Saturday I reckon he must have had close to 20 pints\u000a        <\/li><li><i>Michael<\/i>Dancing with Bez (ex-Happy Mondays), whilst he was performing on stage\u000a        <\/li><li><i>Martin B<\/i>American Pie on the karaoke\u000a        <\/li><li><i>all<\/i>A lot of fat women\u000a        <\/li><li><i>Avez<\/i>The girl who he got off with, and then she kind of stalked us\u000a        <\/li><li><i>all<\/i>All the bands were entertaining: Oasis tribute, Coolio, Baby D and 2 Unlimited\u000a        <\/li><li><i>all<\/i>The Casuals krew actually won two games of football\u000a        <\/li><\/ul><img src='images\/years\/2006\/2006_05_05-63-BognorButlins.jpg' class='diaryImage' alt='Butlins Krew' \/><p class='diaryImageCaption'>Butlins Krew<\/p>","images":false},"title":{"value":"Butlins Bognor - Karen Marks"},"version":1},{"date":{"d":1,"m":5,"y":2006},"datev":20060501,"info":{"content":"<p>Mummy stupidly invited Daddy to the weekly shop which pushed the final bill to over £100!<\/p><p>\u000a        We tootled over to the<a href=\"http:\/\/www.livingrainforest.org\/\">Living Rainforest<\/a>which is near Newbury. It was a smaller setup than what we thought, but we all enjoyed going around the very humid greenhouses. We saw some monkeys which Ben absolutely loved following around. Katie said her favourite was a birdie which was roaming around the greenhouse. We don't know quite why she picked it out, as she was terrified of it. Anyway it was nice to see some animals in a different environment. Most of them were not behind bars and you had to be eagle eyed to spot them. A nice couple of hours spent there.\u000a      <\/p><p>In the evening Daddy and Katie continued some gardening work. This time tidying the strip at the side of the house.<\/p>","images":false},"title":{"value":"Living Rainforest"},"version":1},{"date":{"d":30,"m":4,"y":2006},"datev":20060430,"info":{"content":"<p>Another Casuals game cancelled. The last of the season. Daddy really fears for the future of the club. There doesn't seem to be the passion or desire to play or even turn up from some members of the squad. Still all things must come to an end. Looking positively, an easier level of football may bring back the passion and desire again.<\/p><p>The rest of us went to church, then met up with Daddy at the Fars to celebrate Farmor’s birthday with a meal. Susan and Graham came as well and we had a Danish meatloaf. Mmmm. We went for a nice walk down to the pond and saw that there were some little ducklings. Arrr.<\/p><p>Later on, Daddy and Katie done some gardening. Katie is tendering after the sunflower seeds that were planted last week.<\/p>","images":false},"title":{"value":"Farmor’s Birthday"},"version":1},{"date":{"d":29,"m":4,"y":2006},"datev":20060429,"info":{"content":"<p>Daddy and Katie went out shopping to the Butchers, Bakers and Florists. It was nice to be us two and get some rare quality time together. Katie behaves so nicely when just either Mummy or Daddy is not around. We popped into the Fars on our way home.<\/p><p>\u000a        In the afternoon we went to Alton and split up again.... The girls (along with Ellie) went to an NCT sale, whilst the four boys went up to Lasham to see the\u000a        <a href=\"http:\/\/www.lasham.org.uk\/\">\u000a          gliders\u000a        <\/a>\u000a        go up. The winch takeover seemed to take the gliders at a 45 degree angle. Looked pretty hairy. There were plenty of take offs and landings. We had to be careful when we crossed the airfield!!\u000a      <\/p><p>We returned back to meet with the girls, then went down to the funfair which was setup on the green. Katie was enthusiastic to go on the inflatable, big slide. It was so funny to see her face change from joy to horror in about 2 seconds during her descent. Needless to say she didn't want any further go's.<\/p>","images":false},"title":{"value":"Lasham Airfield and NCT Sale"},"version":1},{"date":{"d":28,"m":4,"y":2006},"datev":20060428,"info":{"content":"<p>Mmmm.. where do I start.<\/p><ul><li><i>Monday<\/i>Car is kept overnight as Toyota mechanics have somehow disabled the car. Laura had managed to snap the key in the boot. Basically as they cannot get the key into the ignition to re-programme we are having to have a new unit costing $380!\u000a        <\/li><li><i>Tuesday<\/i>Pick car up and Ben taken to casualty in an Ambulance for getting a sticker stuck in his throat. Daddy finds Mummy at hospital without any shoes.\u000a        <\/li><li><i>Wednesday<\/i>Casuals lose 11-0 and I miss two penalties. Last ever Casuals game?\u000a        <\/li><li><i>Thursday<\/i>Spend over a $100 on scuba diving gear when Daddy didn't really want to.\u000a        <\/li><li><i>Friday<\/i>The end of a bad week for mining stocks. Eradicate $100's off portfolio value.\u000a        <\/li><\/ul>","images":false},"title":{"value":"Nightmare Week"},"version":1},{"date":{"d":26,"m":4,"y":2006},"datev":20060426,"info":{"content":"<p>It was a lovely sunny day and Katie, Benny and Mummy were in the garden. Ben was on a blanket with his toys and Katie and mummy were planting sunflower seeds in pots. Mummy had the brainwave of labelling the four pots with Katie’s letter stickers, putting a K, B, D, and M on each pot so we could see whose flower grows the tallest.<\/p><p>Stupidly, Mummy left the stickers on the grass and while Katie and Mummy were marvelling over two worms they found, Benny ate one of the stickers. Mummy turned round to see him chewing and ran to try and get it out. She could see it right at the back of his throat and tried to get it but couldn't. It went down his throat and must have got stuck because he started coughing and coughing and looked so worried and upset. Mummy panicked and called for an ambulance having visions of him going blue. While we waited mummy was really distraught and kept saying \"where’s the flipping ambulance\" when it did come Katie said \"here comes the flipping ambulance.\" However Ben was fine by then but they took us to the hospital anyway and the Dr said he must have swallowed it down.<\/p><p>The next day Katie was fascinated when Mummy showed her the sticker in Ben's nappy still intact. She said \"let’s do it again, let’s put another sticker in his mouth!\" This is the second time mummy has been in A and E with Ben in a month. At the start of the month he had pussey tonsils and wouldn't take any fluids or food, worrying mummy silly. And the night he choked on the sticker mummy had to ring NHS direct as Ben was coughing and she was convinced it was still in his throat or in his lungs and the nurse told mummy to calm down. Mummy felt so guilty for leaving the stickers where Ben could get them.<\/p>","images":false},"title":{"value":"Ben Swallows Sticker"},"version":1},{"date":{"d":23,"m":4,"y":2006},"datev":20060423,"first":{"name":"ben","value":"Crawled forward"},"info":{"content":"<p>After church we left Daddy behind and went to Horton Country Park. It was raining and we went for a walk and picnic! Mad.<\/p><p>We went for a little swim at Leatherhead swimming pool. Daddy tried his new mask on, and promptly got told to take it off by this girl. There was a high diving board which Daddy bravely went to try and dive from. Well it's got to hurt. A belly flop!! The same girl looked very disapprovingly at Daddy. A little later on, Daddy let Katie ride on his back as he swam under the water. However, he swam a little deep and Katie was submerged and struggling for air. Daddy didn't know, so Mummy had to step in, and Katie was a little upset.<\/p><p>The three of us have been trying to encourage Ben to crawl for weeks now as he has been so close. Late on in the evening he managed to slowly crawl half the length of the sitting room, and knock the cup tower over. Well done Ben. Just need to keep more of an eye on him now.<\/p>","images":false},"title":{"value":"Horton Country Park - Swimming - Ben 1st Crawl"},"version":1},{"date":{"d":22,"m":4,"y":2006},"datev":20060422,"images":1,"info":{"content":"<p>After comments during the week about buying 'quiet taps' from Bournemouth, we thought we'd better go and investigate. We met up with Ma Ma, Pop Pop, Charlotte, Sue and Richard for a cup of coffee by the pier. We then took the beach train to Alum Chime and then walked back again along the sea front with Auntie Charlotte. Ben just loves being on Daddy's shoulders. He rocks from side to side and bellows his version of a laugh\/sign of happiness.... which is a Bevis and Butthead type laugh!<\/p><p>We then had lunch in Winter Gardens and basked in the sunshine. The warmest day of the year so far. Katie and Mummy went to play on the beach, the sea was freezing, whilst Daddy introduced Ben to the surf shops of the town.<\/p><img src='images\/years\/2006\/2006_04_22-15-Bournemouth.jpg' class='diaryImage' alt='Mummy, Daddy and Ben at Bournemouth' \/><p class='diaryImageCaption'>Mummy, Daddy and Ben at Bournemouth<\/p><p>We met up again. Katie had a go on the trampolines by the pier and then had a lolly. Ben had a taste of a Mister Whippy, but he didn't look too impressed.<\/p>","images":false},"title":{"value":"Bournemouth"},"version":1},{"date":{"d":21,"m":4,"y":2006},"datev":20060421,"images":1,"info":{"content":"<p>Yesterday Howard and Daddy went to the Scuba diving induction lesson where they given the course material and a subtle sales pitch on other courses, holidays and equipment. Needless to say Daddy bought a mask, snorkel, fins and boots for £112! That's on top of the £350 course fee. Still it'll be a good challenge and Daddy's looking forward to it.<\/p><img src='images\/years\/2006\/2006_04_21-KatieScubaDiving.jpg' class='diaryImage' alt='Katie Scuba Diving' \/><p class='diaryImageCaption'>Katie Scuba Diving<\/p><p>Our responsible father of two has been investing the rainy day money in (high risk) shares!<\/p><ul><li><i>Tesco buy\"&gt;16-06-2005 313p<\/i><\/li><li><i>Tesco sell\"&gt;02-03-2005 335p ($437 profit)<\/i><\/li><p>Daddy sold because Tesco were pretty stagnant and there was a worry about the impending competition review in the summer. So we jumped ship and picked a high risk-ish mining company. The metal markets have been soaring recently, and Daddy thought it was time to get into the action.<\/p><li><i>Xstrata buy\"&gt;07-03-2005 1705p<\/i><\/li><\/ul><p>Over the last 7 weeks they have risen to 2076p (18%). Daddy has made 7 buy and sales since and plunged all our savings into it! Being wary as these prices are not sustainable so it's so important to have a 'stop' price.<\/p>","images":false},"title":{"value":"Scuba Diving plus Stocks and Shares"},"version":1},{"date":{"d":19,"m":4,"y":2006},"datev":20060419,"info":{"content":"<p>Katie was washing her hands in the bathroom, which woke Ben up from his afternoon sleep. Katie was worried about Ben waking early. Her conclusion was:<\/p><ul><li><i>katie<\/i>We need to buy some quiet taps from Bournemouth.\u000a        <\/li><li><i>katie<\/i>You can get crisps and chocolate from Bournemouth to!\u000a        <\/li><\/ul><p>Quiet taps so they don't wake Ben is a novel idea, but quite why Bournemouth was singled out, or even known about is quite a mystery.<\/p>","images":false},"title":{"value":"Katie's saying"},"version":1},{"date":{"d":18,"m":4,"y":2006},"datev":20060418,"info":{"content":"<p>In the morning Daddy went off to the auctions and bought a DVD recorder for ?12 and a DAB radio for ?10 and to Daddy's surprise they both worked.<\/p><p>In the afternoon we all went out on a quest, eventually we ended up in Purley On Thames. Not our intended destination, but close enough. We had a nice walk along the river, next to the cows, up to Mapleduram lock.<\/p>","images":false},"title":{"value":"Purley - Thames Walk"},"version":1},{"date":{"d":17,"m":4,"y":2006},"datev":20060417,"images":1,"info":{"content":"<p>Another outing to Alton, this time we went for a nice long walk which took in the duck pond, the watercress line and the swings!<\/p><p>Percy was on show at the steam railway. Daddy just loves the smell of steam from a steam train!<\/p><img src='images\/years\/2006\/2006_04_17-10-BluebellRailway.jpg' class='diaryImage' alt='Bluebell Railway' \/><p class='diaryImageCaption'>Bluebell Railway<\/p>","images":false},"title":{"value":"Steam Trains"},"version":1},{"date":{"d":16,"m":4,"y":2006},"datev":20060416,"images":1,"info":{"content":"<p>Football was called off yet again, so after church we rushed over to Alton, for a nice Easter lunch and an egg hunt in the back garden. Funnily enough it seemed like Katie got the most. The afternoon ended with Mummy throwing a Cadbury's Cream Egg hitting and smashing Daddy's red wine glass that was in his hand! Red wine and glass over Daddy and the floor.<\/p><img src='images\/years\/2006\/2006_04_16-26-Easter.jpg' class='diaryImage' alt='Elders back garden hunting for eggs' \/><p class='diaryImageCaption'>Elders back garden hunting for eggs<\/p><p>After the clear up we went over to Great Grandma's and met up with the rest of the Barnett family. We strolled over to the park and played on the swings.<\/p>","images":false},"title":{"value":"Easter with the Elder and Barnett’s"},"version":1},{"date":{"d":15,"m":4,"y":2006},"datev":20060415,"images":4,"info":{"content":"<p>Ellie led us to the Reptile Centre in the New Forest. We spent half an hour queuing to get there! We saw a frog, a snake and a newsletter inviting us back...erm no thanks.<\/p><p>We played over the secret bridge and had a picnic<\/p><img src='images\/years\/2006\/2006_04_15-19-NewForest.jpg' class='diaryImage' alt='The Gang' \/><p class='diaryImageCaption'>The Gang<\/p><img src='images\/years\/2006\/2006_04_15-27-NewForest.jpg' class='diaryImage' alt='Michael, Katie and Joey' \/><p class='diaryImageCaption'>Michael, Katie and Joey<\/p><p>\u000a        We shifted up to the<a href=\"http:\/\/www.ottersandowls.co.uk\/newforest.htm\">Otter Sanctuary<\/a>close by which had a lot of otters, a fox, some owls and a very tame deer which you can go up to and stroke. He later nearly ate the pushchair! We saw the otters get fed. We liked the otters. A very nice day out\u000a      <\/p><img src='images\/years\/2006\/2006_04_15-28-NewForest.jpg' class='diaryImage' alt='Otter Sanctuary' \/><p class='diaryImageCaption'>Otter Sanctuary<\/p><img src='images\/years\/2006\/2006_04_15-29-NewForest.jpg' class='diaryImage' alt='Ben eating the frame' \/><p class='diaryImageCaption'>Ben eating the frame<\/p>","images":false},"title":{"value":"Bermuda Triangle Of Animals"},"version":1},{"date":{"d":14,"m":4,"y":2006},"datev":20060414,"images":1,"info":{"content":"<p>Good Friday and we went over to Auntie Susan's and Graham's to swap eggs. Well we gave them 2 small eggs and we got 4 big eggs back! We walked down to the pond, but the ducks were not interested. We went to the playground and Benny Boo particularly loved the swings. You could tell he just wanted to go higher. Katie wanted to play with Bomber and Muriel, but they were pretty shy.<\/p><p>In the afternoon Mummy went to church, whilst the rest of us went to the Fars. After playing in the sofa house and farmyard we went for a walk to the aggressive Tomlins pond. Man the ducks were at each other and the swan kept chasing the Canadian Geese out of the water. It's the Basra of the pond world.<\/p><img src='images\/years\/2006\/2006_04_14-14-Fars.jpg' class='diaryImage' alt='Starting our walk to Tomlins Pond' \/><p class='diaryImageCaption'>Starting our walk to Tomlins Pond<\/p><p>Katie wanted the wee wee. No nappy, no toilet, no potty. It was quite funny really trying to get Katie to crouch down, seeing that she has never had to crouch before. Katie done well, Daddy got wet feet, but not a wet arm (which was used as a seat). We moved on to Alphington Pond where it seemed someone had released their goldfish some years ago.<\/p><p>We made our way back home and met up with Mummy again.<\/p><p>In the evening Daddy thrashed Far Far in a game of croquet!! 26-7<\/p>","images":false},"title":{"value":"Visit The Gay's"},"version":1},{"date":{"d":13,"m":4,"y":2006},"datev":20060413,"info":{"content":"<p>We went to the Mother and Toddler Group Easter party today. Katie made a rabbit mask and took part in an Easter egg hunt, finding one for herself and one for Ben. Stupidly though mummy put them at the top of her bag and they must have fallen out because when we got home and went to eat them they had gone. In the afternoon we went and fed the ducks and had a go on the swings with Caroline and Henry. The ducks were completely uninterested in our bread as they must have been fed by every child in Frimley Green during the holidays. Katie had fun though, trying to throw her bread onto the ducks back which she found very funny.<\/p>","images":false},"title":{"value":"Mother And Toddler Easter Party"},"version":1},{"date":{"d":8,"m":4,"y":2006},"datev":20060408,"images":3,"info":{"content":"<p>We all stayed over at Ma Ma and Pop Pop's last night and woke rather early. 5:30!<\/p><p>\u000a        We raced up to Greenwich and started at the top of the\u000a        <a href=\"http:\/\/www.royalparks.gov.uk\/parks\/greenwich_park\/\">\u000a          Greenwich Park\u000a        <\/a>\u000a        gates and entered the squirrel enclosure. We were accosted for a puppet show with a load of other kids. It was lovely to see. Katie was very quiet and attentive, even Benny was well behaved.\u000a      <\/p><img src='images\/years\/2006\/2006_04_08-28-GreenwichMudchute.jpg' class='diaryImage' alt='Greenwich Park' \/><p class='diaryImageCaption'>Greenwich Park<\/p><p>It was a lovely sunny day and we walked around the flower section and down the steep hill to the huge playground at the bottom. Mummy and Katie were rushing around all the apparatus, whilst Daddy and Ben were rocking on the springy horse.<\/p><p>\u000a        We continued our walk in to town and had a stressful time in the traditional<a href=\"http:\/\/www.pieshop.co.uk\/\">Goddard's Pie and Mash<\/a>cafe. Unfortunately you are on top of everyone and it is pretty frantic in there. Both Ben and Katie were both whining and crying so we didn't last as long as we hoped. Definitely recommend it for those without kids.\u000a      <\/p><p>\u000a        Next step was to reach<a href=\"http:\/\/www.mudchute.org\">Mudchute Farm<\/a>, which is Europe's largest inner city farm. We passed the Cutty Sark and had races up and down the tunnel.... Daddy 2 V 0 Mummy. Yes!\u000a      <\/p><img src='images\/years\/2006\/2006_04_08-52-GreenwichMudchute.jpg' class='diaryImage' alt='Greenwich Tunnel' \/><p class='diaryImageCaption'>Greenwich Tunnel<\/p><p>The farm was in the middle of a tower block estate. We entered and weren't that impressed. We saw a load of ducks and a path which lead literally around the houses. Eventually we got to see some other animals. Mutant turkeys, which were huge, some goats, pigs (far far) and cows. We walked around the whole lot and prepared to make our way back, when we saw the stables area. This was fantastic. Loads of kids grooming about 30 horses. There was a lovely jovial, busy, sunny atmosphere. We watched some people having a horsey lesson which Daddy found interesting. Never knew there was so much to it. Personality of the horses... H and F positions for holding the reigns! Not sure what it all means. Anyway Katie was quite taken by the horses. Ben was asleep!<\/p><img src='images\/years\/2006\/2006_04_08-44-GreenwichMudchute.jpg' class='diaryImage' alt='Mudchute Farm Stables' \/><p class='diaryImageCaption'>Mudchute Farm Stables<\/p><p>We made the long walk pack to the top of the park, via an ice lolly stop en-route. Katie and Ben were knackered in the end.<\/p><p>Mummy and Daddy had their final race of the day. Daddy to go through London on his motorbike, versus Mummy going on the A2\/M25\/M3 in the car. Mummy won this one by about 10 minutes! Daddy only nearly died the once when he dropped his glove at the lights when they just turned green. Decided to wheel the bike to the side of the road and almost hit 2 motorbikes who were undertaking!<\/p><p>Daddy went out with Martin and Nick in the evening down in Basingstoke.<\/p>","images":false},"title":{"value":"Greenwich Park and Mudchute Farm"},"version":1},{"date":{"d":7,"m":4,"y":2006},"datev":20060407,"info":{"content":"<p>\u000a        Mummy, Katie and Ben took Ma Ma to the<a href=\"http:\/\/www.nationalstud.co.uk\/\">National Stud<\/a>in Newmarket today for her Mother's Day present. We booked on for a tour, and Katie was very excited because it was on a bus, which she loves. We saw a one day old foal and some huge stallion racehorses, Katie was amazed, but mummy and Ma Ma thought that it was all quite cruel to the horses, mummy didn't realize what a stud farm was until we got there, she just thought it was going to be  racehorse stables, where they all live and you go to buy them or see them.\u000a      <\/p><p>Newmarket town was nice, Ma Ma bought Katie an ironing board and mummy some clothes. We also had a lovely picnic.<\/p>","images":false},"title":{"value":"National Stud"},"version":1},{"date":{"d":4,"m":4,"y":2006},"datev":20060404,"first":{"name":"katie","value":"Out of nappies"},"info":{"content":"<p>Katie wore 'big girl knickers' today and didn't wet them once. She asked to use the potty or toilet all day. We have been trying to get out of nappies since she was two so this is a very big achievement for Katie and will save Mummy and Daddy about £20 a month!<\/p>","images":false},"title":{"value":"No more nappies!"},"version":1},{"date":{"d":2,"m":4,"y":2006},"datev":20060402,"images":2,"info":{"content":"<p>No football and no church this morning. It must be a first. However, we are getting increasingly worried about Ben. Dry nappies, lack of food or drink, vomiting and a temperature. We stayed in and played.<\/p><p>\u000a        In the afternoon we decided to go out and up to London, so we could sleep in the car on the way up. Destination was\u000a        <a href=\"http:\/\/www.londontown.com\/LondonInformation\/Business\/The_Monument\/2c17\/\">\u000a          Monument\u000a        <\/a>\u000a        . We arrived and parked pretty much outside. There are over 300 steps up which must have been heaven for Katie. She loves climbing stairs. We got to the top and the weather had turned for the worse which meant only Daddy was able to have a look at the views. Although there are quite a few buildings which are taller, you can still get some good views over the Thames and towards the city.\u000a      <\/p><img src='images\/years\/2006\/2006_04_02-30-Monument.jpg' class='diaryImage' alt='Mummy and Katie outside the monument' \/><p class='diaryImageCaption'>Mummy and Katie outside the monument<\/p><p>We stopped off at a close Starbucks for a coffee and a cake to share. Katie let us have 2 bites each!<\/p><img src='images\/years\/2006\/2006_04_02-38-Monument.jpg' class='diaryImage' alt='Katie Cup Cake' \/><p class='diaryImageCaption'>Katie Cup Cake<\/p><p>We ploughed our way back, of course colliding with boat race traffic.<\/p>","images":false},"title":{"value":"Monument"},"version":1},{"date":{"d":1,"m":4,"y":2006},"datev":20060401,"images":2,"info":{"content":"<p>Last night Ellie and Michael were hosting an evening around our house along with Karen and Richard, Jon and Rachel. It was a nice evening. Mummy and Daddy won Scene It. The others obviously do not have the film knowledge. All that can be said is Richard Burton and Wet, Wet, Wet!<\/p><p>When Katie woke up this morning mummy told her there was a spider on her head. Katie immediately felt her head and said there wasn't. April fool said mummy. From this point on everything was a tease. \"Katie there's a lion in the garden\" \"Katie there’s a worm in your cornflakes\" etc. Katie joined in teasing Ben, mummy and Daddy with the same teases or real ones, such as \"mummy there's a picture on the wall, April fool\". Then mummy concocted a plan to try and trick Ma Ma, as she always says nobody can April fool her. So Katie rang Ma Ma and Pop Pop and told them she had broken her arm after falling down the stairs, when they were shocked she said \"April fool\" Mummy couldn't believe how well Katie lied, Quite worrying really for when Katie's a teenager!<\/p><p>Ben hasn't been feeling very well. Not just teething, but maybe he has a chest infection. Everything that he's eaten has come back up again. Temperature and allsorts.<\/p><p>\u000a        In the afternoon Daddy, Katie and Farmor ventured to Tring and attempted to cycle along the Aylesbury arm of the Grand Union canal. Of course under Daddy's leadership they got lost and took the wrong canal, went down the\u000a        <a href=\"http:\/\/www.tring.gov.uk\/info\/guc.htm\">\u000a          Wendover\u000a        <\/a>\u000a        arm instead!! How can that be possible? We first of all cycled all the way to the end of the Wendover Arm. Doh! We then ventured along the roads to the picturesque village of Marsworth, passed a couple of horses which we waved at and after 30 minutes began where we were supposed to!\u000a      <\/p><img src='images\/years\/2006\/2006_04_01-15-TringCanalBikes.jpg' class='diaryImage' alt='Grand Union canal Cycling' \/><p class='diaryImageCaption'>Grand Union canal Cycling<\/p><img src='images\/years\/2006\/2006_04_01-24-TringCanalBikes.jpg' class='diaryImage' alt='Katie and Farmor watching a canal boat' \/><p class='diaryImageCaption'>Katie and Farmor watching a canal boat<\/p><p>The weather was sunny, the canal had a lot of very narrow and deep locks. We saw plenty of ducks, swans, dogs and horses on our short route down towards Aylesbury. We only made it as far as Puttenham before Katie had enough. We ambled back to the source of the Wendover arm and returned to the car.<\/p>","images":false},"title":{"value":"April Fool and Canal Bike Ride"},"version":1},{"date":{"d":31,"m":3,"y":2006},"datev":20060331,"images":1,"info":{"content":"<p>Katie had her pre-school Easter party today. The invitation said to wear your best party clothes and Katie looked absolutely beautiful in a lovely pink dress and she even let mummy put her hair in pigtails which is very rare. At the party there was a clown and some food and games. Katie won musical statues (how little miss fidget did this  we'll never know]. Mummy and Ben went to the parents coffee morning while the party was on. In the afternoon while Ben had a little nap, Katie and mummy were really naughty, and snuggled up and ate the Easter egg Katie had been given at the party, while we read books.<\/p><img src='images\/years\/2006\/2006_03_31-09-PlayschoolParty.jpg' class='diaryImage' alt='Katie in her pretty dress' \/><p class='diaryImageCaption'>Katie in her pretty dress<\/p>","images":false},"title":{"value":"Playschool Party"},"version":1},{"date":{"d":28,"m":3,"y":2006},"datev":20060328,"info":{"content":"<p>Today after preschool, Mummy, Katie and Ben went to meet Auntie Charlotte at Horton country park where we were scared by a crazy horse. It was in the field, bucking and neighing and galloping around, we were worried it would jump the fence and we had to run past the field at top speed, Katie and Ben were unfazed, surprisingly, Katie was fascinated. We also saw cows, sheep goats and pigs and got caught in a huge downpour. Poor Ben was soaked but as usual did not complain!<\/p>","images":false},"title":{"value":"Horton Country Park"},"version":1},{"date":{"d":26,"m":3,"y":2006},"datev":20060326,"images":1,"info":{"content":"<p>Katie came home from preschool on Friday with a present and card for mummy. Since then mummy has been desperate to find out what it is. Mummy opened it this morning and it was a lovely box that Katie had decorated with a flower, with some Quality Street inside. In the end Katie ate most of the chocolates, but the thought was there! The card was lovely too, a butterfly made with Katie’s handprints, mummy was thrilled. Ben bought me a chocolate bar, which Katie and daddy ate most of again!<\/p><p>After church, Daddy went on a long walk with Katie to the swings, whilst Mummy and Ben played at home.<\/p><p>In the afternoon Mummy and Katie played face painting... you can see for yourself what happened.<\/p><img src='images\/years\/2006\/2006_03_26-KatieFacePainting.jpg' class='diaryImage' alt='Face Painting' \/><p class='diaryImageCaption'>Face Painting<\/p><p>Later on Farfar and Farmor came around to play and watch Man Utd play! Katie was bossing around Farmor lots.<\/p><p>\u000a        Howard and Susan came around in the evening. We were discussing the impending\u000a        <a href=\"http:\/\/www.divecrew.co.uk\">\u000a          Scuba diving\u000a        <\/a>\u000a        course both Daddy and Howard were going to do.\u000a      <\/p>","images":false},"title":{"value":"Face Painting"},"version":1},{"date":{"d":25,"m":3,"y":2006},"datev":20060325,"info":{"content":"<p>Auntie Susan came around in the morning for some playtime which was nice.<\/p><p>We had lunch at Woking swimming pool and met up with Ma Ma and Pop and Pop. We had a good time in the wave machine. Ben came on the flume with Daddy. They were so slow that another couple came down behind us and bumped into our backs!<\/p><p>Daddy went off to watch Chertsey beat Croydon in a good match, the rest of us went to Grandma's for a bit.<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":21,"m":3,"y":2006},"datev":20060321,"info":{"content":"<p>Mummy picked Katie up from pre-school and on the way home we were discussing what Katie had done there, she said she had been naughty and had to sit on a special mat with one of the playschool ladies. Mummy asked Katie what she had done wrong and Katie said she kept wriggling around during story time. Mummy asked Katie if she is going to sit still on Thursdays playschool and Katie said no, she is going to wriggle! Mummy will have to explain to the playschool ladies that Katie does have ants in her pants when it comes to sitting still, but she is only little after all.<\/p>","images":false},"title":{"value":"Naughty Kitten"},"version":1},{"date":{"d":19,"m":3,"y":2006},"datev":20060319,"images":2,"info":{"content":"<p>In the morning Daddy asked Katie:-<\/p><ul><li><i>Daddy<\/i>Do you want to help me have a shave?\u000a        <\/li><li><i>Katie<\/i>\"No not really.\" Said in a confident, uncompromising manner. That told Daddy.\u000a        <\/li><\/ul><p>Katie's latest expression is \"What a lot of.....\". Cows, Lights, Rice, Dinner, Mud.<\/p><p>Her pronunciation of words cause a lot of delight for Mummy and Daddy. Our favourite at the moment is 'Fffffrosty'.<\/p><p>And she calls us Ma Ma and Dada which is very sweet.<\/p><p>After church we went with Charlotte on a walk from our book given to us by Uncle Steven. A 3.5 mile trek around the cow fields and rivers around Pyrford. It was pretty long for the children. It's just amazing how patient and tolerant Benjamin is. His nose was streaming constantly. He looked cold, but he didn't moan one bit. Obviously inherited his personality from Daddy!!! :)<\/p><img src='images\/years\/2006\/2006_03_19-25-PyrfordWalk.jpg' class='diaryImage' alt='Charlotte And Ben at Pyrford Lock' \/><p class='diaryImageCaption'>Charlotte And Ben at Pyrford Lock<\/p><img src='images\/years\/2006\/2006_03_19-26-PyrfordWalk.jpg' class='diaryImage' alt='A church ruin' \/><p class='diaryImageCaption'>A church ruin<\/p><p>Later on Katie wanted to some painting. However, it was too late.<\/p><ul><li><i>Katie<\/i>Ma Ma - do painting (carrying the paints)\u000a        <\/li><li><i>Mummy<\/i>No Katie, it's a bit late darling\u000a        <\/li><li><i>Katie<\/i>Well I smell the paints instead\u000a        <\/li><\/ul>","images":false},"title":{"value":"Pyrford Walk"},"version":1},{"date":{"d":14,"m":3,"y":2006},"datev":20060314,"info":{"content":"<p>We left bright and early and was in Stafford by 9am. We stopped off at the Castle, walked up the hill to have breakfast and marvel at the Castle and views of the surrounding area.<\/p><p>We then ambled through some pleasant countryside to Lichfield. We parked up and had a lovely walk through the town to the domineering Cathedral. We toured around and saw a bible and angel which were 1300 years old!<\/p><p>We stopped off in a quiet country lane so Ben could have a feed. Daddy and Katie went for a short walk seeing some rabbits scampering across the path and played pooh sticks along a stream and bridge.<\/p><p>We raced home and collapsed, cleared up and again went to bed early. Overall a typical Gay trip - Enjoyable, long and tiring.<\/p>","images":false},"title":{"value":"Stafford Castle and Lichfield Cathedral"},"version":1},{"date":{"d":13,"m":3,"y":2006},"datev":20060313,"info":{"content":"<p>We travelled over to a local Asda for some cooked breakfast. Daddy wasn't too impressed with it. Anyhow we motored up towards Liverpool and entered the desolate Knowsley Safari Park. We headed for the main building and fairground area. It was freezing. There was still snow on the ground which we played footprints in.<\/p><p>As one of the only cars on the Safari Park we motored without rushing past the deer.<\/p><p>We reached the lion enclosure with no one else about. There were seemingly 7 females and 1 male. We stopped close to a couple of them and admired their fine physiques. Our car seemed to gain interest amongst the rest of the pack. We quickly were surrounded, which for about 5 seconds was exciting. Then as soon as the Daddy lion fully extended his jaw to show us what clean teeth he had, combined with a couple of playful lions who started to pace around us, our excitement turned to nervous apprehension. We slowly crawled forward to move the lions out of the way so we could move on.<\/p><p>We moved around to see yet more deer related animals...... and eventually ended up in the Baboon enclosure. The ladies in the car were eager for one to jump on the car. Daddy just thought who was going to fix and pay for the damage! Killjoy. Anyway we had a couple clamber over the roof and perch themselves on the wing mirror much to the amusement of Katie.<\/p><p>The time of year didn't do the safari park any favours. Many animals, it seemed, were kept from our sight. All of the fairground type attractions were shut and there was just no one around to make any atmosphere mainly due to the bitter weather conditions. It was nice and smelly in the giraffe house which Ben and Daddy enjoyed. Daddy had a 30 minute conversation with the giraffes which he enjoyed as they made more sense than Mummy!<\/p><p>After a stressful lunch in the car we had one final tour around the park before moving on to Liverpool for a quick mooch around. We travelled in via the A57 and I thought Liverpool had been re-generated. Not a bit of it. Every other house was boarded up. Shops with metal grills on the front of them. It was terrible. A bit of an eye-opener.<\/p><p>We headed towards Albert Dock which we visited 10 years previous. Ben and Katie were asleep, so Daddy went to see if it was worth us paying the parking and walk about. It was so cold with the biting wind. Daddy enjoyed the walk about, but it really wasn't going to be enjoyable for the children. So the children kind of saw Liverpool as we exited south through a nice little industrial estate that Mummy took us to in Widnes, though Runcorn to Northwich where we stopped so that Katie ran around a nice pub!<\/p><p>We finally made it to Barthomley, Crewe where we stayed in another Travelodge for £10. We all went to bed at 8pm.<\/p>","images":false},"title":{"value":"Knowsley Safari Park and Liverpool"},"version":1},{"date":{"d":12,"m":3,"y":2006},"datev":20060312,"first":{"name":"Ben","value":"Holiday"},"images":3,"info":{"content":"<p>We made off early, without any stress, and reasonably on time which was pretty surprising. We played the list game on the way up where Katie would get a chocolate button every time she saw a post box, phone box, bus, lamp post, rabbit hutch (electrical box), traffic lights, bike, etc.. Katie managed to clear the packet.<\/p><p>We arrived early and stopped off in Kings Norton just south of Bourneville. It was a dump. Straight out of Only Fools and Horses. Bourneville itself looks really nice. Shame we never got the opportunity to look around it properly.<\/p><p>Cadbury World reminded me of Carlsberg a bit in terms of size and what it had to offer. A museum and tour on site of a mass producing factory.<\/p><img src='images\/years\/2006\/2006_03_12-08-CadburyWorld.jpg' class='diaryImage' alt='Cadbury Factory' \/><p class='diaryImageCaption'>Cadbury Factory<\/p><p>We started the tour with 16 bars of chocolate! Katie and Mummies eyes lit up. We went through a dark forest to show where the cocoa beans come from, then a little on the history of Cadbury's, which was quite interesting. Katie rushed us on to the factory part of the tour where we could see conveyor belts of chocolate being wrapped. We made it to the wonka part, where we tasted liquid chocolate, dipped our fudge into chocolate and saw chocolate being mixed and put into moulds. We saw boxes and boxes of chocs. Finally we reached the end in the shop where there were some bargains. Daddy got two packs of mis-shapes for work.<\/p><img src='images\/years\/2006\/2006_03_12-09-CadburyWorld.jpg' class='diaryImage' alt='Ben's Got A Choccy Bar' \/><p class='diaryImageCaption'>Ben's Got A Choccy Bar<\/p><img src='images\/years\/2006\/2006_03_12-11-CadburyWorld.jpg' class='diaryImage' alt='Eating Liquid Chocolate' \/><p class='diaryImageCaption'>Eating Liquid Chocolate<\/p><p>We mucked about in the playground, before heading north, through the centre of Birmingham up into Stoke. The weather was windy, wet and bitterly cold. Welcome to the north. We searched for a swimming pool and stumbled across Waterworld in Stoke - The largest water park in the country. Just what the doctor ordered.<\/p><p>A steep 8 quid entrance fee, but the best water park we'd been to. An area was set aside for 2 year olds. Mini slides, flumes, play house and climbing net. Katie loved it and was bossing everyone about. Benjamin was enjoying it also.<\/p><p>Daddy had a go on a few of the flumes and loved the tire ride which went quick and included some uphill sections just like at Basingstoke. There were hardly any queues for the flumes. Definitely a place to go back to if we had a little more time.<\/p><p>We spent our first night at Stoke Talke Travelodge which was only 10 minutes away. Katie and Daddy ventured into Newcastle Under Lyne for some fish and chips. We all went to bed at 7:30pm and slept well.<\/p>","images":false},"title":{"value":"Chocolate World and Waterworld"},"version":1},{"date":{"d":11,"m":3,"y":2006},"datev":20060311,"first":{"name":"Ben","value":"First night without me"},"info":{"content":"<p>Daddy took Katie out to the swings and to get some fresh bread, whilst Ben helped mummy pack for our holiday tomorrow.<\/p><p>Karen popped around to visit and play with us. Again she was naughty and bought us some sweeties. Yum yum.<\/p><p>In the afternoon we went out with the Elders and Charlotte to Little Angels (soft play). Daddy took great pleasure throwing balls at Uncle Michael! Pop Pop and Ma Ma came around to play in the late afternoon.<\/p><p>In the evening the Fars came around to baby sit, whilst Mummy and Daddy went to the Frimley Lodge quiz. This was the first time since Ben has been born that Mummy and Daddy have gone out without us.<\/p>","images":false},"title":{"value":"Karen Visit, Little Angels"},"version":1},{"date":{"d":6,"m":3,"y":2006},"datev":20060306,"info":{"content":"<p>We went to Frimley Lodge park today and fed the ducks. Katie laughed so much because she threw the bread and it landed on the ducks back. Ben loved going down the big slide with mummy, while Katie went down with her bubby. Today mummy was told off by Katie. Mummy said \"can I have the bowl Katie\"? and Katie said \"say Please mummy\".<\/p><p>Ben had his first lumpy meal today and panicked mummy silly when he coughed on it.  Mummy picked him up, patting his back like mad and then he was sick all over her!<\/p>","images":false},"title":{"value":"Frimley Lodge Park"},"version":1},{"date":{"d":5,"m":3,"y":2006},"datev":20060305,"info":{"content":"<p>Went to church in the morning, Katie wouldn't let mummy leave her in crèche which has been the same for a few weeks now. So we coloured and read books (Katie loves the three little pigs). Tried to give Ben milk from a cup and bottle but he only wants mummy’s milk. Went to the Quays pub for Great Granddads 83rd birthday meal. Ma Ma and Pop Pop and the Elders and Auntie Charlotte and Uncle John G were there. It was really nice. Katie spotted the swings outside and even though it was really cold she spent most of the time out there with the grownups taking turns to play. Went to Great Grandma and Granddads after for cake and Ma Ma and uncle John took Katie to the swings behind their house even though by now it was freezing, mummy and daddy took the opportunity to have a rest on the sofa as Ben was asleep in his car seat in Great Grandmas bedroom.<\/p>","images":false},"title":{"value":"Great Granddad’s 83rd"},"version":1},{"date":{"d":4,"m":3,"y":2006},"datev":20060304,"info":{"content":"<p>Mummy went to an NCT Sale with Ellie and Sarah. The rest of us went around to the Fars to play. We then motored off to the Arena, although Farfar sailed off to Farnborough Leisure centre for some reason. Anyway, we met up with Auntie Susan. The pool was the busiest we've seen it. Could hardly move in there. The water was boiling. Katie loved running between the big and small pools. Ben enjoyed himself with the rattle. He seemed as though he wanted to drink the pool water.<\/p><p>In the afternoon we went for a nice walk our old stamping ground, Bagshot. Daddy wishes we still lived around here. He looked into the old house but couldn't see much. We ended up at the swings. It was bitterly cold.<\/p>","images":false},"title":{"value":"Swimming With The Fars"},"version":1},{"date":{"d":3,"m":3,"y":2006},"datev":20060303,"info":{"content":"<p>Katie did her sponsored slide at preschool today. She managed three slides in one minute and today was the first day that she didn't cry on the way to preschool so hopefully Katie is beginning to enjoy it more, she has made some friends Natasha and Louis.<\/p>","images":false},"title":{"value":"Sponsored Slide"},"version":1},{"date":{"d":1,"m":3,"y":2006},"datev":20060301,"info":{"content":"<p>Ben had a much needed long sleep, he has two horribly painful teeth coming through and has been up allot in the night needing lots of cuddles and Calpol. Katie and mummy made a chocolate fridge cake which we couldn't stop eating.<\/p>","images":false},"title":{"value":"Chocolate Cake"},"version":1},{"date":{"d":26,"m":2,"y":2006},"datev":20060226,"images":1,"info":{"content":"<p>We went for a walk, fed the ducks and play in the playground in the freezing weather.<\/p><img src='images\/years\/2006\/2006_02_26-BenJetteSwing.jpg' class='diaryImage' alt='Ben and Farmor Swinging' \/><p class='diaryImageCaption'>Ben and Farmor Swinging<\/p><p behaviour=\"Katie\">Over the past couple of weeks Katie's behaviour towards Daddy has been very standoff-ish. No kisses, very little closeness. It's been a tough time, where only Mummy can do anything for her. However, for some reason this weekend Daddy's little Katie has come back. She's has been an absolute delight to be around. We all really can't work out what has changed or what is going on. We have a suspicion that it might have something to do with her playschool visits, but why daddy gets the blame is very hard to say.<\/p>","images":false},"title":{"value":"The Fars Come Around"},"version":1},{"date":{"d":25,"m":2,"y":2006},"datev":20060225,"first":{"name":"benjamin","value":"Bottom Centre Tooth"},"info":{"content":"<p>We went swimming with Ma Ma and Pop Pop, Auntie Ellie and Joey at Woking swimming pool.<\/p><p>We dipped some bouncy balls in paint today and rolled them around in a big tin and made some lovely paintings we also made a tiger mask out of a Disney princess paper plate that Katie stole from Woolworths<\/p>","images":false},"title":{"value":"Swimming and Ball Painting"},"version":1},{"date":{"d":23,"m":2,"y":2006},"datev":20060223,"first":{"name":"benjamin","value":"Blowing Raspberries"},"images":1,"info":{"content":"<p>First lot of laying, sustained snow of the year. We rolled up a snowman<\/p><img src='images\/years\/2006\/2006_02_23-04-KatieSnowman.jpg' class='diaryImage' alt='Katie makes a snowman' \/><p class='diaryImageCaption'>Katie makes a snowman<\/p>","images":false},"title":{"value":"Snowman"},"version":1},{"date":{"d":18,"m":2,"y":2006},"datev":20060218,"images":3,"info":{"content":"<p>We hadn't been to London in a long while and we decided to go up today. We looked in our free attractions in London book and came across a couple of places to visit.<\/p><p>\u000a        We caught the tube from Turnham Green and then a bus to\u000a        <a href=\"http:\/\/www.londontown.com\/LondonInformation\/Attraction\/Corams_Fields\/4359\/\">\u000a          Coram's Field\u000a        <\/a>\u000a        which Katie enjoyed. Coram's Field is a 7 acre kids site, with playgrounds, animals and football pitches. It has a cafe and some buildings for kids to do playschool stuff. It was in a very nice setting. Would be great in the summer. Anyway Katie enjoyed playing on the playground, not too fussed about the animals though.\u000a      <\/p><p>Next was a stressful lunch time... with Laura feeling ill, Katie climbing all over the place and Ben overdue for his lunch by an hour or so! Anyway we had a 32 inch pizza to share!... which we ate.<\/p><p>\u000a        We bussed it down to Aldwych to see a\u000a        <a href=\"http:\/\/www.nationaltrust.org.uk\/main\/w-vh\/w-visits\/w-findaplace\/w-romanbath\/\">\u000a          Roman Bath\u000a        <\/a>\u000a        - well it is advertised as this, but reading about it, it is not actually believed to be roman after all! It is strangest attraction you're likely to see. We were prepared for an anti-climax but the national trust 'bath' was tucked away in a back alley way, in a room which you could only view through a small, very low, dirty window. The bath itself looked interesting for the first 10 seconds. The workman close by said we could switch a light on that illuminated the bath.\u000a      <\/p><img src='images\/years\/2006\/2006_02_18-50-London.jpg' class='diaryImage' alt='Steps To The Roman Bath' \/><p class='diaryImageCaption'>Steps To The Roman Bath<\/p><p>We enjoyed the walk and strolled along Victoria Embankment back to catch the underground.<\/p><img src='images\/years\/2006\/2006_02_18-52-London.jpg' class='diaryImage' alt='Chillin' On Embankment' \/><p class='diaryImageCaption'>Chillin' On Embankment<\/p><p>Mummy and Ellie were having a girls night in, so Daddy, Michael and Uncle Dog went out pubbing in Alton. The Butlins boys weekend was planned. The Baker's Arms was a shocking pub.<\/p><img src='images\/years\/2006\/2006_02_18-31-London.jpg' class='diaryImage' alt='Benny Bernassi' \/><p class='diaryImageCaption'>Benny Bernassi<\/p>","images":false},"title":{"value":"London - Coram's Field and Roman Bath"},"version":1},{"date":{"d":15,"m":2,"y":2006},"datev":20060215,"images":1,"info":{"content":"<p>In preparation for reading today, Katie asked for her glasses.<\/p><ul><li><i>Mummy<\/i>\"But Katie you don't have any glasses\"\u000a        <\/li><li><i>Katie<\/i>Yes I do (she goes and gets her goggles!)\u000a        <\/li><\/ul><img src='images\/years\/2006\/2006_02_15-01-KatieGoggles.jpg' class='diaryImage' alt='Goggles' \/><p class='diaryImageCaption'>Goggles<\/p><p>Future job?<\/p><ul><li><i>Mummy<\/i>What do you want to be when you grow up?\u000a        <\/li><li><i>Katie<\/i>Dunno\u000a        <\/li><li><i>Mummy<\/i>A D..... (trying to get her to say A doctor)\u000a        <\/li><li><i>Katie<\/i>A Dog!!!!\u000a        <\/li><\/ul>","images":false},"title":{"value":"Katie Funny"},"version":1},{"date":{"d":12,"m":2,"y":2006},"datev":20060212,"first":{"name":"ben","value":"Cinema Trip"},"info":{"content":"<p>We lost 4-3 at football today. We scored 3 own goals including one from Daddy :(.<\/p><p>We went straight off to the cinema at Bracknell to see the Little Polar Bear 2. We really didn't know if we were going to last 10 minutes or the whole film. Katie got scared during some of the bits but she enjoyed it and kept entertained throughout the 80 minute cartoon. Ben was Ben - awake and being a good boy. It was pretty expensive at 17 quid.<\/p><p>Uncle Dog and Joyce was the next destination. We went around for a nice chat and a cup of tea.<\/p>","images":false},"title":{"value":"Cinema and Uncle Dogs"},"version":1},{"date":{"d":11,"m":2,"y":2006},"datev":20060211,"images":4,"info":{"content":"<p>Well it was actually yesterday. We done jobs and went to the swings in the morning. It was pretty cold.<\/p><p>In the afternoon Daddy went off to Go-Karting at Aldershot. They've changed the track around since he last went, but still managed to get the quickest lap of the day (so far). Daddy won the trophy for 1st place. We then went to the Wellington Statue for a quick walk before returning home for a bite to eat.<\/p><img src='images\/years\/2006\/2006_02_11-02-Karting.jpg' class='diaryImage' alt='Cruizzzinngg It' \/><p class='diaryImageCaption'>Cruizzzinngg It<\/p><img src='images\/years\/2006\/2006_02_11-17-KarenKarting.jpg' class='diaryImage' alt='Discussing the sloppy driving' \/><p class='diaryImageCaption'>Discussing the sloppy driving<\/p><img src='images\/years\/2006\/2006_02_11-01-Karting.jpg' class='diaryImage' alt='Trophy Boy' \/><p class='diaryImageCaption'>Trophy Boy<\/p><p>Richard had organised a disco in Crookham Social club for Karen's 30th. There were a few people we knew that came. It was nice to catch up with Fi, Kelly and their new born, Thomas. We briefly also saw Helen and Nigel. Ben and Katie eventually got tired by about 10 o'clock.<\/p><img src='images\/years\/2006\/2006_02_11-10-RichardKarensParty.jpg' class='diaryImage' alt='Karen and Richard' \/><p class='diaryImageCaption'>Karen and Richard<\/p>","images":false},"title":{"value":"Karen's 30th Birthday"},"version":1},{"date":{"d":5,"m":2,"y":2006},"datev":20060205,"images":14,"info":{"content":"<p>Ben's Big Day and at 6 months old he rather took a liking to his dress!! Helen's mum had kindly embroidered his name and date on the inside to join Katie's particulars, hopefully the gown can be used for other family christenings.<\/p><p>We made St Andrews church, Frimley Green for 9:30 on a cold, cloudy morning. We had a small section of the church for the 40 or so family and friends we had. It was so nice to see everyone come, especially those who had set out at 7am that morning!<\/p><p>The vicar had to work hard as the Christening service was merged with the traditional communion service. Mummy and Daddy spent most of the time trying to keep both Katie and Ben happy rather than listening to the service. Katie was a bit of a handful, she was loving the audience to her performance.<\/p><p>Oil was smeared onto Ben's forehead, water across his head and a candle lit to signify Ben's joining of the church. It was a lovely service which made us parents feel exceptionally proud.<\/p><p>We didn't get time to do photo's in the church which was our only regret of the day. We rushed off to Mytchett Bowls Club where we had some nibbles and drink. I thought Daddy gave an excellent speech.<\/p><p>Thanks for everyone who came and for the generous presents.<\/p><img src='images\/years\/2006\/2006_02_05-32-BenChristening.jpg' class='diaryImage' alt='All The Family Kiddies Together' \/><p class='diaryImageCaption'>All The Family Kiddies Together<\/p><img src='images\/years\/2006\/2006_02_05-34-BenChristening.jpg' class='diaryImage' alt='The Barnett Family' \/><p class='diaryImageCaption'>The Barnett Family<\/p><img src='images\/years\/2006\/2006_02_05-37-BenChristening.jpg' class='diaryImage' alt='Shirley and Michael' \/><p class='diaryImageCaption'>Shirley and Michael<\/p><img src='images\/years\/2006\/2006_02_05-41-BenChristening.jpg' class='diaryImage' alt='The Main Man With Parents' \/><p class='diaryImageCaption'>The Main Man With Parents<\/p><img src='images\/years\/2006\/2006_02_05-43-BenChristening.jpg' class='diaryImage' alt='Dixon’s Of Deal' \/><p class='diaryImageCaption'>Dixon’s Of Deal<\/p><img src='images\/years\/2006\/2006_02_05-45-BenChristening.jpg' class='diaryImage' alt='Godparent Auntie Susan and Graham' \/><p class='diaryImageCaption'>Godparent Auntie Susan and Graham<\/p><img src='images\/years\/2006\/2006_02_05-47-BenChristening.jpg' class='diaryImage' alt='The Godparents: Ellie, Michael, Charlotte and Susan' \/><p class='diaryImageCaption'>The Godparents: Ellie, Michael, Charlotte and Susan<\/p><img src='images\/years\/2006\/2006_02_05-50-BenChristening.jpg' class='diaryImage' alt='Us With The Godparents' \/><p class='diaryImageCaption'>Us With The Godparents<\/p><img src='images\/years\/2006\/2006_02_05-51-BenChristening.jpg' class='diaryImage' alt='The Gays' \/><p class='diaryImageCaption'>The Gays<\/p><img src='images\/years\/2006\/2006_02_05-52-BenChristening.jpg' class='diaryImage' alt='The Main Man' \/><p class='diaryImageCaption'>The Main Man<\/p><img src='images\/years\/2006\/2006_02_05-54-BenChristening.jpg' class='diaryImage' alt='Junior Miss and Senior Mrs. Gay' \/><p class='diaryImageCaption'>Junior Miss and Senior Mrs. Gay<\/p><img src='images\/years\/2006\/2006_02_05-61-BenChristening.jpg' class='diaryImage' alt='Ben Staying Focused Whilst Others Are Distracted' \/><p class='diaryImageCaption'>Ben Staying Focused Whilst Others Are Distracted<\/p><img src='images\/years\/2006\/2006_02_05-63-BenChristening.jpg' class='diaryImage' alt='Bennie' \/><p class='diaryImageCaption'>Bennie<\/p><img src='images\/years\/2006\/2006_02_05-64-BenChristening.jpg' class='diaryImage' alt='Sneaking out for a run around outside' \/><p class='diaryImageCaption'>Sneaking out for a run around outside<\/p>","images":false},"title":{"value":"Ben's Christening"},"version":1},{"date":{"d":4,"m":2,"y":2006},"datev":20060204,"info":{"content":"<p>In the morning Katie, Daddy and Farmor went swimming in a cold Farnborough pool, whilst Mummy and Ben done the final bits of shopping for tomorrow's christening.<\/p><p>After help preparing Mytchett Bowls club with balloons, seating arrangements, etc.. we ventured over to Alton for dinner and games with the Elders. Ask Daddy about the 'Railway Children!'<\/p>","images":false},"title":{"value":"Swimming - Over To Elders"},"version":1},{"date":{"d":3,"m":2,"y":2006},"datev":20060203,"info":{"content":"<p>Today Katie cried and didn't want to go to Playschool. A similar story to yesterday. Mummy had to leave her crying, but the teacher said she cheered up 2 minutes after she had left. All the other kids seem a lot bigger than her. Anyway she still comes out having enjoyed her session.<\/p>","images":false},"title":{"value":"Playschool progress"},"version":1},{"date":{"d":31,"m":1,"y":2006},"datev":20060131,"first":{"name":"katie","value":"First day at playschool"},"images":1,"info":{"content":"<p>Katie's first day at Balmoral Drive's playschool or pre-school. We have been prepping her for the past month and talking very upbeat about it and had made her excited to go. Although quite what she thought was going to happen is very difficult to know.<\/p><p>We arrived after all the other kids had gone in so it wouldn't be so hectic and scary. Katie ran into the hall and played straight away on the slide. Mummy and Daddy spoke to the teacher for 5 minutes, and then slid out. Katie was fine and didn't seem to be bothered at all. It went better than we could have expected.<\/p><p>Mummy and Daddy were very happy and sad as it was confirmation of the next step of Katie's development and independence, which she slipped into seamlessly. Mummy having being in her presence 100% of the time felt it hardest to let go. A feeling of not being needed. Still we are all very proud of her.<\/p><p>She will be going Tuesdays, Thursday's and Friday's, 9:30 till 12:30. Playschool will hopefully bring structured play and social interaction with new children without mummy and daddy around. She will thrive with older children around. Also it gives Mummy a chance to have some 1 on 1 quality time with Ben which never happens. So this will benefit all of us.<\/p><p>Katie brought home 2 pictures and the teachers said she was very happy and confident. She played with new friends Gary and Louie.<\/p><img src='images\/years\/2006\/2006_01_31-KatieFirstDayAtPlayschool.jpg' class='diaryImage' alt='First Day At Playschool' \/><p class='diaryImageCaption'>First Day At Playschool<\/p>","images":false},"title":{"value":"First day at playschool"},"version":1},{"date":{"d":29,"m":1,"y":2006},"datev":20060129,"images":1,"info":{"content":"<p>Daddy's football in the morning was rubbish. Too tired. We of course went to church.<\/p><p>Ben is still waking loads in the night, 6 or 7 times. So he slept most of the afternoon. The Fars popped around for a quick cup of tea before we went off to the Church New Year’s Party!<\/p><p>I know it doesn't sound much fun, but there were games for the children for a couple of hours. Katie had a whale of a time running around and taking part in the games.<\/p><p>The funniest bit was when they began playing 'Gary Glitter's' - Come On, Come On during Pass The Parcel!! A bit un-PC!! We won in the raffle.... We had the ticket 666. Quite ironic for a church raffle.<\/p><img src='images\/years\/2006\/2006_01_29-MartinAtChurchParty.jpg' class='diaryImage' alt='Daddy looking silly' \/><p class='diaryImageCaption'>Daddy looking silly<\/p>","images":false},"title":{"value":"Church Party"},"version":1},{"date":{"d":28,"m":1,"y":2006},"datev":20060128,"images":3,"info":{"content":"<p>We went for a stressful shopping trip to Guildford to get Joey and Freya's first birthday present. We met up at the Star pub for a bite to eat. The lamb shank was 'bonnet da douche'.<\/p><img src='images\/years\/2006\/2006_01_28-BenGerry.jpg' class='diaryImage' alt='Ben With Pop Pop' \/><p class='diaryImageCaption'>Ben With Pop Pop<\/p><p>It was bitterly cold but we met up with Ma Ma, Pop Pop, Joey, Ellie and Michael for Joey's first birthday trip to Bocketts Farm. We saw the new piglets under a heat lamp guarded by a big pig (who reminded us of mummy!). We played in the sandpit, on the trampoline, slides, swings and wendy house. Who needs a farm when there are so many playground toys?<\/p><img src='images\/years\/2006\/2006_01_28-Ben.jpg' class='diaryImage' alt='Benjamin' \/><p class='diaryImageCaption'>Benjamin<\/p><p>We were called to the barn where we were all able to stroke some of the smaller animals. Katie for the first time ever stroked a rabbit! Without being forced. It was so nice to see as she absolutely loves animals. Pop Pop was chatting up the farmer girl, whilst two guinea pigs were fighting each other! We walked around to see the horses, donkeys and llamas.<\/p><p>We ended the trip with a go in the play house, with us all having a go on the big slide.<\/p><p>In the evening we completed our Star Wars viewing by watching Return Of The Jedi.<\/p><img src='images\/years\/2006\/2006_01_28-BenMartinMichaelJoeySlide.jpg' class='diaryImage' alt='Slippy Slidey' \/><p class='diaryImageCaption'>Slippy Slidey<\/p>","images":false},"title":{"value":"Joey First Birthday Trip To The Farm"},"version":1},{"date":{"d":26,"m":1,"y":2006},"datev":20060126,"info":{"content":"<p>... for a takeaway and game of Scene It.<\/p>","images":false},"title":{"value":"Susan And Graham Around"},"version":1},{"date":{"d":22,"m":1,"y":2006},"datev":20060122,"info":{"content":"<p>In the morning Daddy went to play football. Again only 10 turned up, but somehow got a 0-0 result. A great effort by all the lads. The rest of us went to church with Ellie and Joey.<\/p><p>After Ma Ma and Pop Pop popped around for a cuppa, we went for a short walk around the estate.<\/p>","images":false},"title":{"value":"Ma Ma and Pop Around"},"version":1},{"date":{"d":21,"m":1,"y":2006},"datev":20060121,"info":{"content":"<p>Mummy and Daddy took us to the zoo today. We weren't too sure what to expect as Whipsnade Zoo is linked to the very disappointing London Zoo. It was rather strange it's a zoo where you kind of drive round a bit get out, see some animals and pop back into the car again.<\/p><p>Anyway, we started with feeding time with 4 brown bears. This was excellent, as we could see the bears move around, take water from their lake. They got apples, grapes, oranges and biscuits from Sainsbury's. Katie even throw some fruit to them. They looked pretty docile animals. The park was set out in a big oval, where you drive around to the next set of animals to see. The animals had plenty of room and it seemed a bit more humane than its sister London Zoo.<\/p><p>We saw the penguins, monkeys, wolves, antelope, giraffes, zebras, hippos, rhinos, lions, tigers, sea lions and finally elephants. The elephants were the highlight of the day as we saw 5 of them trunk to tail, marching down the path. We had to get out of the way quickly. Both Ben and especially Katie loved it.<\/p>","images":false},"title":{"value":"Whipsnade Zoo"},"version":1},{"date":{"d":17,"m":1,"y":2006},"datev":20060117,"info":{"content":"<woops woopstitle=\"Brakes failed, needed handbrake turn to stop car\" rating=\"8\"><p>Mummy drove over to Ellie's today. As we left the A31, down the slip road the brakes failed to work. Heading towards a fast and busy t-junction, mummy managed to pull the handbrake and turn just before the give way area. We were in the back. Mummy was a bit shaken.<\/p><\/woops><p>Daddy came over and took the car to the garage. However, they couldn't find anything wrong with the brakes. A bit worrying really, as what is to stop it from happening again?<\/p>","images":false},"title":{"value":"Car Brakes Failed!"},"version":1},{"date":{"d":15,"m":1,"y":2006},"datev":20060115,"info":{"content":"<p>Daddy scored an amazing near post diving header from 10 yards out. 17 goals for Casuals now.<\/p><p>In the afternoon we went for a walk over the back of Red Road. We looked for the mythical animals that Daddy reckons live over there. We didn't see them again. Just droppings!<\/p>","images":false},"title":{"value":"Diving Header Goal"},"version":1},{"date":{"d":14,"m":1,"y":2006},"datev":20060114,"info":{"content":"<p>We went to do the recycling in the morning, then over to Woking to meet up with the Weston clan to go swimming. We all came back here for games and dinner.<\/p>","images":false},"title":{"value":"Woking Swim"},"version":1},{"date":{"d":7,"m":1,"y":2006},"datev":20060107,"images":1,"info":{"content":"<p>Uncle Dawg bought us a nice pub-walk book for Christmas. We decided on our first one which was titled Waverly Abbey. But instead managed to see a lot of mud, which was quite comical as we had a small, plastic, 4-wheeled buggy to track through the mud.<\/p><p>We really enjoyed the walk. For:-<\/p><ul><li>the pub that was shut as we sought salvation from the elements.<\/li><li>the commands that 'chip chop' was barking out to us, as we tackled the buggy through the mud.<\/li><li>Daddy almost slipped into the mud whilst carrying Ben.<\/li><li>We never actually saw Waverly Abbey. A return visit required.<\/li><li>The inevitable rush back to the car as Ben was getting cold and hungry. The estimated 1 hour walk took 2 hours!<\/li><\/ul><img src='images\/years\/2006\/2006_01_07-03-TilfordWalk.JPG' class='diaryImage' alt='Muddy Walk' \/><p class='diaryImageCaption'>Muddy Walk<\/p>","images":false},"title":{"value":"Elstead-Tilford Walk"},"version":1},{"date":{"d":3,"m":1,"y":2006},"datev":20060103,"info":{"content":"<b>Things that puts a giggle on my chops<\/b><p \/><ul><li>Katie playing with me. Anything she does, I like.<\/li><li>Being tickled.<\/li><li>Putting my toys in my mouth.<\/li><\/ul><p \/><b>Things that make me sleep<\/b><p \/><ul><li>Being driven in the car<\/li><li>After mummy has given me some booby milk<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>Toys<\/li><li>Baby Food. I could eat for England. Always finish the bowl of food.<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Putting things on my head, so I can't see. I then stretch my arms and legs, shut my eyes and get so stressed that I shiver all my body!<\/li><li>Crying<\/li><li>Playing my orange, drum like toy<\/li><li>Playing with anyone.<\/li><li>Sitting in my doughnut<\/li><li>Rolling around<\/li><\/ul><p \/><b>Development<\/b><p \/><ul><li>I am such a happy boy. I am easily pleased, and am quite happy playing with my toys by myself.<\/li><li>I am still waking 3 or 4 times a night for a feed<\/li><li>I can roll from back to front and vice versa<\/li><li>I am also a good boy. Well much better than Katie ever is or was on all aspects of life. At bedtime, at mealtime and at quiet time.<\/li><\/ul>","images":false},"title":{"value":"Ben at 6 months. What I'm like"},"version":1},{"date":{"d":2,"m":1,"y":2006},"datev":20060102,"info":{"content":"<b>Expressions<\/b><p \/><ul><li>Horsey, horsey don't you stop.<\/li><li>Big cuddle.<\/li><li>Wossat Mummy?<\/li><li>Bic Bix<\/li><li>Ello Boys<\/li><li>Funkey Monkey<\/li><li>Wossies (sweets)<\/li><li>I 'Dict A Riot (in reference to the Kaiser Chiefs track)<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>Fussy eater!!!<\/li><li>Yoghurts<\/li><li>Milk<\/li><li>Frozen peas and ice cubes.<\/li><li>Chocolate Buttons<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Playing with my toys<\/li><li>Roly Pollies around on the floor<\/li><li>Playing with Lindey Dolls<\/li><li>Playing with my teapot, dolls house, Lego<\/li><li>Play dough<\/li><li>Dewies (drawings)<\/li><li>Going to the beach<\/li><li>Reading<\/li><li>Drinking milk<\/li><\/ul><p \/><b>Personality<\/b><p \/><ul><li>Temperamental. Depending on tiredness.<\/li><li>Demanding playtime all the time.<\/li><li>Bossy.<\/li><li>Socialable and chatty (even on the telephone).<\/li><li>Extremely loving<\/li><li>Playful<\/li><\/ul>","images":false},"title":{"value":"Katie at 2 - 2.5 years. What I'm like"},"version":1},{"date":{"d":1,"m":1,"y":2006},"datev":20060101,"info":{"content":"<p>We went for a Danish Christmas meal around at the Fars. Shirley and Michael were there which was nice. Michael was telling us about the 'Richmond Harness' and his business. Very interesting. Susan and Graham popped over.<\/p>","images":false},"title":{"value":"New Years Meal"},"version":1}],"version":1263704490}