{"entries":[{"date":{"d":31,"m":12,"y":2007},"datev":20071231,"images":1,"info":{"content":"<p>Sleeping all in one room guaranteed an early wake up call. Katie and Ben were itching to get out, so Daddy got them changed outside in the corridor at 6:30, leaving Mummy and Jessica to have a lovely lye in.<\/p><p>The three early birds decided to go for a walk in Warminster where Ben developed a 'bad boy strut'. Looked like he had been shot in the leg, but apparently he was skipping! It was still dark but we had fun walking up and down the high street.<\/p><p>We made it back and looked and looked for the car keys. We couldn't find them anywhere. Then Katie produced them from inside of the kettle where she had played with them and left them there! We gave a sigh of relief and ventured off to Sainsbury's to get some breakfast. Talk about trusting a brand. We travelled a 16 mile round trip just to eat breakfast there! Madness.<\/p><p>\u000a        We then were feeling brave and drove to the<googlelink link=\"White+Horse+Westbury\">White Horse<\/googlelink>. We wrapped up and nervously walked around the surrounding area and had our picnic. The horse was on a really steep bit of the hill.\u000a      <\/p><img src='images\/years\/2007\/2007_12_31-04-WhiteHorseWalk.jpg' class='diaryImage' alt='White Horse near Westbury' \/><p class='diaryImageCaption'>White Horse near Westbury<\/p><p>We returned home via Salisbury Plan and Stonehenge to drop our bags and get ready for going to the Elders for the evening to see the new year in. We played with Joey and Lily and pretended that it was midnight so we could sing Auld Lang Syne and have a drink. We went to bed leaving the grownups to have a lovely Fajitas (thanks Ellie) and play some really, really good games we got for Christmas! :)<\/p><p>Some were flagging come the real midnight, but we celebrated with a glass of Champers. An end to another eventful year.<\/p>","images":false},"title":{"value":"Warminster Walk, White Horse Walk, New Years Eve Party With Elders"},"version":1},{"date":{"d":30,"m":12,"y":2007},"datev":20071230,"images":2,"info":{"content":"<p>\u000a        We embarked on a weekend break down to Wiltshire centring around Sine christening. First stop was scenic Swindon and it's thousand roundabouts! The\u000a        <a href=\"http:\/\/www.steam-museum.org.uk\/\">\u000a          Great Western Railway Steam Museum\u000a        <\/a>\u000a        was primarily for Ben's benefit, however, he didn't seem that interested in the steam engines really. Daddy had to be dragged around! I think you have to be a bit of a train nerd to enjoy this place.\u000a      <\/p><img src='images\/years\/2007\/2007_12_30-12-SteamMuseumSineChristening.jpg' class='diaryImage' alt='North Star' \/><p class='diaryImageCaption'>North Star<\/p><p>We stopped off outside in the freezing cold for a picnic, before going around the adjoining shopping centre to warm up.<\/p><p>We drove down to our holetel (Hotel) just outside Warminster. Katie and Ben love hotels. Such adventure. We dumped our bags, made ourselves look beautiful and went off to Frome for the christening.<\/p><p>We parked outside the church and waited in the car as we were a bit early. Five minutes before we ventured up to the church. However it was pitch black. Something not right here. We asked a local and we'd gone to the wrong church! We made it to St Alexandra's and settled down near the front. Sine (pronounced Sheena) is the daughter of Jessica, Mummy's friend from school. We hadn't seen her and Jon since their wedding four years ago, so it was a surprise and a pleasure to be invited down. It was a catholic service which is a bit different to the C of E services we normally attend. Thankfully families were welcome, as Katie and Ben treated the place like an assault course! Jessica squawked quite a bit as well. Sine was christened and we went across to the hall for some nibbles and to catch up with Vicky Deacon and Jessica.<\/p><p>We returned late back to the hotel via a pizza shop. Katie and Ben still excited to be in a hotel slept head to toe.<\/p><img src='images\/years\/2007\/2007_12_30-21-SteamMuseumSineChristening.jpg' class='diaryImage' alt='Head to Toe' \/><p class='diaryImageCaption'>Head to Toe<\/p>","images":false},"title":{"value":"GWR Steam Museum - Sine Christening"},"version":1},{"date":{"d":29,"m":12,"y":2007},"datev":20071229,"first":{"name":"jessica","value":"Swim"},"info":{"content":"<p>Daddy jogged over to Farnborough Rec and met the rest of us for Jessica's first swim. She loved it and spent half an hour in the coldish pool. Ben couldn't wait to get in the pool, dropping his trousers as soon as we got in the changing room! Ben and Katie are getting allot more confident in the water, Katie although not swimming too great is as happy under the water as above. We invented a new game called hippo's - a bit like horsey's but in the water!<\/p>","images":false},"title":{"value":"Jessica's first swim"},"version":1},{"date":{"d":26,"m":12,"y":2007},"datev":20071226,"images":3,"info":{"content":"<p>After an interesting night's sleep Daddy, Uncle Michael, Katie, Ben, Joey and Lily all went up to Greenwich for a tour around. We started at the desolate playground. Benny kept falling over when he was running and got a couple of scrapes, one which covered half his face in mud! Typical Ben.<\/p><p>Katie was on her new scooter and Joey on his new bike. They were loving a run around. Katie and Joey were caught a little short and done a little wee in the drained boating lake! Slow Joe eventually made his way out of the park as we walked though the town to the river side. It was pretty disappointing. The location of the Cutty Sark looked like a building site and Goddard's, Mummy and Daddy's special Pie and Mash shop, had been taken over by a chain restaurant. Really, really disappointed about that. Feels a little bit of something special about Greenwich had gone.<\/p><img src='images\/years\/2007\/2007_12_26-24-Greenwich.jpg' class='diaryImage' alt='Greenwich Park Gates' \/><p class='diaryImageCaption'>Greenwich Park Gates<\/p><p>Uncle Michael and Daddy weren't proud of our lunch choice but McDonalds was an easy choice.<\/p><p>After fish fingers and chips, we had fun trying to get down to the Dockland Light Railway station with a double buggy. 20 minutes later we made it down and chilled out on the platform. We piled into a busy train and meandered through the Docklands to Canary Wharf. So many tall buildings. We found a ramp to race down on foot, bike and scooter, so we pretended to be skater boys and girls. Daddy fell off the scooter which was funny. Time was marching on, so we walked over to India Quay and took the train and car back to Istead Rise.<\/p><img src='images\/years\/2007\/2007_12_26-40a-Greenwich.jpg' class='diaryImage' alt='Down and outs on the DLR' \/><p class='diaryImageCaption'>Down and outs on the DLR<\/p><img src='images\/years\/2007\/2007_12_26-50-Greenwich.jpg' class='diaryImage' alt='Canary Wharf Children' \/><p class='diaryImageCaption'>Canary Wharf Children<\/p><p>We arrived to find Helen and Nigel had popped over for a cuppa, then came the traditional Barnett party. Lots of games, some even had answers to the quiz questions! A surprisingly lack of cheating going on. The highlight was definitely Granddad’s Family Fortune's. The effort and delivery were unique.<\/p>","images":false},"title":{"value":"Greenwich, Barnett Party"},"version":1},{"date":{"d":25,"m":12,"y":2007},"datev":20071225,"images":6,"info":{"content":"<p>Katie woke around 3am to feel presents on her feet. Father Christmas has been. However, it wasn't until a tardy 5:15 before she was awake for the day. Katie and Ben were very patient until 6am when we all piled into their bedroom to see what Father Christmas had delivered. I think he over delivered! Ben received a Thomas Tank Engine train set and Katie her Baby Annabel amongst 20 other presents!<\/p><p>After opening that lot we moved into Mummy and Daddy's room to see their stockings. Daddy must have been a naughty boy as he got a set of 10 biros and a notepad from Tesco cheapo range... although he did get a very nice jumper. Mummy got a pair of jeans and a wooden floor as well as some pegs for the washing line!<\/p><img src='images\/years\/2007\/2007_12_25-03-Christmasday.jpg' class='diaryImage' alt='Mummy and Daddy's present opening' \/><p class='diaryImageCaption'>Mummy and Daddy's present opening<\/p><p>We then made our way downstairs to open presents from friends from under the Father Christmas tree (as Ben calls it).<\/p><p>We got dressed in our Christmas gear, Katie in her pretty spotty dress and Ben in his new full Superman outfit, but he told us that he 'can't fly though'.<\/p><p>We popped over to the Fars again for Christmas breakfast and whilst mummy went to church, the rest of us opened the rest of the Gay presents, had a sing song along with some vinyl records (we sad they were big CD's). Mummy returned and we ventured east to Kent.<\/p><img src='images\/years\/2007\/2007_12_25-14-Christmasday.jpg' class='diaryImage' alt='Christmas Breakfast' \/><p class='diaryImageCaption'>Christmas Breakfast<\/p><p>We arrived at the Weston's where the Elders were also staying.... so it became quite congested. We saw Lily and Joey's presents and prepared for Christmas Lunch.<\/p><p>Turkey with all the trimmings. It's always a competition to see who can clean their plate. This year it went to Charlotte, Daddy, Mummy, Michael and Pop Pop. The children all sat at the end but weren't quite as greedy as the adults.<\/p><img src='images\/years\/2007\/2007_12_25-25-Christmasday.jpg' class='diaryImage' alt='Christmas Lunch' \/><p class='diaryImageCaption'>Christmas Lunch<\/p><img src='images\/years\/2007\/2007_12_25-57-Christmasday.jpg' class='diaryImage' alt='Pop Pop and Jessica Nose To Nose' \/><p class='diaryImageCaption'>Pop Pop and Jessica Nose To Nose<\/p><p>After the cleanup operation, Katie and Ben were the little elves who delivered yet more presents. A contrast in styles to the Gay's where it is a bit more pedestrian, the Weston's race through the presents. We all got loads. Ben got a Postman Pat tent, Katie a magnetic atlas and singing teddy bear and Jessica some bath toys.<\/p><img src='images\/years\/2007\/2007_12_25-63-Christmasday.jpg' class='diaryImage' alt='Superman!' \/><p class='diaryImageCaption'>Superman!<\/p><p \/><img src='images\/years\/2007\/2007_12_25-01-ChristmasJessica.jpg' class='diaryImage' alt='Various of one of our gorgeous girls' \/><p class='diaryImageCaption'>Various of one of our gorgeous girls<\/p><p>After some nibbles the kiddies went to bed whilst the grownups watched some tele and played games.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2007},"datev":20071224,"images":2,"info":{"content":"<p>Daddy had to go to work in the morning and Katie wasn't feeling too great. Ben and Mummy on the other hand were really looking forward to Christmas.<\/p><p>We made our way over to the Fars at 4pm for a traditional Danish Christmas, the first for a few years now. As is normal all the toys were requested to come out. Ben was quite taken by the Snowman on the TV, whilst Katie lost patience and went to help Farmor in the kitchen. Jessica wasn't playing ball. She cried for most of the three hours that we were over, which meant Daddy and Mummy took it in turns to settle her down during dinner.<\/p><p>We had some lovely pork, caramelized potatoes, red cabbage, boiled potatoes, trees (broccoli) and carrots followed by Ris Alamonde and butterscotch tart. We could hold the children back no longer (Mummy is included as a child) and we huddled around the tree and Katie and Ben distributed the gifts, and then opened most of them for us at a great rate of knots.<\/p><img src='images\/years\/2007\/2007_12_24-02-ChristmasEveFars.jpg' class='diaryImage' alt='Danish Christmas Meal' \/><p class='diaryImageCaption'>Danish Christmas Meal<\/p><p>Katie and Jessica got a cute pair of big sister \/ little sister t-shirts and Ben got some boys toys: a digger and some Duplo.<\/p><p>Seven O’clock struck and Cinders had to get back home and leave out the reindeer food, mince pie and a glass of milk for Father Christmas and his entourage.<\/p><p>Daddy returned to the Fars to play Poo Head.<\/p><img src='images\/years\/2007\/2007_12_24-21-ChristmasEveFars.jpg' class='diaryImage' alt='Present Opening' \/><p class='diaryImageCaption'>Present Opening<\/p>","images":false},"title":{"value":"Christmas Eve With The Gays"},"version":1},{"date":{"d":23,"m":12,"y":2007},"datev":20071223,"images":1,"info":{"content":"<p>We had a lovely afternoon as the West's and the Sanders' came over for a bit of Gay mayhem. Katie and Ben were in hyper mode as the first of this year's presents were opened. Ben got a radio controlled car and some trains, whilst Katie received a Barbie and a trip with Karen to a teddy bear factory.<\/p><p>Katie and Ben played well with Freya. We played the easiest game of hide and seek ever. I don't think the children get the concept of hiding! There was a lot of tidying up.<\/p><p>In the evening Steven came over for a cup of tea and a mince pie and to give some presents.<\/p><img src='images\/years\/2007\/2007_12_23-05a-KatieBenFreyaXmas.jpg' class='diaryImage' alt='Presents, Presents, Presents' \/><p class='diaryImageCaption'>Presents, Presents, Presents<\/p>","images":false},"title":{"value":"Friends Over"},"version":1},{"date":{"d":22,"m":12,"y":2007},"datev":20071222,"images":1,"info":{"content":"<p>It is still bitterly cold outside. The morning was spent raiding the Fars house and making a mess!<\/p><p>It was Thomas's 2nd birthday, we travelled across to the Kent-Surrey border to Manic Monsters, that's a softplay place you know.<\/p><p>Thomas was busy playing as was Katie, Ben and the other youngsters. We think it was the best softplay we've been to. Loads of room, not too busy, good slides, football area and a brilliant kart-buggy track.<\/p><p>It was a lovely birthday for Thomas.<\/p><img src='images\/years\/2007\/2007_12_22-16-Thomas2ndBirthday.jpg' class='diaryImage' alt='Thomas smoking a sausage on his birthday' \/><p class='diaryImageCaption'>Thomas smoking a sausage on his birthday<\/p>","images":false},"title":{"value":"The Fars and Thomas's 2nd Birthday Party"},"version":1},{"date":{"d":19,"m":12,"y":2007},"datev":20071219,"info":{"content":"<p>Katie had her first school carol concert today. Auntie Ellie looked after Ben so Mummy could watch without worrying Ben would be running around. Jessica was a very good girl and Katie was wonderful. The minute Mummy saw Katie, her tears started, she tried to sing all the words, all from memory as obviously she can't read the words yet. They sang traditional carols and some songs from the nativity play, it was great.<\/p>","images":false},"title":{"value":"Katie's Carol Concert"},"version":1},{"date":{"d":16,"m":12,"y":2007},"datev":20071216,"info":{"content":"<p>Katie for some reason wasn't looking forward to going to see Cinderella at Camberley Civic Centre. I think she was scared that there were going to be nasty characters. This emotion poured over to Ben who was also reluctant to go.<\/p><p>The Weston’s came to Camberley and carted Jessica around the shops, with Grandma and Grandad. We sat down, with Katie looking the wrong way and Ben on Mummy's lap. Within five minutes Katie and Ben were won over and enjoying the performance.<\/p><p>Even Mummy and Daddy enjoyed the show, especially with many of the improvised scenes as one of the actors wigs fell off, various hecklers both young and old and a place where they had to go off and read the script as they had forgotten their lines!<\/p><p>The best characters were the ugly sisters and buttons. Katie and Ben enjoyed themselves loads. A definite booking for next year again.<\/p>","images":false},"title":{"value":"Cinderella Pantomime"},"version":1},{"date":{"d":15,"m":12,"y":2007},"datev":20071215,"info":{"content":"<p>We went over to Wizzy World for Ella's 5th birthday party. There were 17 children invited. Wow.<\/p>","images":false},"title":{"value":"Cousin Ella's 5th Birthday Party"},"version":1},{"date":{"d":9,"m":12,"y":2007},"datev":20071209,"images":1,"info":{"content":"<p>Lise and Jørgen are currently on holiday with their nephew Morton and his family. Yesterday they went to see Reading beat Liverpool. Today they came over to visit and have a cup of coffee. Mathias, the 10 year old boy, was very entertaining with his light up red fingers and had Katie especially on his tail. Julie wasn't feeling too well and left to go to Frimley Park Hospital.<\/p><p>Lise and Jørgen were on good form and it was very nice to see them again, although it was a little frenetic in the house with eleven of us.<\/p><img src='images\/years\/2007\/2007_12_09-02a-LiseJørgenMathiasKatie.jpg' class='diaryImage' alt='Lise, Jørgen,Mathias and Katie playing' \/><p class='diaryImageCaption'>Lise, Jørgen,Mathias and Katie playing<\/p>","images":false},"title":{"value":"The Danish Crew To Visit"},"version":1},{"date":{"d":8,"m":12,"y":2007},"datev":20071208,"images":2,"info":{"content":"<p>\u000a        Lisa and David (our great, great aunt's, grandson) got married today in Apsley, Hertfordshire. The weather, as in four out of five of this year's weddings was not kind to us. It chucked it down. We scrambled into the back of\u000a        <googlelink link=\"st+marys+apsley\">\u000a          St Mary's church\u000a        <\/googlelink>\u000a        . Lisa walked down the aisle and Katie said she looked like a princess. It was a lovely service with a lot of children involved which was nice to see.\u000a      <\/p><p>We made our way to Berkhampstead Town Hall for a swift drink, a little wiping away of Jessica's sick from the suit and a go on the bouncy castle which Katie and Ben absolutely loved. David kindly pulled us in for a photo which Daddy especially appreciated.<\/p><img src='images\/years\/2007\/2007_12_08-06-DavidLisaWedding.jpg' class='diaryImage' alt='With the wedded couple' \/><p class='diaryImageCaption'>With the wedded couple<\/p><p>Sausages were on the menu, a firm favourite for us all. We shared a table with the Fars, Graham and Susan. The children were entertained by some comics and toys and by Uncle Graham blowing bubbles. Lisa also came over to speak to the children. Ben was measuring her up with his Bob The Builder tape !<\/p><img src='images\/years\/2007\/2007_12_08-16a-DavidLisaWedding.jpg' class='diaryImage' alt='Ben measuring up Lisa' \/><p class='diaryImageCaption'>Ben measuring up Lisa<\/p><p>The best part of the day, other than the wedding of course, was when David was making his speech and he went into a sort of crying high pitched squeal which turned very quickly into laughter. Hard to describe, but a quality moment, with a quality get out. We left Daddy at the wedding as the rest of us went home.<\/p><p>We were gutted to leave early as we missed the huge chocolate fountain that must have been 8 foot high and cheesy Abba music from the disco. A really nice wedding with so many nice touches to it. Thanks David and Lisa and good luck.<\/p>","images":false},"title":{"value":"David and Lisa's Wedding"},"version":1},{"date":{"d":6,"m":12,"y":2007},"datev":20071206,"images":1,"info":{"content":"<p>Katie played an angle in the Cross Farm nativity play. Mummy cried!<\/p><img src='images\/years\/2007\/2007_12_06-02-KatieNativity.jpg' class='diaryImage' alt='Our little angle' \/><p class='diaryImageCaption'>Our little angle<\/p>","images":false},"title":{"value":"Cross Farm Nativity Play"},"version":1},{"date":{"d":3,"m":12,"y":2007},"datev":20071203,"images":1,"info":{"content":"<p>We went to Basingstoke to do some Christmas shopping. Mummy wants to break the bank, whilst Daddy is a scrooge! We were hoping for Ben to see Father Christmas but unfortunately there were just 3 angles. However there was a good train ride beforehand.<\/p><img src='images\/years\/2007\/2007_12_03-04-ChristmasShoppingBasingstoke.jpg' class='diaryImage' alt='Polar Express' \/><p class='diaryImageCaption'>Polar Express<\/p>","images":false},"title":{"value":"Christmas Shopping"},"version":1},{"date":{"d":1,"m":12,"y":2007},"datev":20071201,"images":2,"info":{"content":"<p>Daddy was recovering from a Casuals night out at the Prince Of Wales pub. There was a good turn out with many old faces showing up, including Mike Collis, Chris Mann, Phil C, David Weaver and the usual faces.<\/p><p>We were, for some reason with Laura track record, entrusted to feed Karen and Rich's cat, Kesia. Katie and Ben made themselves at home. Not for long as the garden centre next door had Father Christmas trotting in with his horse and carriage much to the delight of Katie and Ben, who are really getting in to F.C. and Christmas.<\/p><p>On our way to Lily's first birthday gathering, we went stopped off at Upper Foyle where Daddy, Katie and Ben tried the wooden playground out for well over an hour. We had fun playing crocodiles and Katie married Ben in the castle.<\/p><p>We scooted over to the Elders where there was a family gathering for Lily. She's a little belter, constantly smiling away. We had a nice buffet, organised a motor biking holiday with Howard next summer in Scotland and had some chocolate birthday cake.<\/p><img src='images\/years\/2007\/2007_12_01-38-Lily1stBirthdayParty.jpg' class='diaryImage' alt='Family shot' \/><p class='diaryImageCaption'>Family shot<\/p><img src='images\/years\/2007\/2007_12_01-34-Lily1stBirthdayParty.jpg' class='diaryImage' alt='The Children' \/><p class='diaryImageCaption'>The Children<\/p><p>We returned home before Daddy went out to Guildford to meet up with his Ex-FormScapers, taking advantage for the first time of the new extended licensing laws... (only about a year late!!)<\/p>","images":false},"title":{"value":"Father Christmas - Lily's First Birthday"},"version":1},{"date":{"d":25,"m":11,"y":2007},"datev":20071125,"images":1,"info":{"content":"<p>A strange old day. We awoke to no water coming from the taps. A burst water main somewhere in Camberley.<\/p><p>After church and lunch we met up with the Fars at the Windlesham Christmas Fair held at Farmor's school. We had a go on all the activities but didn't win as much stuff.<\/p><img src='images\/years\/2007\/2007_11_25-05-WindleshamXmasFair.jpg' class='diaryImage' alt='In The Gob' \/><p class='diaryImageCaption'>In The Gob<\/p><p>We returned home where Ben and Farfar read the 'Trains' book together, and Farmor was the child, whilst Katie was a bossy mummy!<\/p><p>We also watched the video, \"I'm a Barbie Girl\" by Aqua, over and over again. Actually Mummy and Daddy found the chap in it quite amusing.<\/p>","images":false},"title":{"value":"No Water, Windlesham Fair, I'm A Barbie Girl"},"version":1},{"date":{"d":24,"m":11,"y":2007},"datev":20071124,"info":{"content":"<p>Daddy had to go in to work much to his displeasure. Meanwhile the rest of us chilled out and went to the Heather Ridge Christmas Fair which was really good. Katie was really lucky and won loads of bits.<\/p>","images":false},"title":{"value":"Daddy at work - Heather Ridge Christmas Fair"},"version":1},{"date":{"d":23,"m":11,"y":2007},"datev":20071123,"images":1,"info":{"content":"<p>We went over to Alton for the Christmas Fair which was held in the Square. It was lovely and got us into the mood. There were carols being sung by the choir, some fairground rides and even Father Christmas made an appearance. We went around with the Elders.<\/p><img src='images\/years\/2007\/2007_11_23-08-AltonXmasFair.jpg' class='diaryImage' alt='The Alton Crew' \/><p class='diaryImageCaption'>The Alton Crew<\/p>","images":false},"title":{"value":"Alton Christmas Fair"},"version":1},{"date":{"d":18,"m":11,"y":2007},"datev":20071118,"info":{"content":"<p>Another wintery, wet and frankly horrible day. Daddy continued the work on the patio whilst the ladies and Ben went to church.<\/p><p>In the afternoon, another well organised trip out from Mummy to a softplay in Goldsworth Park. We met up with the Elders, Ma Ma and Pop Pop. Ma Ma was a trooper climbing in, out and around the apparatus like a 4 year old! We stayed for quite a while, 3 hours I think, by which time we had explored all areas and tired the children out.<\/p>","images":false},"title":{"value":"Softplay"},"version":1},{"date":{"d":17,"m":11,"y":2007},"datev":20071117,"info":{"content":"<p>In the morning we went around to see the Fars to wreck their house! In inevitable train track was wheeled out and apparently only Daddy and Farfar can build a track as Mummy and Farmor are rubbish! After train tracks we built a camp under the dining room table then out of the sofa seats! Auntie Susan turned up and little later to join in. We escaped quickly before having to clear up!<\/p><p>Later in the day we ventured over to Farnborough to go swimming. Jessica was a little under the weather, so we left her on the side like Mummy did last week. However, this week we were told this was not allowed. Not sure why. This meant Mummy had to get out of the pool, which made things less safe as Daddy now had to keep an eye on Katie and Ben. Still we had a good time playing sharks and boats. Katie is getting very confident in the water. She still hasn't displayed the swimming abilities that she shows at her lessons, but she has no problem in going under water.<\/p><p>Ben kept going on about Star Wars, looking at the pictures in the house, and pointing out characters on the DVD cover, however when Daddy tried to watch the first film, Ben only lasted 20 minutes before sloping off into the kitchen where Mummy and Katie were making fairy cakes.<\/p><p>Israel beat Russia in an important qualifier game which pleased Daddy lots and lots. England might now qualify. Denmark lost which means they won't.<\/p><p>Daddy also managed to get hold of an old Xbox this week which means we can play films on the TV, and have a DVD player that reliably works!<\/p><p>Ben is calling Jessica, 'Jessica Lukys'. Not sure where he has got that from.<\/p>","images":false},"title":{"value":"Fars And Swimming"},"version":1},{"date":{"d":11,"m":11,"y":2007},"datev":20071111,"info":{"content":"<p>Daddy attempted another Sunday roast on the BBQ against the rain and cold. The chicken didn't taste as good as the pork - not sure that'll be attempted again.<\/p><p>The Elders came around to play in the afternoon. Lily is really a very smiley little lady. Joey of course wanted to go on Daddy's motorbike.<\/p><p>In the late afternoon Return Of The Jedi was on the TV. Ben, not known for sitting still for too long watched the whole lot which pleased Daddy immensely. He just sat there very quiet in attentively. He was such a good boy with his dinner and bath as well. Where has 'ants pants' gone and his naughty streak?<\/p>","images":false},"title":{"value":"Elders Over and Return Of The Jedi"},"version":1},{"date":{"d":10,"m":11,"y":2007},"datev":20071110,"images":1,"info":{"content":"<p>A relatively warm, sunny day meant we could get out and about today. Katie had to do her homework. She currently has 10 keywords that she has to recognise, \"I\", \"We\", \"He\", \"Went\", \"They\", \"It\", \"She\" ... can't remember them all. She can get 9 out of 10 which is very good. She seems to get stuck on \"They\" for some reason. Also earlier this week, Katie swum 2 widths of the swimming pool, with a small break between turning. That's about 15 metres. Daddy has yet to see it yet, or anything close to that.<\/p><p>Mummy, as she repeated a number of times, had a headache, so she was quite brave to take Katie and Jessica swimming. Thankfully Jessica slept the whole time at the side of the pool, allowing Mummy and Katie to be mermaids!<\/p><p>\u000a        The boys instead went to the<googlelink link=\"Tempest+Rally\">Tempest Rally<\/googlelink>of Southern England. We eventually found a place to park and went in to see the two wheel drive stage in the Warren, which is a gravel stage through woods, next to Blackbushe Airport.\u000a      <\/p><p>Ben enjoyed himself as we played 'guess the colour of the next car'. We first picked an open fast straight where we saw a lot of old Escort's which pleased Daddy. Ben's favourite were the blue cars.<\/p><p>We then moved around to a place where there was a big dip, with a hidden trap. Cars taking an inside line too much would fall into some deep mud, which the first car we saw enter, managed to struggle out after some needed spectator participation. The second car we saw however had no such luck. As Ben said \"Blue car stuck in the deep, deep mud - tractor get it out.\"<\/p><p>We'd run out of time, but father and son had some good time together. Definitely one for next year.<\/p><img src='images\/years\/2007\/2007_11_10-03-BenJessica.jpg' class='diaryImage' alt='Ben and Jessica' \/><p class='diaryImageCaption'>Ben and Jessica<\/p>","images":false},"title":{"value":"Tempest Rally and Swimming"},"version":1},{"date":{"d":4,"m":11,"y":2007},"datev":20071104,"images":1,"info":{"content":"<p>Another glorious, sunny day. After church Joey, Lily and Michael came over to play in the garage. Daddy took off Katie's stabilizers on her bike and had a go at getting her acclimatized to two wheels instead of four. The 10 minute session was telling Katie to keep looking forward and pedal, rather than relying Daddy pushing her. It could be a short lived effort as we are not sure if she is ready for this yet.<\/p><p>It was Great Grandma's 82nd birthday for which we celebrated with her and the family down at Camberley Indoor bowls club. All seven of her great grandchildren were there which was nice, if a little frenetic at times. We had a traditional Sunday Lunch.<\/p><p>In the evening we lit our sparklers and whizzed them around in the air. Tonight we were going to have an early night. 6pm lights out!<\/p><img src='images\/years\/2007\/2007_11_04-08a-Joyce82Birthday-BenKatieSparklers.jpg' class='diaryImage' alt='What a sparkler' \/><p class='diaryImageCaption'>What a sparkler<\/p>","images":false},"title":{"value":"Great Grandma's 82nd Birthday Party"},"version":1},{"date":{"d":3,"m":11,"y":2007},"datev":20071103,"images":1,"info":{"content":"<p>\u000a        We left early for Ma Ma and Pop Pop's on this bright, sunny morning. We played for a bit and received presents from Ma Ma's recent India trip, including a traditional outfit for Katie. We ventured off south towards Paddock Wood and after protest from Mummy at the admission charges we entered the\u000a        <a href=\"http:\/\/thehopfarm.co.uk\">\u000a          Hop Farm\u000a        <\/a>\u000a        . There was a big climbing frame which had high, tube slides, some mini sized shops which the children loved. Katie was a grocer and a hairdresser. She played the parts very well.\u000a      <\/p><p>We went to see the farm animals, of which there were not that many - to such an extent there were model animals standing in some of the pens! Ma Ma and Pop Pop treated us to a horsey ride - mechanical of course and then we went for a cup of tea, ice lolly and play area which was great. Just as we were leaving we bumped into Bob and Ellen who were coming in for the fireworks. What a coincidence seeing they live in Nottingham, 200 odd miles away!<\/p><p>We returned back home and hurried out to see some fireworks. After last year’s disaster we decided to go to Frimley Green Rec and stand on the hill to see all the fireworks around, at arm’s length. This was still too scary for the children! We had to settle to have our flask of soup and watch from inside the car. They slowly got into the fireworks, but still wouldn't dare go outside to see them! What a bunch of wimps.<\/p><img src='images\/years\/2007\/DSC00352a.jpg' class='diaryImage' alt='Benny's Bus' \/><p class='diaryImageCaption'>Benny's Bus<\/p>","images":false},"title":{"value":"Hop Farm and Fireworks"},"version":1},{"date":{"d":2,"m":11,"y":2007},"datev":20071102,"images":2,"info":{"content":"<p>It was Cross Farm's Halloween Disco and four of us dressed up in scary monster costumes, whilst Daddy dressed as himself which is scary enough! Boom, boom. Judging by the number of random mum's who came up, Jessica stole the show with her pumpkin outfit. She of course slept through the beats and sounds of the loud disco. Our evening didn't last that long. Initially Katie was dancing around and excited, Ben was just wandering around the dance floor looking lost - I know how he feels! But after a break from dancing Katie got whiney and eventually we could stand it no more and departed. Our children don't do well after 6pm, especially when they get up at 6am! Still it was nice to see all the other children as well having a good time.<\/p><img src='images\/years\/2007\/2007_11_02-04-HalloweenDisco.jpg' class='diaryImage' alt='My Little Pumpkin' \/><p class='diaryImageCaption'>My Little Pumpkin<\/p><img src='images\/years\/2007\/2007_11_02-13-HalloweenDisco.jpg' class='diaryImage' alt='Katie and Ben Dancing Together (Ben in green, Katie in cat)' \/><p class='diaryImageCaption'>Katie and Ben Dancing Together (Ben in green, Katie in cat)<\/p>","images":false},"title":{"value":"Cross Farm Halloween Disco"},"version":1},{"date":{"d":30,"m":10,"y":2007},"datev":20071030,"info":{"content":"<p>The hairdresser was around today and once Mummy was 'on the chair', Katie went upstairs to pretend cut Ben's hair. Mummy went upstairs as it was all too quiet, only to find Ben nude. No nappy. Ben was keen to show that he had put something in the bin. It was a big hard poo! Nice. He must have picked it out of his nappy, and put it in the bin! Mmmm. Nice.<\/p>","images":false},"title":{"value":"Bens Poo"},"version":1},{"date":{"d":28,"m":10,"y":2007},"datev":20071028,"images":1,"info":{"content":"<p>It was a grim morning weather-wise and Katie and Ben didn't get the hours difference, so we had a 5am wakeup call! Ben and Jessica went to church, for their sins, whilst Katie and a determined Daddy were tending to Sunday lunch from 8:30 in the morning.<\/p><p>It was going to be a special roast cooked in the new BBQ. We weren't sure how it was going to turn out, especially as it was raining. It didn't start well as our one single match extinguished before it even got close to the newspaper. After a few attempts we finally got the show on the road and things were going along nicely. The pork was slapped on, as well as some potatoes and parsnips. Leave for 2 hours and hey presto a nice roast lunch.<\/p><p>\u000a        In the afternoon we went with the Fars to<a href=\"http:\/\/www.batterseapark.org\/\">Battersea Park<\/a>. It was about the fourth attempt for us to spend an afternoon with them. Even though it was raining again, we were determined to 'do it' this time. The traffic was bad, but we arrived and the park looked great with so many old, large tree's showing their autumn colours. We first went to the playground where Ben drove us to Paris on his train. It was amusing to see four grown adults crammed inside a rail carriage designed for three year olds!\u000a      <\/p><p>We eventually moved on and played hide and seek amongst the wet undergrowth of the aptly named 'Tropical Gardens'. Tropical is not an adjective I would use to describe a wet, cold, autumnal afternoon in London. We branched around to see the other delights of the park. The mini-maze thingy, a pagoda, a slab of marble that you could slide across, a view across the Thames and finally the fountains. An enjoyable time had by all. It would be a nice place to return and have a picnic in the summer.<\/p><img src='images\/years\/2007\/2007_10_29-04-BatterseaPark.jpg' class='diaryImage' alt='Battersea Park' \/><p class='diaryImageCaption'>Battersea Park<\/p>","images":false},"title":{"value":"BBQ’ed Sunday Roast - Battersea Park"},"version":1},{"date":{"d":27,"m":10,"y":2007},"datev":20071027,"first":{"name":"jessica","value":"Jessica's First Big Smile"},"images":1,"info":{"content":"<p>The previous night Daddy went out with some of his FormScape friends after Debbie had served 7 years in the regime.<\/p><p>Mummy has a bee in her bonnet about getting new carpets. Not sure what has bought this on all of a sudden. Perhaps a lack of spending money for two minutes! Well there is Daddy's dig. Anyway we booked a couple of people to come and measure up and give us a quote.<\/p><p>We also looked for some charcoal for our new BBQ, without much luck. So after lunch Daddy, Katie and Jessica went to Badshot Lea to look for some and to visit the farm that was supposedly there. We couldn't find the farm, but did find an excellent collection of fish and lizard related animals. One waved at Katie which amused her.<\/p><p>We purchased some daffodil bulbs and charcoal, noticing the BBQ just purchased on the internet was £20 cheaper in the garden centre. Couldn't believe it. Just shows. We returned via a trip to the Hogs Back Brewery which Katie enjoyed.<\/p><p>The rest of the afternoon was spent gardening and planting our new bulbs. Katie and Ben like spending 10 minutes digging up the garden then lose patience. Daddy will make gardeners out of them yet.<\/p><p>The evening was spent in front of Strictly Come Dancing as usual. An excuse for Katie to wiggle her bum in front of Daddy and for Ben to run around in circles.<\/p><img src='images\/years\/2007\/2007_10_28-01-JessicaSmile.jpg' class='diaryImage' alt='Smiling Jessica' \/><p class='diaryImageCaption'>Smiling Jessica<\/p><p>A bit sad I know but Daddy for some reason wanted to see George Galloway take apart the US Senate and then got into watching all videos of George Galloway. I previously thought he was crude and I didn't agree with his arguments. However, now I can agree with pretty much everything he says about the troubles in the middle east. A bit of politics. You didn't think you'd see that.<\/p>","images":false},"title":{"value":"Carpets and Garden Centre"},"version":1},{"date":{"d":26,"m":10,"y":2007},"datev":20071026,"info":{"content":"<p>Went to visit Auntie Fiona and Thomas today. We decorated pumpkin biscuits and played with all Thomas' toys. Katie was a bit off colour maybe due to her pre-school injections she had on Wednesday. We went to a great swing park with Thomas and then came home. Katie, Ben and Jess slept all the way home.<\/p>","images":false},"title":{"value":"Fi and Thomas"},"version":1},{"date":{"d":25,"m":10,"y":2007},"datev":20071025,"info":{"content":"<p>Still on half term, so we drove to Gravesend and went to visit Auntie Karen and Summer and Alice, it was so cold but we were brave and went for a walk in Beacon Wood where we took bags and filled them with sticks and acorns etc. We saw millions of toadstools which fascinated the children as Mummy and Auntie Karen told them about the fairies that live under them. We went on the swings Mummy and Auntie Karen used to play on when we were Katie and Summers's age which was strange to think we'd be here 26 years later with our children! We stayed at Ma Ma and Pop Pops (Ma Ma was in India though) and had a lovely tea and bath.<\/p>","images":false},"title":{"value":"Karen, Summer and Alice"},"version":1},{"date":{"d":23,"m":10,"y":2007},"datev":20071023,"info":{"content":"<p>Katie is on half term this week, so Mummy, Katie Ben and Jess went to Marwell zoo with Natasha and Nina. It was a lovely day and we all took a picnic. All the animals were active so we got a good view of them. we went on the land train which pleased Ben. We saw Auntie Karen's name  there as she sponsors a giraffe. The best bit for Katie was seeing the hippos come up and down in their pools of water for air as they made such a splash and they were right in front of us, it really made her laugh. We didn't leave until late so we were all really tired when we got home.<\/p>","images":false},"title":{"value":"Marwell Zoo"},"version":1},{"date":{"d":21,"m":10,"y":2007},"datev":20071021,"info":{"content":"<p>After church and lunch we went over to Heathrow airport to do a bit of plane spotting! Our usual place lay deserted of the other plane spotters, so we guessed the wind was blowing from the wrong direction. We instead went to the visitor centre and tried from there. We did see them land, it wasn't like the other place where they come right over our heads. We shifted over to Laleham to play in another playground by the Thames. I think Ben and Katie could live in a playground they love them so much. A terrible weekend for English sport was capped by Lewis Hamilton losing the formula 1 championship.<\/p>","images":false},"title":{"value":"Heathrow and Laleham"},"version":1},{"date":{"d":20,"m":10,"y":2007},"datev":20071020,"info":{"content":"<p>Most of Saturday was taken up doing jobs - Although we did manage to somehow squeeze two playground trips in! In the evening Karen and Richard came around to watch the Rugby World Cup Final, which England narrowly lost.<\/p>","images":false},"title":{"value":"Karen and Rich Over For Rugby World Cup Final"},"version":1},{"date":{"d":14,"m":10,"y":2007},"datev":20071014,"info":{"content":"<p>Katie missed church for once and went out with Daddy for a bike ride. Ben and Jessica had to endure church with Mummy!<\/p><p>The weather was good and so in the afternoon we went over to a packed out Lookout and went to the playground. We then had a good game of tag in the woods. If Daddy was 'it', then you could gain safety by keeping to a tree, however only for 23 seconds then you wouldn't be safe anymore. We loved playing this game. Unfortunately we had to leave for home and get bathed and bedded. The Fars came over last thing to see us.<\/p>","images":false},"title":{"value":"Look Out"},"version":1},{"date":{"d":13,"m":10,"y":2007},"datev":20071013,"info":{"content":"<p>Mummy and Daddy came over about 9:30 to have a cup of tea and pick us up from the Fars. We had a lovely time and behaved very well - I don't believe it!<\/p><p>In the afternoon we went swimming over at Woking with the Weston and Elder clans. Daddy managed to get Ben onto the slow flume, although he was a little unsure. Katie apparently can swim the width of the pool, about 10 metres, at her lessons. However, we never see it when it comes to the weekend! From swimming we split. Katie and Mummy went to see Angelina Ballerina at Woking theatre. It was a ballet performance that was shorter than expected. Daddy took a unsettled Jessica and cheeky Benjamin to watch Chertsey play. I think Jessica cried throughout the whole game, and I don't blame her with that performance. Chertsey were beaten 5-0 against Cove. It was shocking and could have been more.<\/p><p>Today was a great day for sport. England were playing internationally at cricket, football and rugby. The Elders came over to watch the World Cup Semi Final. A closely fought affair between England and France. In a tense finish, the underdogs, England finished on top.<\/p>","images":false},"title":{"value":"Swimming, Chertsey, Angelina Ballerina, Rugby Semis"},"version":1},{"date":{"d":12,"m":10,"y":2007},"datev":20071012,"first":{"name":"katie","value":"Staying over at the Fars"},"info":{"content":"<p>Katie and Ben spent their first ever night at the Fars on Friday. There was no special reason, it was done just for fun. They arrived in time to play an hour with the wooden train before tea of fish fingers, chips and baked beans. This was followed by a bath and bed time story, just like at home.<\/p><p>They had their story in Farfar and Farmor’s bed where they slept for the night. The Fars were sent off to other rooms for their sleep.  Katie woke twice in the night but Ben slept through. They woke at 7.44am and Farmor and Farfar woke at 7.45am having been brought to order by Katie calling out, \"Farmor.\" We all got up and the railway tracks, which had also been put to bed for the night, had to be reassembled for another session of running trains. The two were dressed after breakfast of cornflakes and yoghurt and played happily until mum and dad arrived at around ten o'clock.<\/p><p>Ben and Katie were very well behaved all through their time at the Fars. There was not one tantrum or any crying; a very happy visit for everyone except mum and dad who missed them not being at their own home.<\/p>","images":false},"title":{"value":"Katie stays over at Fars"},"version":1},{"date":{"d":7,"m":10,"y":2007},"datev":20071007,"info":{"content":"<p>Another weekend and another couple of parties to attend. Obviously a popular party girl is our Katie. In the morning it was Sophie's fifth birthday held at Jakes. We all went, and it was a really nice party. The second half was spent as a group and we played games and had food.<\/p><p>The afternoon was split between the girls and boys. The girls went to the play gym for Joshua's forth birthday. Joshua used to be our next door neighbour. The boys on the other hand cycled down to Frimley Lodge park and joined up with Farmor to go on the miniature railway. Ben can now distinguish between steam and diesel trains. His obsession has no signs of abating, just standing there staring at the steam train that had come into the siding.<\/p><p>After having the first go, we went to the packed out swings and onto the canal before making our final trip around the loop, this time on a stinky diesel. As it was nearing the end of the day, they were retiring the trains back to the engine shed to much delight to Ben. He is a real anorak.<\/p><p>After our Sunday dinner, Daddy had to take the car to the garage to get an oil leak fixed.<\/p>","images":false},"title":{"value":"Parties Galore"},"version":1},{"date":{"d":6,"m":10,"y":2007},"datev":20071006,"images":2,"info":{"content":"<p>We decided to go up to London this week. The children were desperate to 'do some transport'. So eventually we caught the train from Woking, after Daddy had forgotten the pushchair.<\/p><p>Ben, Katie and Daddy were looking out of the window and seeing who could see stuff first. Katie, I think is colour blind. I don't think she can distinguish green from red! We arrived at Waterloo and headed for the underground.<\/p><p>We headed for Oxford Circus and changed to go to Queensway so we could enter Hyde Park where the good playground with the big ship is. On the Central line, there were not enough seats. Katie sat on a thrilled Japanese lady's lap, whilst Mummy and Ben chatted to this old chap. Everyone was real friendly.<\/p><img src='images\/years\/2007\/2007_10_07-06a-London.jpg' class='diaryImage' alt='Socialable Central Line' \/><p class='diaryImageCaption'>Socialable Central Line<\/p><p>At Hyde park we played on the ship and all the other playground toys. This is where all the rich toffs take their children to play. The amount of money that must be flowing around. The kids from Notting Hill and Kensington were here!<\/p><p>Mummy had a Burger King voucher, so for lunch we decided to hunt a store down. We caught the bus to Marble Arch and started walking down Oxford Street. We walked and walked and passed five McDonalds, but no BK's. Ben and Jessica fell asleep and you don't want to be around Mummy and Katie when food is on the offing and they are hungry! We walked the whole length, down to Charring Cross Road, still no sign. We walked down Shaftsbury Avenue and hopped in the Piccadilly Circus store. We had our health conscious burgers and chips before catching a 30 minute bus to the Monument.<\/p><p>Our mis-fortune continued as it was shut! Scaffolding all around it. Oh dear. We walked across London Bridge, caught a train back to Waterloo and walked to the swings and street entertainers by the London Eye.<\/p><p>Although the street entertainers are all that we have seen before the children loved seeing them. Mummy was getting worried about the time, as it was first in the series of Strictly Come Dancing. We headed back to the train station and zoomed home.<\/p><p>Jessica slept most of the way around London! Still she peered over once or twice when we were on the train.<\/p><img src='images\/years\/2007\/2007_10_07-52a-London.jpg' class='diaryImage' alt='A real beaut!' \/><p class='diaryImageCaption'>A real beaut!<\/p>","images":false},"title":{"value":"London Day Out"},"version":1},{"date":{"d":2,"m":10,"y":2007},"datev":20071002,"info":{"content":"<p>Just as we got over the rusting radiator and leaky pipes and all the hospital trips we were faced with this week's set of challenges and expense.<\/p><ul><li>Mummy has a cold and told to re-do some of the playschool wages from the summer holiday period (which we had already done!!)<\/li><li>Mummy had a steamy shower which blew the lights in the en-suite and half of upstairs. Need an electrician to fix! An angle grinder unfortunately can't sort this one out!<\/li><li>A puncture on the car. New tyre required.<\/li><li>Washing machine with a pool of dirty water swishing around at the bottom. No filter! Managed to clear the awkwardly positioned pipes.<\/li><\/ul><p>What is next week going to bring?<\/p>","images":false},"title":{"value":"Puncture, Broken Washing Machine, Blown Electrics"},"version":1},{"date":{"d":30,"m":9,"y":2007},"datev":20070930,"info":{"content":"<p>Mummy braved taking the three of us to church this morning and showed off Jessica to her church friends.<\/p><p>In the afternoon we popped over to Auntie Susan's to drop off her 30th birthday card and present. Katie and Ben were running riot! As ever it ended in tears with Ben banging his head against the door. He worried us all as begun crying, his face turned blue as he didn't come up for breath. Thankfully he did in the end but he got us worried. We went over to the swings and fed the ducks which was nice.<\/p><p>We are getting a bit concerned over Ben's poor behaviour at the moment. He's just generally naughty and we don't seem to make him realize this fact. Katie on the other hand is so good natured, except when she is tired. It's hard for Ben as he gets far less attention now, with a lot of our energies going on comforting Jessica.<\/p>","images":false},"title":{"value":"Over to Auntie Susan’s"},"version":1},{"date":{"d":29,"m":9,"y":2007},"datev":20070929,"images":1,"info":{"content":"<p>\u000a        Well what a week for illnesses and sleep deprivation. On top of her\u000a        <a href=\"http:\/\/hcd2.bupa.co.uk\/fact_sheets\/Mosby_factsheets\/infant_colic.html\" \/>\u000a        colic, poor Jessica went off again to hospital as she had a high temperature, 38.6c, and was quite blocked up, catching Daddy's cold we think.\u000a      <\/p><p>She spent Thursday and Friday night on the Children's Ward at Frimley Park more for observation than anything else. Mummy stayed in with her, leaving an unwell Daddy to look after Katie and Ben.<\/p><p>The Fars kindly took in Ben and Katie whilst Daddy was visiting Mummy and Jessica. On Friday evening they played trains with us, then gave us some nice dinner, baked beans chips and pizza followed by a bath. It was a nice change to have this all at the Fars.<\/p><p>Thankfully this morning we picked the ladies up from hospital and decided to postpone our planned trip to London, instead having a more at home day.<\/p><p>In the afternoon we headed across the road for the Dettingen Open Day. A small thing that we didn't even realise that was on until 10am. Anyway there were Police vehicles to climb on and in, army trucks and firing line, a bucking bronco, a popular bouncy castle, a five a side tournament and face painting which Katie and Ben were excited on having themselves done.<\/p><img src='images\/years\/2007\/2007_09_29-19a-DettingenOpenDay.jpg' class='diaryImage' alt='Painted faces' \/><p class='diaryImageCaption'>Painted faces<\/p><p>In the evening Daddy popped out to see Great Grandad perform two old songs in front of a church group. He was very sweet and put a lot of passion into his performance. Daddy got it on video. Something to show at Christmas I think!<\/p>","images":false},"title":{"value":"Another hospital trip and Dettingen Open Day"},"version":1},{"date":{"d":28,"m":9,"y":2007},"datev":20070928,"info":{"content":"<b>Things I Like Doing<\/b><ul><li>For the past few month I love to do colouring in. I can sit down for ages on my own or with Ben and colour. I am getting quite good at using different colours and not going over the line<\/li><li>Making shops, particularly shoes shops<\/li><li>Playing mummies and daddies or something that involves role play with Ben<\/li><li>Reading books. Even though I can't read I make the stories up from the pictures and read aloud<\/li><li>Singing to tapes in the car.<\/li><li>Playing horses on Daddies back! or generally assaulting him!<\/li><li>Playing Guess Who, Barbies, hide and seek, making cornflake cakes \/ jam tarts, riding my bike, the list is pretty endless really. A very happy girl.<\/li><li>Drinking milk from a bottle. Still!<\/li><\/ul><b>Things I Don't Like Doing<\/b><ul><li>Going to bed! Wow there is always an excuse not to go to sleep. Need water, need a wee, got a tummy ache, need a kiss. We wonder what the next excuse is.<\/li><li>Eating properly. By that sitting to the table and eating the contents of the plate without causing a fuss, although she is slowly improving. However, what is not improving is the variety of foods that I eat.<\/li><li>Letting Daddy do stuff for\/with me, although this again is getting better.<\/li><\/ul><b>School<\/b><ul><li>I like school, although I did ask not to go to school on one day.<\/li><li>I can count to 23 without any mistakes now<\/li><li>I am learning letter sounds and beginning to read words.<\/li><\/ul>","images":false},"title":{"value":"Katie - What I'm like at 4 - 4.5 years"},"version":1},{"date":{"d":27,"m":9,"y":2007},"datev":20070927,"info":{"content":"<p><b>Things I Like Doing<\/b><\/p><ul><li>Rough and tumble with Daddy. Forehead to forehead like bulls pushing each other<\/li><li>All things trains. Toy trains (especially the Fars wooden set), real trains, Underground Ernie, miniature trains, watching trains from Frimley Green bridge<\/li><li>Playing cars, dressing up as Bob the builder or Sporticus (Lazy Town)<\/li><li>Some clothing is difficult to get him out of. Katie's ballet shows, Katie high heel shoes, Denmark football top, his pyjamas. His blanket he sleeps with also has to be close to him at night time and insists on bring it downstairs with him when he wakes.<\/li><li>Causing mischief. Bear hugging Katie when she doesn't want it. Biting! Not sharing or just outright stealing of whatever Katie is playing with \/ doing.<\/li><li>Better than Katie at going to sleep. Eats more, although hard to get him to sit down and eat by himself.<\/li><\/ul><p><b>Things I Don't Like Doing<\/b><\/p><ul><li>Not so great at anything requiring patience. e.g. colouring, board games, puzzles. Interested for 5 minutes then slumbers away<\/li><li>Getting dressed is sometimes a bit of a mission<\/li><\/ul><p><b>Speech<\/b><\/p><p>Ben's speech has really come on from about June onwards and he can form sentences.<\/p><ul><li>Doing Daddy? Doing?<\/li><li>What's that for?<\/li><li>And me. And me<\/li><li>Originally called Jessica - 'Ca' (the end bit of Jessica)<\/li><li>No, mummy do it.<\/li><li>Cuddle me mummy<\/li><\/ul>","images":false},"title":{"value":"Ben - What I'm like at 2 - 2.5 years"},"version":1},{"date":{"d":25,"m":9,"y":2007},"datev":20070925,"first":{"name":"jessica","value":"Trip To Hospital"},"info":{"content":"<p>\u000a        Jessica has been quite unsettled at times. She can go through spouts of several hours where she screams her lungs out and looks as if she is in real pain as she arches her back. We think she has a lot of trapped wind. She is suffering with\u000a        <a href=\"http:\/\/hcd2.bupa.co.uk\/fact_sheets\/Mosby_factsheets\/infant_colic.html\">\u000a          Colic\u000a        <\/a>\u000a        we think\u000a      <\/p><p>Today the health care visitor saw her swollen, purple stomach and referred her to the GP. The GP said get down to Casualty to get it checked out. A number of tests were carried out and the medical staff didn't seem over worried, but there again didn't explain what was wrong with her. Just we've got to monitor the situation.<\/p><p>Jessica has been feeding and pooing well. She sleeps during the day and has been keeping us up at night. She still looks ever so gorgeous.<\/p>","images":false},"title":{"value":"Jessica off to hospital"},"version":1},{"date":{"d":23,"m":9,"y":2007},"datev":20070923,"info":{"content":"<p>It was nice to see some of our Danish friend's Joan and Gert who were over for the Shadows convention and staying at the Fars.<\/p><p>Anyway popped over to see us all and were very generous with their gifts.... as everyone has been.<\/p><p>In the afternoon we went to Frimley Lodge Park for the Barnett family picnic. We had a big game of cricket which the girls done rather well at.<\/p>","images":false},"title":{"value":"Joan and Gert Visit and Family Picnic"},"version":1},{"date":{"d":22,"m":9,"y":2007},"datev":20070922,"images":1,"info":{"content":"<p>\u000a        We went with Ma Ma, Pop Pop and the Elders to<a href=\"http:\/\/www.legoland.co.uk\/\">Legoland<\/a>. It was pretty expensive, but the park was massive! So many good things for the kiddies to try.\u000a      <\/p><img src='images\/years\/2007\/2007_09_22-07-Legoland.jpg' class='diaryImage' alt='Excited to be at Legoland' \/><p class='diaryImageCaption'>Excited to be at Legoland<\/p><p>We tried the tea cup ride, the excellent Rat Run, the carraseol, the swing roundabout before settling down for our picnic. We queued for the diggers for 45 minutes, having got to the front Michael and Joey were interrogated on Joey's age. We hadn't realized that the diggers were only allowed for 3 year olds and above.<\/p><b>Joey's first big lie!<\/b><ul><li><i>Joey<\/i>I'm 2!\u000a        <\/li><li><i>Lady<\/i>Sorry you can't come on\u000a        <\/li><li><i>Michael<\/i>No, he's 3 today. It's his birthday\u000a        <\/li><li><i>Lady<\/i>Sorry I've got to hear it from the child. How old are you? (Real interrogation at this stage, where half the queue were looking over)\u000a        <\/li><li><i>Joey<\/i>I don't know\u000a        <\/li><li><i>Michael<\/i>It's your birthday today isn't it?\u000a        <\/li><li><i>Joey<\/i>A confused nod of the head from Joey\u000a        <\/li><\/ul><p>Anyway they managed to get on to the anti-climatic ride in the end. Meanwhile the rest were having a great time in the water fountains and spray area. Katie just loved it and ran around for ages. Ben was a little more reserved.<\/p><p>After a go on the helicopter ride and serine boat trip, which Jessica even went on, we headed towards the Lego models which were the kids favourites. Ben was of course interested in the model trains and watching them come out of the tunnels, which Katie admired the 'views' as she called them.<\/p><p>We finally ended the day with a go on the monorail ride and the train.<\/p><p>A really good day out. Shame we didn't manage to see half the park. Seriously contemplating an annual season ticket, but at £55, its quite a bit of money.<\/p>","images":false},"title":{"value":"Legoland"},"version":1},{"date":{"d":21,"m":9,"y":2007},"datev":20070921,"info":{"content":"<p>Over the past two weeks we have had many visitors all coming to see a mainly sleeping baby! She awakes for feeding, and boy does she feed, she has put on 11oz. A fatty and no denying it.<\/p><p>Katie and Ben really show a lot of love towards Jessica. Both asking to give cuddles and kisses. Luckily there has been no resentment at all. Katie calls her Jessa or Jess and Ben calls her Car, because he can't seem to say the 'Jessi' bit.<\/p><p>Jessica is quite sicky and poo's very well. She's given us some smiles, Mummy convinced they're genuine smiles! At night time she is pretty unsettled. Daddy's favourite bit is the 8pm till 10pm shift where Jessica sleeps on Daddy's chest. Daddy's favourite.<\/p><p>Daddy back to work on Monday, so the real test comes for Mummy.<\/p>","images":false},"title":{"value":"First Two Weeks"},"version":1},{"date":{"d":13,"m":9,"y":2007},"datev":20070913,"images":2,"info":{"content":"<p>It was quite a challenge for Daddy to get the children ready, for Katie's 9am start. Again Daddy and Ben went into hospital to visit Mummy and Jessica, hoping they might be allowed home. However, we were going to have to wait till later.<\/p><p>Jessica still very healthy and with a nice colour now. She's feeding off the breast OK, and she is now producing at the other end.<\/p><p>Daddy and Ben picked Katie from school and we went to Frimley lodge park to play on the swings, feed the ducks, see the big trains and play on the small train tracks. We then rushed to ballet for Katie and then onto the hospital. They were very short staffed, but at 6pm we were allowed to return home as a family of five!<\/p><p>Mummy was fit and raring to sort lots of things up. It is business as usual for her, as if she hadn't gone through labour just 2 days previous!<\/p><p>Jessica slept in the mosses basket next to Mummy and Daddies bed all night. She is so cute!<\/p><img src='images\/years\/2007\/2007_09_13-05-Jessica2day.jpg' class='diaryImage' alt='Sleep, sleep, sleep' \/><p class='diaryImageCaption'>Sleep, sleep, sleep<\/p><img src='images\/years\/2007\/2007_09_14-18a-Jessica3day.jpg' class='diaryImage' alt='The three monsters' \/><p class='diaryImageCaption'>The three monsters<\/p>","images":false},"title":{"value":"Jessica arrives home"},"version":1},{"date":{"d":11,"m":9,"y":2007},"datev":20070911,"images":3,"info":{"content":"<p>Finally the five a side team is complete. Jessica was born at 4:55pm, happy, healthy and weighed in at 7lbs 13.5oz.<\/p><p>Jessica's middle name Ellen is Oldemor's (Great Grandmother's) Christian name and Uhrskov also a family name handed down through many generations of the Danish wing of the family tree. If Jessica turned out to be a boy we would have called him Thomas Scott Uhrskov Gay.<\/p><img src='images\/years\/2007\/2007_09_11-08-JessicaBorn.jpg' class='diaryImage' alt='A happy Laura and screaming Jessica' \/><p class='diaryImageCaption'>A happy Laura and screaming Jessica<\/p><img src='images\/years\/2007\/2007_09_11-19-JessicaBorn.jpg' class='diaryImage' alt='Sleeping ladies' \/><p class='diaryImageCaption'>Sleeping ladies<\/p><img src='images\/years\/2007\/2007_09_11-22-JessicaBorn.jpg' class='diaryImage' alt='Battered and bruised Jessica' \/><p class='diaryImageCaption'>Battered and bruised Jessica<\/p><p>Mummy first got regular contractions on the Monday and stayed up all night on the hope they would become frequent and regular.<\/p><p>We took Katie to school and Mummy needed to stop a couple of times in order to squeeze Daddy's hand. Auntie Charlotte came down and looked after Ben and Katie as Mummy's contractions were getting a little more painful.<\/p><p>We got to hospital at about 1pm and Mummy was doing ever so well in managing the pain taking pethadene and the gas and air. She was high as a kite at some points. A strict midwife was requested when there was a change in shifts. We got one!<\/p><p>Mummy got to 7cm dilated and gave birth all within 30 minutes. She screamed at the top of her voice at one point, and then apologised for it!<\/p><p>Daddy could see the head and 3 pushes later, little Jessica was born. We forget how purple and slimy they come out. Daddy was able to clip the cord. Mummy and Daddy were overjoyed.<\/p><p>Daddy said it was a boy, which shocked Mummy as she was convinced it was going to be a girl. It was a girl. Not sure if it was the drugs, but Mummy preached \"I've got the gift, I said it would be a girl. I've got the gift\". \"Yes Laura, let's not worry about that, we've got a baby\".<\/p><p>Jessica was placed on to Mummy's chest for a bit before some extra bits and pieces needed to be taken care of. Mummy was exhausted and was so tired that she dozed for a while, giving Daddy some one on one time. \"That’s another wedding that's going to cost me\".<\/p><p>Katie and Ben came in with the Fars for their first look at Jessica. Katie was interested and loving and wanted to cuddle Jessica. Ben on the other hand wasn't quite in tune with the situation and just wanted to look out of the window.<\/p><p>\u000a        Mummy was hungry but was also suffering from nausea. After a bath we were shipped off to the maternity ward where Jessica and Mummy settled in for the night on a noisy ward. She has to stay for 48 hours to ensure Jessica has got the\u000a        <a href=\"http:\/\/news.bbc.co.uk\/1\/hi\/health\/medical_notes\/5306662.stm\">\u000a          Strep B infection\u000a        <\/a>\u000a        .\u000a      <\/p><p>Jessica was taken away at 2am as her temperature dropped, but it was nothing serious, and gave Mummy a chance of some prolonged rest.<\/p>","images":false},"title":{"value":"Jessica Ellen Uhrskov Gay"},"version":1},{"date":{"d":10,"m":9,"y":2007},"datev":20070910,"first":{"name":"katie","value":"Katie at school"},"images":1,"info":{"content":"<p>Katie has been very excited about starting Cross Farm. We woke at 7-ish and got dressed into the blue uniform and all drove into Frimley Green and met up with Natasha and her mummy at their house. We made the 15 minute walk and arrived just before the 9:30 start.<\/p><p>We were greeted by the headmistress and led into the school hall where we were told the procedure for the next few days.<\/p><p>Then we settled Katie into Lambs class. She ran off to play in the wendy house and that was the last we saw of her really.<\/p><p>Picking her up at 1pm, we didn't get too much out of her. We think she just played for most of the day. A glorified playschool session. Happy to go back tomorrow.<\/p><img src='images\/years\/2007\/2007_09_11-02-KatieSchool.jpg' class='diaryImage' alt='Katie's gonna be bright at school' \/><p class='diaryImageCaption'>Katie's gonna be bright at school<\/p>","images":false},"title":{"value":"Katie's first day at school"},"version":1},{"date":{"d":9,"m":9,"y":2007},"datev":20070909,"info":{"content":"<p>After church we headed over for a delicious BBQ at Karen and Richard's. You are always guaranteed top notch nosh. Katie and Ben even had a little pond side dining table and chairs. Katie proceeded to root out Karen's shoes from somewhere which of course she was particular fond of. Katie ended up with one of Karen's tops on as well in the end, because she covered her original t-shirt with chocolate sauce! Mummy and Daddy cringed when he children played in the white carpeted and white sofa'ed conservatory with mucky fingers and dirty feet!<\/p><p>We walked to the park on this hot and sunny day.<\/p>","images":false},"title":{"value":"Karen and Richards"},"version":1},{"date":{"d":8,"m":9,"y":2007},"datev":20070908,"info":{"content":"<p>It was Niamh 5th birthday and it was held a softplay called Jakes in Bagshot. It was a lovely birthday as there weren't too many invited so Katie knew everyone and the place itself was only half full, or was it half empty? Anyway Daddy spent a lot of time in tubes, slides and other contortion-ary' apparatus.<\/p><p>In the afternoon Daddy went out with the boys to Reading to watch England V Israel. Whilst the rest of us played and went to the park.<\/p>","images":false},"title":{"value":"Niamh's Birthday Party - Reading with boys"},"version":1},{"date":{"d":2,"m":9,"y":2007},"datev":20070902,"images":1,"info":{"content":"<p>Daddy cycled with Ben over to the Fars house even though they were both out. We didn't want to see them, we wanted the train set!! The challenge was to use every bit of track, every station, boat terminal, bridges and tunnel. Well we managed it. Ben was very particular on which train could be moved by Daddy! As true workman we stopped half way through for a glass of \"molk\" and a \"cracker\".<\/p><p>In the afternoon we went to Alton for Lily's christening. The service was shared with two other children, all behaving themselves very well especially when the vicar doused them in water. We returned to the Elder's household for some nibbles and to catch up with friends and family.<\/p><p>Oh yes it was Mummy and Daddy's wedding anniversary, which sort of sailed past unnoticed, just a chocolate bar in the evening and watching a film!<\/p><img src='images\/years\/2007\/2007_09_02-05a-LilyChristening.jpg' class='diaryImage' alt='Lily's christening' \/><p class='diaryImageCaption'>Lily's christening<\/p>","images":false},"title":{"value":"Lily Christening - 7th Wedding Anniversary"},"version":1},{"date":{"d":1,"m":9,"y":2007},"datev":20070901,"info":{"content":"<p>Unfortunately Daddy had to go to work and help out for a project which was being commissioned on Monday, which put pay for any sort of family day out!<\/p>","images":false},"title":{"value":"Daddy went to work"},"version":1},{"date":{"d":31,"m":8,"y":2007},"datev":20070831,"info":{"content":"<p>Katie, Ben and Mummy picked up Uncle Peter from his new house then met Auntie Lindy and Ella at the Aldershot lido. We walked to a nice swing park and had a play and at 12:30 we walked back to meet Auntie Ellie, Joey, Lily, Ma Ma and Auntie Charlotte. We paid to go into the Lido for the day even though the weather was coldish (as has been for most of the holidays). We had a picnic and then some braved the cold water. Katie and Ella amazed us by going completely in as did Auntie Ellie and Auntie Charlotte. Mummy would have loved to but the midwife had said earlier it might not be advisable, as the water was very cold. Joey and Ben stuck to the paddling pool, which Ben kept saying was cold. Ma Ma went in but didn't swim. After about twenty minutes we got out and went in the sandpit there. Luckily Auntie Lindy and Ma Ma had brought buckets because Mummy forgot. Ma Ma also brought giant dominoes and bowls which Katie and Ella loved. We had a lollypop and left about four it was a really good day.<\/p>","images":false},"title":{"value":"Aldershot Lido"},"version":1},{"date":{"d":27,"m":8,"y":2007},"datev":20070827,"images":1,"info":{"content":"<p>Daddy rushed over to Gravesend quickly to try and sort Ma Ma and Pop Pop's new broadband without too much success. Not got the password!<\/p><p>We all met up at Frensham Ponds for Rachel's birthday. Ben and Katie loved playing in the water and going on the space hoppers. Along with Daddy we began to dig out a river and a tunnel before other kids came in and took over. Daddy was gutted as he was quite proud of his construction!<\/p><p>The water was pretty cold, the children being only ones brave enough to go in properly. It was busy with many kids running around enjoying themselves. At one point some concerned parents couldn't find 'Heather'. It makes your stomach turn they were shouting and scanning the water for the little girl. She was found just a couple of minutes later walking aimlessly 50 years away, oblivious to the commotion. A scary moment.<\/p><p>We had a picnic which because we didn't contribute much meant it was a really nice spread. None of your 'value' Laura food! We had a chocolate cake which melted quickly in the sun and then some ice creams.<\/p><p>We were all pretty filthy by the end of it. A big scrub in the bath was needed.<\/p><img src='images\/years\/2007\/2007_08_27-13-FrenshamPonds.jpg' class='diaryImage' alt='Frensham Pond birthday visit' \/><p class='diaryImageCaption'>Frensham Pond birthday visit<\/p>","images":false},"title":{"value":"Frensham Ponds - Rachel's Birthday"},"version":1},{"date":{"d":26,"m":8,"y":2007},"datev":20070826,"images":1,"info":{"content":"<p>We left early for a fun day out at Paulton's Park. Saying that we still managed to get caught in traffic! The children got excited, almost too excited. Katie was not feeling too adventurous whilst Ben was, but he wasn't allowed to go on too much because he was too small! Poor Ben. There were plenty of rides that we all could go on, the favourite being the tractor ride. \"Again, Again.\" We went on it three times. We went to see some of the animals, but it was the playground and the rides which were the big draw today.<\/p><p>After lunch Katie was beginning to feel as if she could go on some of the more exciting rides which pleased Daddy. Mummy unfortunately couldn't go on them! A full fun day out had by all.<\/p><img src='images\/years\/2007\/2007_08_26-07-PaultonsPark.jpg' class='diaryImage' alt='The Vikings on a Viking boat' \/><p class='diaryImageCaption'>The Vikings on a Viking boat<\/p>","images":false},"title":{"value":"Paulton's Park"},"version":1},{"date":{"d":25,"m":8,"y":2007},"datev":20070825,"info":{"content":"<p>In the morning Daddy went to pick our new car. Well 7 year old car! It's a 2000, Nissan Almera Tino, done 39K miles and cost us £2900 after trading in the Corolla. We didn't think we'd get anything for our mobile tip. The car is probably the smallest we could get that will fit three car seats. The Zafira had only a middle lap belt and the Picasso was too expensive for us in the end, especially if you compare it to what we have with the Almera. It has good safety and reliability records so hopefully it will hold us in good stead for the next few years.<\/p><p>The afternoon was split between boys and girls. The girls wanted to paint some shelves whilst the boys went to watch a convincing 3-0 win for Chertsey against Raynes Park. The weather was glorious.<\/p>","images":false},"title":{"value":"New Car - Chertsey Win - Painting"},"version":1},{"date":{"d":24,"m":8,"y":2007},"datev":20070824,"info":{"content":"<p>We drove to Reigate park to meet Ma Ma, Auntie Ellie, Joey, Lily, Great Grandma and Great Grandad. It started off quite stressfully as Mummy couldn't remember where the park was and we drove round and round the one way system trying lots of different roads. In the end we found the car park where we were all supposed to meet only to find it was shut as lots of the park was under reconstruction. So we had to drive off again and find another place to park that was free as Mummy had no money in her purse! We were running really late by this time and then when Mummy got Benny out of the car his nappy had leaked and he needed completely changing. Next in the line of stresses was the fact that a heavily pregnant mummy really needed a toilet but as the park toilets were also shut we had to walk for ages to find another one.<\/p><p>By the time we reached the swings we were so late and Katie and Boots were hungry and fed up. Ma Ma and company were not there as they had apparently got stuck in traffic to, so we played on the swings. Mummy found it really hard to keep her eyes on Katie and Benny as it’s such a big park and they both wanted to go on different things. Anyway when everyone arrived we had a lovely picnic as Ma Ma had bought lots of nice treats. We walked to the ducks and fed them while Mummy had to trek another long mile for a toilet. She came back to find Katie and Joey splashing in muddy puddles. Mummy had stupidly dressed Katie in her new white trousers which were now brown trousers. We finished the day with an ice cream from the most expensive van in the world but it was nice!<\/p><p>Farfar's birthday present this year was a trip to Reading Speedway with Daddy and Farmor. It was a strange evening because there were a number of bad crashes with each of the riders having suspected back problems. On the second big crash we had to wait for the ambulance to return from the hospital! In the end the number of races was curtailed to 13.<\/p><p>The races themselves were OK, the highlight was smelling the burning oil. Mmmm. The bikes really do accelerate at a phenomenal rate. They have just one gear and no brakes! Got speaking to one of the regulars who explained all the rules and what was going on. Quite interesting how it is all setup. Riders almost race freelance and can move from team to team. They are also commission based. The more points they win, the more money they get. He said they rarely have the ambulance on the circuit. I think we bought bad luck as it came on at least twice.<\/p>","images":false},"title":{"value":"Stressy Reigate and Reading Speedway"},"version":1},{"date":{"d":19,"m":8,"y":2007},"datev":20070819,"info":{"content":"<p>The weather was again unkind to us and again we had to postpone our trip to the farm with the Fars. Instead we went over after church for lunch and playtime with the train track, dolly trolley and farm. We later went for a walk down to Tomlins Pond to feed the ducks and swans. Susan and Graham came over as well and helped push us on the trolley.<\/p>","images":false},"title":{"value":"Fars For Lunch"},"version":1},{"date":{"d":18,"m":8,"y":2007},"datev":20070818,"images":1,"info":{"content":"<p>In the morning we went over to Hartney Witney to look at a car which we put a deposit on.... although Daddy is not sure he's made the right decision. We shall see next week when we go and pick it up.<\/p><p>Then the moment Katie has been looking forward to for a long while... being a bridesmaid at Andrew and Sarah's wedding. She was excited at the prospect at walking down the aisle with Oliver and having the first dance with him. She was a princess. She looked so beautiful in her dress.<\/p><img src='images\/years\/2007\/2007_08_18-06a-SarahAndrwWedding.jpg' class='diaryImage' alt='Bridesmaid Katie' \/><p class='diaryImageCaption'>Bridesmaid Katie<\/p><p>We arrived at St Andrews, Frimley Green just before the 2pm kick off. We sat near the front and Katie and Oliver followed Sarah down the aisle. Katie's face was a picture and she beamed a smile all the way down. The service was short and for the first time both children behaved themselves.<\/p><p>After the service and a few photos, which incidentally Michael took, we headed off to Wonersh for the reception. We amazingly made it, even though we didn't take a map and mummy thought it was in Compton about 7 miles away!<\/p><p>The Barnett Hill Hotel was set in lovely grounds which unfortunately we couldn't take advantage of because of the dire weather. We did however make use of the games room downstairs and played table football and pool.<\/p><p>The meal was lovely and the speeches refreshingly short and sweet. The whole day was kept simple and relaxed... well as much as you can with Katie and Ben! Throughout the day there were some nice Polish touches to the proceedings. A Polish reading in church and a seemingly polish tradition of tapping your glass during the morning breakfast which 'forces' the bride and groom to kiss each other. We also heard some polish songs as well. Really nice touches which makes the day a little different.<\/p><p>Disco time. Katie, Ben and about six other kids stole the dance floor for a bit. They were loving it. We managed to stag till 10pm before we had to admit defeat and take the terrapins home.<\/p>","images":false},"title":{"value":"Sarah and Andrews Wedding"},"version":1},{"date":{"d":12,"m":8,"y":2007},"datev":20070812,"first":{"name":"benjamin","value":"In the bunk bed"},"info":{"content":"<p>We missed church and went up to Greenwich Park. We parked up the top as usual and walked our way down through the squirrel and deer park down to the big swing park. We spent ages there and even stopped for our picnic. We then made our way passed the burnt out Cutty Sark site, which incidentally was just a load of boarding, and proceeded for our race! Daddy and Ben in the lift were beaten by Mummy and Katie running down the stairs. A frightful thought!<\/p><p>We emerged on the north side of the river and went on the short trip on the DLR to Mudchute, so we could look around the farm. Ben again was going mad for the trains! We had a look around and said hi to Farfar who was wallowing around in the mud.<\/p><p>We returned back on the train and Daddy ran all the way through Greenwich and the park to get the car so that the tired troops didn't whine too much!<\/p><p>The bunk beds! Well it didn't go too well. Katie and Ben played around a bit too much and when they did finally go to sleep Ben fell out of bed (from the bottom bunk!), waking Katie up. Ben ended up sleeping in the cot. We'll move him back when we get a guard rail.<\/p>","images":false},"title":{"value":"Greenwich - Bunk Beds"},"version":1},{"date":{"d":11,"m":8,"y":2007},"datev":20070811,"images":1,"info":{"content":"<p>In the morning Daddy constructed the bunk bed as both Katie and Ben are now going to sleep in the same room, so that our brother or sister can have the baby room. The bed came in about 100 pieces and both Katie and Ben done their best to help.... in only the way they know. i.e. all the bits went everywhere!<\/p><p>In the afternoon we went over for Summer's third birthday in Gravesend<\/p><img src='images\/years\/2007\/2007_08_11-09a-SummersBday.jpg' class='diaryImage' alt='Jumping for joy at Summer's Birthday' \/><p class='diaryImageCaption'>Jumping for joy at Summer's Birthday<\/p>","images":false},"title":{"value":"Summer's 3rd Birthday Party"},"version":1},{"date":{"d":8,"m":8,"y":2007},"datev":20070808,"info":{"content":"<p>Ma Ma took Benny for a walk to feed the ducks and to the swings in Istead Rise so Katie and Mummy could have a little girly trip to buy all Katie’s new school uniform, ready for her first day a few weeks. We bought a dress, polo shirts, plimsolls, socks, tights and P.E shorts. Unfortunately Clarks did not have Katie's shoe size and we could not find any nice winter coats so we will have to get those later. We had lunch at McDonalds. Katie had her first happy meal which she loved!<\/p>","images":false},"title":{"value":"Ma Ma and out with Benny"},"version":1},{"date":{"d":5,"m":8,"y":2007},"datev":20070805,"images":1,"info":{"content":"<p>Ben, with the help of Katie opened his presents on Mummy and Daddy's bed at 7am! It's funny because Ben isn't too fussed about actually opening the presents, he was quite happy Katie taking the lead role.<\/p><p>We had a bumper turnout for Ben's birthday which was held in our poor old back garden. There was blazing sunshine and Ben's friends came over to paddle, bounce, build sand castles and general cause mischief. Daddy done the BBQ, whilst Mummy organised a couple of games.<\/p><p>It was pretty chaotic. We wonder what Grandma, Grandad, Peter and our neighbours thought of the music, shouting, crying and Ma Ma's voice!<\/p><img src='images\/years\/2007\/2007_08_05-10-BensBirthday.jpg' class='diaryImage' alt='PARTY!!' \/><p class='diaryImageCaption'>PARTY!!<\/p><p>The party lasted about 3 hours before some decided to join us at Frimley Lodge Park for a trip along the miniature railway which Ben goes potty for. Daddy insisted on waiting for a nice steam engine, rather than those horrible smelling diesels. After playing on the swings we then returned home for the start of 'operation clear up'. What a mess the house and garden was!<\/p><p>Both Uncle Howard and Steven popped over for a bit to give presents and stop for a chat which was nice. We couldn't tempt them on one of the 24 burgers we had left over!<\/p><p>Karen and Rich also popped over last knockings bearing gifts. Ben is so lucky to receive so many nice presents.<\/p><p>A really enjoyable day for the kiddies. Ben and Katie were both really tired outcome the end of the day.<\/p>","images":false},"title":{"value":"Ben's 2nd Birthday"},"version":1},{"date":{"d":4,"m":8,"y":2007},"datev":20070804,"info":{"content":"<p>The temperature in the high 20's we decided to get the paddling pool out for a bit of a play. We got Daddy wet! We also needed to get some last minute things for Ben's party tomorrow.<\/p>","images":false},"title":{"value":"Hot, Hot, Hot"},"version":1},{"date":{"d":3,"m":8,"y":2007},"datev":20070803,"info":{"content":"<p>We went back to the outdoor pool on the campsite. Katie stayed in for two hours she didn't want to get out. We bought a nice picnic and ate in a field. From there we drove to Portsmouth for a go on the funfair. We also had a sit on the beach and an ice-cream. You could watch the hovercraft come in and out which absolutely fascinated Ben, until it got him wet as it left and he cried, but he still went back to watch it again.<\/p><p>We drove home via Ellie's to drop off her tent as we couldn't move in the car. We arrived home exhausted but we had a lovely time.<\/p><p>Ben told daddy all about the hovercraft that went splash and made him wet. Daddy must have heard the story told about 50 times! It reminded him of when Barrie told the 'Jon Jonno' story on his stag weekend!<\/p>","images":false},"title":{"value":"Hayling Island Camping: Pool and Fair"},"version":1},{"date":{"d":2,"m":8,"y":2007},"datev":20070802,"images":2,"info":{"content":"<p>We drove to the beach and met Lynne and Rachel and had a go on the Hayling steam train. Auntie Ellie, Joey and Lily were with us. The train stopped at a swing park on the beach where we played and then got the train back.<\/p><p>After lunch it started to rain. Katie and Ben wanted to go back to the fair and go on the runaway train, which we did. Joey would not go on anything except a little train that went around and then Auntie Ellie had to go on to as he was 'shy' of it.<\/p><p>It then started to pour down so we did the scarecrow hunt, in aid of the Hayling carnival, 76 scarecrows were hidden around the island. We bought a map with a route and you had to spot them and write down their names. Katie, Ben and Mummy were in one car and Ma Ma, Auntie Ellie, Joey and Lily in the other. We had a race, meeting back at the campsite after an hour and a half seeing who could find the most. We lost by 9 scarecrows but had great fun. Katie spotted loads but Ben was no help as he slept the whole way.<\/p><img src='images\/years\/2007\/2007_08_02-04-Camping-HaylingIsland.jpg' class='diaryImage' alt='Joyriding the Benny Bus' \/><p class='diaryImageCaption'>Joyriding the Benny Bus<\/p><img src='images\/years\/2007\/2007_08_02-05-Camping-HaylingIsland.jpg' class='diaryImage' alt='Joyriding the Benny Bus 2' \/><p class='diaryImageCaption'>Joyriding the Benny Bus 2<\/p><p>It stopped raining so we had a BBQ and a campfire singing lots of songs, probably annoying the rest of the campsite. As it had rained Mummy was able to snuggle in the tent all night without any wheeze, the pollen must have been dampened.<\/p>","images":false},"title":{"value":"Hayling Island Camping: Met the Stevens"},"version":1},{"date":{"d":1,"m":8,"y":2007},"datev":20070801,"info":{"content":"<p>We had a shower and breakfast and Mummy felt a lot better. We drove to Portsmouth and caught a ferry to Ryde. From there we got a train to Sandown and then a bus to Sandown zoo. It was a blazing hot day and the zoo without wanting to be horrible was not very good. They had eight tigers which were all asleep as it was so hot and three lions again much to Katie's disappointment were also asleep. They had a few small monkeys and a bug house (which was the best bit).It did only cost £6.00 to get in and nothing for children though. Katie also fell off the picnic bench and bumped her head so we were quite glad when we left there.<\/p><p>We headed to Sandown beach which was gorgeous and had a little swim in the sea. We found a tea garden and had a lollypop and a great swing park. Before going home Katie and Ben had a go on the trampolines which they loved. We didn't get home until late, so we bought some food from Tesco and ate by our tent. Mummy slept at Auntie Ellie's so she didn't get wheezy and Ma Ma and Katie slept in the tent together.<\/p>","images":false},"title":{"value":"Hayling Island Camping: Isle Of Wight Zoo"},"version":1},{"date":{"d":31,"m":7,"y":2007},"datev":20070731,"info":{"content":"<p>We all headed over to a muddy shower block. Katie and Ben are chalk and cheese. Katie wouldn't get out of the shower, Ben wouldn't get in. Ben screamed the shower block down when Mummy made him get in. After a shower we had a go on the campsite swing park and then headed for a swim in the campsite's outdoor heated pool. The pool was so warm and the weather lovely. We had great fun in there.<\/p><p>In the afternoon we headed to Windlesham for Uncle John Garrett's funeral. Katie and Ben went to play at Natasha's house and Mummy picked them up afterward's. After fish and chips for tea by the tent we all went to bed. During the night Mummy had an allergic reaction to the pollen from the newly mowed campsite and couldn't breathe and ended up being checked out in A and E.<\/p>","images":false},"title":{"value":"Hayling Island Camping: Swimming - Uncle John Garrett's Funeral"},"version":1},{"date":{"d":30,"m":7,"y":2007},"datev":20070730,"info":{"content":"<p>Mummy, Katie, Ben and Ma Ma set off bright and early for our camping holiday in Hayling Island with the car jam packed full of sleeping bags and deck chairs etc. Mummy had bought some Revels or 'pebbles' as Katie calls them and we could all eat one when somebody saw a different mode of transport. Katie kept making them up saying she had seen things when nobody else could see them!<\/p><p>We got to the campsite which was very muddy due to the freak weather conditions this year and Auntie Ellie met us with her tent and put it up for us. We made it all cosy and then headed off to the beach. We met Ella and Auntie Lindy accidently there and they joined us. Ella was on her way to the fairground and we went to. Katie wanted to go on everything Ella did, and she surprised Mummy with her bravery. Then Ella wanted to go on the runaway train rollercoaster but Katie drew the line at this, until Ben indicated he wanted a go and then Katie must have thought 'I can't let my little brother beat me', so Ma Ma took Katie on and Auntie Ellie took Ben on. They loved it and wanted to go again and again. Next we had hotdogs for lunch and headed for a paddle in the sea and a go on the seaside swing park and sandpit. It was lovely and hot.<\/p><p>We had takeaway pizza for tea (Katie's choice) by our tent and then Mummy put an exhausted Ben to sleep while Ma Ma and Katie played football.<\/p>","images":false},"title":{"value":"Hayling Island Camping: Arrival"},"version":1},{"date":{"d":28,"m":7,"y":2007},"datev":20070728,"images":1,"info":{"content":"<p>A frustrating morning where we went to some car salesman’s house to eventually look at a Xsara Picasso SX. It was a bit weird as he was a proper car salesman, but as he went to his storage area 10 minutes away we played with his 14 month old and his Russian wife! It was all a bit weird. Anyway the car drove well, but the interior was seemed very basic. Mainly the trim! Just put me off. Daddy was  pretty proud as it is the first time he's gone to see a car without buying it!<\/p><p>In the afternoon we went out to the West’s house for a bit of a play with Freya, then onto Trilakes with them.<\/p><img src='images\/years\/2007\/2007_07_28-06-TrilakesWithWests.jpg' class='diaryImage' alt='Barrie and Daddy with offspring' \/><p class='diaryImageCaption'>Barrie and Daddy with offspring<\/p>","images":false},"title":{"value":"The West’s, Trilakes"},"version":1},{"date":{"d":24,"m":7,"y":2007},"datev":20070724,"images":2,"info":{"content":"<p>Katie and Ben came into Mummy and Daddy's bedroom at about 6:30am to open her presents. She had so many lovely things ranging from fairy dresses to sunglasses and a sticker making machine. She was really getting into it.<\/p><p>Grandma and Grandad popped over to drop something’s off, including another present, and helped us take some stuff down to the hall where Katie's party was going to be held. With the inclement weather this summer, at the last minute we decided to swap from our outdoor hula and paddling pool party to an indoor affair.<\/p><p>It took about an hour to setup. Fortunately we had some help from Auntie Ellie and Natasha's mum. The 14 little guests arrived promptly and it all started pretty manically. The kids were running and screaming around and giving the bouncy castle a good seeing to. There was a lot of energy released.<\/p><p>After about 20 minutes the kids settled down a bit and started making crowns on the craft table, dressing up as princesses, fairies and pirates, and taking turns in trying to pin the tail on the donkey that Grandad had kindly made up... Well that's if the tail hadn't gone missing. We just used a felt tip pen instead which served just as well.<\/p><img src='images\/years\/2007\/2007_07_24-17-KatieBirthday.jpg' class='diaryImage' alt='The manic bouncy castle' \/><p class='diaryImageCaption'>The manic bouncy castle<\/p><p>We played pass the parcel (or 'parcel parcel' as Katie calls it) then had a sugar inducing party lunch.... There was at least some fruit and sandwiches as well on the table. Katie was presented with her princess birthday cake and we all sang happy birthday. Most parties have the food at the end and I can see why now. The kids wanted to play around rather than play more games. We managed to muster half of them for a game of 'musical statues' and 'farmers in the den'.<\/p><img src='images\/years\/2007\/2007_07_24-22-KatieBirthday.jpg' class='diaryImage' alt='Lunchtime' \/><p class='diaryImageCaption'>Lunchtime<\/p><p>The two hours were up and I think everyone had a good time. Mummy done ever so well in organising all this for me. It's not easy, especially with the last minute changes and being seven months pregnant!<\/p><p>After the long clear up session we went home to open all the presents received at the party. Auntie Ellie , Joey, Lily and Howard were there to watch. Wow, what a lot of presents.<\/p><p>We said our goodbyes, gave Natasha's mum some flowers then Auntie Charlotte arrived shortly before the Fars who had brought some lovely fish and chips. Yum Yum. We are all going on a healthy diet after today's food intake!<\/p><p>An end to a lovely day. Katie off her own back said 'Thank you mummy for a lovely party' at bedtime which was really nice of her. What a sweetie.<\/p><ul><li><i>Party goers<\/i>Ella Rout, Joey Elder, Lilly Elder, Freya West, Summer Teale, Alice Teale, Emma Tyas, Natasha Kelly, Sophie Roberts, Ben Stockwell, Poppy Franklin, Oliver Bandoz, Henry Jacquet, George Jacquet, Joshua Thompson, Grace Baier\u000a        <\/li><\/ul>","images":false},"title":{"value":"Katie's 4th Birthday"},"version":1},{"date":{"d":22,"m":7,"y":2007},"datev":20070722,"info":{"content":"<p>In the morning Daddy took Ben to church on the back of the bike. We stopped for ages by the railway bridge in Frimley Green to watch the cars struggle through the flooded road and to warn mummy. The boys waited and waited, only to realize that we had the only car keys! So Daddy and Ben had to race home!<\/p><p>After church we went off to Emma's birthday party. There was a clown woman (not mummy!) who was really good. We had a great time there.<\/p><p>In the afternoon Daddy and Farfar went over to Sutton to look at a Picasso only to find that the salesman couldn't let Daddy take it on a test drive because 'He was the only salesman there'!! Wow what a great answer to a prospective customer. They walked away no happy having spent the best part of the afternoon getting there and back.<\/p><p>Meanwhile Aunty Susan popped over to see us girls and drop off a birthday present for a certain person!<\/p>","images":false},"title":{"value":"Emma's Birthday, Susan Visit"},"version":1},{"date":{"d":21,"m":7,"y":2007},"datev":20070721,"images":1,"info":{"content":"<p>The boys went off to get their haircut, whilst the girls helped each other out doing chores.<\/p><p>\u000a        We were feeling a little guilty as Uncle John always mentioned\u000a        <a href=\"http:\/\/www.chobham.info\/windlesham_arboretum.htm\">\u000a          Windlesham Arboretum\u000a        <\/a>\u000a        and we had never been. So after a go on the swings at the memorial field we walked through the mud to a hidden treasure that was the arboretum. We ran around, played hide and seek and walked up the hill so we could run down again. We got a bit lost and ended up next to the motorway, but eventually found our way out.\u000a      <\/p><img src='images\/years\/2007\/2007_07_21-01-WindleshamArboritum.jpg' class='diaryImage' alt='Windlesham Arboretum' \/><p class='diaryImageCaption'>Windlesham Arboretum<\/p><p>The afternoon was spent down the Arena, and Katie showed us how she could swim without armbands. We still would call it a scramble for life rather than anything controlled. Still spent more time without armbands than she did with. Ben also bicycled his way around the pool.<\/p><p>In the evening mummy went on leg two of Sarah's Hen night in a jazz club in Ascot. She didn't return until 1am. Because she forgot her keys and Daddy was fast asleep she was locked out for about 15 minutes, banging on the door to try and wake Daddy up!<\/p>","images":false},"title":{"value":"Boys Haircuts, Windlesham Arboretum, Swimming"},"version":1},{"date":{"d":20,"m":7,"y":2007},"datev":20070720,"info":{"content":"<p>Barrie and Laura went through a marathon delivery of about 24 hours! Laura went into hospital yesterday lunchtime, and Harrison was born healthy at 9lbs 2oz after a c-section.<\/p><p>Daddy met up with his ex FormScape mates at the wet, Reading Beer and Jazz festival... although there wasn't much jazz. It was good to catch up.<\/p>","images":false},"title":{"value":"Katie's Last Playschool Day and Harrison is born"},"version":1},{"date":{"d":19,"m":7,"y":2007},"datev":20070719,"images":1,"info":{"content":"<img src='images\/years\/2007\/2005_03_05-41-Steves30th.jpg' class='diaryImage' alt='Uncle John Garratt' \/><p class='diaryImageCaption'>Uncle John Garratt<\/p><p>Uncle John Garratt passed away this morning having suffered from a heart attack in a Dublin hospital. He was still touring the country after the wedding the previous week.<\/p><p>Although on paper he was a distant relative, he was close to all the immediate Barnett family. He was such a lovely man who always took an interest in everything you did. He would pop over and talk to the children, take lots of photos, chatted about his china collection or about a recent walking trip. His house Warrendale, was fantastic. A real life museum. A man who never ever watched television, kept three Jaguars, collected royal china, indexed every photo from the past 40 or 50 years and loved his gardening and diy'ing. He was very close to his brother and nephews despite them being in Canada.<\/p><p>We have tried to not mention it to Katie or Ben, as Katie still worries about Oldemor passing away earlier in the year. We feel there is no point upsetting her.<\/p><p>A man who we will sorely miss.<\/p>","images":false},"title":{"value":"Uncle John Garratt Passes Away"},"version":1},{"date":{"d":15,"m":7,"y":2007},"datev":20070715,"info":{"content":"<p>Katie, a popular little girl, went to Eve's birthday which was held at Fizzy Kids (softplay place). Meanwhile, Mummy and Ben went to church together.<\/p><p>Auntie Charlotte popped over to dump some of her stuff as she was moving out of her student digs for a bit. Barrie, Laura and Freya also made a fleeting visit to drop off a belated card and present. Laura is freakishly looking as if she is at bursting point. She genuinely looks as if she had a bowling ball shoved up her top! She is now 3 days past the 40 week mark.<\/p><p>Later in the afternoon the four of us went to Natasha's party held at Runabout (another softplay). We all enjoyed ourselves here.<\/p>","images":false},"title":{"value":"Two More Birthdays"},"version":1},{"date":{"d":14,"m":7,"y":2007},"datev":20070714,"info":{"content":"<p>After last week’s Ireland trip there were plenty of jobs that needed doing including yet more maintenance to Daddy's motorbike! This time Daddy snapped the bolts that holds the brakes on.... and of course failing with some dodgy DIY of attempting to drill out the sheered bolts and re-tapping by... well just putting new screws in! Oh well another £30 down the tubes!<\/p><p>Ma Ma and Pop Pop popped over for a cup of tea then Katie had the first of three parties this weekend. First up was Grace which Mummy took her to. Meanwhile Daddy and Ben cycled through the woods to play with the trains at Farmor’s.<\/p>","images":false},"title":{"value":"Motorbikes and Grace's Birthday"},"version":1},{"date":{"d":10,"m":7,"y":2007},"datev":20070710,"first":{"name":"katie","value":"Katie 5 metre swimming badge"},"info":{"content":"<p>Daddy grew another year older today. We helped him open all his cards and presents before Daddy had a chance to wake up! He got some nice clothes, vouchers, a sloe (a kind of garden hoe - ask Farfar), a bottle of beer and a left hander's pen!<\/p><p>Later in the day Katie swum five meters which is brilliant. I think it's time to get rid of those armbands.<\/p>","images":false},"title":{"value":"Daddy's 32nd Birthday"},"version":1},{"date":{"d":8,"m":7,"y":2007},"datev":20070708,"images":2,"info":{"content":"<p>(Laura’s account) Ben woke up at 04:45, so it was a really early start for us all. Pop Pop drove us to Kerry airport where we flew to Stanstead. Ben was in a horrid mood on the plane as he was very tired and wanted a seat of his own like Katie but had to sit on Mummy’s lap, he was kicking and screaming. Katie made friends with the lady next to us, and when she offered Mummy her magazine to read Katie gave her Disney Princess magazine to read, which the lady did. It was lovely.<\/p><p>We drove home and got in our outfits to ride on the carnival float. Katie wore a pink tinsel wig to be Stephanie from Lazy town and Mummy a blue Bandanna for Sporticus. The playschool float looked great but we didn't win. Farfar and Farmor walked along the side with Benny in the pushchair. He seemed to love it. We also spotted all the playschool ladies, Auntie Karen and Uncle Richard, Uncle Barrie, Auntie Laura and Freya and Auntie Susan. Katie loved it. Afterwards we walked onto the green and went on all the stalls. Katie and Ben won an inflatable hammer each, which they hit everyone with. Katie tried her first candy floss (she didn't like it-mad!) She went on a really high inflatable slide and both Katie and Ben went on a tea cup ride which they loved, Mummy had to ask the lady to spin then more slowly as at first she did it so fast Ben couldn't keep sitting up although he was smiling! Ben had a train tattoo pained on his face and Katie a flower one, (which Mummy was later not allowed to remove before bed). We all had an ice cream. Overall a great afternoon.<\/p><ul><li><i>Daddy's Bike Touring<\/i>(Back to Martin’s account) I on the other hand had a long journey home about 450 miles.... which I enjoyed. We headed north first to Limerick then east through the lovely Tipperary and then Waterford just arriving in time for the calmer crossing to Fishgaurd. On my travels I managed to get 111mph out of my old CB500, whilst Howard pushed the 130mph barrier! Not one speed camera or police car in sight.\u000a        <\/li><li>Back on the main land and we still had 250 miles to go which proceeded at a good pace. 60 miles to go and disaster struck! Passing Swindon at about 90mph all of a sudden my bike revved right up, and bits of metal were flying past Howard’s helmet! The chain had snapped and created sparks where it was being dragged along the tarmac. Anyway we both luckily returned home eventually unscathed.<\/li><li>Overall a fantastic trip which I really enjoyed. I have grown closer to motor biking now. Top tip are ear plugs, they make all the difference. Thanks to Howard as well who was great company throughout and had to put up with me! And of course congratulations to Joyce and Steven.<\/li><\/ul><woops rating=\"7\" woopstitle=\"Who wants to go on a biking holiday with me?\"><li><i>Tom Tom Smootied<\/i>Whilst winding the roads of Dingle, Kerry, my Pineapple flavoured smoothie decides to leak in my top box covering the shoes I am supposed to wear at the wedding and Howard's 'sat nav', which proceeds to no longer work!\u000a        <\/li><img src='images\/years\/2007\/2007_07_06-93-Kerry.jpg' class='diaryImage' alt='You've been smoothied' \/><p class='diaryImageCaption'>You've been smoothied<\/p><ul><li><i>Stoned<\/i>Heading out of the Dingle peninsula my back wheel flicks a stone out which hit and oncoming car on the driver’s door which dents it nicely, then bounces back and almost hits Howard who is following me on the rebound!\u000a          <\/li><li><i>Chain Smoker<\/i>Having completed a 1000 miles, the bike had held up well despite the pool of liquid found on the Sea Cat, the mirror that was loose and the chain which had about 4 inches of play! Passing Swindon at about 90mph all of a sudden my bike revved right up, and bits of metal were flying past Howards helmet! The chain had snapped and created sparks where it was being dragged along the tarmac. Anyway we both luckily returned home eventually unscathed.\u000a          <\/li><\/ul><img src='images\/years\/2007\/2007_07_08-10-M4Breakdown.jpg' class='diaryImage' alt='Broken Chain' \/><p class='diaryImageCaption'>Broken Chain<\/p><\/woops>","images":false},"title":{"value":"Motorbike Ireland Tour - Homeward Bound, Carnival"},"version":1},{"date":{"d":7,"m":7,"y":2007},"datev":20070707,"images":2,"info":{"content":"<ul><li><i>Daddy's Bike Touring<\/i>The day of the wedding. Barrie, Ellie (wife for the night), Laura and the children all came over on the 6:05am flight from Stanstead. The alarm clock went off at 2:30am! I went to meet them at the airport but couldn't find them! We eventually met up at the hotel and proceeded to go with Ma Ma and Pop Pop out to Banna beach where I decided to change and run into the cold sea. It was great as the waves were reasonably big to jump into. It wasn't cold once I swum around a bit. Ben loved running in and out of the water until he fell over in it and got soaking wet!\u000a        <\/li><\/ul><img src='images\/years\/2007\/2007_07_07-24-JoyceSteveWedding.jpg' class='diaryImage' alt='Fancy a swim at Banna Beach?' \/><p class='diaryImageCaption'>Fancy a swim at Banna Beach?<\/p><ul><li>We returned back to the hotel to freshen up and get changed. There were two busses to take the guests to the church which was in a place called Camp. The church was at the foot of the Slieve Mish Mountains, looking back across the bay of Tralee. The service was not so much as a couple of sides of paper, but more like a book! True to form the kiddies made life a little awkward. Katie needed a wee, so I took her outside into the bushes. She then proceeded to wee on her 'pretty shoes' and my hand, this all happening as Joyce was pulling up in the car. I was wiping my hands and Katie's foot out in the hallway where Joyce was waiting to make an entrance. Sorry Joyce..... Oh and she looked beautiful in her dress. I quickly nipped in and positioned ourselves back to normal. Then, as Joyce walked down the aisle Ben was standing on the pew and you could see on his face he was straining himself. The bowling lot behind us were going 'Pooey' and 'What’s that smell?' in jest. Anyway it was time for me to take him out and change his nappy. I knew keeping Ben in church would be like locking up a caged animal, so we went for a walk up the hill and saw the stream, some sheep and horses who chased us off. Not that I was scared! We returned for the last five minutes. Laura said it was a really romantic service, one I am gutted to have missed.<\/li><\/ul><img src='images\/years\/2007\/2007_07_07-99-JoyceSteveWedding.jpg' class='diaryImage' alt='The happy couple' \/><p class='diaryImageCaption'>The happy couple<\/p><ul><li>We returned to the hotel. Laura and I were busy chasing the kiddies all over the place as photos were taken. We had a lovely chocolate fountain to distract us and proceeded to fill our faces.<\/li><li>Photos were taken and kids were there to be followed and chased around the corridors of the lovely hotel. We sat on a big round table with Ellie, Charlotte and the Allen’s'. The food was plentiful and nice. Martin Bigg's best mans speech is probably the best I've heard.<\/li><li>The evening went on with the boys getting on with the Irish lot. Laura and I took it in turns to go and mind the sleeping children. Unfortunately the dancing started too late for them. Katie was still going at 9pm, fit and strong, having been up since 3am! She's got Ma Ma's energy that is for sure. Barrie got drunk quite early and fell asleep first on the toilet and then in the hallway. He ended up drinking water for the rest of the night. Charlotte ended up in the boys room (but nothing happened), Nick was a hit with the Irish ladies, Howard was matched up by Ma Ma with a Tralee'n and Paul Deer offended some of the Irish with an off the cuff remark meant in jest! The party went long into the night. We were sad not to have seen it having gone to bed relatively early, shattered.<\/li><\/ul>","images":false},"title":{"value":"Motorbike Ireland Tour - Steve and Joyce's Wedding"},"version":1},{"date":{"d":6,"m":7,"y":2007},"datev":20070706,"images":2,"info":{"content":"<ul><li><i>Daddy's Bike Touring<\/i>Mona had served melon and blackcurrant coulees for starter and a slightly alternative Irish breakfast. It included cheese on toast topped with marmalade, an interesting combination which I liked and Howard didn't. We had to move quick as the builders were in and ready to go. One had parked his truck such that the cradle was hanging above Howard’s bike! We headed out of Skibbereen and instantly began to ride on empty, windy roads viewing mountains and the coast. I had my Feeder mp3's on, the weather was good, motorcycling conditions were good and the scenery breath taking. It's very hard to describe and even the photos don't do it any justice. You've just got to do it yourself. Needless to say we seemingly stopped every five minutes to marvel at the views. It seemed we'd stop and see something we liked, go on a bit, go around a corner then another hidden treasure is presented, stop again to marvel take some photos and go on again. This morning was probably the best bit of the trip for me.\u000a        <\/li><li>The roads were rough though! We kept seeing road works signs, then a '100' sign.... which I think meant 100 pot holes per kilometre! Boom boom.<\/li><\/ul><img src='images\/years\/2007\/2007_07_06-42-Kerry.jpg' class='diaryImage' alt='Stunning coastline' \/><p class='diaryImageCaption'>Stunning coastline<\/p><ul><li>We wound around the mountain roads and eventually ended in the picturesque town of Kenmare. The gateway to the much heralded Ring Of Kerry. To begin with I must admit I wasn't that impressed, especially from what I had seen in the morning. The roads were certainly a lot busier with tourists and construction traffic. As we started to reach the west half of the peninsula the scenery again got more dramatic, looking across at the mountains. Small sandy beaches would pop up around the next corner. I liked seeing the small, green hilled islands poking out of the Atlantic Ocean and the waves crashing into the rocks. We stopped a number of times, but quickly pushed on after lunch which we had in a friendly Irish coffee shop. We headed for Sue and Richard’s cottage which we were going to stay at overnight at Boolteens.<\/li><li>It was in a beautiful location. Views of Slieve Mish Mountains out the back window and Dingle Bay out the front. Again difficult to describe really, but somewhere you'd want to retire to. We dumped our stuff and had a cup of tea before we parted ways. Richard and Sue went off to Tralee whilst we had the Dingle peninsula to explore. First stop was Inch beach, then onto Dingle itself. A busy town, again with old, colourful buildings. It's naughty to say this, but we didn't stop because we have had seen the same over the past couple of days.<\/li><li>Out west past Dingle we probably saw the most stunning scenery. We were biking along the cliff edge. The sea looked so blue. We stopped a number of times. On one stop I went into the top box to get the map only to find my pineapple flavoured smoothie decided to leak covering the shoes I am supposed to wear at the wedding and Howard's sat nav, which proceeded to no longer work! I couldn't even throw stuff away or clean up. Arrgghh. Anyway we laughed.<\/li><\/ul><img src='images\/years\/2007\/2007_07_06-89-Kerry.jpg' class='diaryImage' alt='The holy one' \/><p class='diaryImageCaption'>The holy one<\/p><ul><li>Heading out of the Dingle peninsula my back wheel flicked a stone, which hit and oncoming car on the driver’s door which dented it nicely. The stone then bounces back and almost hits Howard on the rebound who is following me! Anyway I was proud to have reached 100mph on Dingle! Don't tell Laura.<\/li><li>We scrubbed up at the cottage and then biked to Tralee to meet with the other wedding guests in the hotel. It was nice to meet up with familiar faces. There must have been about 30 of Steve's friends and family. We didn't return until gone midnight.<\/li><\/ul>","images":false},"title":{"value":"Motorbike Ireland Tour - Ring Of Kerry, Dingle"},"version":1},{"date":{"d":5,"m":7,"y":2007},"datev":20070705,"images":1,"info":{"content":"<ul><li><i>Daddy's Bike Touring<\/i>After our Irish Breakfast we said our goodbyes to the helpful hotelier and biked off in the rain heading west in the Cork direction. A chance to enjoy the Irish countryside. Well not really the weather was so bad we couldn't see much and had to concentrate a lot on the road. We hit New Ross, got lost in Waterford and then went on to Cork. All the towns looked quite similar in that there weren't any modern buildings, most of them painted colourfully, shot fronts were artistically decorated and the road surface shot to buggery! No need for speed humps.\u000a        <\/li><li>By the time we got to Cork it had stopped raining and we walked down some of the pedestrianized streets and stopped off in a coffee shop for a nice round of sarnies and a hot drink. It was refreshing to walk where not every other shop was not part of a chain. Howard bought some 'tack' from the tourist information and we headed into the suggested deep, south west corner of Ireland.<\/li><li>Next stop was Clonakilty which was walked around for a bit. It had the same character and appearance as all the towns we had passed so far. Narrow streets, colourful, old-ish buildings. We weren't impressed with Clonakilty Bay, it looked like a swamp! We didn't know where we were going. Just heading in a general westward direction along the coast. We hit our first 'Wow' scene at Inchydoney Beach. A massive white, sandy beach with hills and cliffs either side. We stopped for some photos and continued along the dramatic coastline. It was nice to get out of the towns and off the main roads. I was really enjoying myself seeing the sites and riding with Howard.<\/li><li>Late afternoon we decided to base ourselves at Skibbereen. We tried a number of B and B's along the high street before the one that won 'Most Unusual B and B in Ireland' had a free room. That was because no one else actually would stay there! It was a place Laura would have run a mile from. It was set in a Victorian style, the deep red walls were filled with many artefacts like nude paintings, a stuffed bird and a certificate where the proprietor, Mona, had bought a Scottish title. There were dusty mannequins dressed in evening wear in the hall way. Mona showed us our room and enquired if we wanted a double or two twins! The bathroom across the hall was very different. It had deep red carpets, a massive corner bath, a bidet, a chez lounge and all Mona's toiletries it seemed. I couldn't stop chuckling to myself at how weird it all was. It was an experience. As I say Laura would have run a mile from this place.<\/li><li>We decided to do a couple more short excursions to Baltimore and Castletownsend. The sea was certainly still very choppy. Waves crashing over the harbour walls. We were nice and warm in our bike gear. We kept commenting on how this would be packed with tourists in the summer season when the weather was warmer and better... but of course we were already in July.<\/li><\/ul><img src='images\/years\/2007\/2007_07_05-23-WestCork.jpg' class='diaryImage' alt='Ship Wreck' \/><p class='diaryImageCaption'>Ship Wreck<\/p><ul><li>We headed back into Skibbereen and had some fare in a pub. Ear wigging some locals conversation I found it difficult to comprehend what they were saying, their accent was something out of the film Snatch! The talk of the town was the recent drugs found washed up at a local village. 100 million pounds worth! There were quite a few pubs, but not many had more than half a dozen people in them. We finally parked ourselves in a place which had a bit of atmosphere and later a band. Howard had his first ever pint of Guinness at the age of 50! He thought it was alright.<\/li><\/ul>","images":false},"title":{"value":"Motorbike Ireland Tour - Rosslare, Cork, Skibbereen"},"version":1},{"date":{"d":4,"m":7,"y":2007},"datev":20070704,"images":1,"info":{"content":"<ul><li><i>Daddy's Bike Touring<\/i>Laura’s Uncle Howard and I had planned a motor biking trip around Steven and Joyce’s wedding. The first time either of us had done an extended bike tour and both first time visitors to Ireland (other than a weekend trip to Dublin).\u000a        <\/li><li><i>Daddy's Bike Touring<\/i>I left work on a half day and realised we had to scoot in order to make Fishgaurd for the 6:30pm sail. Howard came around and we set off in changeable weather conditions. Conditions ranged from rain, to being sunny, but worst of all it was pretty windy. At times we had to slow right down as the wind was trying to blow us into the next motorway lane! We stopped off at Penarth services thinking we were almost there. I mean it’s a long way down the M4 isn’t it? However, we still had about 100 miles to go and we were struggling for time as the M4 petered out and the roads narrowed. This was a proper biking trip, weaving in and out of traffic at speeds higher than I would say was comfortable. We just made the boat in time, being last on. As one of the crew was strapping the bike down he noticed a pool of blue liquid under my bike! Oh no. We couldn't work out where it came from, but we did notice the chain was reasonably slack!\u000a        <\/li><\/ul><img src='images\/years\/2007\/2007_07_04-01-ToRosslaire.jpg' class='diaryImage' alt='Daddy and Howard off motor biking' \/><p class='diaryImageCaption'>Daddy and Howard off motor biking<\/p><ul><li>The crewman also asked whether we had strong stomachs as this was going to be a choppy ride. Well the first 15 minutes were fine. The next quatre of an hour the mood changed as the Sea Cat bounced up and down over the waves. The waves were splashing up on the sides of the windows. Passengers’ faces started to turn green, merchandise from the shop was falling off shelves and you could do comedy walks as we were treated to going up and down, up and down. The half an hour marker saw the first sick bags being used. I remarkably lasted till 45 minutes before the strawberry smoothie I had in port re-appeared! I felt better for it, but felt ever so sleepy and still a bit queasy. ‘Iron Gut’ Howard wasn't feeling the best.<\/li><li>Thank goodness the journey was just two hours and we arrived in Rosslare to a lovely sunset. We dumped our bags, managed to prize ourselves away from the helpful hotelier and went to the pub for a lovely fish and chips washed down with a pint. We then went for a bit of a walk and went into a more of a locals place down the road. An end to a nice day..... oh and I was sick again during the night!<\/li><\/ul>","images":false},"title":{"value":"Motorbike Ireland Tour - To Rosslare"},"version":1},{"date":{"d":1,"m":7,"y":2007},"datev":20070701,"info":{"content":"<p>Gillingham Marina was awoken at 6:30 with Ben signing at the top of his voice from the top of the boat - much to the delight of Pop Pop!<\/p><p>Daddy bombed over on his motorbike and took Ben over to Bluey, whilst the rest of the family went to St Nicholas. We packed a picnic and made our way uptown and toured around the Imperial War Museum. Katie and Ben were far too young to appreciate any of it, not that we expected anything more. Katie's most noteworthy point was looking around a 1940's home.<\/p><p>We trawled through the traffic home. Uncle Steven popped over for a bit which was nice.<\/p>","images":false},"title":{"value":"Imperial War Museum"},"version":1},{"date":{"d":30,"m":6,"y":2007},"datev":20070630,"info":{"content":"<ul><li><i>Katie's Day With Ma Ma and Pop Pop - As told by Ma Ma<\/i>Katie and Ma Ma had such a lovely day together. First, when Katie woke up (6.15 am) we went downstairs and had a chocolate biscuit for breakfast (no cornflakes - sorry!). We then got Pop Pop up and he went off to Croydon to get Charlotte a new car. When he had gone we played Musical Statues and Musical Bumps until it was time to go shopping. Off to Sainsbury's we went and bought loads of goodies (as well as essentials). After lunch we went to the Strawberry Fair where Katie helped run the Fishing For Ducks stall. She also had her face painted and met Shrek (not particularly enthralled). Once home, we all played some more games until Mummy and Daddy and Bennybumbum arrived. Altogether a brilliant day!\u000a        <\/li><\/ul><p>For the rest of us, Charlotte stayed the night and came with us in the morning to do a spot of shopping in Farnborough. Ellie who's 29th birthday it was, came along with Joey and Lily for a spot of lunch and then over to the RLC open day. We watched the amazing cavalry and had a go on the fairground whilst trying to dodge the showers.<\/p><p>Mummy and Ben raced over to Kent to spend the night on the Babar.<\/p>","images":false},"title":{"value":"RLC Open Day, Strawberry Fair, Sleep over on Babar"},"version":1},{"date":{"d":27,"m":6,"y":2007},"datev":20070627,"first":{"name":"katie","value":"Dentist"},"info":{"content":"<p>Katie's first trip to the dentist today. Mummy had her teeth checked first and then Katie, as good as gold jumped onto the chair and opened her mouth for the dentist. He said her teeth were lovely and white and then she was given a princess sticker which made her day. Mummy couldn't believe how brave she was, Mummy made more fuss! Auntie Ellie looked after Benny.<\/p>","images":false},"version":1},{"date":{"d":25,"m":6,"y":2007},"datev":20070625,"first":{"name":"katie","value":"Dry night - No nappy!"},"info":{"content":"<p>We awoke at 6:50 to a phone call from Ma Ma saying that Auntie Charlotte had crashed and rolled her car. Fortunately she was fine and didn't need any hospital treatment, but she did bump her head! The car is a write off. It would appear there was diesel on the road. A car just after her also crashed!<\/p><p>\u000a        We opened cards and presents. Daddy gave mummy a nice black and white canvas print of our\u000a        <a href=\"images\/years\/2007\/2007_01_07-18-London.jpg\">\u000a          London outing\u000a        <\/a>\u000a        back in January.\u000a      <\/p><p>The Fars popped over with a present and a cake early in the morning, followed by Laura, Caroline and Henry, and later Fiona and Thomas for lunch. We then popped over to see Grandma and Granddad.<\/p><p>In the evening Mummy and Daddy went to watch Pirate Of The Caribbean III. Daddy likes Keira Knightly and Mummy, Jonny Depp.<\/p><p>We have been trying for the past 2 or 3 weeks to get Katie not to wear a nappy at night... And every night she has wet the bed! Except for tonight! Yoo Hoo. She got up to go on her potty all by herself.<\/p>","images":false},"title":{"value":"Mummy's 31st Birthday"},"version":1},{"date":{"d":24,"m":6,"y":2007},"datev":20070624,"info":{"content":"<p>Another day of rain put pay to our intended trip to Finkley Down Farm with the Gays. Instead we went to Woking swimming pool for a bit of a splash around and some food in the cafe afterwards.<\/p><p>\u000a        The weather improved a bit so we all decided to venture outside to the<a href=\"http:\/\/www.cockcrow.co.uk\/\">Great Cockcrow Railway<\/a>in Chertsey. The Fars went to pick up two distant relatives, Donald and Doris Southgate. When we say distant this is how it goes... Katie and Ben's Great, Great, Great Grandfather was George Gay of 1834. This man is Donald's and Farfar's Great Grandfather! See the\u000a        <a href=\"\/familytree\/gayfamily.pdf\">\u000a          tree\u000a        <\/a>\u000a        . Still it is nice to keep in contact with such distant relatives. There was one common trait between Ben, Farfar and Donald and that is the love of steam trains!\u000a      <\/p><p>The train ride itself was good. Two 20 minute rides left the bottom a little sore. Katie and Ben were getting a bit tired by the late afternoon, so left the older generations to look around the signal boxes with Farfar's childhood friend Jamie. A lucky escape by us!<\/p>","images":false},"title":{"value":"Swimming and Great Cockcrow Railway"},"version":1},{"date":{"d":23,"m":6,"y":2007},"datev":20070623,"images":2,"info":{"content":"<p>The morning was spent looking on the internet for a suitable car that would house the 5 Gay's. We swung between the Citroën Xsara Picasso, Vauxhall Zafira and Renault Scenic. We have at least made a start in deciding. We broke off to feed the fish in the pond, and as Katie says 'They were mad for it'!<\/p><p>The afternoon was spent at Jon and Rachel’s wedding down in Eastergate near Bognor Regis. The weather as seems the norm these weekends was inclement and it even started to thunder during the service. It was a lovely, cosy church, seemingly stuck in the middle of nowhere. We somehow kept the children entertained enough with books, food and milk during the ceremony not too cause too much fuss. \"The Dingles\" have arrived, which rang true to a certain extent with our crew.<\/p><p>We saw a few familiar faces including the Elders, Weston’s and Sanders. The weather staved off enough for photographs. Katie and Ben made the confetti shots. The familiar faces left for the morning breakfast whilst we had to kill 4.5 hours before the evening do.<\/p><img src='images\/years\/2007\/2007_06_23-11-RachJonWedding.jpg' class='diaryImage' alt='Rach, Jon and the confetti kids' \/><p class='diaryImageCaption'>Rach, Jon and the confetti kids<\/p><p>We headed with Charlotte to Bognor Regis. Parked the car, then realized we forgot the pushchair. We made the half an hour round trip back to the church to collect it. Silly Mummy and Daddy!! Bognor Regis had a bit of a dying, holiday town about it. Not sure if it was the weather or the shops that had closed down, but there was no buzz to the place. We had a go in the penny arcades, and on a couple of the fairground rides on the seafront. We also threw stones into the sea which was quite choppy. A word of warning. Ben and Katie don't have much control when throwing stones so some might end up on your head or in your back if you are not careful!<\/p><p>We were with Charlotte and Mummy, so 5pm meant dinner time. We had a treat at the Fish and Chip restaurant. Katie ate and ate!!<\/p><p>\u000a        We headed back to the car and drove 5 miles to Arundel, which is a lovely town dominated by the\u000a        <a href=\"www.arundelcastle.org\">\u000a          Castle\u000a        <\/a>\u000a        . We went on the adjacent playground for quite a while and had a walk around the castle perimeter. Unfortunately we didn't have a enough time to look inside, much to Katie's disappointment. She wanted to see where the Princess lived!\u000a      <\/p><img src='images\/years\/2007\/2007_06_23-47-RachJonWedding.jpg' class='diaryImage' alt='Walking alongside Arundel castle' \/><p class='diaryImageCaption'>Walking alongside Arundel castle<\/p><p>We headed north 10 miles towards Petworth, going the scenic route, well let’s say Mummy was reading the map, to the evening do of the wedding. It was again in the middle of nowhere, in a converted barn with fields all around. The children liked the secret house. Ben found (another!!) female friend who supplied him with food from the buffet. It was a lovely relaxing evening. We eventually left way past bedtime at 9:15pm!<\/p>","images":false},"title":{"value":"Jon and Rachel's Wedding"},"version":1},{"date":{"d":22,"m":6,"y":2007},"datev":20070622,"info":{"content":"<p>Today was Katie's pre-school outing to Bocketts Farm. Mummy, Katie and Ben went as Daddy had to work. It was raining on and off, but we had a great day. There was a lovely play barn there which Katie and Ben loved. Katie, much to Mummy's amazement just grabbed a mat and went down the highest slide ever and then Ben wanted to go on it too so Mummy had to go with him, not sure what the baby must have thought of it! We had a picnic in the rain, went on a lovely long tractor ride (Ben loved this) saw some pig racing, Katie picked the winner and went on the trampolines. Ben was terrified of the cows and sheep as they were really noisy and he sobbed real tears, so we had to go outside. Katie and Ben both stroked a baby goat and chicken. We finally went for a lollypop and while Katie and Ben played on the swings and sandpit with all her friends, Mummy had a cup of tea with the other Mums. We were there for six hours in the end, a great day. In the evening Mummy talked to Daddy about swapping infant schools. Katie had had such a lovely time with all her pre-school friends that Mummy feels sad about sending her to Heather ridge where she won't know anyone. So we have decided to change schools to Cross Farm so Katie can be with all her friends. There are thirteen pre-school friends going there.<\/p>","images":false},"title":{"value":"Bocketts Farm with Playschool"},"version":1},{"date":{"d":17,"m":6,"y":2007},"datev":20070617,"info":{"content":"<p>It was Father's Day. Katie had made Daddy a coaster which she had drawn a picture of Daddy on one side, and written Dad on the other. She also had made a card from playschool. Ben had got a joint of lamb, which Daddy saw as a real treat.<\/p><p>After church, we went over to Woking for a swim with Ma Ma, Pop Pop, Charlotte and the Elder clan. Ben was the only one brave enough to go with Daddy on the flume. We all had a great time.<\/p><p>We watched Superman II in the afternoon. Ben and Katie were hooked.<\/p><p>Some Gay'isms<\/p><ul><li><i>Katie saying<\/i>Oh My Bennet - A cross between Oh My Goodness and Gordon Bennet\u000a        <\/li><li><i>Ben saying<\/i>And me, And Me - Just to be sure he doesn't get left out of anything\u000a        <\/li><\/ul><p>The scary mind of Mummy, discussing the Falklands. Apparently it's near Scotland and Mrs Thatch was headmistress at the time!<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":16,"m":6,"y":2007},"datev":20070616,"images":1,"info":{"content":"<p>After a few errands in the morning we went over to Bordon way to meet up with the Elders to 'pick your own strawberries'.  The kids enjoyed themselves. There were a few sneaky tasting sessions. They were gorgeous. After collecting 2 big pun nets full, and digging and couple of potatoes and carrots we went back to the Elders where we went over the fields at the back of their house. During the week Ben and Katie have been going on about these cows that were plopping away. They were highly amused and felt they had to go and show Daddy them! It was a nice walk, although we didn't see much in the plopping department. The weather was drawing in and the kiddies were getting a bit tired, so we decided to head for home and lunch!<\/p><img src='images\/years\/2007\/2007_06_16-08-StrawberryHaul.jpg' class='diaryImage' alt='Strawberry Haul' \/><p class='diaryImageCaption'>Strawberry Haul<\/p><p>The afternoon was spent doing a spot of shopping in preparation for Boodle (number 3 baby). We bought a bunk bed and looked at car seats. It looks as if we are not going to be able to fit three seats in the back! Mmmm. A new car?<\/p>","images":false},"title":{"value":"Strawberry Picking"},"version":1},{"date":{"d":10,"m":6,"y":2007},"datev":20070610,"images":1,"info":{"content":"<p>The girls went to church whilst the boys went with the Fars for a bike ride around Windsor Great Park. Ben loved it as we saw plenty of horses and had a nice lolly. We made it to the George I status which has great views of the area, including the castle. Ben managed utter the words 'Farfar' and 'Farmor'.<\/p><img src='images\/years\/2007\/2007_06_10-05-WindsorGreatPark-BenJette.jpg' class='diaryImage' alt='Farmor and Ben at George I statue' \/><p class='diaryImageCaption'>Farmor and Ben at George I statue<\/p><p>They made it back just in time for the Parish lunch which was held at church. Luckily it was a nice day. Katie was besotted with James, and Ben kept saying 'Girl'. We'll obviously have to keep an eye on them both.<\/p><p>Afterwards we went straight around to the Fars to play in the back garden.<\/p>","images":false},"title":{"value":"Windsor Great Park, Parish Lunch, The Fars"},"version":1},{"date":{"d":9,"m":6,"y":2007},"datev":20070609,"images":1,"info":{"content":"<p>In the morning we went to Alice Holt and played on the playground and followed the nature trail.<\/p><img src='images\/years\/2007\/2007_06_05a-BenKatie.jpg' class='diaryImage' alt='Ben And Katie' \/><p class='diaryImageCaption'>Ben And Katie<\/p>","images":false},"title":{"value":"Alice Holt"},"version":1},{"date":{"d":3,"m":6,"y":2007},"datev":20070603,"images":1,"info":{"content":"<p>On this hot morning the girls walked to church, whilst the boys continued on their epic bike ride up the Grand Union Canal! Starting off from Grove Park Golf club they continued northwards. On the way, would you believe the chances, but they bumped into cousin David who was out training for a half marathon! After a nice chat we carried on past David's house through Hemel Hempstead and onto Berkhampstead. It was a lovely Oldie Worlde type town. We stopped off for a drink and a treat. Don't tell mummy! Anyway mad for trains Ben decided we should return on the choo choo.<\/p><p>We all got home in time for Roast Pork before shifting on to Auntie Susan's new home, which is just around the corner from their old house!<\/p><img src='images\/years\/2007\/2007_06_03-01-BenKatie.jpg' class='diaryImage' alt='Ben And Katie' \/><p class='diaryImageCaption'>Ben And Katie<\/p><p>Katie and Ben made themselves at home in no time by getting into Susan and Grahams bed! They rugby tackled the cushion to smithereens. In obvious need to release some energy we took them to the park for them to play Pooh sticks and on the swings.<\/p><p>Auntie Susan's new house was very nice. A good move we feel.<\/p><p>Early to bed after an exhausting weekend.<\/p>","images":false},"title":{"value":"Grand Union Bike, Susan's New House"},"version":1},{"date":{"d":2,"m":6,"y":2007},"datev":20070602,"info":{"content":"<p>We went over to Aldershot to pick daddy's motorbike up, which had two new tyres, then to get Mummy's car tyre replaced. In a chance coincidence we saw Gary who was also at the garage getting some work done on the Belingo!<\/p><p>After a play on the mattress in the back garden, which has doubled up for a trampoline, we headed over to Wokingham. We first stopped off at a playground where Mummy and Katie played on the wickedest swing rope and saw a couple of deer playing in the field. Katie couldn't stop talking about the deer and what they had done.<\/p><p>We then went to Carnival swimming pool. Ben gained a bit more confidence and was able to splash about on his own and sort of make his way around the pool. Katie showed off how she can swim. I don't think she showed her full skills, preferring to still wear armbands.<\/p><p>When we exited the swimming pool, we saw a Tesco lorry crunch into a new BMW 335i. What a mess. The lorry drove off, but Daddy managed to run after it and get his number plate. We went to tell the man whose car it was and left our details. He later rang up to say thank you and ask for more details. The polish driver denied all knowledge!<\/p><p>We came home to wash the car inside and out which ended a busy day.<\/p>","images":false},"title":{"value":"Tyre, Deer, Swim, Smash"},"version":1},{"date":{"d":28,"m":5,"y":2007},"datev":20070528,"info":{"content":"<p>The weather continued to be terrible. It rained all day yesterday and today. It was just 9 degrees! On top of that the car had lost all electrics.<\/p><p>Daddy and the Fars spent all morning running around in the rain trying to sort it out. After lunch, Karen and Rich came over to see Derby get promoted to the Premiership. Pop Pop and his friend then came around to look at the car and finally we got it working.<\/p>","images":false},"title":{"value":"Bank Holiday Woes"},"version":1},{"date":{"d":27,"m":5,"y":2007},"datev":20070527,"info":{"content":"<p>After church and Sunday lunch we went over to the Fars for playtime. The weather was appalling which put pay to our planned trip to the Cockcrow Railway. Instead Ben and Daddy made a monster rail track in the Fars front room. Katie and the girls made a nice necklace.<\/p>","images":false},"title":{"value":"The Fars"},"version":1},{"date":{"d":26,"m":5,"y":2007},"datev":20070526,"images":1,"info":{"content":"<p>First time the four of us have gone out for a while, and we decided to do the trusted London circuit.<\/p><p>First site of the underground train at Turnham Green got Ben in a frenzy. Arms flapping and the squawking! We 'Oystered' are way on and headed to Covent Garden. Mummy went through the exit barriers and Katie ran behind and got a smack in the face from the closing barriers. Ouch!<\/p><p>We ventured around the market and shops and sat down to watch one of the street performers. He was a sort of clown which rode a 10 foot unicycle. He had a big crowd and quite a sales pitch. He gave a child 5 pound for helping him and said 'arr he deserves it because he's performing in front of you' and 'you don't think 5 pounds is too much'.... as to say he was worth at least a fiver. Honestly he must have absolutely raked it in. The children I think enjoyed it all though it did take ages to get to the unicycle bit.<\/p><p>We walked around convent garden to see a carousel which Katie was dying to get on. However, she insisted on going on the carriage and not a up and down horsey much to mummy and daddy's disappointment.<\/p><img src='images\/years\/2007\/2007_05_26-07-London.jpg' class='diaryImage' alt='Spin Me Right Around' \/><p class='diaryImageCaption'>Spin Me Right Around<\/p><p>\u000a        We headed south across Waterloo bridge and noticed loads of statues of men dotted all around. On the bridge and on the tops of loads of buildings. Must look up what that is all about. Kept us all amused for a while trying to spot them all. We must have seen a dozen or so. Just looked up, they're\u000a        <a href=\"http:\/\/www.londonist.com\/archives\/2007\/05\/i_see_naked_peo.php\">\u000a          Anthony Gormley sculptures\u000a        <\/a>\u000a        . We ate lunch close by and walked along the South Bank and saw even more street artists.\u000a      <\/p><ul><li>A man who had his dog through a table, pretending to be a dog in a kennel.<\/li><li>Football keepy up man<\/li><li>Lots of still man statues<\/li><li>A man getting out of chains, padlocked around his body.<\/li><\/ul><p>The performers all had the same pitch as the clown earlier. There must be a book on how to capitalize from street performing.<\/p><p>We went on the swings for quite a while, went past the London Eye and the Star Wars exhibition, went across Westminster bridge and caught a bus, where Katie's apple rolled the length of the bus along the floor. From Victoria we caught the tube, where Ben was doing very well impressing you young females, before returning back to base.<\/p>","images":false},"title":{"value":"London"},"version":1},{"date":{"d":20,"m":5,"y":2007},"datev":20070520,"info":{"content":"<p>In the morning we went to church. After we drove towards Ashdown Forest to see where Winnie The Pooh lives for a picnic. It was taking a long time to get there, so we stopped at a lovely park in Edenbridge instead and had a nice picnic. We fed the ducks, played on the swings, Katie had a ride on her bike and Ben pushed his little pushchair and then we had an ice cream. It was a really nice afternoon.<\/p><p>We drove home and Katie and Ben slept all the way. Daddy was home when we got in and we were all shattered. Mummy and Katie went to pick up the rest of the Christian Aid envelopes we delivered during the week while Daddy bathed Boo.<\/p>","images":false},"title":{"value":"Edenbridge"},"version":1},{"date":{"d":19,"m":5,"y":2007},"datev":20070519,"info":{"content":"<p>In the morning Pop Pop's friend fitted a CD player into Mummy's car, so we played and went for a ride on Katie's bike around the block.<\/p><p>Joey, Lily, Auntie Ellie and Ma Ma went to see Ma Ma's horse Tikki, which Joey stroked.<\/p><p>In the afternoon Ma Ma had bought tickets for Katie and Joey to see Noddy at Canterbury theatre. We all went over there had lunch in a cafe and then Auntie Ellie, Mummy, Pop Pop, Ben and Lily walked round the shops and along the river to see the baby ducks, while the others saw Noddy. Katie loved Noddy, Joey was scared but luckily Ma Ma had bought a huge box of sweets which made him better! We all came back and Katie snuggled up with Mummy and Pop Pop and watched her favourite programme You've Been Framed.<\/p><p>Another hard evening of getting all the children to bed, Katie went to sleep, then Mummy tried to get Ben to sleep, but he wouldn't go, but woke Katie who had had a nice power nap and was roaring to go again, by which time Ben had finally nodded off! Katie then sat up with Mummy and we watched some television and ate the curry Pop Pop had bought for us. Katie loved it, finally going to sleep at 9:30!<\/p>","images":false},"title":{"value":"Noddy"},"version":1},{"date":{"d":18,"m":5,"y":2007},"datev":20070518,"images":1,"info":{"content":"<p>Mummy, Katie and Ben went to stay with Ma Ma and Pop Pop. After going to the play gym with Auntie Fiona and Thomas we went to Istead Rise. We had tea and a bath with Joey and Lily. When it was bedtime Lily stole the only cot at Ma Ma's and Ben would not go to sleep in the bed, he just kept sitting up and then Katie could not sleep and nor could Joey. It was nearly nine o'clock  before all four children were asleep and Mummy, Auntie Ellie and Pop Pop could eat dinner.<\/p><p>Meanwhile Daddy went up to Leeds for Steven's Stag weekend.<\/p><p>Friday was spent in a pool bar, the Elbow Room, Nando's and then Yates's and Oceaniana<\/p><p>Saturday, saw Leeds city centre, before moving towards Guiseley for It's A Knockout. The evening was a Pirates or Priests theme. I dressed as a dodgy Pirate! The costumes of the others were fantastic. After the Indian sit down meal we went into Revolutions then ended up in the Nu Bar.<\/p><p>Sunday was home day.<\/p><p>The highlights were...<\/p><ul><li>Nando's. Phil Rowe smashing the glass, trying to cuddle the waitress who pleaded not to say 'sorry' one more time, and Bazza's abominable language in reaction which quietened the whole restaurant!<\/li><li>Andy Tudor spotting a “mechanical ship” or as some might call it…..a car<\/li><li>Ballbag for actually looking like a vicar<\/li><li>Barrie West, for being the only man ever to wear a black shirt and trousers and STAND OUT and bringing £260 in cash for the weekend.<\/li><li>Kingster, for his well timed GET YOUR BANGER OUT comment.<\/li><li>Simon Fisher, for looking far too comfortable with his sword<\/li><li>Bunky, the campest pirate ever and his 'the bride downstairs is a bit of all right' comment.<\/li><li>Elder, for nearly killing the stag on the journey up with his entertainment system.<\/li><li>Tiller, for attempting to convince one of the hens that he was single, and that being 'engaged' still meant that he was technically single.<\/li><li>Ian Honnor (geez) for his full length dive in the penalty shootout and the subsequent claret!!<\/li><li>Barry Jenks, and his face of pure aggression in the bungee run<\/li><li>Dog, I’ve never seen a man eat a whole Subway baguette and miss his mouth with nearly all of it. And leaving his fancy dress outfit at the hotel DOH!!<\/li><li>Everyone’s pirate impressions that became increasingly like impressions of a farmer.<\/li><\/ul><p>Some cracking moments, can’t remember half of them at the moment. However, the Man of Weekend award went to none other than Phil Roe.<\/p><ul><li>You are a diabetic! Not sure how you drunk that much<\/li><li>For being pretty much the last man standing on both nights<\/li><li>For having the most outstanding fancy dress costume<\/li><li>For his outrageous penalty kick<\/li><li>For pulling of a forward flip on the dance floor in Yates (an empty dance floor)<\/li><li>For attempting and re-attempting it the next night<\/li><li>For playing pool with one hand and performing very well and you’re trick shot on the black.<\/li><li>For pulling off one of the most impressive dance moves I’ve seen for a long time<\/li><li>For drinking hot chilli sauce in Nando’s from the bottle<\/li><li>For taking a picture of that young ladies fun bags when she thought you were taking a picture of Mr Bigg and her.<\/li><li>And for getting up on Sunday at 7.30 to catch a train<\/li><\/ul><img src='images\/years\/2007\/2007_05_18-00-SteveStag.jpg' class='diaryImage' alt='Steve's Stag Weekend' \/><p class='diaryImageCaption'>Steve's Stag Weekend<\/p>","images":false},"title":{"value":"Steve's Stag Weekend - Ma Ma and Pop Pops"},"version":1},{"date":{"d":12,"m":5,"y":2007},"datev":20070512,"images":1,"info":{"content":"<p>The weather was a bit inclement so the planned day out at Battersea Park had to be postponed for another day. Instead we invited the Fars around for a birthday lunch.<\/p><p>Daddy decided to do a Lasagne and Salad, with a fruit salad for pudding. However, we had no food in the house, so whilst Mummy and Ben rested from the previous night, Daddy and Katie went shopping. What an expensive partnership!<\/p><img src='images\/years\/2007\/2007_05_12-02-FarmorBdayLunch.jpg' class='diaryImage' alt='Lunch' \/><p class='diaryImageCaption'>Lunch<\/p><p>Anyway the meal was nice and we had some nice play time and a trip down to the 'Garden Of Eden' swings.<\/p>","images":false},"title":{"value":"Farmor Birthday Lunch"},"version":1},{"date":{"d":11,"m":5,"y":2007},"datev":20070511,"first":{"name":"benjamin","value":"Sick"},"info":{"content":"<p>Ben was sick a number of times over the course of the evening and night. He cried I think because of the shock of what he had done and as it wasn't too pleasant. The sick stank! Got all over his bed, the sofa and the floor. In the 'in between' times he was right as rain and you wouldn't know any difference.<\/p>","images":false},"title":{"value":"Sickness"},"version":1},{"date":{"d":10,"m":5,"y":2007},"datev":20070510,"info":{"content":"<p>Katie was invited to Ben Stockwell's party from pre-school. There was an excellent bouncy castle in the garden but unfortunately after 20 minutes it poured down with rain and the castle was too slippery. There was lots of games inside, instead and Katie won musical islands and musical bumps which she was thrilled about.<\/p>","images":false},"title":{"value":"Ben Stockwell's Birthday Party"},"version":1},{"date":{"d":7,"m":5,"y":2007},"datev":20070507,"info":{"content":"<p>Charlotte stayed over and opened some of her presents early doors. After a strange train journey into Camberley, some of Charlotte's family came around for a spot of nibbles.<\/p>","images":false},"title":{"value":"Charlotte's 21st"},"version":1},{"date":{"d":6,"m":5,"y":2007},"datev":20070506,"info":{"content":"<p>We went to Tweeseldown to watch some show jumping. Both Ben and Katie were fascinated by the horses jumping. There was also a  mobile farm there and to mummy's amazement Katie went in the goat pen and stroked a goat all by herself. Mummy had forgotten Ben's shoes so he couldn't go in and Katie did it all by herself even if it was for half a second before she got scared and ran out again. Then we found an inflatable army assault course which Katie begged to have a go on, Mummy thought she might be too small but she was brilliant. There was things to climb over and through, she had another go and then wanted another one but it was getting too late. As we were going home Katie spotted a 'bucking bronco' which she again was desperate to have a go on. We queued up but unfortunately she was too little. It was a great afternoon.<\/p>","images":false},"title":{"value":"Tweeseldown Show Jumping"},"version":1},{"date":{"d":5,"m":5,"y":2007},"datev":20070505,"images":2,"info":{"content":"<p>We started the day by going into Gravesend for a spot of shopping and to walk along the river. It was rather dull and grey but the kiddies enjoyed seeing the boats.<\/p><p>We moved on to Cascades to play on the swings and go swimming. It was funny to see a 4.5 month pregnant lady squeezing into her swimming costume! Katie showed off her swimming skills, or as Daddy likes to call it, her underwater scramble for anything to keep her buoyant! Daddy took Ben on the long flume. Ben lasted about 5 seconds, before going through the darkened tunnel before he began to start crying. The flume sped up quite a bit and thankfully we got to the bottom with Ben seemingly not enjoying it. However, for the rest of the day, Ben mimed the slide action enthusiastically, accompanied with a wee sound signifying he did sort of enjoy it. Not sure.<\/p><p>After lunch with Charlotte we headed down to Sharon and Shwan's wedding in her local church in Sholden, Deal. It was a packed affair with the Fars, Susan and Graham in attendance. We only lasted 5 minutes in the church before we could cringe no more and get the children out. Sharon looked lovely walking down the aisle. Linda had a mixture of worryness and happiness emotions.<\/p><p>The service lasted over an hour and we managed to poke into a couple of family shots.<\/p><img src='images\/years\/2007\/2007_05_05-02-SharonShwanWedding.jpg' class='diaryImage' alt='Sharon and Shwan' \/><p class='diaryImageCaption'>Sharon and Shwan<\/p><p>We moved back into Deal and went to the British Legion hall for a fantastic morning breakfast. Graham was hearing the slide story 10 or 20 times from Ben. We also made a trip down to the beach and skimmed a few stones across the water. We stayed for a couple of dances from the live band. The kids were loving it.<\/p><img src='images\/years\/2007\/2007_05_05-27-SharonShwanWedding.jpg' class='diaryImage' alt='Ben at the Beach' \/><p class='diaryImageCaption'>Ben at the Beach<\/p><p>A really nice day and it was good to see the Dixon family.<\/p>","images":false},"title":{"value":"Sharon and Shwan's Wedding"},"version":1},{"date":{"d":30,"m":4,"y":2007},"datev":20070430,"images":1,"info":{"content":"<p>After church we all went to Fleur's birthday party at the Mytchett centre. Katie was ever so good in the games. All the traditional ones. Anyway she kept getting to the last 3 or 4 and losing out. You could see she was disappointed but she took it ever so well. Daddy was a little bit worried that both Katie and Ben didn't seem to actually interact with the other children much. They always wanted to play with Mummy and Daddy.<\/p><p>We have finally managed to tempt Katie back on to her 'big girls bike'. She has been reluctant to put her helmet on previously.<\/p><img src='images\/years\/2007\/2007_04_29-03-FleursBday.jpg' class='diaryImage' alt='Katie opening present in 'Parcel Parcel'' \/><p class='diaryImageCaption'>Katie opening present in 'Parcel Parcel'<\/p>","images":false},"title":{"value":"Fleur's Birthday Party"},"version":1},{"date":{"d":29,"m":4,"y":2007},"datev":20070429,"info":{"content":"<p>In the morning we went to see Farmor as it was her birthday during the week.<\/p><p>We went over to Fiona and Kelly's for a lunchtime BBQ which was very nice. It was good to see Helen and Nigel there to.<\/p>","images":false},"title":{"value":"Fiona and Kelly's BBQ"},"version":1},{"date":{"d":23,"m":4,"y":2007},"datev":20070423,"info":{"content":"<p>After lunch we went over to Bedfont to watch with all the other sado's aeroplanes coming into land. Ben was going ballistic for them. Shaking his arms, waving at the planes. Katie was telling us when the London (British Airways) planes were coming in.<\/p><p>We moved onto the playground at Staines where we've been a few times before. The water fountains are either going or being renovated currently which was a shame. After a go on the playground we went to get lollies and feed the ducks on the Thames. Katie with bread in one hand and a rocket lolly in the other, tossed her hand intending to give the ducks some bread. She got a bit confused and threw out the wrong arm. It went all quiet as Katie couldn't quite believe she threw her rocket into the river! As it floated away the water works were turned on full power. It didn't help that Mummy and Daddy were laughing. Anyway a replacement was bought and tears wiped away.<\/p>","images":false},"title":{"value":"Plane Spotting and The Lolly Incident"},"version":1},{"date":{"d":22,"m":4,"y":2007},"datev":20070422,"images":1,"info":{"content":"<p>At lunchtime Katie and Mummy went to Beth’s party at Farnborough Leisure Centre.<\/p><p>Meanwhile Ben and Daddy went to the Fars, where we went for a walk to feed the ducks. This tired poor Ben out and then slept for 2.5 hours!!<\/p><p>In the afternoon the Weston and Elder clan came around to play.<\/p><img src='images\/years\/2007\/2007_04_21-04a-BenFarmor.jpg' class='diaryImage' alt='Ben Feeding The Ducks With Farmor' \/><p class='diaryImageCaption'>Ben Feeding The Ducks With Farmor<\/p>","images":false},"title":{"value":"Grandparents Day and Beth’s Party"},"version":1},{"date":{"d":18,"m":4,"y":2007},"datev":20070418,"info":{"content":"<p>Daddy had to return back to work this morning from the old people’s home.<\/p><p>Farfar woke us too early, 4:30am, as he didn't set the alarm clock correctly! Anyway we drove to the airport to drop Daddy off. However, Daddy managed to check in quickly, using the machine which meant he had almost 1.5 hours to kill. Farmor suggested to go back in the car and go for a drive along the coast!!! Well how this turned into a cauldron of stress I don't know. Well I do actually. The directions that came from the native, weren't that great. In fact at one point we went around in circles and didn't know which direction we were going in. We were lost! We did finally give up and follow signs for the motorway again.<\/p><p>The plane trip was good and Daddy could see the ground on this clear day. However, Daddy landed at Gatwick late and we were all there to greet him. Well Katie and Ben's greeting was 'Where's our sweets?' Cheeky monkeys. Daddy arrived at work at 9:30, even having gone on the M25. Not too bad.<\/p><p>Katie has been asking about Oldemor.<\/p><ul><li><i>Katie<\/i>Where is Oldemor?\u000a        <\/li><li><i>Daddy\/Mummy<\/i>She is up in the sky\u000a        <\/li><li><i>Katie<\/i>How did she get there?\u000a        <\/li><li><i>Daddy\/Mummy<\/i>The angles came and took her\u000a        <\/li><li><i>Katie<\/i>When can I see her again\u000a        <\/li><\/ul><p>At which point it was getting a bit morbid, so we changed the conversation. She has asked a couple of times now about Oldemor which is touching, seeing she only seen her twice.<\/p>","images":false},"title":{"value":"Copenhagen to Knaphill: A Commute From Hell"},"version":1},{"date":{"d":17,"m":4,"y":2007},"datev":20070417,"info":{"content":"<p>Daddy went with Farmor, Farfar and Susan to Denmark for Oldemor's funeral. We stayed at the old people’s home all four of us in the same room for a couple of nights.<\/p><p>The funeral was held just around the corner in a church in Hjortospring cemetery. It was a nice sunny day. The Danish flag was at half mast. Joan, Lise and Jørgen, Inger, Frau Vest, Vera and a red cross representative attended.<\/p><p>It was a lovely service. The coffin was decorated in flowers including a very special heart one from Farmor.<\/p><p>Afterwards we went back to Oldemor's room and had coffee and nibbles. As we have not got much scope for bringing things back to England anything that is left in Oldemor’s room will go to the Red Cross. Thankfully some of the friends took some pictures and bits so at least we know where bits have gone.<\/p><p>Later in the day we went for a car trip to get out and about. We hiked across Øresundsbroen, the bridge that connects Denmark with Sweden. It was a whopping £50!! Anyway we stopped off at a small village, Vellinge for a walk around. We went into a traditional Swedish off license. Man they are super strict. You have to be let in and out of the shop. The shop assistant has to go and fetch your order as you are not trusted to pick the bottles of alcohol yourself. Super Red Tape.<\/p><p>We returned back to Denmark and headed to the southern tip of Amager and to Dragor. It was a picture postcard town with narrow cobbled streets separating the pastel yellow houses, some thatched all of different designs. We had a nice meal at the restaurant.<\/p><p>On the way back to our sleeping quatres we went through the city centre and to Marinedales Vej, where Farmor grew up. They've tarted up the place quite a bit which was nice to see.<\/p><p>We Stayed at Auntie Ellie's tonight as Daddy is still in Denmark. Uncle Michael babysat all four of us  while Mummy and Auntie Ellie went for a meal for Uncle Howard's 50th. It was a nice evening. Mummy had a lovely burger! When we got home Mummy and Katie snuggled up on the put-me-up and Ben was in the travel cot. We got up early to get Daddy from Gatwick, which Katie and Ben loved doing and spotted some big aeroplanes.<\/p>","images":false},"title":{"value":"Oldemor Funeral, Howards 50th"},"version":1},{"date":{"d":16,"m":4,"y":2007},"datev":20070416,"info":{"content":"<p>Daddy went to Denmark for Oldemor’s funeral and Mummy hates staying on her own in the house so she drove us to Gravesend to stay with Ma Ma and Pop Pop. It took us three hours to get there, stuck in horrible traffic. Katie and Ben were great though, we played every game we could think off. We had tea and a bath and then straight to bed. In the morning we left early to get to playschool.<\/p>","images":false},"title":{"value":"Daddy to Denmark, Us to Gravesend"},"version":1},{"date":{"d":15,"m":4,"y":2007},"datev":20070415,"info":{"content":"<p>After church we and a scrumptious roast pork we went over to Tilford to bask in the sunshine, look at the horses that passed by and play, play, play in the sand and river that flows through.<\/p><ul><li><i>Bens word for 'horse'<\/i>He He\u000a        <\/li><\/ul>","images":false},"title":{"value":"Tilford"},"version":1},{"date":{"d":14,"m":4,"y":2007},"datev":20070414,"info":{"content":"<p>In the afternoon we went to the canal centre at Mytchett where there was a big car boot sale and an Easter egg hunt which was good.<\/p><p>Later Ben and Daddy went to watch a yet again disappointing Chertsey performance at Ash. One player head butted another and a fight ensued.<\/p><p>Meanwhile the ladies stayed at home to watch the big horse race, the Grand National. Katie got well into it, shouting at the tele!<\/p>","images":false},"title":{"value":"Canal boats and football"},"version":1},{"date":{"d":13,"m":4,"y":2007},"datev":20070413,"info":{"content":"<p>We went into Gravesend with Ma Ma. We saw the big ships on the Thames, Ben was fascinated by the noise they made. Ma Ma bought Katie and Ben a new Pair of shoes each and a sun hat for Ben. She also bought Mummy a pair of sandals as hers got swept away in the sea last year. We went for a McDonalds and Mummy won a free cheeseburger ! In the afternoon we went to see Mummy's cousin Joanne and her two little boys Cameron and Taylor. Cameron liked Katie and gave her some big cuddles. Both Katie and Ben loved their bunk beds. They live in a big block of flats and when we arrived there Katie said \"Wow what a lot of windows Taylor has got!\" She was also surprised not to find any stairs in the flat. They all got on really well and had a lovely afternoon.<\/p>","images":false},"title":{"value":"Cameron and Taylor"},"version":1},{"date":{"d":12,"m":4,"y":2007},"datev":20070412,"info":{"content":"<p>We met Auntie Karen, Summer and Alice today and went to Swanley park. Katie went in the little paddling pool there, Ben was not so keen as the water was very cold. There was a great sand pit there and a swing park but Mummy was scared because it was so busy and she found it hard to make sure Ben didn't fall off anything while checking Katie was safe! We had a lovely picnic that Auntie Karen brought and an ice lolly. There was a few little merry - go- rounds which all the children really enjoyed. Ma Ma then met us and we caught the miniature train back to the car. We stayed the night at Ma Ma and Pop Pop's, all squashed into one bed. Well Mummy was squashed Katie and Ben had plenty of space!<\/p>","images":false},"title":{"value":"Swanley Park"},"version":1},{"date":{"d":11,"m":4,"y":2007},"datev":20070411,"info":{"content":"<p>At 1:30 in the morning, Oldemor passed away peacefully. She contracted a urine infection a couple of weeks previous and has never really recovered. Farmor went to see her last week and Oldemor didn't acknowledge or recognise her. So the news is not completely unexpected.<\/p><p>We have great comfort that she went without any pain. She reached a good age and she is now with Oldefar.<\/p><p>Katie was booked into an Easter craft session at the library with her friends Natasha, Grace and Nina. There was stories, singing and she made two bookmarks and an Easter basket filled with eggs. It was so lovely. We then went to Natasha's for lunch and an Easter egg hunt and a play in her garden. All the children had such a great time together.<\/p>","images":false},"title":{"value":"Oldemor Passes Away, Craft Morning"},"version":1},{"date":{"d":9,"m":4,"y":2007},"datev":20070409,"images":1,"info":{"content":"<p>Our recent steam train obsession meant that we headed south to Eastleigh and to the Lakeside Country Park. Another miniature railway with some nice steam engines. It was a good setup and a reasonably long track around some lakes. Ben absolutely loved it. Of course Farfar went up to the driver and started talking 'engines' with him. Not sure who is sadder Ben or Farfar!<\/p><p>We stopped off half way around to go on the swings and play hide and seek, which is Katie's favourite, even though the same hiding place was used over and over again. Sometimes Katie will play hide and seek with her dolly! She hides the dolly, then goes round like we do, saying 'Is she behind the curtains?'. Very sweet. Anyway we moved on to walk around the lakes and play Pooh sticks on one of the bridges.<\/p><p>Ben is still not speaking. He's moved on from making noises for certain things to making actions. For instance if you ask him to say 'cat', he'll scrunch his eyes for a second. So funny.<\/p><p>Anyway he demonstrated a 'cat' half way around our walk.<\/p><p>We returned back to the station and trained it back to the start. We stopped off for a lolly, before returning home for a late lunch and the weekly food shop.<\/p><p>Later in the afternoon we popped over to Farmor's again, this time for a mini Easter Egg hunt. Yep more eggs to add to the collection!<\/p><img src='images\/years\/2007\/2007_04_09-04-Lakeside.jpg' class='diaryImage' alt='Ooo Ooo' \/><p class='diaryImageCaption'>Ooo Ooo<\/p>","images":false},"title":{"value":"Lakeside Country Park and Another Easter Egg Hunt"},"version":1},{"date":{"d":8,"m":4,"y":2007},"datev":20070408,"images":2,"info":{"content":"<p>The Weston’s and Elders came over for an Easter Lunch, roast chicken. We then had an Easter hunt in the back garden. Katie was ensuring fair play and an equal bounty between all. Joey enjoyed a go on the motorbike, whilst Ben liked a good game of football  with the La La ball.<\/p><img src='images\/years\/2007\/2007_04_08-53a-EasterSunday.jpg' class='diaryImage' alt='Painting them eggs' \/><p class='diaryImageCaption'>Painting them eggs<\/p><img src='images\/years\/2007\/2007_04_08-25-EasterSunday.jpg' class='diaryImage' alt='Footballing chums' \/><p class='diaryImageCaption'>Footballing chums<\/p><p>We later went over to Great Grandma and Grandad’s house and got loads of eggs from the Barnett masses. Great Grandad was taking pictures of a baby in the travel chair thinking it was Lily, but it was a baby doll. Easter egg on face I think.<\/p>","images":false},"title":{"value":"Easter Egg Hunt"},"version":1},{"date":{"d":7,"m":4,"y":2007},"datev":20070407,"info":{"content":"<p>We went over to the Elders, first to see the trains down at the Thomas day. However, we arrived as one of the steam trains pulled out and the next was Daisy the polluting diesel! However, it was a nice day and we had a lolly pop and walked back to the Elders via the duck pond. We had a nice spot of lunch before heading off for a walk to Chawton and the home of Jane Austin. We played on the swings and pooh sticks in the stream.<\/p>","images":false},"title":{"value":"Alton and Chawton"},"version":1},{"date":{"d":5,"m":4,"y":2007},"datev":20070405,"info":{"content":"<p>We went to Oliver's for an Easter Egg hunt. Katie, Ben and Oliver ran round the garden looking for the eggs having a really good time. Mummy was so proud of Katie as every time she found more than one egg in a place she gave the other one to Oliver or Ben. Mummy is biased but she definitely thinks Katie is the best girl in the world!<\/p>","images":false},"title":{"value":"Oliver's Easter Egg Hunt"},"version":1},{"date":{"d":4,"m":4,"y":2007},"datev":20070404,"info":{"content":"<p>We drove to Bristol to take Ma Ma to Horseworld for her belated Mother's day treat. It was lovely weather and a good day out. Katie groomed a donkey, a pig and a sheep. There was a lovely indoor play area, Ben loved going on the big slide. There was a nature trail and a little horse show. We had a picnic and a lolly and Ma Ma bought Katie two horses, Ben a tractor and Mummy and herself a horse mug.<\/p>","images":false},"title":{"value":"Horse World"},"version":1},{"date":{"d":3,"m":4,"y":2007},"datev":20070403,"info":{"content":"<p>Ma Ma came to stay for a couple of Days. Today Auntie Ellie, Joey and Lily came over and we went for a walk to the swings and to feed the fish. In the afternoon we popped to Camberley and then To Great Grandma and Granddad’s.<\/p>","images":false},"title":{"value":"Ma Ma staying"},"version":1},{"date":{"d":1,"m":4,"y":2007},"datev":20070401,"info":{"content":"<p>We went to Frimley Lodge Park with Farfar, Karen and Richard to go on the miniature steam train.<\/p>","images":false},"title":{"value":"More Steam Trains"},"version":1},{"date":{"d":31,"m":3,"y":2007},"datev":20070331,"images":2,"info":{"content":"<p>\u000a        We had an early start on this sunny day. We circled around the M25 to Leyton and visited an inner city farm,\u000a        <a href=\"http:\/\/www.lbwf.gov.uk\/index\/leisure\/childrens-activities\/brooks-farm-leyton.htm\">\u000a          Brooks Farm\u000a        <\/a>\u000a        . Before entering we went on a playground which was a bit different. There were monkey and parrot swings and this wicked roundabout which Daddy spun as quickly as he could. 'Again, again' from both Ben and Katie. I think they preferred to stay there rather than go in the farm.\u000a      <\/p><p>The farm was being tended to by local children. Real EastEnders! There were goats, chickens, horses and even a Farfar (oink, oink). We managed to buy some eggs once the 15year old had finished her fag!<\/p><p>\u000a        We travelled south down to Stratford where we went into a place called\u000a        <a href=\"http:\/\/www.discover.org.uk\/index.php\">\u000a          Discover For Children\u000a        <\/a>\u000a        . We didn't quite know what to expect, it was an 'experience' for children. Anyway it was a fun place, where there were stepping stones which played cool sounds, a craft area, a story telling area. Katie sang twinkle, twinkle little star, which was recorded and played for all to hear. There were dens, a video wall and mirrors to draw on.\u000a      <\/p><p>We spent well over an hour in there before Mummy whisked us out into the sunshine and the adjoining playground. Katie took Ben on the slide!<\/p><img src='images\/years\/2007\/2007_03_31-23a-StratfordLeyton-KatieBen.jpg' class='diaryImage' alt='Slippery Slide' \/><p class='diaryImageCaption'>Slippery Slide<\/p><p>We then caught the Docklands Railway to see some big building at Canary Wharf. Ben and Katie loved waiting at Stratford station watching mainline trains and underground trains go by. All the characters from Underground Ernie were mentioned.<\/p><p>Half way through our journey about half a dozen, real EastEnders sat around us. One with a pit-bull. The language was pretty fowl, even with their best efforts to avoid bad language. 'Careful there's two babies next to ya'. Mummy and Daddy laughed and thought it was quite sweet that they at least tried.<\/p><p>We got off at Canary Wharf, an impressive station. 'Daddy, you love your buildings don't you?'. We could eat her up sometimes. We walked around all the tall buildings, seeing if we could see the tops of them.<\/p><img src='images\/years\/2007\/2007_03_31-31-StratfordLeyton-KatieBen.jpg' class='diaryImage' alt='All the tall buildings' \/><p class='diaryImageCaption'>All the tall buildings<\/p><p>Ben's love for buses meant we had to go back on the D8. We went in the wrong direction at first, but finally got the right bus back to Stratford. Katie was appalled at all the litter and the writing on the seat of the bus. 'People are naughty. Naughty, naughty, naughty. We're not naughty are we Daddy?'. I think Katie pointed every bit of litter out on the streets of the east end. It had sent Ben to sleep.<\/p><p>We returned home by driving through central London, seeing the London Eye and Big Ben! Katie stopped for a wee wee outside a posh hotel in Knightsbridge before returning home for You've Been Framed!<\/p>","images":false},"title":{"value":"Brooks Farm, Discover Centre, Canary Wharf"},"version":1},{"date":{"d":30,"m":3,"y":2007},"datev":20070330,"info":{"content":"<p>Katie had her Easter Party at playschool today. They played games and had lots of food. Katie had to go in Fancy dress, Mummy tried to persuade Katie to wear a different costume than the Princess Aurora dress that Katie wore to World book dress up day, but Katie's mind could not be swayed . She did look beautiful and most of the girls were princesses. One was an Easter egg which looked great.<\/p>","images":false},"title":{"value":"Playschool Easter Party"},"version":1},{"date":{"d":29,"m":3,"y":2007},"datev":20070329,"info":{"content":"<p>After Katie had put her foot down the toilet - goodness only knows why, Mummy went to help out for the morning at Katie's pre-school. It was great. Katie wouldn't let any other children play with her Mummy though, but it was great to see what Katie does there. She is so good and listens to the stories and joins in all the songs. Mummy was so proud of her. Katie made an Easter cake and did a little egg hunt, We had great fun together.<\/p><p>Meanwhile the boys went off to do 'man' things. B and Q first stop. Get some sand for the sandpit, look at BBQs and hooks and flowers! Ben loved going in the trolley. He was chillin' in there.<\/p><p>Next stop Longacre, then onto to see Farmor at her school. Ben managed to play in the hall and even go on one of the musical instruments.<\/p><p>Tiring work, Ben had a kip as we went over to pick Mummy and Katie up. After lunch we went over to Oliver’s to play, then onto ballet.<\/p><p>In the evening Daddy went over to Reading to watch the PDC darts league with the boys. Noticed everyone slowing down in the drinking stakes these days. Even Nick. Finally got home at midnight.<\/p>","images":false},"title":{"value":"Mummy to playschool, PDC Darts"},"version":1},{"date":{"d":28,"m":3,"y":2007},"datev":20070328,"images":1,"info":{"content":"<p>In the afternoon we headed to Alresford to see Farfar go on the Steam Train Experience. He was in the cab with two other novices and two teachers. It took about 45 minutes to be shown the ropes. Katie managed to go in the cab, but she was a bit scared I think of the 5 boiler suited strangers looking down at her reaction to being wowed in a steam train.<\/p><p>Farfar was in control for the first run and eventually they pulled out of the station towards Medstead. Ben liked looking at the train. I think he will be a train spotter before too long.<\/p><img src='images\/years\/2007\/2007_03_28-04-Alresford.jpg' class='diaryImage' alt='Farfar driving a steam train' \/><p class='diaryImageCaption'>Farfar driving a steam train<\/p><p>Whilst Farfar was travelling along, Ellie, Joseph, Lilly and the rest of us went along the Millennium trail around Alresford. There was a gorgeous looking thatched roof house that bridged the river. Lovely.<\/p><p>We returned to the station. However, Farfar had not returned. We went off to Ellie's for a cup of tea and to mess her house up!<\/p><p>In the evening Daddy watched a pitiful England performance against Andorra. It was the first in the series of the Apprentice also!<\/p>","images":false},"title":{"value":"Farfar’s Steam Train"},"version":1},{"date":{"d":25,"m":3,"y":2007},"datev":20070325,"images":1,"info":{"content":"<p>It was Sophia's christening at St Andrews church. It was a nice service, so Mummy says. Daddy was on crèche duty. We then went to Sophia and Oliver's house for food.<\/p><img src='images\/years\/2007\/2007_03_25-17.jpg' class='diaryImage' alt='The Odd Balls' \/><p class='diaryImageCaption'>The Odd Balls<\/p><p>Earlier in the week Katie answered the phone:-<\/p><ul><li><i>Katie<\/i>Hello\u000a        <\/li><li><i>Sarah<\/i>Hi Katie, it's Sarah here\u000a        <\/li><li><i>Katie<\/i>No, Sarah's not here\u000a        <\/li><li><i>Sarah<\/i>No, it's Sarah here\u000a        <\/li><li><i>Katie<\/i>Mummy, Sarah's not here is she?......\u000a        <\/li><\/ul>","images":false},"title":{"value":"Sophia's Christening"},"version":1},{"date":{"d":24,"m":3,"y":2007},"datev":20070324,"images":1,"info":{"content":"<p>We headed coast bound to sunny Bournemouth. We popped into Charlotte's place in Winton for a bacon sandwich. Reminds mummy and daddy of student days gone past. Typical student house.<\/p><p>We parked at the top of the hill and walked down to the pier with our buckets and spades. We attempted to make a sand car, but Katie quite rightly said it wasn't as good as Karen and Richard's effort from last year!<\/p><p>We didn't dare go too close to the water after last times drenching accident! Katie and for the first time Ben, went trampolining. Trying to keep Ben on the one apparatus was pretty hard work. However, his funny walks and laughter was worth the trip alone.<\/p><p>We headed into town where Daddy surfed the surf shops and Katie treating us to some chips and later a lolly.<\/p><img src='images\/years\/2007\/2007_03_24-06-Bournemouth.jpg' class='diaryImage' alt='Beach crew' \/><p class='diaryImageCaption'>Beach crew<\/p>","images":false},"title":{"value":"Bournemouth"},"version":1},{"date":{"d":21,"m":3,"y":2007},"datev":20070321,"first":{"name":"katie","value":"Chicken Pox"},"info":{"content":"<p>Katie has developed chicken pox but not has had it half as bad as Ben has. Still she let us all know that she was itchy :)<\/p>","images":false},"title":{"value":"Bout of Chicken Pox"},"version":1},{"date":{"d":18,"m":3,"y":2007},"datev":20070318,"info":{"content":"<p>Ben and Katie got mummy a pose of flowers each and a double decker chocolate bar. Katie managed to write her name in a card. It wasn't too comprehendible unless you were shown what she was trying to do.<\/p><p>After church we popped over to the Fars for a cup of tea and the mess the place up. We told them the news of Mummy being pregnant. They were very happy.<\/p><p>At lunchtime we went to The Surrey, St John’s where we joined the Weston and Elders and had sausage and chips. There was a nice play area outside where we got Daddy, Uncle Michael and  Joey out to play as well. Katie liked jumping off one of the platforms.<\/p><p>Poor Lilly looked worse than Ben with her spots. She was in good form though. It was nice to play with Ma Ma also.<\/p><p>Katie is addicted to the CBeebies website at the moment. She is getting very good at the glide pad. Show enjoys quite a few games. She hates games that has a timer that ticks down. She is always very proud at her achievements.<\/p>","images":false},"title":{"value":"Mothers Day"},"version":1},{"date":{"d":17,"m":3,"y":2007},"datev":20070317,"images":2,"info":{"content":"<p>Ben is into his third day of chicken pox which he caught a week or so earlier from Joey. Poor little might has not been sleeping well at night, been off his food, clingy to mummy and been a bit itchy. However, other than that he has long spells where you wouldn't know any different.<\/p><img src='images\/years\/2007\/2007_03_17-12-Ben.jpg' class='diaryImage' alt='Chicken Pox Ben' \/><p class='diaryImageCaption'>Chicken Pox Ben<\/p><img src='images\/years\/2007\/2007_03_21-KatieBenNursing.jpg' class='diaryImage' alt='Katie looking after Ben' \/><p class='diaryImageCaption'>Katie looking after Ben<\/p><p>In the morning we ran some errands and Daddy took Katie to the army swing park. We completed the assault course without the crocodiles getting us.<\/p><p>In the afternoon we went plane spotting as when we came back past Heathrow last week Katie and Ben loved watching the planes coming into land. We parked up and joined the other 'Normans'. Katie got into to so much she started taking down the nationalities of each of the planes. She can name a few countries now from it!<\/p><p>Ben has developed a few cute noises to signify things he wants:<\/p><ul><li><i>Woo Ooo<\/i>train\u000a        <\/li><li><i>rarrrr<\/i>Lion\u000a        <\/li><li><i>-snor sounds-<\/i>I want to go to sleep\u000a        <\/li><li><i>-clicking noise-<\/i>I want some food\u000a        <\/li><\/ul>","images":false},"title":{"value":"Chicken Pox and Plane Spotting"},"version":1},{"date":{"d":15,"m":3,"y":2007},"datev":20070315,"info":{"content":"<p>All the mummy’s were invited into Katie's playschool to watch the children sing some songs for Mother's day. There was three songs about spring which were excellent and one about being good for our Mummy's. Mummy managed to get a seat right at the front and right opposite Katie and it was wonderful. Katie sang all the songs and was really good. Then each child had to take their Mummy's to see the painting they had drew of them. Katie had painted me big and orange with a green face and what mummy thought was green hair but Katie said was actually a green hat. Then Katie gave Mummy some daffodils and a lovely card she had made. What a nice morning!<\/p>","images":false},"title":{"value":"Mother's Day song"},"version":1},{"date":{"d":12,"m":3,"y":2007},"datev":20070312,"info":{"content":"<p>We finally found out that Katie has landed a place at Heather Ridge school. Daddy started there only 27 years ago! Hopefully he can dig the old uniform out to save a bit of money :)<\/p>","images":false},"title":{"value":"Katie gets Heather Ridge"},"version":1},{"date":{"d":11,"m":3,"y":2007},"datev":20070311,"info":{"content":"<p>The first shorts and t-shirts day of the year. After church and Sunday roast, we headed up to Hyde Park and the pirate playground. A very busy playground.<\/p><p>We tried climbing the mast on the pirate ship but there was just too many people. We tried some of the less favoured playground apparatus. Ben and Katie loved the spinning bowl.<\/p><p>We walked to the boating lake, had an ice lolly and Katie and Daddy braved the cold stream at Princess Diana's memorial.<\/p><p>We continued in a loop passed some fountains and finally back to the car.<\/p>","images":false},"title":{"value":"Hyde Park"},"version":1},{"date":{"d":10,"m":3,"y":2007},"datev":20070310,"info":{"content":"<p>Mummy and Katie had a girlie trip to the N.C.T sale with Auntie Caroline and Sarah. We bought lots of clothes for Katie, ready for the summer and we bought some new puzzles and games. We also bought Ben some motorbikes.<\/p><p>Daddy and Ben continued their trek northwards from Harefield. The paths were reasonably muddy. We passed many boats, which Ben told Daddy of each instance... \"Ba Ba\". Still not sure if he enjoys it or not as he sits quite silent after the initial 10 minutes.<\/p><p>We passed some beautiful scenery. Rolling hills with horses, quaint 'lock' cottages and Grove Park, a nice looking mansion with a golf course surrounding it. This is where we ended our journey and turned back for the car.<\/p><p>On the way home on the M25 I noticed the mountain bike was hanging vertically and swinging from side to side! I quick pulled over and put the bike back properly on the rack. Not too sure how close we were to dropping the bike on the motorway.<\/p>","images":false},"title":{"value":"Grand Union Canal - Harefield to Watford and Toy Sale"},"version":1},{"date":{"d":7,"m":3,"y":2007},"datev":20070307,"info":{"content":"<p>Mummy went to see Auntie Karen's brand new baby Alice but Katie and Ben had to Stay with Ma Ma and Pop Pop as we have been in contact with Joey who has Chicken Pox at the moment. We had a great time though and kept Ma Ma and Pop Pop busy. They gave us a lovely bath and a nice dinner.<\/p>","images":false},"title":{"value":"Alice Teale born"},"version":1},{"date":{"d":6,"m":3,"y":2007},"datev":20070306,"info":{"content":"<p>We had an appointment to see the doctor at Frimley Park. All went well.<\/p>","images":false},"title":{"value":"Hospital Appointment"},"version":1},{"date":{"d":4,"m":3,"y":2007},"datev":20070304,"info":{"content":"<p>After church we went to the Fars for Sunday lunch. Ben and Katie were on good form. They sat up to the table nicely and actually ate their food properly. The meal was interrupted with a big 'Parda' from Ben. He took it in his stride though and tried to get away with it as if nothing had happened. They managed to make lots of mess!<\/p>","images":false},"title":{"value":"Sunday Lunch to the Fars"},"version":1},{"date":{"d":3,"m":3,"y":2007},"datev":20070303,"images":1,"info":{"content":"<p>At the last minute we re-arranged to go to the zoo today. We saw loads of animals. Our favourites were the lions who were lazy bones, but did prowl around a bit. We were the width of the glass away from them. They are massive creatures. We saw the tigers being fed. The alligator who was dozing in the water, sprung out and quickly ran towards us. We were a bit scared. Lucky it was behind the glass. At lunchtime we stopped and played on the adventure playground. We climbed this really high scramble nets. Benny's boots fell off!<\/p><p>It was lunchtime for the elephants as well and Daddy fed them some carrots and cabbage. Their trunk is very rough, it was a funny feeling when they came to take the food from Daddy's hand.<\/p><img src='images\/years\/2007\/2007_03_03-06a-ColchesterZoo.jpg' class='diaryImage' alt='Ben wobbling over the crocs!' \/><p class='diaryImageCaption'>Ben wobbling over the crocs!<\/p><p>Katie enjoyed the Rhino's who were in a very muddy field. We also went in the water tunnel and saw the sea lions swimming all around us. We ended with a train ride through the zoo which was nice as we could rest our legs.<\/p>","images":false},"title":{"value":"Colchester Zoo"},"version":1},{"date":{"d":25,"m":2,"y":2007},"datev":20070225,"info":{"content":"<p>Daddy made Sunday lunch for Karen and Richard, who have also just returned from holiday skiing. We all played hide and seek, sardines and pairs. What a laugh. I think Auntie Karen is just a big kid!<\/p><p>Katie ate too many doc doc's and felt a little dickie late in the afternoon.<\/p>","images":false},"title":{"value":"Karen and Richard for Sunday Lunch"},"version":1},{"date":{"d":24,"m":2,"y":2007},"datev":20070224,"info":{"content":"<p>Auntie Susan and Uncle Graham finally got engaged this week. They also have managed to agree the sale of their house as well as find a place just around the corner from where they are now. They came around and saw us running around frantically. I think we put Graham off having children for life!<\/p><p>Ma Ma and Pop Pop also made an appearance and told us about their recent holiday in Canada.<\/p>","images":false},"title":{"value":"Engaged Susan and the Weston’s"},"version":1},{"date":{"d":19,"m":2,"y":2007},"datev":20070219,"info":{"content":"<p>Pop Pop had a day off from work, so Mummy, Katie and Ben went to spend the day with him. We went and saw Ma Ma at school, and all the children loved us, we also went for a walk with the pushchairs and helped Pop Pop spend lots of money doing his shopping. We watched their holiday video and broke two of Ma Ma's favourite china horses! What a busy day.<\/p>","images":false},"title":{"value":"Day out with Pop"},"version":1},{"date":{"d":18,"m":2,"y":2007},"datev":20070218,"images":1,"info":{"content":"<p>Early in the morning Ben fell down three of our stairs and bumped his head into the stair-gate. What a bump! A big egg rose immediately. The standard reactions: Mummy panicking, stressing and shouting. Daddy laid back and not getting too involved. Mummy was paranoid enough to go down to A and E. Daddy took Katie out for a bike ride in the meantime. Mummy rushed back, having not seen a doctor because we had to go and pick Ma Ma and Pop Pop from Heathrow. They had returned from a lovely holiday in Canada. We loved to see all the big planes coming almost on top of us.<\/p><p>\u000a        After Sunday lunch we smoozed down to<a href=\"http:\/\/www.millersark.co.uk\/\">Roke Farm<\/a>near Odiham. There was a busy open day with lots of animals to mingle with. Ben was almost brave enough to feed some sheep. They both were able to stroke, pat and poke the animals. It was fun getting in with the pigs, seeing the tiny lambs and hearing the cows mooo. Ellie, Joey and the Fars accompanied us around the farm. It was good fun.\u000a      <\/p><img src='images\/years\/2007\/2007_02_18-05-RokeFarm.jpg' class='diaryImage' alt='Farfar and Katie enjoying themselves at the farm' \/><p class='diaryImageCaption'>Farfar and Katie enjoying themselves at the farm<\/p>","images":false},"title":{"value":"Hospitals , Airports and a little farm"},"version":1},{"date":{"d":17,"m":2,"y":2007},"datev":20070217,"info":{"content":"<p>In the morning we went back to the Camberley Obelisk for a walk around and a go on the playground. We also went to get Mummy's valentine present, a pair of pyjamas. We got Katie a pair as well. We made our trips to the bakers and butchers<\/p><p>The afternoon was split into boys and girls. Mummy, Katie and Natasha went to see Charlotte's Web at the cinema. Katie enjoyed it, although was a bit naughty during the film as she chatted to Natasha. Meanwhile Daddy and Ben went to Wembley to see Chertsey lose 2-0. Not that Ben would know. He had severe conjunctivitis and a bout of putting the stand seats up and down, up and down!! He enjoyed himself and entertained the Chertsey supporters (as the players weren't doing it!).<\/p>","images":false},"title":{"value":"Girls to Cinema, Boys to Football"},"version":1},{"date":{"d":12,"m":2,"y":2007},"datev":20070212,"info":{"content":"<p>The last part of my trip was good. There was a bit of snow in the air, but I missed my family.<\/p><p>I wasn't expecting to picked up in departures, so it was a lovely surprise to see Katie and Ben running towards me all excited in their pyjamas! They were as pleased to see me as I was them. It brought a tear to my eye.<\/p><p>Then Laura paid for the parking, then forgot to take the ticket! So we were stuck in Gatwick's car park. I wasn't paying £30 \/ £40 \/ £50. So I scouted an escape route which involved reversing down a busy one way area, going up the curb and onto some paving. Finally had to cross on to the main ring road across another curb. Fearing from being beached, I managed to find a gap in some bollards up the road, and a few beeps later we were free!<\/p>","images":false},"title":{"value":"Return from Denmark"},"version":1},{"date":{"d":11,"m":2,"y":2007},"datev":20070211,"images":1,"info":{"content":"<p>A late riser this morning. Oldemor isn't usually too great in the mornings and today was no different. She gets a bit short and feisty with all of us, including the other in-mates. Could barely get a decent word from her.<\/p><p>We left her for lunch, as we went off to Fredericksberg for swimming. It was extremely cold, snow in the air. The pool didn't seem to be much warmer! Such a common activity, but so differently done in Denmark. Cleanliness and nudity seem order of the day.<\/p><p>After a sauna, pølser and a chocolate, we returned to the home to find Oldemor in a much better mood. Such a relief. Farmor left for a bit leaving me to have a nice chat on my own with Oldemor. I remarked how clever she was for knitting. She even had a go on the computer! Oldemor thought I looked 40!<\/p><img src='images\/years\/2007\/2007_02_12-09-DaddyInDenmark.jpg' class='diaryImage' alt='Oldemor and Farmor In Confab' \/><p class='diaryImageCaption'>Oldemor and Farmor In Confab<\/p><p>We went to church then Auntie Charlotte came back very tired and we went to look for some marbles for Katie in Camberley. Every time Katie sleeps through the night she is going to put a marble in the jar and when she gets ten we are going to the zoo. Katie is waking up every hour in the night at the moment and is then so tired during the day. She says there is bears in her room.<\/p>","images":false},"title":{"value":"From minus 2 to 50 degrees - Charlotte To Stay"},"version":1},{"date":{"d":10,"m":2,"y":2007},"datev":20070210,"info":{"content":"<p>6am and the Fars are waiting outside for Daddy who is still asleep in bed! Martin, you're parents are waiting outside. Arrgghh. Got to pack toiletries, get dressed, put laptop into bag, batteries, take out razor, oh and find passport! Oh well we made it to Gatwick in time and the check in process all went quite smoothly. Not much queuing at all.<\/p><p>Daddy and Farmor were going to see Oldemor to help celebrate her 90th birthday. It was a cloudy day so grabbing a window seat only proved an advantage for about 20 seconds before we were immersed in cotton wool. The plane was just half full. Farmor had sneaked on a cheese sandwich to eat as we weren't going to pay extortionate prices for 'cardboard and fruit'.<\/p><p>Arriving at the airport we stepped out to a fine, sunny day. We made our way to Kongens Nytorv and the classy Magasin department store. We reached the top floor, secured a window seat and watched over the circulating ice skaters as we delicately scoffed smorbrød and a tiny øl (well a pint of Tuborg).<\/p><p>We Metro’ed, trained and bussed our way to see Oldemor at her home about 10 miles outside Copenhagen.<\/p><p>Oldemor was in fine spirits and sat chirping away. She still appears vacant at times, but the pleasing thing is that she still has a sense of humour and is well. The same revolving, small talk questions were answered in the same patient manner. Oldemor's daily schedule is, breakfast, then a midday lunch, followed by a sleep from 1pm to 3pm, then dinner at 6pm and bedtime at 7 or 8 o'clock. She has a number of pills, one for sedation, another for her heart and a number of vitamin and iron supplements.<\/p><p>It was nice for the 3 of us to sit together in her front room decorated with pictures of the English contingent and her old furniture. We had some coffee and of course Oldemor was dishing out the sweets and taking a few for herself. We read and chatted until 6pm when it was 'liver stew' time. :(<\/p><p>Farmor and Daddy joined in with this meal. It was pretty quiet amongst the 15 or so inmates. Some seemed very able to get about and knew what they were doing. The 100 year old looked remarkable and was helping some of her younger comrades from their seats. There was a married couple both in wheelchairs which was very sweet. Somehow I can't imagine Laura and I ever being in a home together in later years. I think we will have argued ourselves to our coffins before we get to that stage!<\/p><p>Wishing Oldemor a good night, Farmor and Daddy went off to the city centre to 'paint the town red'. Rip it up so to speak. Well it was blooming cold, at -3 degrees, with a stiff wind. After exploring the cinema we decided to head for a bar and have an expensive drink. It still amazes me how quiet the city is. Where is everyone? What are they doing? We returned home to have some pastries and a catch up of the news on BBC World, before settling down to the World Service for the night!<\/p><p>Daddy went to Denmark so Auntie Charlotte came to stay as mummy doesn't like being on her own in the house. We went to Poppy's birthday party at Fizzy Kids then on to see Great Grandma and Grandad. In the evening Auntie Charlotte had a party so we went to stay at Auntie Ellie's. We all had a great time. Pizza for tea, then a play and then all in the bath together (not Lilly though). Mummy put Katie and Ben to bed in Auntie Ellie's bed but when she went to get Ben to put him in the travel cot she couldn't find him in the bed or on the floor. She panicked of course but found him snuggled up asleep in the corner of the bedroom, Mummy doesn't know how he got there! Mummy and Katie slept on the put me up.<\/p>","images":false},"title":{"value":"Daddy To Denmark"},"version":1},{"date":{"d":4,"m":2,"y":2007},"datev":20070204,"info":{"content":"<p>We met Ma Ma and Pop Pop at Woking swimming pool with the Elder clan. We had a lovely time and then the Elders came back to our house for some birthday cake. Uncle Howard came over too.<\/p>","images":false},"title":{"value":"Joeys second party"},"version":1},{"date":{"d":3,"m":2,"y":2007},"datev":20070203,"info":{"content":"<p>In the morning we went Joey's 2nd birthday celebration which was jointly held with a girl born on the same day, Isabella. It was held in a function room at the country market near Frensham. There was lots of space and toys to play with. About 20 kids played 'parcel parcel' (as Katie calls it). A lovely buffet and a trip at the end to the adjoining fish shop. Live fish, which Katie, Ben and Joey all enjoyed.<\/p><p>We then rushed over to Freya's party which was being hosted at Wizzy World. Ben and Katie loved playing in the cage. We had another game of pass the parcel and musical bumps. By the end of the day I think the children were worn out... not to mention the parents! We ended the day by watching out favourite 'You’ve Been Framed'.<\/p>","images":false},"title":{"value":"Joey's and Freya's Birthday Parties"},"version":1},{"date":{"d":28,"m":1,"y":2007},"datev":20070128,"info":{"content":"<ul><li><i>Katie At Ma Ma and Pop Pop<\/i>Ma Ma and Pop got up early because Ma Ma's next door neighbours came in to fix the tank. I read loads of books with Ma Ma and then we went to church. I did some colouring and things at the back. After a lovely lunch we drove back home and I was reunited with my darling mummy, daddy and Bennyboo.  (Thanks to Ma Ma and Pop Pop for this entry)\u000a        <\/li><\/ul><p>In the afternoon Katie arrived back at home with Ma Ma and Pop Pop staying for a cup of tea. Later in the afternoon the Fars came around and were at the end of Katie's and Ben's exuberance.<\/p>","images":false},"title":{"value":"Grandparents Day"},"version":1},{"date":{"d":27,"m":1,"y":2007},"datev":20070127,"images":1,"info":{"content":"<p>In the morning PC Flint came around to take a statement and I asked whether Daddy wished to press charges against the kids who stole our MP3 player from the letter box. The delivery firm posted the package only half way through the letterbox and these known criminals just took it out. Luckily there was a witness.<\/p><p>Ma Ma and Pop Pop took our baby away for the weekend :( Wow. I think it is the first time she has spent a night away from us. Katie was not phased at all. In fact she was looking forward to it all week and when Mummy and Daddy teased her about coming to, she was quite adamant that they were not allowed to go! Makes us feel really loved and wanted! It would be a good experience for her to be away from Mummy especially. Independence and all that.<\/p><img src='images\/years\/2007\/2007_01_27-01-KatieLeavingHome.jpg' class='diaryImage' alt='Katie Away For The Weekend' \/><p class='diaryImageCaption'>Katie Away For The Weekend<\/p><ul><li><i>Katie At Ma Ma and Pop Pop<\/i>Left Mummy and Bennyboo at The Star and went off with Ma Ma and Pop Pop to Godstone Farm Park. Was a little shy to begin with but soon settled in and started to have fun. The farm was great and I saw rabbits, guinea pigs, goats, sheep, cows, mice, chickens, llamas, and a large pig (Ma Ma was surprised when I called him Far Far - but I was only joking).\u000a        <\/li><li>Next we went to have something to eat - Ma Ma had a coffee (which was naughty because she is off caffeine at the moment) and Pop Pop had a tea. I had a lolly which was lovely. Next we headed for the play barn. The best bit of all was the little caravan which Ma Ma and I played in for absolutely ages. We loved it and we want someone to make me one for my garden!!!! Ma Ma would not come on the softplay because she had a skirt on (so what I ask?) I think she was silly to wear a skirt anyway. Soon it was time to leave and we set off for Pop Pop's favourite place on earth - Bluewater.<\/li><li>As we arrived I gave Ma Ma a sly look and said \"Can I have another pair of shoes?\" (Last time we came I got a pair) Of course she said yes, as I knew she would. However, once inside the Mall I spotted some fantastic balloons. I couldn't believe it because when I asked if I could have one Ma Ma said it had to be either the shoes OR the balloon - I ask you how mean is that! Anyway I chose the balloon.<\/li><li>We had a spot of lunch (I had crisps hee hee) and then went down to the stable where Ma Ma rides each week. Tikki is lovely and I got to ride her round the stable yard with Ma Ma. I was so brave I even brushed her. While Ma Ma rode, Pop Pop and I went To Toys R Us  where I played with all the toys (what a surprise!). Once we were back at Ma Ma and Pop Pop's we played loads of games and had tea (sausages and baked beans for me - yum) and then after watching \"You've Been framed\" and reading a few books I went to bed. Ma Ma said I was a real fidget but I don't believe her!  (Thanks to Ma Ma and Pop Pop for this entry)<\/li><\/ul><p>\u000a        Meanwhile, Mummy and Daddy took Benny out for a nice go on the playground and for a walk up to\u000a        <a href=\"http:\/\/www.surreyheath.gov.uk\/leisure\/LeisureActivitiesinSurreyHeath\/obelisk.htm\">\u000a          Camberley Obelisk\u000a        <\/a>\u000a        . It has quite a history behind it, but it has seen better days. Anyway Ben really enjoyed the attention from both parents. He loved walking up the hill and going on the swings. It was so, so much easier and quieter handling just one of our offspring and we had the energy and time to muck around with him properly. What a difference there is between having one and two children to look after. Before Katie gets upset, we of course missed her very much, although when asked whether she wanted to ring us up in the evening apparently she responded with 'no, I'll do it later.' Charming!\u000a      <\/p>","images":false},"title":{"value":"Police Statement, Katie Away For Weekend, Camberley Obelisk"},"version":1},{"date":{"d":25,"m":1,"y":2007},"datev":20070125,"info":{"content":"<p>Katie had her first ballet lesson today, she was so excited even though I don't think she even knows what ballet is. Katie really enjoyed it skipping and marching around the room and pretending to be a butterfly. She went with her friend Poppy. She is desperate for some ballet shoes now, which hopefully we can buy next week.<\/p>","images":false},"title":{"value":"Katie Ballet Lesson"},"version":1},{"date":{"d":24,"m":1,"y":2007},"datev":20070124,"images":1,"info":{"content":"<p>We woke up to snow this morning which was a surprise to us all. Katie and Ben were really excited. We made a snowman and threw a few snowballs in the back garden.<\/p><p>After Daddy went to work we went to Frimley Green hill and went sledging. Katie had no fear going down. Ben wanted to be on his own<\/p><img src='images\/years\/2007\/2007_01_24-04-KatieBenSnow.jpg' class='diaryImage' alt='Katie sledging' \/><p class='diaryImageCaption'>Katie sledging<\/p>","images":false},"title":{"value":"Let it snow, let it snow, let it snow"},"version":1},{"date":{"d":20,"m":1,"y":2007},"datev":20070120,"images":2,"info":{"content":"<p>Illness struck the household this week. Mummy felt a bit sicky and coldy, as did Katie and Ben to a lesser extent. So lots of early nights.<\/p><p>Daddy has also had a bit of a rollercoaster ride at his new work. His new 'project' requires knowledge in a number of new areas. Kind of building blocks.<\/p><ul><li>VB.NET<\/li><li>ASP.NET 2<\/li><li>Telerik Controls (+dynamic creation and AJAX support)<\/li><\/ul><p>\u000a        The VB.NET I believe I have picked up enough quite quickly. Got used to the syntax. The thing is to get into the supported classes and features that are thrown in. ASP.NET has had a number of significant jumps since the original version which I last looked at. So much richer in terms of controls and structure. Then\u000a        <a href=\"http:\/\/www.telerik.com\">\u000a          Telerik\u000a        <\/a>\u000a        , which is a 3rd party provider of ASP.NET 2 controls which allows you to design website that look more like a normal windows app. At the beginning of the week I was finding a number of concepts and combination hard to grasp. However, after a bit more playing and reading all is a bit clearer now, and my boss reviewed my progress and was happy enough with it. Phew. I was doubting myself as a software engineer for a while. Still got to work hard at it though. If it all comes off it will be very rewarding for me, using the latest technologies competently.\u000a      <\/p><p>It was a cold crisp January day. Last minute, we decided to go and visit Bournemouth. Ben and Katie rather optimistically took their buckets and spades. We parked at the top of the cliffs and walked down to the beach area. We could see pipes all along the beach. Weird. Perhaps it's the Russians extending their oil pipeline!<\/p><img src='images\/years\/2007\/2007_01_20-02-Bournemouth.jpg' class='diaryImage' alt='Katie admiring the pipes' \/><p class='diaryImageCaption'>Katie admiring the pipes<\/p><p>The pier was also shut so we wandered into the busy town and looked for some new work clothes and shoes for Daddy. A bit of a culture shock as CNL require smart-casual dress rather than casual!<\/p><p>After our picnic we went back to the beach to dig holes and build sand castles and try and cover up the leaks from the pipes.<\/p><p>We all went to throw stones into the sea. Unfortunately the tide was coming in and Benny is not quite that quick on his feet. The tide came rushing in, Benny turned, fell on his bum and then got a very wet bottom! Oh dear. We all had a laugh and Ben was marched back to the car to get changed whilst Daddy and Katie played in the sand and on the pipes.<\/p><img src='images\/years\/2007\/2007_01_20-11-Bournemouth.jpg' class='diaryImage' alt='Danger, Danger, Danger. Explosives!!' \/><p class='diaryImageCaption'>Danger, Danger, Danger. Explosives!!<\/p><p>We went back via the zig-zag to the car and popped in to the Elders for a cup of tea and to see Joey's green paint explosion!<\/p>","images":false},"title":{"value":"Bournemouth Pipes"},"version":1},{"date":{"d":15,"m":1,"y":2007},"datev":20070115,"info":{"content":"<p>Today Caroline and Henry rang up and wondered if we fancied going to Farnborough ten pin bowling. We had a whale of a time there. Katie got a strike and a spare and wore special shoes and a pink 6lb ball. Ben also managed a couple of goes as well.<\/p><p>There was a group of special needs people there which Katie noticed and didn't say anything about at the time. 10 hours later at bed time she asked<\/p><ul><li><i>Katie<\/i>Why did that lady have big cheeks?\u000a        <\/li><li><i>Mummy<\/i>Which lady?\u000a        <\/li><li><i>Katie<\/i>The lady at bowling\u000a        <\/li><li><i>Mummy<\/i>She's a special lady\u000a        <\/li><li><i>Katie<\/i>I'm not special, nor are you mummy because we haven't got big cheeks.\u000a        <\/li><li><i>Mummy<\/i>No, we're all special for one reason or another.\u000a        <\/li><\/ul><p>Ben is attempting to say a few words now, although it's still not coming out quite right. He's not so interested in books, but is more analytical and can play by himself a lot more. We're not worried about his lack of speech but we are all getting frustrated at times that he cannot express himself clearly. At the moment he loves going into the toy box and using it as a boat. He's also well into cars, trains and motorbikes. However, he's also into Katie's pushchairs and necklaces.<\/p>","images":false},"title":{"value":"Ten Pin Bowling - Special Needs Lady"},"version":1},{"date":{"d":14,"m":1,"y":2007},"datev":20070114,"images":1,"info":{"content":"<p>The Elders risked coming over for Sunday lunch today. Daddy doing the cooking. Lamb Shank.<\/p><p>In the afternoon we all ventured over to Great Grandmas and wrecked their peaceful Sunday afternoon, before moving onto Frimley Lodge park for a spot of duck feeding, and playing on the swings.<\/p><p>Uncle Michael pushed 2 of us at a time on Joey trike which was great fun along the park at speed. We also had a hang man contest.<\/p><img src='images\/years\/2007\/2007_01_14-02a-Elders.jpg' class='diaryImage' alt='Hangman' \/><p class='diaryImageCaption'>Hangman<\/p><p>Last knockings, the Fars popped over for quite a few games of hide and seek.<\/p>","images":false},"title":{"value":"Elders"},"version":1},{"date":{"d":13,"m":1,"y":2007},"datev":20070113,"info":{"content":"<p>In the afternoon we went with Michael, Ellie, Joey and Lily to Woking swimming pool.<\/p>","images":false},"title":{"value":"Woking Swim"},"version":1},{"date":{"d":7,"m":1,"y":2007},"datev":20070107,"images":3,"info":{"content":"<p>Daddy went to visit the Fars whilst the rest of us went to (boring) church!<\/p><p>After a nice Sunday lunch, we drove to Green Park and caught the tube to Westminster. 'Big Ben' met 'Little Ben' as we crossed the Thames over to see the London Eye and walk along the South Bank. Ben and Katie were loving it. They stopped and danced by a busker which was a site to be seen. It put a smile on some passersby anyway. After a heavy tip (a pound), we continued up steps, Katie's favourite, along Hungerford Bridge and eventually onto Trafalgar Square.<\/p><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/n6EjgnRgEBU&amp;hl=en_GB&amp;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/n6EjgnRgEBU&amp;hl=en_GB&amp;fs=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><\/div><img src='images\/years\/2007\/2007_01_07-08-London.jpg' class='diaryImage' alt='The Bens' \/><p class='diaryImageCaption'>The Bens<\/p><img src='images\/years\/2007\/2007_01_07-18-London.jpg' class='diaryImage' alt='Ben and Katie Loving It On The South Bank' \/><p class='diaryImageCaption'>Ben and Katie Loving It On The South Bank<\/p><img src='images\/years\/2007\/2007_01_07-24-London.jpg' class='diaryImage' alt='A busker and his two dancers' \/><p class='diaryImageCaption'>A busker and his two dancers<\/p><p>We caught a double decker and passed Piccadilly Circus, up Regent Street seeing all the lights. Mummy and Katie almost fell down the steps on the way out. We had a short walk along a street with a load of really posh shops back to the car.<\/p>","images":false},"title":{"value":"London"},"version":1},{"date":{"d":6,"m":1,"y":2007},"datev":20070106,"info":{"content":"<p>Rain, rain, rain go away. Well it's pretty difficult to get out of the house when it's cold, wet and windy.<\/p><p>After a splash around in the puddles in the road (getting totally soaked), we went over to the soft play in Fleet. We had great fun on the trolley runs.<\/p><p>We popped over to the West household for a cup of tea. Barrie's latest money making scheme involves them living in a caravan for a while. Needless to say we had to rib him about that!<\/p><p>In the evening Ben went to bed whilst the rest of us watched Ice Age. We have to be very careful with Katie that nothing too bad happens in the film... well it all has a happy ending.<\/p>","images":false},"title":{"value":"Runabout"},"version":1},{"date":{"d":5,"m":1,"y":2007},"datev":20070105,"info":{"content":"<p>\u000a        Three hard days at<a href=\"http:\/\/www.cnluk.com\">CNL<\/a>this week. There are two areas which I need to quickly get up to speed:\u000a      <\/p><ul><li>The Product, IPSecurityCenter (which I will be working on)<\/li><li>VB.NET, the programming language I will be developing in<\/li><\/ul><p>Neither of the above I have any experience in. So I have set out a rough plan for the next 4 weeks in which I will be following. So far I have dipped my toes into both and am quite enjoying both. The product hasn't yet been released and is a bit rough around the edges in places. Quite a few bugs I have found. VB.NET, Visual Studio 2005 and Team Foundation Server on the other hand look interesting enough to get into. Well it's the latest stuff so will look great on my CV if nothing else. My biggest hurdle is to pass the three month probation period. There was a chap who left in December because he didn't make the grade. Just got to really make sure I don't fall the same way.<\/p><p>Anyway I'm working with 4 other developers + the development boss and two commissioning guys (install systems into companies). I've got 20 inch wide screen flat panels and 2 gig memory. Complete builds are completed within a minute or two, which is great. At FormScape they would take 4 hours.<\/p><p>Still trying to muster the enthusiasm to do some work at home. I'm not sure why I am not. I think when I get home I just get lazy \/ can't be bothered. Still they do work hard at CNL. 8:30am to 6pm, with a little lunch break are my typical hours at the moment.<\/p><p>A bad couple of days on the shares this week.... Really bad!!! 2 big'uns down in 2 days.<\/p><p>Finally after a couple of days man effort the new kitchen floor is down and looks very much the last one. We had a bit of a panic when we got too low a quality tile! The tiler had to go home Thursday and come back Friday! Ooops. Mummy's recent splash out:<\/p><ul><li>Kitchen floor<\/li><li>Kitchen table<\/li><li>Wooden toy box<\/li><li>Front room rug<\/li><li>Front room lights<\/li><li>Bathroom cabinet<\/li><li>Fridge freezer<\/li><li>Carpet and sofa cleaning<\/li><\/ul><p>Hopefully now she has stopped and Daddy can recover from 'open wallet surgery'!<\/p>","images":false},"title":{"value":"First Week At CNL, Kitchen"},"version":1},{"date":{"d":3,"m":1,"y":2007},"datev":20070103,"info":{"content":"<b>Sleeping<\/b><p \/><ul><li>I am such a good sleeper. From an early age I have been able to be put down in the evening about 6:30\/7pm awake. I might cry for a couple of minutes, then I stop (still awake), then settle to sleep later<\/li><li>3 times out of 4 I sleep right through the night.<\/li><li>I still have a morning knap for 1.5 hours roughly.<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>For breakfast I always eat my 1.5 Weetabix with warm milk.<\/li><li>Still eats a fair bit. Have about 4 different things at dinner time. Mashed banana, yoghurt and a jar of baby food.<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Katie playing with me. Anything she does, I like.<\/li><li>Putting my toys in my mouth.<\/li><li>Making as much mess as possible.<\/li><li>Climbing on things. At the moment I climb on to the table, from there on to the sofa and then just dive off.<\/li><li>I like to hang out at the bottom of the stairs and try to get through the stair gate.<\/li><\/ul><p \/><b>Development<\/b><p \/><ul><li>I am such a happy boy. I've developed a really nice smile.<\/li><li>I get into temper tantrums, when I get upset sometimes. I think this is due to frustration in expressing myself.<\/li><li>At 13 months I am now really trying to walk. I can walk with a wobble and can't get up myself.<\/li><\/ul>","images":false},"title":{"value":"Ben at 1 - 1.5 years. What I'm Like"},"version":1},{"date":{"d":2,"m":1,"y":2007},"datev":20070102,"info":{"content":"<b>Expressions<\/b><p \/><ul><li>Why?<\/li><li>Are we there yet?<\/li><li>Play with me<\/li><li>No<\/li><li>Can I stay up early (she actually means late)<\/li><\/ul><p \/><b>Things that I like eating<\/b><p \/><ul><li>Still a fussy eater!!!<\/li><li>I find it very difficult to sit down and eat properly with everyone. I'm always not liking the food, finding an excuse not to eat it or just wandering off to play. I hardly eat breakfast and Mummy and Daddy are always challenged at meal times.<\/li><\/ul><p \/><b>Things that I like doing<\/b><p \/><ul><li>Playing with my toys, especially the Barbie dolls. I like to make the dolly's kiss and cuddle each other<\/li><li>Reading<\/li><li>Drinking milk has fallen a bit in the popularity steaks.<\/li><li>I love to go on my big girls bike, on little trips on Daddy's motorbike or down to the swings on my scooter.<\/li><\/ul><p \/><b>Friends<\/b><p \/><ul><li>Being an established member of playschool I have developed quite a few friends. I've been invited to half a dozen or so birthday parties over the summer. My favourite friends are the older boys. For some reason I'm not that interested in playing with girls.<\/li><li>Of course I still have Joey, Ella, Henry and Oliver as main friends.<\/li><\/ul><b>Personality<\/b><p \/><ul><li>Not changed.....<\/li><li>Temperamental. Depending on tiredness.<\/li><li>Demanding playtime all the time.<\/li><li>Bossy.<\/li><li>Socialable and chatty (even on the telephone).<\/li><li>Extremely loving<\/li><li>Playful<\/li><li>Talkative.... sometimes I just like talking for the sake of it. I do this cute thing where I stutter over words because I'm trying to think what my next word will be in the sentence!<\/li><\/ul>","images":false},"title":{"value":"Katie at 3 - 3.5 years. What I'm like"},"version":1},{"date":{"d":1,"m":1,"y":2007},"datev":20070101,"info":{"content":"<p>The morning was spent clearing up after last night's gathering and taking down the decs.<\/p><p>In the afternoon we met with the Elders at a particularly muddy Farnham park and played on the swings. Katie liked the ariel slide loads. We then later went to Alton to swap presents and try some of the fountain of chocolate.<\/p>","images":false},"title":{"value":"Clear Up and Elders"},"version":1}],"version":-1867103178}