{"entries":[{"date":{"d":31,"m":12,"y":2008},"datev":20081231,"images":1,"info":{"content":"<p>In the morning we popped over to the Fars for some games. Ben asks for the train set every time, but only plays with it for 10 minutes! Still I think Daddy and Farfar get more enjoyment from constructing the track layout! Mummy was scarily quite convincing as a teacher when we played schools.<\/p><p>Couple of hours later we left the Fars, went home for some lunch and prepared for our New Year’s Party! Woo Hoo. First up the Elders and the kiddies version of New Years Eve. We played some party games and had tea. We then had 3 instalments for bath time! We went to bed like good children.<\/p><p>\u000a        Karen, Rich, Rachel and Jon then arrived a little later to ignite the Stephens' Vs Weston's battle. It was pointed out that there weren't actually any Weston's or Stephens' in attendance, but that was a mere detail! Top game of the evening undoubtedly went to the\u000a        <a href=\"http:\/\/video.google.co.uk\/videosearch?hl=en&amp;q=speed+stacks&amp;um=1&amp;ie=UTF-8&amp;sa=X&amp;oi=video_result_group&amp;resnum=4&amp;ct=title#\">\u000a          Speed Stacking Cups.\u000a        <\/a>\u000a        Gay's were the worst and Gildewell's the best! There was a food interlude, which included some pork that had been BBQ'ed in the near freezing temperatures.\u000a      <\/p><p>The teams seem to swap around so difficult to say who won in the evening overall, but it was a laugh. Mummy had a few to drink and felt the effects the day after. We had some visitors, which drip fed through to the lounge throughout the evening. All but Ben visited the downstairs. Lily was positively in party mode.<\/p><p>Midnight came and we all tried to sing Auld Lang Syne. We carried on until about 1:30am when our guest left and we went to bed.<\/p><img src='images\/years\/2008\/2008_12_31-13-NewYearsEve.jpg' class='diaryImage' alt='Ben training' \/><p class='diaryImageCaption'>Ben training<\/p>","images":false},"title":{"value":"New Years Eve"},"version":1},{"date":{"d":29,"m":12,"y":2008},"datev":20081229,"images":4,"info":{"content":"<p>It was a bitterly cold day. We went to Windsor for a walk around the castle perimeter and along the river edge.<\/p><img src='images\/years\/2008\/2008_12_29-16-Windsor.jpg' class='diaryImage' alt='Our castle' \/><p class='diaryImageCaption'>Our castle<\/p><p>Some pictures of the offspring. Beauts.<\/p><img src='images\/years\/2008\/2008_12_29-40-Windsor.jpg' class='diaryImage' alt='Katie C U Gay' \/><p class='diaryImageCaption'>Katie C U Gay<\/p><img src='images\/years\/2008\/2008_12_29-41-Windsor.jpg' class='diaryImage' alt='Benjamin A U Gay' \/><p class='diaryImageCaption'>Benjamin A U Gay<\/p><img src='images\/years\/2008\/2008_12_29-00-Jessica.jpg' class='diaryImage' alt='Jessica E U Gay' \/><p class='diaryImageCaption'>Jessica E U Gay<\/p>","images":false},"title":{"value":"Windsor"},"version":1},{"date":{"d":25,"m":12,"y":2008},"datev":20081225,"images":2,"info":{"content":"<p>Mummy and Daddy were awoken surprisingly not really early. 6:45am this year. Luckily Father Christmas had visited all five of us and had it away with the milk and biscuit!<\/p><p>We squashed into Katie and Ben's bedroom first and FC had been particularly generous one feels. Katie's main presents were a set of Barbie's, a mini washing line!!! a Princess Jasmine outfit and what she had asked for, a snowflake necklace!<\/p><p>Ben received a Star Wars poster, DVD, another lightsaber (green) and some t-shirts. Needless to say he was very happy. Jessica got a keyboard, a dolly with smelly hair, a mobile phone (don't worry it is a toy one) and some other smaller girlie bits.<\/p><p>We then moved downstairs to open the presents under the tree from friends..... we were present'ed out!<\/p><p>Mummy went to church whilst the rest of us went to the Fars again for Christmas breakfast, which was a selection of giffler and fresh rolls. We again opened the rest of our presents and played. Mummy returned from church, so we hot footed it down to Kent to see Ma Ma, Pop Pop and the Elder clan. Unfortunately Charlotte had Christmas shifts at work, so couldn't make it, instead spending the day with her ex-boyfriend, Steve.<\/p><p>Lunch first up. We had one of the three turkey's that Pop Pop had cooked. The kiddies had their own table which never remained calm throughout. There was plenty of quantity and quality on the dining table. A traditional spread. After, we rolled out of the house and walked to the Fitzgerald household.... which reminds me of a Mother-In-Law'ism.<\/p><p>Yesterday, Helen had asked when the church service was at St. Nicholas. Ma Ma had said 11:15 thinking Helen meant the midnight mass service. They didn't turn up. Instead the Fitzgerald's turned up to church this morning when most of the congregation were walking out!<\/p><p>We returned to open the mass of presents from the Weston's and Barnett's. Jessmunta received a mini trampoline, Ben a Thomas The Tank Engine mountain and Katie a cupcake maker, a CD karaoke player, and some bits and bobs for her teaching games where she plays her teacher Miss Morris.<\/p><p>We tidied and played with some of the presents then went to bed after a spot of tea. The adults stayed up to play some games and watch Gavin and Stacey!<\/p><img src='images\/years\/2008\/2008_12_25-00-ChristmasDay.jpg' class='diaryImage' alt='A compendium of present openings.' \/><p class='diaryImageCaption'>A compendium of present openings.<\/p><img src='images\/years\/2008\/2008_12_25-31-ChristmasDay.jpg' class='diaryImage' alt='Present time' \/><p class='diaryImageCaption'>Present time<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2008},"datev":20081224,"images":1,"info":{"content":"<p>Daddy returned home at 2:30pm and soon after we all went to the Fars for a traditional Danish meal. We were joined by the Tremears. Katie and Ben had some bits of this tasty spread. Jessica wolfed down whatever was in front of her. It was pretty manic really. After chocolate log and risalamande, which Farfar won, we moved down to the main event. Throughout the evening we were tracking, on the internet, where Father Christmas was in the world. He had gone west from Australia and was now in Iran!<\/p><p>Katie and Ben were busy earlier sorting the presents outs into piles of different recipients! Anyway the main event arrived and we were handing the presents out enthusiastically... a bit quicker than the normal Gay pace of one at a time.<\/p><p>Katie's haul included some books and a stationary set, Ben got a Denmark football strip and a lightsaber, Jessica a rabbit teddy bear, a book and a toy. Katie was excited at opening her presents, Ben I think was a bit over roared and surprisingly didn't seem to get it, and Jessica was a rampant present opener. It didn't matter if they were for her or not!<\/p><p>We had a game of bingo before returning home to put some reindeer food on the front path and a cup of milk and a biscuit for FC himself. Daddy returned to the Fars for some more games, whilst Mummy later went to midnight mass.<\/p><img src='images\/years\/2008\/2008_12_24-09-ChristmasEve.jpg' class='diaryImage' alt='Present time' \/><p class='diaryImageCaption'>Present time<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":21,"m":12,"y":2008},"datev":20081221,"images":1,"info":{"content":"<p>End of Term: Katie came home yesterday, the only one in the class to receive a certificate for her progress in 'phonics and writing'. Well done Katie, we are all very proud of your progress this term. She is really enjoying school.<\/p><p>A late Christingle service which Katie and Ben enjoyed was proceeded with lunch then a trip to Oliver Strangle's house for some Christmas cheer. They live down Buckhurst Road which is where Mummy wants to live. We didn't spend too long there.<\/p><p>The Fars kindly came around to babysit Jessica, whilst the rest of us met with Ellie and Joey at Camberley Civic Centre for this year’s panto performance of Jack and the Beanstalk. Apparently it had some Emmerdale, Neighbours and Home and Away actor in it, Richard Grieve. We hadn't heard of him.<\/p><p>It started off very scarily which Joey didn't cope with too well. For the rest of the performance whenever 'Fleshcreep' appeared on stage Ellie had to cover his eyes! Ben was tittering on the edge, but as the performance went on he was more relaxed. Katie just loved it from start to finish. You can tell she was really into it.<\/p><p>The production itself was good, although not as last years. Some of the jokes were terrible. However, it was very enjoyable and most important of all the children enjoyed it. Ben's reaction to a lightsaber fight was a picture of joy. The show lasted 2 hours.<\/p><p>Afterwards we popped into McDonalds for some reason! The children were all on a high. Milkshakes aren't what they used to be though in McD's. A good afternoon.<\/p><img src='images\/years\/2008\/2008_12_21-11-McDonalds.jpg' class='diaryImage' alt='The children!' \/><p class='diaryImageCaption'>The children!<\/p>","images":false},"title":{"value":"Pantomime: Jack And The Beanstalk"},"version":1},{"date":{"d":20,"m":12,"y":2008},"datev":20081220,"images":1,"info":{"content":"<p>It was Ben's friend Tom's 3rd birthday party which was in two parts. First up was soft play, bouncy castle and crash mats. Some energy was released. Best game was 'washing machines'. We then moved along for some food and party games. What a contrast in moods. When Katie got knocked out of a game she left with a smile, Benny left in a grump! Tom was in great form telling his Daddy when the music should be played in pass the parcel! We had a great time.<\/p><p>We sprinted home to meet the Sanders and West crews. We swapped presents. Ben strangely was given a Star Wars ship and T-shirt, Katie a board game which she played 3 times and some boots. Jessica received a much needed coat, drum and a car. We played all afternoon, then watched the final of Strictly Come Dancing!<\/p><img src='images\/years\/2008\/2008_12_20-30-Tom3rdBdaySandersWests.jpg' class='diaryImage' alt='Jessica and her new drum!' \/><p class='diaryImageCaption'>Jessica and her new drum!<\/p>","images":false},"title":{"value":"Tom's 3rd Birthday, Sanders and West’s Over"},"version":1},{"date":{"d":14,"m":12,"y":2008},"datev":20081214,"images":1,"info":{"content":"<p>After church, Mummy and Katie went with some school friends to watch a pantomime, Peter Pan on ice. Katie absolutely loved it and in her words, \"didn't want it to end\".<\/p><p>\u000a        Meanwhile Daddy, Ben and Jessica went over to the Fars to play trains and watch the Snowman. We had\u000a        <a href=\"http:\/\/en.wikipedia.org\/wiki\/%C3%86bleskiver\">\u000a          æbleskive\u000a        <\/a>\u000a        which Daddy hasn't had for a long, long time. Yummy.\u000a      <\/p><p>Uncle Michael is in Malaysia on business and Auntie Ellie had to work the 'nudist' shift at Alton leisure centre, so Daddy was entrusted to play with Lily and Joey who came over. We all played in the bedroom. We dressed Lily up in one of Katie's Disney Princess dress', put a hair band in, some rings on her fingers and some pink heeled shoes. Cannot say that Daddy doesn't play girlie dressing up! Ben and Joey proceeded to kill, trample and poke Daddy and then each other, which Jessica took exception to and cried whenever this happened and tried to push the boys off Daddy! Mummy and Katie later returned from the panto to join in the fun. We had dinner, a bath and story time before going to bed at 7:15pm. Auntie Ellie came later and all stayed the night.<\/p><img src='images\/years\/2008\/2008_12_14-16-Fars.jpg' class='diaryImage' alt='A Bath Full Of People' \/><p class='diaryImageCaption'>A Bath Full Of People<\/p>","images":false},"title":{"value":"Peter Pan on Ice, Fars, Elders to stay"},"version":1},{"date":{"d":13,"m":12,"y":2008},"datev":20081213,"images":1,"info":{"content":"<p>\u000a        We drove up to Turnham Green and caught the tube to Tower Gateway where we were greeted with a deluge of weather! The big debate was, do we take the double buggy or not? Important strategic question. We decided not. Anyway we trotted across to\u000a        <a href=\"www.towerbridge.org.uk\/\">\u000a          Tower Bridge\u000a        <\/a>\u000a        and went up the lift to one of the two walkways which connect the towers 20 metres from the ground. We all enjoyed playing with the computers and Daddy liked looking across the views of London, even though it was a bit grey! Jessica was finally freed and was toddling about everywhere. She could be real noisy.\u000a      <\/p><p>After looking west on the second walkway, we sunk down into the engine rooms, and sneaked some lunch in by the coal bunker! We departed Tower Bridge on the south side and caught a bus to Covent Garden. There was the inevitable street entertainer. He spent 10 minutes balanced on top of a ladder, to blow and pop a rubber glove on his head! It's all about the quality! We visited some knick-knack shops which were quite quaint. Katie has only a pair of canvas type shoes, which were soaked along with her tights. So we popped into an expensive camping shop and bought some boots and a pair of kids socks for £7.50. Daddy almost had a heart attack!<\/p><img src='images\/years\/2008\/2008_12_13-10-TowerBridgeSelfridges.jpg' class='diaryImage' alt='Victorian Gays' \/><p class='diaryImageCaption'>Victorian Gays<\/p><p>We walked down to the Strand and caught a double-decker which passed along the pretty Christmas lights down Regent's Street and Oxford Street to Selfridges. Needless to say it was a tad busy in there. After looking around the toy department and queuing for the toilets, we went on the magical train journey to Lapland. It was presented really well and have been looking forward to the experience for the past week. After our short train ride, we were escorted by the lady elf into Father Christmas's grotto. He engaged with Katie and Ben straight away, by muddling their names up! Jessica on the other hand wasn't so sure. Anyway Katie wished for some necklaces’ and Ben some Star Wars'ez, as he says. We posed for some photos, before Father Christmas gave each of us a parting gift. A nice Christmas book each!<\/p><p>We exited and marched down to Marble Arch tube. Jessica put a smile on people’s hearts in the tube as she was laughing and smiling away and determined to wander around the carriage! We finally returned home, via the chip shop for a treat. Although late, we proceeded to decorate the Christmas tree and front room. What a lovely Christmas day we had.<\/p>","images":false},"title":{"value":"Tower Bridge Exhibition, Father Christmas at Selfridges"},"version":1},{"date":{"d":12,"m":12,"y":2008},"datev":20081212,"images":1,"info":{"content":"<p>In the morning Mummy helped run the Christmas Fair for the playschool. Ben was a snowflake in his nativity play. He loves singing the songs.<\/p><img src='images\/years\/2008\/2008_12_12-01-BenNativity.jpg' class='diaryImage' alt='Our snowflake' \/><p class='diaryImageCaption'>Our snowflake<\/p>","images":false},"title":{"value":"Ben's Nativity"},"version":1},{"date":{"d":8,"m":12,"y":2008},"datev":20081208,"info":{"content":"<p>Ben has loved playing with the pushchairs today. He was looking through a telescope. I asked what was he looking for, he replied someone to play with. He wanted to play with Aimee but she was busy. He then smiled at Oliver and asked him to play. They then went off together (it was so sweet).<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":6,"m":12,"y":2008},"datev":20081206,"images":3,"info":{"content":"<p>Mummy and ourselves went to Ma Ma and Pop Pop's for the weekend.<\/p><p>We went to Gravesend Christmas shopping. Ma Ma bought Ben a new snuggle blanket as Ben's smelt so bad of wee and she couldn't get the smell out. He chose a Spiderman one and Katie got some stationary for her teaching game. We had a drink and a cake and a play on the slide. In the afternoon we went to Mummy and Auntie Ellie's old junior school for their Christmas fair and then on to ride Teaky. Ben and Joey went on her no problems but when Katie got on with Ma Ma she was a bit lively and Katie got scared. Mummy had Ben and Jess, so poor Auntie Ellie had to rescue her as she was screaming, hopefully it hasn't put her off horses for life.<\/p><p>\u000a        Daddy on the other hand rode to Swansea and made it with 15 minutes to spare before the coach left from the\u000a        <a href=\"http:\/\/www.thetowersswanseabay.com\/\">\u000a          Hotel\u000a        <\/a>\u000a        to the wedding venue,\u000a        <a href=\"http:\/\/www.neath-porttalbot.gov.uk\/default.aspx?page=1325&amp;lang=en\">\u000a          Margam Park\u000a        <\/a>\u000a        . It was a beautiful setting. Greeting us was the 30 strong Porthcawl Male choir who were fantastic. They banged out some familiar songs which was good to hear, nothing like Daddy's version of 'Slide Away' thankfully.\u000a      <\/p><p>The wedding itself was held within the impressive Orangery. A civil affair, which was light hearted. Emma looked top dollar of course. The deed was done, and we ventured to get some mulled wine and tasty salmon puff pastry things! Daddy met Martin's girlfriend, Vicky, for the first time. She was very socialble and friendly. So pleased for Marts.<\/p><img src='images\/years\/2008\/2008_12_06-06-JamesEmmaWedding.jpg' class='diaryImage' alt='Deal or No Deal?' \/><p class='diaryImageCaption'>Deal or No Deal?<\/p><p>Daddy ventured around Margam Park and took some boring photo's. Barrie was getting a bit worried about his best man's speech. His parents were there as well, so it was good to catch up with them. We sat down for the wedding breakfast, late afternoon. Most of the 80 guests were of similar age so it was good to chat to some of Emma's college friends.<\/p><p>All the speeches were good.... even the Father of the Bride. Some English-Welsh jokes. James' speech was good... and he seemed to enjoy doing it. The opposite could be said for Bazza, obviously really nervous but the content was very good. He had to pull some of his Welsh jokes out in the end..... 'What's the best thing to come out of Wales?'...... 'The M4'!! Boom Boom.<\/p><p>We begun to drink and drink. Chocolate fountain and pork buffet. The disco was in full swing.... Again slightly different, there was a chap who sang all the songs. He was very good. The three brothers did some rock to the Motley Crew. They bounced around and pretended to play guitars. It was very funny.<\/p><img src='images\/years\/2008\/2008_12_06-83-JamesEmmaWedding.jpg' class='diaryImage' alt='The Ball Crew' \/><p class='diaryImageCaption'>The Ball Crew<\/p><p>The cake cutting was next... with Lightsabers. Very cool.... If only Ben could see these bad boys. £150 a pop. Needless to say Duncan took his 'babies' away fairly promptly! The wedding ended with plenty more discoing. Martin Aves danced to Raining Men by the way! Never thought I'd see the day. Vicky split her dress.... and didn't we hear about it!<\/p><p>Midnight struck and before we turned back into pumpkins we returned back to the hotel on the coach. Everyone in good spirits. Anyway Daddy, a sleeping Barrie and James' Auntie Carol were the last men standing at 4am!<\/p><p>Some really nice touches at the wedding. The choir, the setting, the people, the speeches, the CD, the singer, the photo\/signing book, the Motley Crew rendition, but sorry Emma, the one that eclipsed it all was the lightsaber cake cutting!<\/p><img src='images\/years\/2008\/2008_12_06-72-JamesEmmaWedding.jpg' class='diaryImage' alt='Han and Leah' \/><p class='diaryImageCaption'>Han and Leah<\/p><p>The 4 hour journey was eventful. Ice welcomed me on the bike! However, the cold was the least of my problems. There was so much salt on the motorway that I had to continually stop to clean the visor on the helmet. Also, a car raced in front of me, pulled on his hazards and told me to pull over. He had seen my wallet fall out of my pocket whilst riding along and a number of coins had hit his car at 80 mph! Ooops. I walked a mile up the M4 looking for it, but alas I couldn't find it!<\/p>","images":false},"title":{"value":"James and Emma's Wedding - Visit Ma Ma and Pop Pop"},"version":1},{"date":{"d":5,"m":12,"y":2008},"datev":20081205,"info":{"content":"<p>Mummy picked Katie up from school and we drove straight to Play with Summer and Alice. We spent a bit of time there and then went to Ma Ma and Pop Pops for tea. We ate it all up. Ma Ma had got Katie loads of great books and teaching aids to pretend to be a teacher which is Katie's favourite game. We went to bed. At 10:30 Mummy received a call from a drunk Ma Ma and Pop Pop asking for a lift home. They had been out to Ma Ma's Christmas work do. Mummy decided to go in her pyjamas to repay Pop Pop for all the times he came to collect her and her friends in his dressing gown and slippers!<\/p>","images":false},"title":{"value":"The Teals’"},"version":1},{"date":{"d":3,"m":12,"y":2008},"datev":20081203,"images":1,"info":{"content":"<p>Mummy arrived one hour early to ensure a good seat for Katie's Nativity. It was a traditional Mary and Joseph affair. Katie was dressed as a shepherd and sang two songs. It was really nice to see.<\/p><img src='images\/years\/2008\/2008_12_03-01-KatieNativity.jpg' class='diaryImage' alt='Katie's Nativity' \/><p class='diaryImageCaption'>Katie's Nativity<\/p>","images":false},"title":{"value":"Katie's Nativity"},"version":1},{"date":{"d":30,"m":11,"y":2008},"datev":20081130,"images":1,"info":{"content":"<p>In the morning we ventured over to the Fars to play. We went over to the Elders in the afternoon to celebrate with the Barnett's, Lily's second birthday.<\/p><img src='images\/years\/2008\/2008_11_30-17-Lily2ndBirthday.jpg' class='diaryImage' alt='Lily and family' \/><p class='diaryImageCaption'>Lily and family<\/p>","images":false},"title":{"value":"The Fars and Lily's 2nd Birthday"},"version":1},{"date":{"d":29,"m":11,"y":2008},"datev":20081129,"images":1,"info":{"content":"<p>We went over to Church Crookham to meet with the Sanders and the Elders, to see the now traditional annual arrival of Santa at Redfield’s.<\/p><img src='images\/years\/2008\/2008_11_29-05-RedfieldsSanta.jpg' class='diaryImage' alt='Jess in Redfield’s' \/><p class='diaryImageCaption'>Jess in Redfield’s<\/p>","images":false},"title":{"value":"Redfield Santa"},"version":1},{"date":{"d":23,"m":11,"y":2008},"datev":20081123,"info":{"content":"<p>In the afternoon Mummy stayed at home with Jessica was in need of a long sleep. The rest of us went swimming at Farnborough. We spent 1.5 hours playing all sorts of games, including trampling on Daddy's back under water!<\/p><p>Despite the bitter weather, Daddy felt compelled to do a BBQ and invited the Fars over for some hot dogs before they baby sat for us, whilst Mummy and Daddy went with the West’s to the new Cinema in Camberley to watch James Bond, Quantum Of Solace. Mummy didn't think much of it because it wasn't a traditional Bond movie. Daddy just enjoyed being at the cinema again.<\/p>","images":false},"title":{"value":"Swimming, Fars and James Bond"},"version":1},{"date":{"d":22,"m":11,"y":2008},"datev":20081122,"images":1,"info":{"content":"<p>Katie and Mummy made some bread rolls or was it a mess? We had them nice and warm for lunch. Daddy and Ben played train sets. Jessica had a long morning sleep. She has a touch of conjunctivitis.<\/p><img src='images\/years\/2008\/2008_11_22-01-Katie.jpg' class='diaryImage' alt='Making a mess, I mean bread' \/><p class='diaryImageCaption'>Making a mess, I mean bread<\/p><p>In the cold afternoon we took our bikes to Virginia Water and cycled to the totem pole.<\/p>","images":false},"title":{"value":"Virginia Water"},"version":1},{"date":{"d":21,"m":11,"y":2008},"datev":20081121,"info":{"content":"<p>Today Ben was watching two other children playing with the toolbench and when I asked if he knew the Bob The Builder song, Ben sang it to me all the way through by himself!<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":15,"m":11,"y":2008},"datev":20081115,"images":1,"info":{"content":"<p>Daddy and Benny picked up Auntie Michael and Joey and went for a trip to see some moto cross and quad bike racing. We had a great time. We were trying to pick which colour would win. Ben always picked blue. There were a couple of accidents which required medical attention.... otherwise the hundred or so competitors in about a dozen races got around safely, if not spectacularly.<\/p><p>We had comfy chairs and a small picnic. Luckily the weather was good, but there was plenty of mud for the kiddies to get stuck into.... which we felt when we stood behind the start line. We got sprayed with mud!<\/p><img src='images\/years\/2008\/2008_11_16-00-MotoCross.jpg' class='diaryImage' alt='Motocross Montage' \/><p class='diaryImageCaption'>Motocross Montage<\/p>","images":false},"title":{"value":"Boys Motocross Trip"},"version":1},{"date":{"d":9,"m":11,"y":2008},"datev":20081109,"images":1,"info":{"content":"<p>We went to the Fars for Sunday lunch and to go for an Autumn walk. The Fars had finally started their front room re-design. Green walls.... old persons green walls!<\/p><img src='images\/years\/2008\/2008_11_09-08-Fars.jpg' class='diaryImage' alt='Out For A Walk' \/><p class='diaryImageCaption'>Out For A Walk<\/p>","images":false},"title":{"value":"Fars Sunday Lunch"},"version":1},{"date":{"d":8,"m":11,"y":2008},"datev":20081108,"info":{"content":"<p>In the afternoon Daddy, Katie and Ben played at Farnborough swimming pool. Katie is happier swimming under water, than she is above! Ben on the other hand rather not get wet at all. As always we had great fun playing sharks and basically kill Daddy! Jess has a big tooth coming through so she went with Mummy to do a spot of Christmas shopping.<\/p><p>Late in the evening we packed a thermos flask of soup and trekked to the top of Frimley Green hill to watch the surrounding fireworks. In a 180 degree turnaround from last year, Katie couldn't get enough of them. She was loving it. Ben was Ben, and Jess didn't mind them. On the way home we stopped by Grove school to see their display. It was really good, although we must have looked like pikeys watching it from outside the school! They were pretty loud, but Jessica didn't show any negative emotion at all.<\/p>","images":false},"title":{"value":"Swimming, Fireworks"},"version":1},{"date":{"d":2,"m":11,"y":2008},"datev":20081102,"info":{"content":"<p>Sunday was wet again and I have little to report apart from going to church (without Mama as she was babysitting ill Ben who seemed to perk up apparently once we had all left the house) and visiting Great Nan and Great Pop Pop's grave. As usual a great time was had by all!<\/p><p>Thanks to Ma Ma for that write up.<\/p>","images":false},"title":{"value":"Great Nan and Grandpop's grave"},"version":1},{"date":{"d":1,"m":11,"y":2008},"datev":20081101,"info":{"content":"<p>On Friday, we went to Auntie Karen's house, for a little party. Katie dressed as a pumpkin and Ben was Darth Vader. We made decorations and did some apple bobbing. Katie and Summer's cousins Amber and Kyle were brilliant and had a great time. Ben was not feeling well and would not put his head in the bowl. We then drove to Ma Ma and Pop Pop's to go trick or treating or tickle and treating as Katie calls it. Ma Ma was running late (lost in Bournemouth) so we had to drag a reluctant pop Pop to come with us as Mummy wasn't sure whose doors to knock on. Ben wasn't into it as he was still feeling ill. we did about five houses and collected lots which made Ben perk up. Katie had a feather duster to tickle people as a trick but fortunately did not need to use it.<\/p><p>We arrived at Ma Ma and Pop Pop's house. We had just had our dinner when some children came 'trick or treating'. Of course Pop Pop had not bought enough sweets so Mama cheekily took some of ours to give to the callers (I will NEVER forgive her for this!).<\/p><p>Anyway we went to bed and in the morning set off in the pouring rain for London. I will never understand adults - I mean why spend a wet and windy day in Canary Wharf waiting for some people whom I had never met before to go on to a boring (and when I say boring, I mean boring) exhibition where there were black and white pictures of lots of poor looking people, when you could be at a soft play or something.<\/p><p>Well at last we were out of that gruesome place and headed off to Weatherspoons where I had a yummy spaghetti bolognaise. Ben was a bit of a pain (but then he didn't feel well bless him). I have to say I rather took to Uncle Dave and Auntie Rita - they were complimentary about me and I like that. At last Mummy had had enough and suggested we went home and left Mama and Pop Pop with their friends. Boy was I glad to get home!<\/p><p>That evening we watched telly before enjoying fireworks. I use the term enjoy loosely as Ben felt too ill to watch and went to bed and I was just too worried about this huge firework that someone called Dave (a different Dave) had brought. Actually it was a bit of a let-down when it was eventually lit.<\/p>","images":false},"title":{"value":"Trick or Treating and Fireworks in Istead Rise"},"version":1},{"date":{"d":31,"m":10,"y":2008},"datev":20081031,"images":2,"info":{"content":"<p>Friday:<\/p><p>\u000a        Daddy trekked down to Bristol with the boys for James' stag weekend. We had Barrie and Michael as drivers and straight away they went the wrong way down the M3! Down the 303, as Baz calls it, we took direction's off 'Pat' to a lovely pub in Corton, called the\u000a        <a href=\"http:\/\/www.thedove.co.uk\/\">\u000a          Dove Inn\u000a        <\/a>\u000a        . The landlord was a little shocked to see the stag donned in a lurid, green mankini! He eventually came around, and after shocking a few of the civilized locals, and a go behind the bar, James and the rest of us moved onto three other pubs. One of which a rockwilder greeted us by the door. Needless to say he was a curious dog! Just glad he had eaten earlier!\u000a      <\/p><img src='images\/years\/2008\/2008_11_01-11-JamesStag.jpg' class='diaryImage' alt='Mankini Man pulling some Butcombe' \/><p class='diaryImageCaption'>Mankini Man pulling some Butcombe<\/p><p>We eventually made it to the Premier Inn, Bristol. We had a spot of bother getting the minibus into a height restricted car park. A wheel spin and a bit of speed allowed us to scrape under the car park roof, leaving us with red paint etched on top! Oops.<\/p><p>A spruce up, and a trip to Frankie and Benny's for some nosh, we were now setup for the rest of the evening. A casino was first. Dog and Tony ended roughly even playing blackjack for a few hours, whilst the rest of us were trying to nurse Bazza through a friendly game of poker without him causing too much offense and noise! Oi Dunlop, come here! Snap Rules!! What?<\/p><p>Next in order was some Tino style walking towards the bars at the canal. After some had a Martini, we proceeded back to the hotel, for a cheeky chinky at 3am! Not all made it back in one piece, Mr Aves, lost his footing and got some almighty cuts and bruises all over his face.... or was it a mugging? Kingster?<\/p><p>Saturday:<\/p><p>Having scraped through the car park height restrictor on the way in, we had the same problem on the way out. We let some of the tyres down hoping to reduce the height, thus no scraping. However, it made no difference, and again we all cringed as we could hear the scraping noise as we departed the hotel for the quad biking. Martin Ball was convinced he had been at the quad biking venue before, but the organiser cast aspersions over that claim. James' and Emma's dads joined us.<\/p><p>On this bitterly cold morning, we had a small course to complete on a time trial basis. Some got it on two wheels within 10 seconds (huh erm), some aborted the bike by jumping off it (Dog), and some were obviously good at it. I think Duncan and Barrie were the top two candidates. A great laugh.<\/p><img src='images\/years\/2008\/2008_11_01-24-JamesStag.jpg' class='diaryImage' alt='The Quad Biking Krew!' \/><p class='diaryImageCaption'>The Quad Biking Krew!<\/p><p>We then descended to a local pub where we had some lunch and played some friendly poker.... and a final game for cash, which Tony walked away with the winnings.<\/p><p>At the business end of the stag do, we caught taxi's to the canal region again. Bazza leaning into one of the taxi's, saying \"it's ###### Bin Laden driving\" - welcome to our diplomat, Barrie! The cabbie just looked so disappointed! Anyway after the first establishment was ticked off, we hit Reflex, a 80's nightclub where James had to fulfil the dares on his t-shirt....which he managed to do. Another late return back to the hotel.<\/p><p>Sunday:<\/p><p>We returned home. Cheers guys for such a great weekend.<\/p><ul><li><i>Stag<\/i>James Ball\u000a        <\/li><li><i>Organizers<\/i>Barrie West, Duncan Ball, Michael Elder\u000a        <\/li><li><i>Stag T-Shirt Design<\/i>Michael Elder\u000a        <\/li><li><i>Stag Song<\/i>James Bond - Scouting For Girls\u000a        <\/li><li><i>Role Call<\/i>James Ball, Barrie West, Duncan Ball, Martyn Ball, Mark Poeti, Tony King, Nick King, Michael Elder, Martin Aves, Steven Barnett, Martin Gay, Chris Ball (Father), Mr Rianne (Father in law), Emma's sisters' husband.\u000a        <\/li><\/ul>","images":false},"title":{"value":"James Ball's Stag Weekend"},"version":1},{"date":{"d":25,"m":10,"y":2008},"datev":20081025,"info":{"content":"<p>We stayed overnight at the Fars. We had a treasure hunt which won us lots of sweets and a torch!<\/p><p>Mum and Dad came to collect us, and after lunch went with Paula and Natasha to the country market to pick Pumpkins and play on the swings.<\/p>","images":false},"title":{"value":"Fars Overnight Stay - Pumpkins"},"version":1},{"date":{"d":12,"m":10,"y":2008},"datev":20081012,"images":1,"info":{"content":"<p>After church we went over to Auntie Susan's and Graham's for a Hot Dog feast and of course to play on the Playstation, trash the house and play on the swings in the park.<\/p><p>Later in the afternoon we popped over to the Fars to do the same again. We made boats out of the sofa's and boxes.<\/p><img src='images\/years\/2008\/2008_10_12-11-SusanGrahams.jpg' class='diaryImage' alt='Jess teaching Susan to walk!' \/><p class='diaryImageCaption'>Jess teaching Susan to walk!<\/p>","images":false},"title":{"value":"Around the Gays"},"version":1},{"date":{"d":11,"m":10,"y":2008},"datev":20081011,"images":1,"info":{"content":"<p>Last night Mummy and Daddy went to the Bull pub in Bentley for their anniversary meal. It was real nice food.<\/p><p>As it part of Katie's school subject next week we headed towards the beach. A new destination in Calshot. However, beforehand we stopped off at Hythe to eat our picnic at the waterfront and saw lots of sail boats, seagulls and a big fish. We then hopped onto the stony beach of Calshot. The weather was great and beach quite empty. We collected lots of interesting stones and shells and went for a walk up and down past all the beach huts.<\/p><p>In the late afternoon we had a plethora of people over to watch the England international.<\/p><img src='images\/years\/2008\/2008_10_11-38-HytheCalshot.jpg' class='diaryImage' alt='Jessica taking a stroll on the beach' \/><p class='diaryImageCaption'>Jessica taking a stroll on the beach<\/p>","images":false},"title":{"value":"Calshot Seaside"},"version":1},{"date":{"d":5,"m":10,"y":2008},"datev":20081005,"images":1,"info":{"content":"<p>In the morning Katie sung at the Methodist church for the Harvest Festival.<\/p><p>In the afternoon we went to Sophie's party, where there was an excellent magic man.<\/p><img src='images\/years\/2008\/2008_10_05-09-SophiesBday.jpg' class='diaryImage' alt='Katie at Sophie's birthday' \/><p class='diaryImageCaption'>Katie at Sophie's birthday<\/p>","images":false},"title":{"value":"Harvest Festival and Sophie's Birthday"},"version":1},{"date":{"d":4,"m":10,"y":2008},"datev":20081004,"info":{"content":"<p>In the morning we went Swimming over in Woking with Ma Ma and Pop Pop<\/p>","images":false},"title":{"value":"Swimming with the Weston's"},"version":1},{"date":{"d":3,"m":10,"y":2008},"datev":20081003,"first":{"name":"katie","value":"Spelling Test"},"info":{"content":"<p>Katie has 10 spellings to learn in a week and today she got all 10 correct! This after a good report from parents evening as well. Have we the first brain box in the family? She's doing well in spelling and reading. OK in writing and need a bit of improvement in maths.<\/p><p>Here are the 10 words she had to spell:<\/p><ul><li><i>They<\/i><\/li><li><i>You<\/i><\/li><li><i>We<\/i><\/li><li><i>She<\/i><\/li><li><i>Come<\/i><\/li><li><i>Like<\/i><\/li><li><i>This<\/i><\/li><li><i>The<\/i><\/li><li><i>And<\/i><\/li><li><i>Was<\/i><\/li><\/ul>","images":false},"title":{"value":"Spelling test at school"},"version":1},{"date":{"d":29,"m":9,"y":2008},"datev":20080929,"images":1,"info":{"content":"<p>The West's came over to play in the afternoon.<\/p><img src='images\/years\/2008\/2008_09_28-07-WestsOver.jpg' class='diaryImage' alt='Young Lovers?' \/><p class='diaryImageCaption'>Young Lovers?<\/p>","images":false},"title":{"value":"West's Over"},"version":1},{"date":{"d":28,"m":9,"y":2008},"datev":20080928,"images":1,"info":{"content":"<p>We went down to see Charlotte's new house which she is sharing with two other friends. Just a walk away from the hospital she is working at.<\/p><p>\u000a        The children were playing havoc so we got out quick. Charlotte was sick out of the car twice en-route to the\u000a        <a href=\"http:\/\/www.choldertoncharliesfarm.com\/\">\u000a          Rare Breeds Farm\u000a        <\/a>\u000a        in Cholderton. The weather was great and there were plenty of things to entertain the children. We of course saw a noisy Farfar in his pen. We had a trip around the field in the tractor, played on the adventure playground, there were monsters in the maze, saw Auntie Ellie do a summersault on the trampoline and played monsters again in the soft play. Overall a great time for the kids.\u000a      <\/p><img src='images\/years\/2008\/2008_09_27-23-RareBreedsFarm.jpg' class='diaryImage' alt='Jessica Chicken' \/><p class='diaryImageCaption'>Jessica Chicken<\/p>","images":false},"title":{"value":"Charlotte's New House, Rare Breads Farm"},"version":1},{"date":{"d":21,"m":9,"y":2008},"datev":20080921,"images":1,"info":{"content":"<p>It was the annual Weston trip away. This time Thorpe Park and along came Howard, Susan and her son, Sean. We started in Octopus Land which was for the kiddies and then made our way around the park. Ben was a bit of a woos and got seriously grumpy on some rides, because he couldn't be the driver! Katie loved the rapid river, but hated the log flume!<\/p><p>\u000a        Daddy went on some of the more adult rides.<a href=\"http:\/\/www.thorpepark.com\/rides-stealth.php\">Stealth<\/a>, the 0-80mph rollercoaster in 2.7 seconds, tip toeing over the top of the arch at 200 feet. Well, we were just queuing and this one time (at band camp!), the coaster did not make the tip-toe, and came rushing down backwards towards the start point. Was it going to crash? Thankfully no, the brakes were applied, but it was pretty scary to see it malfunction. The engineers were called, and we left the queue. We did return later, and Daddy thought it was the most exhilarating ride he has ever been on. Beats all the ones in America he's been on.\u000a      <\/p><img src='images\/years\/2008\/2008_09_22-69-ThorpePark.jpg' class='diaryImage' alt='Splash time' \/><p class='diaryImageCaption'>Splash time<\/p>","images":false},"title":{"value":"Thorpe Park"},"version":1},{"date":{"d":20,"m":9,"y":2008},"datev":20080920,"images":1,"info":{"content":"<p>We popped over to Susan's for a birthday breakfast. We sat and chatted. Ben was taken with Playstation 3 and the Star Wars game. I'm sure if we had it at home he wouldn't be off it. We later went for a walk and a go on the swings at the back of the house.<\/p><img src='images\/years\/2008\/2008_09_20-22-Susans31stBirthday.jpg' class='diaryImage' alt='Birthday Time' \/><p class='diaryImageCaption'>Birthday Time<\/p><p>In the afternoon we went swimming. Bath time and Jessica now thinks it a good idea to lay a couple of logs in the bath itself! How pleasant. This has been going on for about a week now. Also since her birthday, we have put her in a strict routine, which means she sleeps pretty much all the way through for the first time and wakes at about 6:15am each morning. Finally some rest.<\/p>","images":false},"title":{"value":"Auntie Susan's 31st Birthday"},"version":1},{"date":{"d":14,"m":9,"y":2008},"datev":20080914,"images":1,"info":{"content":"<p>We split into two teams today. Mother and Eldest daughter went to church and two birthday parties.<\/p><p>The rest went with the Fars down to Alresford to catch a steam train. We huffed and puffed a return journey to Ropley and back where Farfar and Ben made a detour to see Thomas who was 'snoozing' under the covers.<\/p><p>After some lunch, we headed off again this time to Alton and back. Ben was getting into the spirit, announcing Ropley as Broccoli and 'Signal Box' and 'Siginal Box'! Jessica on the other hand was 100% fidget box. She seemed to have a smile on her face all day.<\/p><img src='images\/years\/2008\/2008_09_14-Watercress.jpg' class='diaryImage' alt='Train Cranks' \/><p class='diaryImageCaption'>Train Cranks<\/p>","images":false},"title":{"value":"Steam Trains and Birthday Parties"},"version":1},{"date":{"d":13,"m":9,"y":2008},"datev":20080913,"images":1,"info":{"content":"<p>For some reason we went all the way over to High Wycombe to get our photo taken by the pros. Getting Ben to stop saying a continuous 'cheeeeeese', Katie to give a broad smile and Jessica to look at the camera in a cramped space is not that easy! Anyway we got some lovely pictures taken. We walked around the town and visited the office where Daddy worked for six months and where he made his first phone call to ask Mummy out on a date!<\/p><img src='images\/years\/2008\/2008_09_13-05-ProShots.jpg' class='diaryImage' alt='Family Portrait' \/><p class='diaryImageCaption'>Family Portrait<\/p><p>In the afternoon we went to Ikea at Wembley.... always a known as a stress test assault course, and this was no exception. Anyway we didn't get a dining room chair, cutlery or a dinner set which we had intended to get.<\/p><p>We returned home to watch Snow White and the Seven Dwarfs<\/p>","images":false},"title":{"value":"Photo's - Ikea"},"version":1},{"date":{"d":11,"m":9,"y":2008},"datev":20080911,"images":1,"info":{"content":"<p>The day before Ben decided to swing on the curtains like Tarzan and ripped the curtain pole off the wall.<\/p><p>We awoke early with some of the Elder clan having stayed overnight to help us out. Katie and Ben helped Jessica open her presents in mummy and daddy's bed.<\/p><ul><li><i>Jessie got loads of presents<\/i>A little trike, a climbing frame, bookshelves, dressing gown and pyjamas, a stool, a cushion, a rug and lots of clothes.\u000a        <\/li><\/ul><p>Jessica had a mini party at lunchtime, with friends: Thomas, Joey, Lily, Summer and Alice in attendance. We also had other visitors during the day including: The Fars, Auntie Susan, Helen, Fiona, Auntie Ellie, Great Grandma and Granddad, Uncle Howard and Uncle Richard. Thank you for all the lovely presents and cards.<\/p><img src='images\/years\/2008\/2008_09_11-Jessica1stBirthday.jpg' class='diaryImage' alt='Present Opening' \/><p class='diaryImageCaption'>Present Opening<\/p>","images":false},"title":{"value":"Jessica's 1st Birthday"},"version":1},{"date":{"d":11,"m":9,"y":2008},"datev":20080911,"info":{"content":"<p>Lovely to see Ben back and great to hear all about his holiday. Ben has talked a lot about the swimming pools and flumes. Ben has settled back really well into preschool.<\/p><p>Author: Julie (Ben's playschool teacher, Ben's pronounces her as 'Doolie')<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":7,"m":9,"y":2008},"datev":20080907,"images":1,"info":{"content":"<p>We split in the morning. Daddy went with Ellie, Rachel, Jon and Richard for a 10 kilometre run down along Littlehampton Promenade. Conditions were good, although preparation was poor. Anyway Daddy managed it in 53 minutes which he was pleased with.<\/p><p>Meanwhile the rest of us went over to the same Gym Katie had her birthday, this time for Henry's celebrations.<\/p><p>We all met again in the afternoon for a Barnett family picnic down at Frimley Lodge Park. We had a game of cricket and a go on the steam trains. Ben and Joey particularly played really well with each other. You can tell they are going to be good friends. Mummy came rushing in with a cake, and we all sang happy birthday to Jessica and shared a bottle of Champagne.<\/p><img src='images\/years\/2008\/IMG_2094.jpg' class='diaryImage' alt='Karen and Katie' \/><p class='diaryImageCaption'>Karen and Katie<\/p>","images":false},"title":{"value":"Family Picnic, Littlehampton 10km, Henry's 5th Birthday Party"},"version":1},{"date":{"d":6,"m":9,"y":2008},"datev":20080906,"info":{"content":"<p>We went down to see cousins Dixon down at their home in Deal. It was nice to see the whole Dixon clan. We had a lovely Fish and Chip lunch, and a trip down to Tides for a swim. Katie and Ben loved the long, windy slide. You could tell Yasmin enjoyed the water as well. We popped back again and played in the back garden where Ben managed to through the ball into the pond, which we hadn't managed to retrieve! We also learned the great news that Sharon is about 12 weeks pregnant! Woo hoo.<\/p>","images":false},"title":{"value":"Dixons Of Deal"},"version":1},{"date":{"d":24,"m":8,"y":2008},"datev":20080824,"images":2,"info":{"content":"<p>Day minus 2<\/p><p>After waving Daddy off on his motorbike trip we headed to Ma Ma and Pop Pop's house. We played in the garden then went to the Gillingham Country Park. We had great fun rolling down the hill and making dens. From there we went to visit Teaky. Ben and Katie were brave enough to ride, but Joey was a little scared.<\/p><p>After tea and bath we all headed back home where Joey, Katie and Ben slept together.<\/p><p>Day minus 1<\/p><p>We went to church where we created lots of noise in the crèche together and were very naughty. Lily and Joey headed home while we went back to load the car with all our camping gear. By the time we left for Auntie Ellie's we couldn't fit another thing in. We had sleeping bags, pillows, food and clothes.<\/p><p>We slept at Auntie Ellie's and we were all very excited for the start of our holiday.<\/p><p>Day 1 - Setting Up<\/p><p>We squeezed into the car and headed for the service station to meet Ma Ma and Pop Pop. After Ma Ma's hourly caffeine injection and a go on the swings, we set off again in the direction of Swanage. We got stuck in lots of holiday traffic and got slightly lost, but eventually found our lovely campsite. Auntie Karen, Uncle Richard, Jon and Rachel were leaving Swanage after their holiday and helped us put up our tents. We have a new one this year, fortunately easy to assemble, although not easy enough for us to do it! Auntie Karen and Uncle Richard lent us their Lillo and bedding for added comfort. Once we said goodbye to Pop Pop who had to drive all the way home, we went for a walk to the cliffs. However, the path soon became too steep for the buggy and the little ones, so we returned. We cooked sausages on our little stove and went to bed. In the night mummy was woken twice with Ben and Jessica being sick over our lovely new tent and sleeping bags!<\/p><p>Day 2 - Weymouth<\/p><p>We walked to a nearby swing park where Auntie Ellie mistakenly threw Lily over a wall, thinking there was a platform on the other side. Unfortunately there wasn't and she fell six foot to the ground. Luckily, she only cried for a minute and was fine, so we were able to laugh about it.<\/p><p>We then headed off to Weymouth where we lost each other and couldn't find anywhere to park. After communicating through Pop Pop we were able to find each other on the beach. We had a picnic, a play in the sand and were allowed two goes on the fair. After this we all want to go on a donkey, (so Ma Ma got on her hands and knees!)... Katie's was the biggest, and Ben a little baby one called Daisy. Next we caught an open topped bus to Portland Bill. At first it was great fun, but as the road became more open the wind was so intense, so we had to go downstairs. We had ice cream, but were unable to go up the lighthouse as you had to be a metre tall.<\/p><p>We desperately needed the laundrette to clean the sleeping bags and as luck would have it, we found one in Wareham on the way to the campsite, which stayed open till 9pm and had a chip shop next door, so we were able to have tea whilst we did our washing. Jessie was sick again in the night.<\/p><img src='images\/years\/2008\/2008_08_26-14-SwanageHoliday-Weymouth.jpg' class='diaryImage' alt='Eee-ore' \/><p class='diaryImageCaption'>Eee-ore<\/p><p>Day 3 - Farmer Parmers<\/p><p>We went for another go on the swings and then headed to Farmer Parmers. This was an excellent farm. We started by going in the play loft, and climbing haystacks and going down slides. There were tractors to ride, a great adventure playground and two huge bouncy castles. We hadn't found anywhere to buy a picnic, so decided to buy sausages there. In the afternoon we did the Woodland Walk, going over bridges and trying to spot Winnie The Pooh figures. We had a go in the Maize Maze and Katie and Ben got out first! The tractor ride was the bumpiest ever and verged on a white knuckle ride. We had an ice cream and Mummy was so busy trying to keep the wasps off Ben, she dropped hers without even having a bite. Finally there was some brilliant Go-Karts. The children too little to ride them, but they had seats on the back so the adults ride them around the bumpy track. We stopped at the Laundrette again and also bought a BBQ. At the campsite we cooked a delicious meal; sausages, burgers and marshmallows and also attempted a few campfire songs. Jessica was sick again!<\/p><p>Day 4 - Steam Train Ride<\/p><p>We caught the steam train, from Swanage to Corfe. Ben wet himself on the train after the guard pointed us in the wrong direction for the toilet and couldn't get there quick enough. He spent the rest of the day in Joey's swimming shorts. We found a little, old fashioned sweet shop in Corfe and were allowed sweets from Auntie Ellie's budget. Mummy had fun looking around Enid Blyton's shop. We didn't climb to the castle as we felt the little ones wouldn't make it, although Katie was desperate to try. Instead, we went into the model village and had great fun playing giant connect four, Jenga, hop scotch and croquet on a hill! One funny thing Katie and Joey found a little wishing well and put in a penny and made a wish. Katie started to cry because her wish hadn't come true. After eventually prizing out of her what it was, she said she wished to have found sweets in her pocket. Luckily, Mummy had some left from earlier and was able to convince Katie the fairy had put them in the wrong pocket. Katie was delighted. Then, Joey started crying as he wished for a motorbike and there was none in his pockets. Unfortunately none of the adults were able to produce a motorbike!<\/p><p>We caught the steam train back to Swanage and had a play on the beach. Katie and Mummy were brave enough to paddle up to our tummy's as it was quite cold. Jessie was not sick, thank goodness.<\/p><p>Day 5 - Studland Bay<\/p><p>We drove to Studland Bay. The weather was a little better, although still not hot. Ma Ma bought all the children a pair of Crocs (shoes), and we tried them out on the rocks looking for crabs. We didn't find any, however, people with special crab lines were catching loads, which fascinated us, using bacon as bait. Auntie Charlotte joined us, and made us boats in the sand. Katie and Mummy swum out to a boat. Auntie Ellie said we wouldn't able to, and lost the bet and was supposed to cook us bacon on the following day! Ben on the other hand screamed blue murder when mummy naughtily forced him into the sea, thinking he would enjoy it if he just got in there. We went for a walk along the cliff top and found an old fort. Katie and Joey had great fun playing in it.<\/p><p>We said goodbye to Ma Ma, who had to return home with Auntie Charlotte, and we went back to the campsite for our final night.<\/p><p>Day 6 - Littlehampton Beach Party<\/p><p>If we thought we couldn't fit anymore in to the car on the way to Swanage, on the way back we had the additional Lillo, two pillows, a double duvet and a wind break! We got so stressed trying to fit it all in, put the tents down and keep our eyes on the children. We set off in the direction of Littlehampton for Rachel's 30th birthday beach party. Four hours later we got there! We hadn't realized it would be such a long journey especially with all the holiday traffic we got stuck in. It was also a very hot day. However, the children were very well behaved in the car. We had great fun on the beach.<\/p><p>We had a BBQ and an ice cream. We went on Rachel's kayak and swum up to our necks in the sea again. We didn't leave Littlehampton until 6pm. We were helping one of Rachel's friends fly a kite. We ate a picnic tea on the way back to Auntie Ellie's where we stayed the night.<\/p><img src='images\/years\/2008\/2008_08_30-14-SwanageHoliday-Littlehampton.jpg' class='diaryImage' alt='Kayak' \/><p class='diaryImageCaption'>Kayak<\/p>","images":false},"title":{"value":"Weston Swanage Holiday"},"version":1},{"date":{"d":23,"m":8,"y":2008},"datev":20080823,"images":18,"info":{"content":"<p>Top 4 Roads<\/p><p>\u000a        1.\u000a        <a href=\"http:\/\/maps.live.com\/default.aspx?v=2&amp;FORM=LMLTCP&amp;cp=58.253172~-4.43985&amp;style=h&amp;lvl=9&amp;tilt=-90&amp;dir=0&amp;alt=-1000&amp;phx=0&amp;phy=0&amp;phscl=1&amp;rtp=pos.58.0240163952112_-4.40054945647717_Lairg%2C%20UK__~pos.58.476514030832_-4.41823185791253_Tongue%2C%20UK__&amp;rtop=0~0~0&amp;encType=1#JnJ0cD1wb3MudHAzbTI2Z216eXJ4X0xhaXJnJTJjK1VLX19fZV8lN2Vwb3MudHJjZzljZ215bXpiX1Rvbmd1ZSUyYytVS19fX2VfJTdlcG9zLnRyc3I1cmdwaHZ5OF9SZWF5JTJjK1VLX19fXyZydG9wPTAlN2Uw\">\u000a          Lairg To Tongue To Reay\u000a        <\/a>\u000a        - Single track road, little traffic, Ben Hope in the distance and Loch Loyal. Atlantic coast road to Reay\u000a      <\/p><p>\u000a        2.\u000a        <a href=\"http:\/\/maps.live.com\/default.aspx?v=2&amp;FORM=LMLTCP&amp;cp=58.506434~-4.689299&amp;style=h&amp;lvl=11&amp;tilt=-90&amp;dir=0&amp;alt=-1000&amp;phx=0&amp;phy=0&amp;phscl=1&amp;rtp=pos.58.4923227131367_-4.61653433740139_Lochside%2C%20UK__~pos.58.5682950186122_-4.74715877194399_Durness%2C%20UK__&amp;rtop=0~0~0&amp;encType=1\">\u000a          21 miles to Durness\u000a        <\/a>\u000a        - Race! Mount Foinaven with its white peaks.\u000a      <\/p><p>\u000a        3.\u000a        <a href=\"http:\/\/maps.live.com\/default.aspx?v=2&amp;FORM=LMLTCP&amp;cp=57.704045~-5.497195&amp;style=h&amp;lvl=10&amp;tilt=-90&amp;dir=0&amp;alt=-1000&amp;phx=0&amp;phy=0&amp;phscl=1&amp;rtp=pos.57.8499987213306_-5.4667000074989_Little%20Gruinard%2C%20UK__~pos.57.54925402956_-5.51567581003522_Torridon%2C%20UK__&amp;rtop=0~0~0&amp;encType=1\">\u000a          Little Gruinard to Torridon\u000a        <\/a>\u000a        - The picturesque beach, sea views from Tuirnalg, 100mph dash, Loch Maree, Mountain pass in Glen Torridon\u000a      <\/p><p>\u000a        4.\u000a        <a href=\"http:\/\/maps.live.com\/default.aspx?v=2&amp;FORM=LMLTCP&amp;cp=56.556455~-5.202026&amp;style=h&amp;lvl=9&amp;tilt=-90&amp;dir=0&amp;alt=-1000&amp;phx=0&amp;phy=0&amp;phscl=1&amp;rtp=pos.56.6813997924328_-5.10700978338718_Glencoe%2C%20UK__~pos.56.5666669607162_-5.06666667759418_Gualachulain%2C%20UK__~pos.56.4351200312376_-4.70951981842518_Tyndrum%2C%20UK__&amp;rtop=0~0~0&amp;encType=1\">\u000a          A82 and Glen Etive\u000a        <\/a>\u000a        - Black Mountain pass and really long straights, along with the spur of Glen Etive.\u000a      <\/p><p \/><p>The long awaited motorbike holiday to the North and West of Scotland finally came. Daddy went with Uncles Howard and Michael.<\/p><p>Day 1 - A 9am start which took us 430 miles north on a 9 hour trip to Dumbarton.<\/p><ul><li><i>Howard Filtering<\/i>Just past Birmingham we encountered traffic Jams. Daddy filtered between lanes 1 and 2. Cars could see him in their mirrors so moved out of my way. However, Howard was filtering between lanes 2 and 3, so the cars moved across into Howards path, narrowly missing a collision!\u000a        <\/li><li><i>155 mph - Police<\/i>Tootling along at 80mph, Daddy saw Howard accelerating in his mirrors. Vroom. 155mph. Never seen that speed before... followed 2 minutes later by a Police Car going at similar speed. I thought Howard was done for. Luckily the Police Car was rushing to attend to an accident further along the motorway.\u000a        <\/li><li><i>Glasgow thieving<\/i>Our first stop in Glasgow was for fuel which had an M and S attached. Saw two teenagers run out of the shop with two cases of Coke. A shop assistant then ran out of the shop 20 seconds later. By that time, the kids had scarpered.\u000a        <\/li><\/ul><p>\u000a        Day 2 - Argyll Tour. Our first taste of lochs, mountains and costal scenery. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=dumbarton&amp;daddr=Rest+and+be+Thankful,+Argyll+and+Bute,+Argyll+and+Bute+to:B828+%4056.203065,+-4.915382+to:Inveraray+to:lochgilphead+to:Ellenabeich+to:Oban+to:56.461732,-4.850464+to:Glencoe&amp;hl=en&amp;geocode=%3B%3BFTmXWQMdSv-0_w%3B%3B%3B%3B%3B%3B&amp;mra=dpe&amp;mrcr=5&amp;mrsp=7&amp;sz=10&amp;via=2,7&amp;sll=56.439722,-4.850464&amp;sspn=0.5542,1.400757&amp;ie=UTF8&amp;ll=56.375137,-4.9617&amp;spn=0.555141,1.400757&amp;t=h&amp;z=10\">\u000a          Dumbarton - Rest And Be Thankful - Inveraray - Seil - Oban - Glen Orchy - Glencoe\u000a        <\/a><\/p><ul><li><i>Dumbarton Jog<\/i>Daddy rose at 6:15am to go on a 5 mile jog around Dumbarton taking in the football club and castle. Feet blistered in the Lego’s.\u000a        <\/li><li><i>Weather<\/i>The weather throughout the week was pretty consistent. Rain in the mornings, broken sunshine in the afternoons. It was to be expected really. The rain didn't spoil the holiday.\u000a        <\/li><li><i>Sites<\/i>We had our first taste of streams cascading down spectacular mountains as we passed Loch Lomond onto the picturesque village of Inveraray.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_24-05-Scotland-ObanCircular.jpg' class='diaryImage' alt='Inveraray' \/><p class='diaryImageCaption'>Inveraray<\/p><ul><li><i>Isle Of Seil<\/i>We tried our luck over the 200 year old Atlantic Bridge\u000a        <\/li><li><i>Taxi not for Mr Gay<\/i>Going through traffic in Oban, Daddy managed to get into a tussle with a taxi driver who wouldn't let him through. Eventually Daddy forced himself, leading the taxi driver to take a picture of his bike, I guess to hand into the police. Stupid taxi drivers think they have their own highway code!\u000a        <\/li><li><i>Rapids<\/i>Stopped off along one of the first bit of single tracks to see the rapids through Glen Orchy Fan-bloody-tastic.\u000a        <\/li><li><i>Best 'A' Road in the UK<\/i>The A82 from the Bridge Of Orchy to Glencoe is the most stunning bit of road to be seen, past the Black Mount mountains. Long 2 mile straights, mountains either side, long sweeping corners, no pot holes, repairs, drains, manhole covers... just tarmac bliss.\u000a        <\/li><li><i>Restaurant in someone's front room<\/i>We stopped in Glencoe and our host Glencoe Jane booked us in the local restaurant which was situated in someone's front room. Very strange setup. Food was excellent.\u000a        <\/li><\/ul><p>\u000a        Day 3 - Travelling to the North Coast. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=glencoe&amp;daddr=ardgay+to:tongue+to:bettyhill&amp;hl=en&amp;geocode=&amp;mra=ls&amp;sll=57.600895,-4.722585&amp;sspn=2.148782,5.603027&amp;ie=UTF8&amp;t=h&amp;z=8\">\u000a          Glencoe - Loch Ness - Inverness - Easter Fearn - Loch Loyal - Tongue - Bettyhill\u000a        <\/a><\/p><ul><li><i>Bad Weather Day<\/i>As the weather was pretty bad we decided to head as far north as possible and work our way down Scotland.\u000a        <\/li><li><i>Overtaking<\/i>Michael desperately trying to overtake a lorry along Loch Ness for about 20 minutes. Once overtaken the lorry pulled off the road 30 seconds later!\u000a        <\/li><li><i>Inverness<\/i>Didn't think much of Inverness. Another city.\u000a        <\/li><li><i>Lairg to Tongue<\/i>Fantastic single track, great weather, lovely scenery! Howards best road ever at that point in time.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_25-15-Scotland-ToNorthCoast.jpg' class='diaryImage' alt='Easter Fearn' \/><p class='diaryImageCaption'>Easter Fearn<\/p><img src='images\/years\/2008\/2008_08_25-58-Scotland-ToNorthCoast.jpg' class='diaryImage' alt='Castle At Tongue' \/><p class='diaryImageCaption'>Castle At Tongue<\/p><ul><li><i>Bettyhill<\/i>Howard almost out of petrol, so stopped at Bettyhill which pleased Daddy as there was an unspoilt, coved, sandy beach. 'Now you won't be wanting to do that' line in a thick Scottish accent.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_25-71-Scotland-ToNorthCoast.jpg' class='diaryImage' alt='Bettyhill Beach' \/><p class='diaryImageCaption'>Bettyhill Beach<\/p><p>\u000a        Day 4 - Exploring the North. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=bettyhill&amp;daddr=Unknown+road+%4058.643560,+-3.028960+to:helmsdale+to:altnaharra+to:Alltnacaillich,+Highland,+United+Kingdom+to:durness&amp;hl=en&amp;geocode=%3BFWjUfgMdIMjR_w%3B%3B%3B%3B&amp;mra=ls&amp;sll=58.375798,-3.834229&amp;sspn=1.05134,2.801514&amp;ie=UTF8&amp;ll=58.382998,-3.894653&amp;spn=1.051125,2.801514&amp;t=h&amp;z=9\">\u000a          Bettyhill - John O'Groats - Duncansby Head - Girnigoe Castle - Helmsdale - Ben Hope - Durness\u000a        <\/a><\/p><ul><li><i>Costal Road - Best Yet<\/i>The long straights, the views over to the Orkneys and general picturesque views made this one of the most enjoyable rides as far as Reay where there were big industrial plants spoiling the view.\u000a        <\/li><li><i>John O'Groats<\/i>We decided to do John O'Groats. Not too much there. We in fact went further north and east by a mile to Duncansby Head, which is actually further from Lands End.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_26-23-Scotland-NorthHighlands.jpg' class='diaryImage' alt='John O'Groats' \/><p class='diaryImageCaption'>John O'Groats<\/p><ul><li><i>East Coast<\/i>We continued down past Wick. A drag race ensued along some of the straights, passing Grinigoe Castle\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_26-29-Scotland-NorthHighlands.jpg' class='diaryImage' alt='Girnigoe Castle' \/><p class='diaryImageCaption'>Girnigoe Castle<\/p><ul><li><i>Cross Country - The midgeys<\/i>We moved onto the cross country routes heading towards Durness. We stopped off at a small loch to go on some rowing boats which were begging to be rowed! Within 2 minutes we were attacked by Midges’. Horrible. They got everywhere. Yuk.\u000a        <\/li><li><i>Daddy mountain climb<\/i>Along the valley we stopped off and Daddy and Howard started to climb one of the mountains, Ben Hope. Daddy got quite high. However, Michael and Howard buggered off whilst Daddy was still half way up. Views of the valley were fantastic. Sound bounced all the way down.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_26-68-Scotland-NorthHighlands.jpg' class='diaryImage' alt='Martin having climbed up Ben Hope' \/><p class='diaryImageCaption'>Martin having climbed up Ben Hope<\/p><ul><li><i>21 mile Durness run - Best Road Ever<\/i>Well we ragged it once we hit the north coast road. Michael videoed it. A must see. Again hard to put into words the scenery, but loch + mountains + white top mountains + single track + lambs roaming the roads + high up + good, dry weather = Best journey experience ever.\u000a        <\/li><\/ul><p>\u000a        Video Links:<a href=\"http:\/\/uk.youtube.com\/watch?v=WIiI_ov-6i0\">1<\/a><a href=\"http:\/\/uk.youtube.com\/watch?v=UkdLjEEkpeU\">\u000a          2\u000a        <\/a><a href=\"http:\/\/uk.youtube.com\/watch?v=YhcBsJf86K0\">3<\/a><a href=\"http:\/\/uk.youtube.com\/watch?v=sW7-sI_-Bys\">\u000a          4\u000a        <\/a><a href=\"http:\/\/uk.youtube.com\/watch?v=usJJQfrUDic\">5<\/a><a href=\"http:\/\/uk.youtube.com\/watch?v=Ij_ct6vhAZ8\">\u000a          6\u000a        <\/a><\/p><img src='images\/years\/2008\/2008_08_26-82-Scotland-NorthHighlands.jpg' class='diaryImage' alt='Beach near Durness' \/><p class='diaryImageCaption'>Beach near Durness<\/p><p>\u000a        Day 5 - Descent South to Ullapool to the Torridon Hotel. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=durness&amp;daddr=laxford+bridge+to:Claonel+to:ullapool+to:poolewe+to:Annat,+Achnasheen,+Highland,+United+Kingdom&amp;hl=en&amp;geocode=&amp;mra=pe&amp;mrcr=4&amp;sll=57.462843,-5.022138&amp;sspn=4.31504,11.206055&amp;ie=UTF8&amp;ll=58.060444,-4.493408&amp;spn=1.06072,2.801514&amp;t=h&amp;z=9\">\u000a          Durness - Loch Shin - Ullapool - Gruinard Beach - Annat\u000a        <\/a><\/p><ul><li><i>Durness<\/i>Durness a funny place where there were a maximum 2 or 3 houses together. Some reason I thought it looked like the Falklands. Never been to the Falklands but it is what I imagine to be like.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_27-32-Scotland-DurnessUllapool.jpg' class='diaryImage' alt='Kyle Of Durness from Keodale' \/><p class='diaryImageCaption'>Kyle Of Durness from Keodale<\/p><img src='images\/years\/2008\/2008_08_27-46-Scotland-DurnessUllapool.jpg' class='diaryImage' alt='Michael racing onto Laxford Bridge' \/><p class='diaryImageCaption'>Michael racing onto Laxford Bridge<\/p><img src='images\/years\/2008\/2008_08_27-82-Scotland-DurnessUllapool.jpg' class='diaryImage' alt='View of Loch Ewe from Poolewe' \/><p class='diaryImageCaption'>View of Loch Ewe from Poolewe<\/p><ul><li><i>Lamb Attack<\/i>Got stuck behind a farmer herding his lambs along the road. There were hundreds of the things. Michael dispersed many of them with his hooter.\u000a        <\/li><li><i>Glasses<\/i>Somehow, Michael's glasses flew off his face whilst riding and lost forever. A yokel, local said he'll keep a look out for them!\u000a        <\/li><li><i>Ullapool<\/i>Ullapool was surrounded by mountains and had a huge loch. Looked like a toy town when we approach from up high in the hills. Had nice cup of tea by the sea.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_27-51-Scotland-DurnessUllapool.jpg' class='diaryImage' alt='Ullapool in the distance' \/><p class='diaryImageCaption'>Ullapool in the distance<\/p><ul><li><i>Beach<\/i>Another stop off where there was a gorgeous sandy beach (Little Gruinard), looking out into the evening sun, with one chap fishing from his deckchair and another flying his kite! C'est Beau.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_27-78-Scotland-DurnessUllapool.jpg' class='diaryImage' alt='Kite flying at Little Gruinard Beach' \/><p class='diaryImageCaption'>Kite flying at Little Gruinard Beach<\/p><ul><li><i>100mph sneeze<\/i>For some reason it tickles Michael at the noise of the CB500 dash through the superb roads adjacent to Loch Maree. Noise was half jet engine, half apologetic sneeze.\u000a        <\/li><\/ul><p>\u000a        See it<a href=\"http:\/\/uk.youtube.com\/watch?v=btQet4cWPOA\">here<\/a>.\u000a      <\/p><ul><li><i>The Torridon Hotel<\/i>\u000a          After much discussion over price (Daddy tight fisted) we stayed at the\u000a          <a href=\"http:\/\/www.lochtorridonhotel.com\/\">\u000a            Torridon Hotel\u000a          <\/a>\u000a          . By far the best place. We had our own motel style block with a huge room.\u000a        <\/li><\/ul><p>\u000a        Day 6 - Applecross and Isle Of Skye. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=Annat,+Achnasheen,+Highland,+United+Kingdom&amp;daddr=lochcarron+to:ardheslaig+to:Applecross,+Strathcarron,+Highland+to:Duirinish,+Kyle,+Highland,+United+Kingdom+to:portree+to:kyle+of+lochalsh&amp;hl=en&amp;geocode=&amp;mra=ls&amp;sll=57.406935,-5.819345&amp;sspn=0.540015,1.400757&amp;ie=UTF8&amp;t=h&amp;z=10\">\u000a          Annat - Shieldaig - Applecross - Lochcarron - Portree, Skye - Kyle Of Lochalsh\u000a        <\/a><\/p><ul><li><i>Breakfast<\/i>Daddy enjoyed breakfast as much as Michael hated it. It had no fry-up element to it at all. Continental styley all the way through.\u000a        <\/li><li><i>Applecross<\/i>The north coastal part of Applecross forest had again scenery to die for. The southern end of the route included a climb on the motorbike up a huge mountain, shrouded in cloud so we could not see a lot. Half way up we saw a camper van with panicking occupants as it appeared there radiator was at the end of its life. Steam gushing out of the engine. What a place to break down.\u000a        <\/li><li><i>Isle Of Skye<\/i>Seemed to take us ages to get going onto the Isle Of Skye. We notice a sharp incline in the amount of traffic. We stopped off in Portree. Michael asked a local if there cinema only has 12 year old films. Nice. Anyway Michael had 'bad vibes' about Skye so we returned to stay in the Kyle Of Lochalsh.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_28-44-Scotland-SkyeAppleCross.jpg' class='diaryImage' alt='Loch Ainort, Isle Of Skye' \/><p class='diaryImageCaption'>Loch Ainort, Isle Of Skye<\/p><ul><li><i>Scottish Food<\/i>Tonight we tried deep fried Mars Bar, which none of us liked particularly, Haggis, which tasted of minced beef and some tasty White Pudding, which surprisingly was made of oats.\u000a        <\/li><\/ul><p>\u000a        Day 7 - Nevis, Grey Mare's Tail Waterfall, Glen Etive. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;saddr=kyle+of+lochalsh&amp;daddr=Unknown+road+%4056.777580,+-5.000200+to:B863+%4056.716670,+-4.972170+to:56.551346,-5.08255+to:tyndrum&amp;hl=en&amp;geocode=%3BFWxbYgMd-LOz_w%3BFX5tYQMddiG0_w%3B%3B&amp;mra=dme&amp;mrcr=0&amp;mrsp=3&amp;sz=12&amp;via=1,2,3&amp;sll=56.578775,-4.940414&amp;sspn=0.138042,0.350189&amp;ie=UTF8&amp;ll=56.872996,-5.068817&amp;spn=1.095751,2.801514&amp;t=h&amp;z=9\">\u000a          Kyle Of Lochalsh, Fort William, Glen Nevis, Grey Mares Tail, Glen Etive, Tyndrum\u000a        <\/a><\/p><ul><li><i>Eilean Donan Castle<\/i>Most beautiful picture ever!\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_29-01-Scotland-Nevis.jpg' class='diaryImage' alt='Eilean Donan Castle' \/><p class='diaryImageCaption'>Eilean Donan Castle<\/p><ul><li><i>Fort William<\/i>Not that impressed. Another town with 70's architecture.\u000a        <\/li><li><i>Jumps<\/i>The road along Glenn Nevis was incredibly windy and undulating. One found one point with potential motorbike jumping possibilities. Only Howard managed this feat.\u000a        <\/li><li><i>Nevis Climb<\/i>Well not really. Howard and Daddy climbed up part of the mountain in the Nevis range to see the gorge with rushing water. Very pleasant.\u000a        <\/li><li><i>Gey Mare's Tail Waterfall<\/i>The waterfall's view was partially blocked so Daddy decided to change into swimming trunks and t-shirt and attempt to clamber along the rocks to get closer. Once it was reached it was amazing to see the force and gusts of spray created from the waterfall. It was in its own cove with a mini beach. Daddy really enjoyed this bit.\u000a        <\/li><li><i>Glenn Etive<\/i>Michael found a small excursion route along a valley which again hard to describe but was quite remote and extremely picturesque and tranquil.\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_29-53-Scotland-Nevis.jpg' class='diaryImage' alt='Glen Etive' \/><p class='diaryImageCaption'>Glen Etive<\/p><ul><li><i>Tyndrum Hotel<\/i>Thumbs down all round for this place (except the fish and chip shop). Best forgotten.\u000a        <\/li><\/ul><p>\u000a        Day 8 - Blackpool. Route:\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=q&amp;hl=en&amp;geocode=&amp;q=tyndrum+to+blackpool&amp;sll=53.800651,-4.064941&amp;sspn=9.482453,22.412109&amp;ie=UTF8&amp;t=h&amp;z=7\">\u000a          Tyndrum - Blackpool\u000a        <\/a><\/p><img src='images\/years\/2008\/2008_08_30-01-Scotland-Blackpool.jpg' class='diaryImage' alt='North Edge Of Loch Lomond' \/><p class='diaryImageCaption'>North Edge Of Loch Lomond<\/p><ul><li><i>Hen Night Capital<\/i>There were loads of Hen Do's and some outrageous costumes. Some real pigs out there.\u000a        <\/li><li><i>Tack-A-Lac-Dac<\/i>It is still by far the tackiest place you are ever likely to encounter. Cheapo, cheapo everything. It was heaving with people. So busy\u000a        <\/li><li><i>Pepsi To The Max<\/i>Daddy and Howard went on Europe's tallest rollercoaster, the Pepsi Max ride. The first bit was so high and such a steep descent. Amazingly we saw Steve Laidlaw in the queue!\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_08_30-19-Scotland-Blackpool.jpg' class='diaryImage' alt='Pepsi Max Ride, Blackpool' \/><p class='diaryImageCaption'>Pepsi Max Ride, Blackpool<\/p><ul><li><i>Cruise The Illuminations<\/i>Illuminations have only just been turned on so we cruised the golden mile on the motorbikes.\u000a        <\/li><\/ul><p>Day 9 - Return Journey<\/p><p>Overall we had a really good time, both as a motor biking holiday and to look at all the scenery. Next year the Swiss Alps!<\/p>","images":false},"title":{"value":"Boys Motorbike Holiday - Scotland"},"version":1},{"date":{"d":16,"m":8,"y":2008},"datev":20080816,"images":1,"info":{"content":"<p>Home day. We packed up and dropped the key off. We went to Lynton and Lynmouth. Towns which almost merge into one. Again very idyllic villages with great views into the sea.<\/p><img src='images\/years\/2008\/2008_08_16-18-Day8-LyntonLynmouth.jpg' class='diaryImage' alt='Yummy Mummy' \/><p class='diaryImageCaption'>Yummy Mummy<\/p><p>The children behaved very well seeing that we were stuck in the car for 7 hours or so. At one point Ben very worryingly said - I've seem a yummy boy in a scrummy car! - What!<\/p><p>Overall it was nice to have time with the five of us. Some of the places were really picturesque, the beaches and surf shops were great. However, the weather put pay to any kind of real beach action and Ben is a handful! We all had fun though and it was a great adventure.<\/p><p>We need a holiday to get over the holiday!<\/p>","images":false},"title":{"value":"North Devon Holiday - Lynton and Lynmouth"},"version":1},{"date":{"d":15,"m":8,"y":2008},"datev":20080815,"images":3,"info":{"content":"<p>We awoke not really knowing what we were to do today. As is often the case it made for the best day of the hols we think. Daddy wanted to see Boscastle, which was very disappointing. We didn't even stop.<\/p><p>\u000a        We then headed towards Tintagel, but on the way we saw a shabby sign for a waterfall,\u000a        <a href=\"http:\/\/www.tintagelweb.co.uk\/St%20Nectan's%20Glen.htm\">\u000a          St Nectan's Glen\u000a        <\/a>\u000a        . We started on the woodland walk, but 30 minutes in the children were whinging and whining so we turned back to the car without seeing the waterfall itself!\u000a      <\/p><img src='images\/years\/2008\/2008_08_15-11-Day7-Tintagel.jpg' class='diaryImage' alt='Daddy and Jess' \/><p class='diaryImageCaption'>Daddy and Jess<\/p><p>Tintagel came to the rescue, the village was great. The cove even better. Another waterfall and cave in which a dragon lived according to Katie and Ben! We enjoyed ourselves down their... and then we had the steep climb back to the village with a pushchair full with Ben and Jess. You've got to try it.<\/p><p>After another ice cream we returned home via Widemouth Bay for another early evening swim.<\/p><img src='images\/years\/2008\/2008_08_15-29-Day7-Tintagel.jpg' class='diaryImage' alt='Katie Boof(tiful) Gay' \/><p class='diaryImageCaption'>Katie Boof(tiful) Gay<\/p><img src='images\/years\/2008\/2008_08_15-22-Day7-Tintagel.jpg' class='diaryImage' alt='Tintagel Waterfall' \/><p class='diaryImageCaption'>Tintagel Waterfall<\/p>","images":false},"title":{"value":"North Devon Holiday - Tintagel"},"version":1},{"date":{"d":14,"m":8,"y":2008},"datev":20080814,"images":2,"info":{"content":"<p>We travelled west for a few miles to the oldie worlde seaside village of Clovelly. We hadn't realized you had to pay to get to see the village properly, however, we found a semi legitimate entrance. We descended down the cobbled street. No cars and someone was moving house. People use sledges to transport stuff down to their shops and houses which was funny to see.<\/p><img src='images\/years\/2008\/2008_08_14-10-Day6-ClovellyWestwardHo.jpg' class='diaryImage' alt='It girl' \/><p class='diaryImageCaption'>It girl<\/p><img src='images\/years\/2008\/2008_08_14-20-Day6-ClovellyWestwardHo.jpg' class='diaryImage' alt='Clovelly' \/><p class='diaryImageCaption'>Clovelly<\/p><p>We made our way down to the harbour when it began to rain again, which meant we didn't see the waterfall. A really lovely place to visit.<\/p><p>We skipped eastwards to Westward Ho! A place with an exclamation mark in it. A big, deep sandy beach, with rock pools. And we went searching for crabs. With the help of some boys we founds loads of crabs which were put into a bucket. Ben was even brave enough to hold one! We all really enjoyed the hunt, overturning big rocks to see them hiding and boasting on finding the biggest crabs.<\/p><p>Then all of the sudden a big wash of water came over the rocks and the tide had come in so quickly it caught us all out. In fact our shoes were floating on the water and the rucksack with the camera in it began to sink below the water. Fortunately with the help of others we retrieved all our belongings.<\/p><p>We retreated to play in the sand, then off for an ice cream, then back to the park for a swim.<\/p>","images":false},"title":{"value":"North Devon Holiday - Clovelly, Westward Ho!"},"version":1},{"date":{"d":13,"m":8,"y":2008},"datev":20080813,"info":{"content":"<p>The weather continued to be terrible, so we decided non-outside activities today. We trekked up to see Watermouth Castle but decided that it wasn't much of a castle, but it did have a theme park attached to it. However, weather and prices dictated that this would not be today's best option.<\/p><p>We headed along the coast to Combe Martin and got out, walked five paces to see the torrent of water streaming towards the sea and the rocky beach when the heavens opened once more. We forced ourselves to carry on, but the children really were voicing their opinions so we had to abort and continue in the car.<\/p><p>\u000a        We reached the<a href=\"http:\/\/www.lynton-rail.co.uk\/visitors\/location\">Lynton and Barnstable Steam Railway<\/a>which was a half size train. To be honest this was a bit disappointing for £13. A mile down a hill and a mile back again. All in all about 10 minutes of travel.\u000a      <\/p><p>Weather still terrible and to cap a bad day, a big puddle appeared in the foot well of the passenger side of the car as well as Mummy having left the pushchair out in the rain all night!<\/p><p>With limited options we decided to head to Croyde and to a swimming pool which had a 90 minute queue! Anyway we had fun in the pool with Katie and Ben circling around the slide again and again.<\/p><p>We returned home, Ben singing 'We all live in an Elephant Submarine'. Not sure Mr Lennon had thought of these alternative lyrics. As Ben has had so many trouser 'accidents' we had to do a run to the laundrette.... which resulted in Daddy having an argument with a women who jumped the queue in front of us!<\/p>","images":false},"title":{"value":"North Devon Holiday - Steam Railway, Swimming"},"version":1},{"date":{"d":12,"m":8,"y":2008},"datev":20080812,"images":1,"info":{"content":"<p>We headed north to Ilfracombe and braved the elements on the rocky beach. The beach was surrounded by cliffs, and rocks popped out of the sea which made it a great playground for us. We paddled a bit, until Ben fell into the water and screamed his little heart out. Not because he was hurt, but because he was cold! Whilst Mummy took him back to the car to get changed, Katie pretended to be the little mermaid on the rocks. A convincing performance she gave as well. Showers curtailed our beaching experience so we sheltered and had our picnic. The big climb up the cliff which overlooked the beach was next. A great view of the coastline up there.<\/p><p>We then explored the rest of the town by car.... what a lovely town it was as well. A real shame that the weather put pay to more exploration, However, Katie and Mummy's managed a little trip to the tiny chapel at the end of the harbour.<\/p><p>Next stop were the sandy beaches of Woolacombe. We had great fun splashing in the puddles. Mummy and Katie braved it and went in to the sea, but then came running straight out again. Jessica on the other hand was trying to munch her way through the beach. Yes she loved eating sand! Despite the cool climate, we could have stayed there all day.<\/p><p>Just by chance in the ice cream parlour we sat next to Katie's class mate, Phoebe. Small world.<\/p><img src='images\/years\/2008\/2008_08_12-13-Day4-IlfracombeWoolacombe.jpg' class='diaryImage' alt='Ilfracombe Rapids' \/><p class='diaryImageCaption'>Ilfracombe Rapids<\/p>","images":false},"title":{"value":"North Devon Holiday - Ilfracombe and Woolacombe"},"version":1},{"date":{"d":11,"m":8,"y":2008},"datev":20080811,"images":1,"info":{"content":"<p>Early doors we had a look around Bideford town. Really nice again and a refreshing change from chain store to chain store. Narrow streets on a hill with no modern architecture at all.<\/p><p>We pushed onto the Big Sheep, a park aimed exactly for the likes of Ben and Katie. There we took part in some duck trailing, saw lambs being fed, watched three day old piglets jump around their mother, went on a tractor ride and train ride. Daddy and Jess enjoyed the Beer talk, whilst Katie and Ben had a great time in the soft play. We were all surprised when Katie and Ben went down the big drop slide. Ben maintains he really loved it, but funnily enough wouldn't go on it again! He wishes he could be brave but just isn't. Saying that he was able to feed the sheep without any bother. Katie didn't even get close. Certainly we filled the day and had a great time.<\/p><img src='images\/years\/2008\/2008_08_11-09-Day3-BigSheep.jpg' class='diaryImage' alt='Feeding the Big Sheep' \/><p class='diaryImageCaption'>Feeding the Big Sheep<\/p>","images":false},"title":{"value":"North Devon Holiday - The Big Sheep"},"version":1},{"date":{"d":10,"m":8,"y":2008},"datev":20080810,"images":1,"info":{"content":"<p>First thing we went for a walk down to Bucks Mills beach which entailed a woodland walk down, down, down.... And what a secret, great place. A 25 foot waterfall crashing down on to the beach and plenty of rock pools. Fantastic. Only Daddy and Katie fancied the return journey up the hill!<\/p><p>After a 40 mile detour due to someone forgetting the wallet, we made our way to Bude down the coast. A lovely costal town with a large sandy beach and a large amount of wind to go with it. We had to abort the beach picnic as sand was blowing around. We didn't even attempt going near the sea! We made our way to the lighthouse on top of the cliff and out on the blustery causeway.<\/p><p>Ice Creams were next in line. Ben ordered a big, bright blue ice cream and then decided he didn't want it. Jessy of course was sure to make her voice heard and had a nibble at each of ours.<\/p><p>We rushed back and went in the on-site outdoor swimming pool (in the rain) and had a go in the indoor version as well. Something that all three children saw as the best bit of their holiday so far!<\/p><img src='images\/years\/2008\/2008_08_10-19-Day2-BucksMillsBude.jpg' class='diaryImage' alt='Bucks Mills Waterfall' \/><p class='diaryImageCaption'>Bucks Mills Waterfall<\/p>","images":false},"title":{"value":"North Devon Holiday - Cliff Walk, Bude"},"version":1},{"date":{"d":9,"m":8,"y":2008},"datev":20080809,"images":1,"info":{"content":"<p>Our first proper family holiday with the five of us, in fact a first holiday in quite some time. We've chosen a holiday park in Bideford Bay. We've not done North Devon so all new territory.<\/p><p>We meandered our way down through the traffic and weather to Exmoor and stopped off at Minehead. The beach was pretty deserted but we done our best to look for little animal or two in the rock pools. Coldness got the better of Ben after about 30 seconds, especially after he somehow got wet. On our way back to the car we stopped off to see the steam train which arrived at the station.<\/p><img src='images\/years\/2008\/2008_08_09-14-Day1-Minehead.jpg' class='diaryImage' alt='Packed, sunny beach' \/><p class='diaryImageCaption'>Packed, sunny beach<\/p><p>We arrived at the park in the pouring rain and entered our cosy chalet (with a real emphasis on the 'let', as Ben pronounces it). A bedroom for Katie and Ben and a travel cot for Jess. Mummy and Daddy stayed up for the Olympics.<\/p>","images":false},"title":{"value":"North Devon Holiday - Minehead"},"version":1},{"date":{"d":5,"m":8,"y":2008},"datev":20080805,"images":1,"info":{"content":"<p>We awoke early and sat on the bed opening presents. This year the theme was definitely Thomas The Tank Engine and Star Wars. Ben was very excited with his new bike. He said - I'm so pleased with my bike.<\/p><p>Well there was terrible weather so the 20+ people who were going to squeeze into the garden had to squeeze into the house which made things interesting. Anyway Ben's friends were very generous with their presents. We played some traditional games and had a birthday picnic lunch in the front room.<\/p><img src='images\/years\/2008\/2008_08_05-26-BenBirthday.jpg' class='diaryImage' alt='Birthday Chaos' \/><p class='diaryImageCaption'>Birthday Chaos<\/p><p>Although a little frenetic, the children enjoyed themselves. Thanks to all that helped.<\/p>","images":false},"title":{"value":"Ben's 3rd Birthday"},"version":1},{"date":{"d":3,"m":8,"y":2008},"datev":20080803,"images":1,"info":{"content":"<p>A quiet day. In the afternoon we popped down to Frimley Lodge for a go on the steam train and spent a lot of time climbing trees and not in the playground for once!<\/p><img src='images\/years\/2008\/2008_08_03-01-FrimleyLodge.jpg' class='diaryImage' alt='Mummy and Jessica loving' \/><p class='diaryImageCaption'>Mummy and Jessica loving<\/p>","images":false},"title":{"value":"Frimley Lodge"},"version":1},{"date":{"d":2,"m":8,"y":2008},"datev":20080802,"images":1,"info":{"content":"<p>\u000a        Today we were treated to go to<a href=\"http:\/\/www.draytonmanor.co.uk\">Drayton Manor<\/a>, a theme park in the Midlands. Primarily chosen because it had a new 'Thomas Land' which excite Ben very much. In fact both Ben and Katie had been looking forward to this trip very much.... and we were not disappointed.\u000a      <\/p><p>We began in Thomas Land which was pretty busy. We had to swap around quite a lot because Jessie was not allowed on some rides. But we were very impressed on the lack of height restrictions, allowing Ben and Katie to go on most of the rides. After a few rides, we escaped for our picnic and then had a go on the cable cars, which flew over the whole park. This turned out to be all of our favourite ride. So good, we had a second go straight away. There were so many rides which we all went on, including Jessica.<\/p><p>We attempted to rush between rides to fit them all in before the park closed at 6pm. We ended, fittingly, on a ride from Knapford station on Thomas himself.<\/p><img src='images\/years\/2008\/2008_08_02-00-DraytonManor.jpg' class='diaryImage' alt='Drayton Manor' \/><p class='diaryImageCaption'>Drayton Manor<\/p><p>We stopped off at a chippy on the 2.5 hour trip home. All had a good day.<\/p>","images":false},"title":{"value":"Drayton Manor"},"version":1},{"date":{"d":27,"m":7,"y":2008},"datev":20080727,"images":1,"info":{"content":"<p>Katie had 21 friends for her party at Surrey Borders Gym Club, Camberley. It was hot, hot, hot inside. The first hour was spent running around using the gym apparatus. There was a lot of energy out there.<\/p><p>It was lunchtime and the usual concoction of e-numbers were served as well as the innovative Barbie birthday Katie made by Great Grandma and decorated by Great Granddad! Mummy then ran a couple of games: What's The Time Mr Wolf, Musical Bumps and Musical Statues. Two hours was long enough as everyone was sweltering in the greenhouse, gym club.<\/p><img src='images\/years\/2008\/2008_07_27-23-KatieBirthdayParty.jpg' class='diaryImage' alt='Party, Party, Party' \/><p class='diaryImageCaption'>Party, Party, Party<\/p><p>In the afternoon we had some visitor who watched me open the presents given at the party. I got lots of nice things. Thank you for all those who gave presents and helped out at the party.<\/p>","images":false},"title":{"value":"Katie's Birthday Party"},"version":1},{"date":{"d":26,"m":7,"y":2008},"datev":20080726,"first":{"name":"jessica","value":"Wave and Holiday"},"images":1,"info":{"content":"<p>On this glorious sunny day we went down to the local library fete where there were lots of animals to touch. Where Katie would no way touch anything a couple of years back she was now quite curious and stroked a jumping fire bellied toad, a cockroach, a giant African snail and even a snake! Ben on the other hand Ben was a big scaredy cat.<\/p><img src='images\/years\/2008\/2008_07_26-12b-AliceHoltFruitPick.jpg' class='diaryImage' alt='Benny Bum' \/><p class='diaryImageCaption'>Benny Bum<\/p><p>We went out for a picnic in a field in Burnt Oak and then over to a 'pick your own fruit' place, where we got some potatoes, beetroot, rhubarb and lots of raspberries.<\/p><p>Alice Holt was our final destination of the day. We took Katie's new bike, and her old pink one that Ben had attached himself to. Well, that is the last time we follow Mummy. Not only were the bikes unsuitable for the terrain and skill level, but we also got lost and ended up at Lodge Pond! We finally made it back and slept well.<\/p>","images":false},"title":{"value":"Fete, Pick Your Own, Alice Holt"},"version":1},{"date":{"d":24,"m":7,"y":2008},"datev":20080724,"images":2,"info":{"content":"<p>I don't think we have seen Katie eagerly anticipate her birthday as much as this year. She was too excited to sleep last night. Finally falling at 9:30pm, then waking at 5:30am this morning!<\/p><p>Mummy and Daddy could not hold out any longer, and at 6am we began opening some presents. She hauled a nice lot of presents, including some from Denmark which was very kind. Mummy and Daddy had hid Katie's main present in the en-suite. She was very pleased with a new bike!<\/p><img src='images\/years\/2008\/2008_07_24-10-Katie5thBirthday.jpg' class='diaryImage' alt='Katie's new bike' \/><p class='diaryImageCaption'>Katie's new bike<\/p><p>We snuggled downstairs to watch CBeebies, only to find Katie's birthday card had made a TV appearance for the third year running! We were all very excited. First one to be read out as well.<\/p><img src='images\/years\/2008\/2008_07_24-12-Katie5thBirthday.jpg' class='diaryImage' alt='Katie's card on CBeebies' \/><p class='diaryImageCaption'>Katie's card on CBeebies<\/p><p>Natasha, Nina, Emma and Joey, her four closest friends, were invited for lunch and a little play in the back garden. You can tell they had a good time, as there was plenty of mess to be tidied.<\/p><p>Later in the afternoon Farmor, Auntie Susan, Great Grandma and Granddad came across to give presents and for a little play as well. At tea time we had a take away pizza which was a real treat for us all.<\/p>","images":false},"title":{"value":"Katie's 5th Birthday"},"version":1},{"date":{"d":23,"m":7,"y":2008},"datev":20080723,"first":{"name":"katie","value":"School Report"},"images":1,"info":{"content":"<p>Today, was Katie's last day in Miss King's, lambs class. We are very happy with Katie's progress, particularly after a slowish start. Most impressively, Katie in past month has began to start writing sentences of her own accord. She is spelling words phonetically that she has not come across before. She is very happy with school and has made some very good friends.<\/p><img src='images\/years\/2008\/2008_06_XX-01-KatieSchoolReport.jpg' class='diaryImage' alt='Katie's School Report' \/><p class='diaryImageCaption'>Katie's School Report<\/p><p>Ben broke up last week. Difficult to gauge his progress really because he larks around so much. Is there a big brain under that grumpy face? We reckon he picks a lot of stuff up from Katie when we do her homework. Anyway he has a good friend at playschool, Oliver Strangle.<\/p>","images":false},"title":{"value":"School's Out For Summer!!"},"version":1},{"date":{"d":20,"m":7,"y":2008},"datev":20080720,"images":1,"info":{"content":"<p>Katie had a ballet exam this morning. She had to have her hair in a specific style using a 6 inch pink ribbon. All sounds very strict. She done a routine with Natasha. We await to hear the results.<\/p><img src='images\/years\/2008\/2008_07_20-04-Ballet.jpg' class='diaryImage' alt='Nijinsky (not the horse)' \/><p class='diaryImageCaption'>Nijinsky (not the horse)<\/p><p>It was Harrison's first birthday and we went around the West's abode for a BBQ and a jump about on the bouncy castle. It was good to see Katie and Ben mix with children they do not know so well. It was good to see James and Emma there as well.<\/p><p>Later in the evening Karen took Mummy out to see Mama Mia at the cinema. Mummy said it was the best film ever.<\/p>","images":false},"title":{"value":"Ballet Exam, Harrison's 1st Birthday"},"version":1},{"date":{"d":19,"m":7,"y":2008},"datev":20080719,"info":{"content":"<p>Daddy spent the morning constructing Katie's bike that she is getting for her birthday. Wonder how long it stays up before it falls apart? Emma, Katie's class friend, had a lunchtime birthday at Tomlinscote school.<\/p><p>Later in the sunny afternoon we popped over to Frimley Green Rec and sat on top of the hill to watch the Farnborough Air Show. There were lots of people that had a similar idea. Daddy and Jessica sat at the top of the hill, unfortunately, most of the planes had flown by. The rest of us played on the swings of course!<\/p>","images":false},"title":{"value":"Emma's 5th Birthday"},"version":1},{"date":{"d":13,"m":7,"y":2008},"datev":20080713,"images":1,"info":{"content":"<p>Daddy stayed over at the hotel overnight and had breakfast with some of the wedding guests. Meanwhile the rest of us were preparing for the Frimley Green Carnival. Mummy had done a lot of work in organising the stall and float for the playschool contribution.<\/p><p>We had help from Ma Ma, Pop Pop, Charlotte and the Sanders. 2pm came and the procession started. Mummy and Daddy were able to hitch a ride on the Nations Of The World themed, playschool float with Ben. Katie was on the Cross Farm float. The crowds were pretty large. We managed to see all the grandparents and great grandparents, the Danes and the West’s on the short route to the Lakeside club.<\/p><p>Ben enjoyed looking out to the crowds. We think Katie enjoyed it to, although we didn't see her.<\/p><img src='images\/years\/2008\/2008_07_13-46-FrimleyGreenCarnival.jpg' class='diaryImage' alt='View from the playschool float' \/><p class='diaryImageCaption'>View from the playschool float<\/p><p>Soon after we departed and went separately again. Daddy went over to Auntie Susan’s to see her and Graham open wedding presents. The rest of us went to Grace's birthday party where there was a magic man!<\/p><p>Come the end of the day we were all pretty tired. One of the busiest weekends we have had ever we think.<\/p>","images":false},"title":{"value":"Frimley Green Carnival"},"version":1},{"date":{"d":12,"m":7,"y":2008},"datev":20080712,"images":9,"info":{"content":"<p>Finally after nine years of courting and a year plus engagement, Susan and Graham were today to get married in St Peter's, Frimley. Preparations went well, Susan, Farmor and Enid made sure of that. The weather all week has been shockingly wet, so we were surprised to see that we had a sunny day for all the bits that were important.<\/p><p>Susan, Sophie, Farmor and Farfar prepared at Richmond Close. The hairdresser was snipping hair and all was pretty relaxed. Daddy was getting nervous in preparing for his Corinthians reading. Katie was getting ready and looking beautiful in her bridesmaid outfit. 3pm arrived, we were all settled in church and Susan, who looked fantastic, was led arm in arm by Farfar, who looked very smart and proud, with the bridesmaids trailing behind in their half white, half lavender coloured dresses. Graham was waiting at the altar in his dress, with his brother, the best man, Robin, who only just made it due to commando exercises.<\/p><p>The ceremony was conducted by Mavis, the lady vicar. Graham was pretty jovial throughout the service. Daddy got through his reading OK. Jessica was a fidget and a chatterbox throughout the service. It was so nice to see so much family around, many seeing Jessica for the first time. Unfortunately we didn't know Graham's family too well.<\/p><img src='images\/years\/2008\/2008_07_12-01a--02-SusanGrahamWedding.jpg' class='diaryImage' alt='Church Exit' \/><p class='diaryImageCaption'>Church Exit<\/p><p>\u000a        After an hour the service ended and we made our way outside for photos and to see Susan and Graham Tremear off in their old gangster car. The parents had a £120k Bentley to take them to the reception at the\u000a        <a href=\"http:\/\/www.mercure.com\/mercure\/fichehotel\/gb\/mer\/6621\/fiche_hotel.shtml\">\u000a          Farnham Bush Hotel\u000a        <\/a>\u000a        . They wouldn't for some reason let me chauffeur them!\u000a      <\/p><img src='images\/years\/2008\/2008_07_12-15a--03-SusanGrahamWedding.jpg' class='diaryImage' alt='With the beautiful bridesmaids' \/><p class='diaryImageCaption'>With the beautiful bridesmaids<\/p><p>More photos and Graham revealed that there wasn't too much clothing under his dress! Shocking! We sat down for the Wedding Breakfast which consisted of Tomato and Cheese for starter, Roast Beef for mains and a tart thingy for pudding. Very nice, although Mummy and Daddy took it in turns to take Jessica out for a walk. Then came the speeches...<\/p><img src='images\/years\/2008\/2008_07_12-09a--04-SusanGrahamWedding.jpg' class='diaryImage' alt='Skipping Bridesmaids' \/><p class='diaryImageCaption'>Skipping Bridesmaids<\/p><img src='images\/years\/2008\/2008_07_12-21--04-SusanGrahamWedding.jpg' class='diaryImage' alt='Foreground - Background' \/><p class='diaryImageCaption'>Foreground - Background<\/p><img src='images\/years\/2008\/2008_07_12-27a--04-SusanGrahamWedding.jpg' class='diaryImage' alt='Gay side of the family' \/><p class='diaryImageCaption'>Gay side of the family<\/p><img src='images\/years\/2008\/2008_07_12-40--04-SusanGrahamWedding.jpg' class='diaryImage' alt='Chase me' \/><p class='diaryImageCaption'>Chase me<\/p><img src='images\/years\/2008\/2008_07_12-44--04-SusanGrahamWedding.jpg' class='diaryImage' alt='The Danish connection' \/><p class='diaryImageCaption'>The Danish connection<\/p><img src='images\/years\/2008\/2008_07_12-49--04-SusanGrahamWedding.jpg' class='diaryImage' alt='Reardons laughing at Graham's underwear' \/><p class='diaryImageCaption'>Reardons laughing at Graham's underwear<\/p><p>First up for the slaughter was Farfar. Nervous anticipation. He had done very well and even Mummy, the harshest critic said it was a lovely speech. Next up was Graham who also said some lovely, heart-felt things. Finally Robin, who kept it to about 10 minutes and came up with some funny and original content. Overall good speeches. Time was marching on, so the cake cutting and coffee was left to later and the hall was cleared for the first dance and disco.<\/p><p>Katie and Ben were looking forward to this part all day long. Susan and Graham couldn't have their preferred Pink Floyd song, instead had to go for something slower and less rocky which would be more appropriate for a first dance. As soon as it was time for the disco, Katie and Ben began to flag quickly and very soon it was home time for them. We returned home and left Daddy to carry on at the party.<\/p><img src='images\/years\/2008\/2008_07_12-15--06-SusanGrahamWedding.jpg' class='diaryImage' alt='First dance' \/><p class='diaryImageCaption'>First dance<\/p><p>Daddy managed to speak a lot to the Dixons', stepping his foot in it with the impending arrival of David and Lisa Dixon number 2 child. Obviously fun with the Danish clan of Lise, Jørgen, Joan and Gert. Also managed to speak to Graham's parents and Uncles Ross and John. Barrie was 'taking the micky' fodder. He is so tight it is unbelievable.<\/p><p>It was good to see the Reardons who had only touched down 12 hours previously to come down from the Midlands. Joshua such a nice lad - someone I last maybe have seen as a baby.<\/p><p>The disco finished about 12:30 with a dozen of the hardened crew, including the bride and groom staying in the hotel bar. A good day had by all.<\/p>","images":false},"title":{"value":"Susan and Graham's Wedding"},"version":1},{"date":{"d":5,"m":7,"y":2008},"datev":20080705,"images":1,"info":{"content":"<p>Katie went off to Ma Ma's with Joey for the day. The rest of us met up with the Sanders and went to visit Rebecca at her home near Liss. You could see Rebecca really wanted to stay awake, but she was very sleepy. We continued anyway and took her for a walk around the grounds and had a scrummy picnic.<\/p><p>Fortunately we had a shared picnic, which means we get to eat all the nice food that the Sanders had bought. Daddy was in his element. We said out goodbyes and moved on to a really good swing park in Petersfield next to a lake and had an ice cream!<\/p><p>Later in the afternoon we went over to the Elders who were hosting a BBQ. Michael ensured that all the meat was thoroughly cooked. Ben decided he could sort himself out when it came to sitting on the toilet. Anyway there was a lot of mess in that bathroom and not all where it was intended to be! Embarrassing. The evening turned into a Wii Fit event. Daddy was on the border of being overweight!<\/p><img src='images\/years\/2008\/2008_07_05-02-KarenRichElderBBQ.jpg' class='diaryImage' alt='Jessica saying hello to Rebecca' \/><p class='diaryImageCaption'>Jessica saying hello to Rebecca<\/p>","images":false},"title":{"value":"Rebecca Visit, Elder BBQ"},"version":1},{"date":{"d":29,"m":6,"y":2008},"datev":20080629,"images":1,"info":{"content":"<p>The Fars were tasked with planning an afternoon out. So we headed off to Wellington Country Park. There were lots of playgrounds there which obviously pleased us. We spent ages at sand and water pit where we built dams and rivers.<\/p><img src='images\/years\/2008\/2008_06_29-15-WellingtonCountryPark.jpg' class='diaryImage' alt='Ben enjoying the Sand and Water Pit' \/><p class='diaryImageCaption'>Ben enjoying the Sand and Water Pit<\/p>","images":false},"title":{"value":"Wellington Country Park"},"version":1},{"date":{"d":28,"m":6,"y":2008},"datev":20080628,"images":1,"info":{"content":"<p>Mummy went to London with Ellie for another birthday treat! Leaving Daddy and Uncle Michael with us five children. Daddy day care. We went over to the Royal Logistics Corps show which was good. We saw the tug of war, the cavalry, a world championship motorbike display team and went on some fairground rides. The Fars joined us and we also saw Sarah, Caroline and their respective families.<\/p><img src='images\/years\/2008\/2008_06_28-35a-RLCOpenDay.jpg' class='diaryImage' alt='World Championship Motorbike Display Team' \/><p class='diaryImageCaption'>World Championship Motorbike Display Team<\/p><p>Needless to say the house was manic and in a big, big mess by the time Mummy returned.<\/p>","images":false},"title":{"value":"RLC Open Day"},"version":1},{"date":{"d":25,"m":6,"y":2008},"datev":20080625,"images":1,"info":{"content":"<p>Mummy has reached the grand old age of 32. We started the day by opening presents and cards in bed. Daddy gave mummy a pink and white pair of Nike's, two pink and white tops and some pink and white socks along with a CD player for the kitchen. Mummy also got £55 of Next vouchers, some pyjamas, some smellies and lots of chocolates.<\/p><p>We went along with Daddy down to the Spar. We each had some money to buy mummy some sweeties. Well only the wine gums made it home to Mummy, the other sweet were eaten en-route home!<\/p><p>It was Katie's Sports Day in the morning and Daddy managed to get a half day's holiday to come and watch. The school was split into teams comprising of a dozen children from each year of the school. Each team performed an event for two minutes, then moved onto the next one. Anyway Katie's team won, although I don't think we can say that she is a budding athlete.<\/p><p>Next were the individual, 40 metre races. Katie came half way. \"Did you see I takeover somebody?\". She was proud of this fact. Mummy came last in the .... erm Mummies race which involved balancing a bean bag on her head. Daddy came third in the .... erm Daddies race.<\/p><p>Auntie Ellie, Joey and Lily later came around, then sandwiched between picking Katie up from school and swimming, we visited the Fars who gave mummy a tent.<\/p><p>We had a curry and watched a DVD in the evening, which we slept half way through!<\/p><img src='images\/years\/2008\/2008_06_25-00-KatieSportsDay.jpg' class='diaryImage' alt='Sports Day and Birthday' \/><p class='diaryImageCaption'>Sports Day and Birthday<\/p>","images":false},"title":{"value":"Mummy's 32nd Birthday and Sports Day"},"version":1},{"date":{"d":24,"m":6,"y":2008},"datev":20080624,"images":1,"info":{"content":"<p>All we can say is that it must have been a slow news week!<\/p><img src='images\/years\/2008\/2008_06_24-01-CamberleyMail.jpg' class='diaryImage' alt='Katie and Daddy fame at last!' \/><p class='diaryImageCaption'>Katie and Daddy fame at last!<\/p>","images":false},"title":{"value":"Daddy and Katie - Front Page Of The Camberley Mail"},"version":1},{"date":{"d":22,"m":6,"y":2008},"datev":20080622,"images":2,"info":{"content":"<p>After Daddy's attempt at BBQ'ed belly of pork, we went to Runnymede Pleasure Grounds. Mummy went with Ma Ma, Pop Pop, Charlotte and Ellie to the Runnymede Hotel for high tea to celebrate Ellie's 30th birthday.<\/p><p>The rest of us went to see the talking tree, play on the swings and have a walk up and down the Thames. We had a great time.<\/p><img src='images\/years\/2008\/2008_06_22-02-Runnymede.jpg' class='diaryImage' alt='Loving siblings!' \/><p class='diaryImageCaption'>Loving siblings!<\/p><img src='images\/years\/2008\/2008_06_22-35-Runnymede.jpg' class='diaryImage' alt='Les Dawson!' \/><p class='diaryImageCaption'>Les Dawson!<\/p>","images":false},"title":{"value":"Runnymede Pleasure Grounds"},"version":1},{"date":{"d":21,"m":6,"y":2008},"datev":20080621,"first":{"name":"katie","value":"Katie - No Stabilizers"},"images":1,"info":{"content":"<p>We had planned to go to Brighton today, however, the weather put pay to that idea. Instead Ben decided to get in touch with his feminine side (again!) and demanded to be called Alyssa and dressed up in a pink dress! Of course we again had to watch Star Wars, we have now moved to Empire Strikes Back!<\/p><p>In the afternoon we went to the Pool In The Park, Richmond. It had a proper indoor and outdoor pool as well as a nice warm baby pool, which we initially went in. Ben continued to be a 'girl' when it came to the outdoor pool, complaining it was too cold! Katie on the other hand loved it and wanted to stay in there. Her swimming is really coming on. I think she actually managed to swim 10 meters without touching the bottom. It wasn't fluid mind you, but at least she is improving.<\/p><p>I think we were there for two hours. All but the driver slept on the way home. Just before dinner, Daddy tried Katie once more on the bike without the stabilizers. We had tried earlier in the year, but it really was hopeless. This time however, Katie managed to balance right away.  She just struggled a bit on the start, but she was so happy that she could join the rest of her friends in the 'I've got no stabilizers' group. Well done Katie.<\/p><img src='images\/years\/2008\/2008_06_21-00-KatieNoStablelizers.jpg' class='diaryImage' alt='Girlie Ben and Cycling Katie' \/><p class='diaryImageCaption'>Girlie Ben and Cycling Katie<\/p>","images":false},"title":{"value":"Katie on two wheels"},"version":1},{"date":{"d":19,"m":6,"y":2008},"datev":20080619,"first":{"name":"jessica","value":"Crawling forwards"},"info":{"content":"<p>Jessica has being moving around by rolling around the carpet up until now and half a pace backwards crawling. However, today she amazed us by actually crawling forwards across the room. Well done Jessica.<\/p>","images":false},"title":{"value":"Jessica crawls.... forwards"},"version":1},{"date":{"d":15,"m":6,"y":2008},"datev":20080615,"images":1,"info":{"content":"<p>Daddy was treated to a fried breakfast in bed for Father's day. Ben had made a card with a photo of himself and an outline of his hands for Daddy. Katie was given £1 at school to buy something at the school stalls. She had bought a mini torch to go on my key ring, and Jessica kindly got Daddy (which of course had to be shared with Mummy) a chocolate bar.<\/p><p>We popped over to the Fars in the morning, whilst Katie and Mummy went to church. The train set made an appearance surprisingly enough.<\/p><p>From there, all of us went over to Istead Rise for Iscot, to celebrate Ellie's impending 30th birthday. The Barnett clan arrived along with some of Ellie's friends. Judith came all the way down from Manchester! The afternoon had an Ascot theme with betting on horse races shown on DVD. Pop Pop also done a BBQ.<\/p><img src='images\/years\/2008\/2008_06_15-11-FarsIscot.jpg' class='diaryImage' alt='Iscot' \/><p class='diaryImageCaption'>Iscot<\/p>","images":false},"title":{"value":"Father's Day - Iscot"},"version":1},{"date":{"d":14,"m":6,"y":2008},"datev":20080614,"images":1,"info":{"content":"<p>\u000a        We went with the Fars over to<a href=\"http:\/\/www.bekonscot.com\/\">Bekonscot<\/a>, the oldest model village in the world. We started with a train ride then a look around the model city, rather than village. All set in the 1920's. Katie and Ben loved looking at all the little shops, people and model train set which ran all the way around the place.\u000a      <\/p><p>\u000a        After picnicking and an extended play at the swings we finished off the village and headed towards the\u000a        <a href=\"http:\/\/www.theoldshirehorsecentre.com\/\">\u000a          Old Shire Centre\u000a        <\/a>\u000a        near Maidenhead. We went for the shire horses, but on arrival we were told that there have not been shire horses there for 12 years! We were told it was the 'Old' Shire Centre, as in there used to be shire horses. Still a bit of a con. Nevertheless we saw Farfar in one of the pig pens again, and had our second tranche of swings! If there was a choice between the farm animals or swings, they would choose swings every time at the moment.\u000a      <\/p><img src='images\/years\/2008\/2008_06_14-00-Bekonscot.jpg' class='diaryImage' alt='Bekonscot' \/><p class='diaryImageCaption'>Bekonscot<\/p>","images":false},"title":{"value":"Bekonscot"},"version":1},{"date":{"d":13,"m":6,"y":2008},"datev":20080613,"images":1,"info":{"content":"<p>As part of the impending Father's Day, all Daddy's were allowed to go to school with their children and sit in the lessons for as long as they wanted. So Daddy nervously wanted to go. You never know he might learn something. Daddy was going to see what actually goes on. When he asks Katie what she does, we always get an unenthusiastic response.<\/p><p>Daddy was the only father to turn up for the first part of day (9am). We played until the register was called. It was a bit embarrassing for Daddy as he seemed centre of attention, with children wanting to sit next to him and even cuddle him! There was a lot of things to get the children involved. Questions about today's weather, today's date, what we are currently learning, etc. I noticed that most pupils were eager to put their hands up to answer, however, Katie was a little tentative. When she reluctantly put her hand up for the 'day of the week' question, she answered correctly, Friday, however, when asked how she knew that she replied that it was a guess. Well at least she is honest.<\/p><p>One thing I could say very positively is that Katie was very attentive, sat still and focused on Miss King and what she said. Others had to be told subtlety to buck their ideas up.<\/p><p>The current topic was farm animals, in particular knowing an adult and child name of a species. We were all given a small card, with a picture and word of an animal. We then had to go around the class and ask for its older or younger counterpart. This was quite fun and we played this twice. Miss King then took a group of 4 or 5 and took them through some book work. The 15 others, could play in the classroom or just outside where there were many activities, from painting, playing the water pit, Lego, musical instruments, farms and computer work. I think in the half an hour we managed to get round all of these, including playing vets in the Wendy house. Some of Katie's friends followed Daddy around and try to steal him from Katie! I think it was daddy being silly and making pig noises won them over!<\/p><p>At 10:15 it was the school assembly. Each class took a line in the main hall and sat down. Mrs Allen, the headmistress, appears to know the names of all the pupils which is quite remarkable really, as she politely told some pupils to behave themselves. Anyway, after the healthy eating topic, she moved onto the Headmistress Awards. Two pupils from each class, each week get picked out for something good they have done. They pulled to the front of the assembly and asked about their work. Well today, it so happens that Katie was picked for her exceptionally improvement in her writing. She has been behind and something of a concern, but recently she has been able to form her letters a lot better now. It was nice to see some recognition for this. Anyway Daddy was very proud and Katie was beaming also. Well done Katie.<\/p><p>Before daddy had to rush back to work, him and Katie were picked out with a couple of others to have their photo taken for the Camberley News and Mail newspaper (in the end we made the front page!! See account on 24th June 2008). Not sure if they'll make it, but it was good to be picked. Must be because of the looks!<\/p><p>A really enjoyable time for Daddy. An insight in what goes on between 9am and 3pm.  From the little he saw, there is quite a lot of play and Katie needs her confidence building up when answering questions.<\/p><img src='images\/years\/2008\/2008_06_13-05-MartinToSchoolKatie.jpg' class='diaryImage' alt='School Pals' \/><p class='diaryImageCaption'>School Pals<\/p>","images":false},"title":{"value":"Daddy Goes To School"},"version":1},{"date":{"d":9,"m":6,"y":2008},"datev":20080609,"images":1,"info":{"content":"<p>The girls and Ben went to church while the boys stayed at home to build the trampoline and see saw Ma Ma had bought. On the way home the girls popped in to see Auntie Anna and Uncle Peter and fed their fish. Katie and Ben were desperate to get back and play on the new things. Daddy and Pop Pop had done a fine job putting them together. Katie and Ben then played in the lovely sun.<\/p><p>Ma Ma had also bought some water pistols. Mummy had the idea to call Daddy into the garden and Pop Pop was supposed to lock the door and we were going to soak him. However, Pop Pop missed his cue to lock the door and we squirted daddy but he did not find it funny, then we got Ben who also did not find it funny. Like father like son. Katie, mummy and Ma Ma enjoyed themselves though.<\/p><p>Pop Pop cooked a £22 leg of lamb which Daddy and pop Pop loved. In the afternoon we all went to see Teaky, Ma Ma's horse. Katie groomed it and sat on her. We then drove home very tired.<\/p><img src='images\/years\/2008\/2008_06_08-21-SundayAtCarolGerry.jpg' class='diaryImage' alt='Montage' \/><p class='diaryImageCaption'>Montage<\/p>","images":false},"title":{"value":"Church and Horseys"},"version":1},{"date":{"d":8,"m":6,"y":2008},"datev":20080608,"images":2,"info":{"content":"<p>We set off at 08;15 to Auntie Helen's house. We had a cup of tea in the mansion and Katie and Ben ate her whole stock of biscuits and made do with the cats toys as a way of amusement.<\/p><p>We left there and drove to Medway country park to meet Ma Ma and Pop Pop. We had a walk round and then a nice picnic made by Pop Pop. We then went on to the Marina for a sail on Babar. We sailed past Chatham and Upnor Castle and saw an old submarine. Katie and Ben enjoyed it, playing houses in the cabins.<\/p><img src='images\/years\/2008\/2008_06_07-10-Babar.jpg' class='diaryImage' alt='Check Me Out' \/><p class='diaryImageCaption'>Check Me Out<\/p><img src='images\/years\/2008\/2008_06_07-26-Babar.jpg' class='diaryImage' alt='On Babar' \/><p class='diaryImageCaption'>On Babar<\/p><p>In the evening Pop Pop and Daddy went clothes shopping to Bluewater (what girls!). While Mummy and Ma Ma ate a whole bag of M and Ms and gossiped.<\/p>","images":false},"title":{"value":"Helen's, Sailing With Ma Ma and Pop Pop"},"version":1},{"date":{"d":1,"m":6,"y":2008},"datev":20080601,"info":{"content":"<p>We were awoken at 6am with a knock on the door from Charlotte and Katie! They returned early after not having much sleep. We left for Southsea at 9:30 to find a good spot to see all the runners go past and hopefully see our crew. Anyway after a bit of a rush we saw the leaders go past and kept our eyes peeled. The field went down to the walkers and we were sure we had missed Ellie and Char. So Mummy decided to move on to a place without telling Daddy. Anyway we were all separated, phoneless and lost.<\/p><p>Mummy did manage to see the girls close to the finish line which was nice. They made it around the 5kn course in about 40 minutes. Eventually Daddy found us and we met up with the Sanders and Elders to have a picnic just behind the beach. We later, then went onto the stony beach where we paddled in the ice cold sea. Well Daddy and Katie did. Ben was not getting out of his big, think boots and shorts. Anyway Joey bravely bared all and went into the sea!<\/p><p>On our return home we stopped off at the campsite, cleared up the tent from the night before and had a go on the swings. An early night.<\/p>","images":false},"title":{"value":"Ellie and Charlotte - Race For Life"},"version":1},{"date":{"d":31,"m":5,"y":2008},"datev":20080531,"images":1,"info":{"content":"<p>Daddy went off with Farfar for Uncle Graham's Stag clay pigeon shooting. Of course they turned up late. Daddy started off with 9 out of 10.... then proceeded with 3 out of 30. Farfar, was marginally better. Graham's team won, although most people had huge red marks over their shoulders. It was quite interesting to hear about it all. At 30 yards the shot spreads over a 30 inch diameter.<\/p><p>Meanwhile the rest of us played with Natasha at the swing park, then Auntie Charlotte turned up to take Katie camping at the Basingstoke Canal Centre. She had a late night, but a very enjoyable one.<\/p><p>Ben's current craze is Star Wars, or as he says it Star Warez. He is Luke Skywalker and knows the main characters and main storyline. He unfortunately has a 'light saver'!.. or picks up sticks as a substitute and waves it about, without much care for what's around.<\/p><p>Jessica is getting a lot better at night time. Not so much of the pain ridden screaming at night.... Just waking for feeds and attention. She is yet to start crawling, so she is behind Katie and Ben after 8 months.<\/p><img src='images\/years\/2008\/2008_05_31-12-ClayPigeonShooting.jpg' class='diaryImage' alt='At the shoot' \/><p class='diaryImageCaption'>At the shoot<\/p>","images":false},"title":{"value":"Clay Pigeon Shooting, Camping With Charlotte"},"version":1},{"date":{"d":25,"m":5,"y":2008},"datev":20080525,"images":1,"info":{"content":"<p>In the morning we went over to Alton to pick up the children from the Elders. We went for a long walk to the other side of Alton, via the steam railway, which everyone found exhausting.<\/p><p>Along with the Elders we scooted over to Basingstoke and had a go at ten pin bowling. Ellie was by far the best, and Michael the worst. The Gay's beat the Elders. The children loved getting them all down. They were so proud!<\/p><img src='images\/years\/2008\/2008_05_25-02a-Bowling.jpg' class='diaryImage' alt='Ten Pin Bowling' \/><p class='diaryImageCaption'>Ten Pin Bowling<\/p><p>We said our farewells and we trundled next door to a steam fair which, by luck was still going strong. Ben and Daddy of course loved all the traction engines. There is something about the smell of steam which is magical.<\/p><p>We didn't stay too long as we had a hotel booked for the night in Amesbury, near Stonehenge. We got there in good time. It was Daddy, Ben and Katie's job to find our now traditional Fish and Chips. It was a Sunday evening and it wasn't going to be easy. We headed south to Salisbury city centre, and after asking 3 different people and walking around in circles we finally managed to get our treat, plus a bonus lollipop from the fish and chip man just to make sure we were really unhealthy. Surprisingly Katie and Ben didn't gobble it down there and then, and decided to save the lollipop for tomorrow! Very sensible.<\/p><p>We had the usual fun and games during the night with Jessica. We awoke on the Bank Holiday Monday to a torrent of rain. We decided not to travel to Gloucester to see the cheese rolling, instead we made it home by 8:30am.<\/p>","images":false},"title":{"value":"Bowling, Overnight Hotel Stay"},"version":1},{"date":{"d":24,"m":5,"y":2008},"datev":20080524,"images":1,"info":{"content":"<p>\u000a        We shuffled around our weekend plans due to the weather forecast and trundled south towards Bournemouth and went to\u000a        <a href=\"http:\/\/www.adventurewonderland.co.uk\">\u000a          Adventure Wonderland\u000a        <\/a>\u000a        . All the children could go on most of the rides which was really nice. It was pitched just at the right level for Katie's age. There were lots of rides and playground activities. I think the favourite was the inflatable crocodile. Mummy and Daddy were assured it wasn't a real one.\u000a      <\/p><img src='images\/years\/2008\/2008_05_24-37-AdventureWonderland.jpg' class='diaryImage' alt='Adventure Wonderland' \/><p class='diaryImageCaption'>Adventure Wonderland<\/p><p>We headed back towards the Elders where we dropped off Katie and Ben to stay overnight. Katie, Ben, Joey and Lily were very pleased with this arrangement.<\/p>","images":false},"title":{"value":"Adventure Wonderland"},"version":1},{"date":{"d":18,"m":5,"y":2008},"datev":20080518,"images":1,"info":{"content":"<p>In the afternoon Katie had yet another birthday party. This time it was the turn of Ben Theobald.<\/p><p>Later the Gay's came over for a BBQ. Of course Daddy's BBQ's never go to plan, and Graham had to step in. We took the British approach to the afternoon, in that it was pretty chilly, but we were determined to have a good time outside!<\/p><img src='images\/years\/2008\/2008_05_18-02-BBQ.jpg' class='diaryImage' alt='Building block fun' \/><p class='diaryImageCaption'>Building block fun<\/p>","images":false},"title":{"value":"BBQ"},"version":1},{"date":{"d":17,"m":5,"y":2008},"datev":20080517,"images":1,"info":{"content":"<p>In the morning Cross Farm had their summer fete, which featured Katie doing Maypole dancing in front of lots of parents and the rest of the school. Daddy ran the 'score a goal' stall. It was nice to see all grandparents and great grandparents there as well.<\/p><p>In the afternoon Ben, Jessica and Mummy went to Theo's party, leaving Daddy biking Katie over to Tomlinscote for Oliver's birthday party.<\/p><img src='images\/years\/2008\/2008_05_17-09-CrossFarmFair.jpg' class='diaryImage' alt='Ben going to a pirate party' \/><p class='diaryImageCaption'>Ben going to a pirate party<\/p>","images":false},"title":{"value":"School Fete and Birthday Parties"},"version":1},{"date":{"d":11,"m":5,"y":2008},"datev":20080511,"info":{"content":"<p>Some more great weather, this time enjoyed at home. In the afternoon the Sanders came over for a BBQ. It's been a while since we've seen them. We listened to the radio as it was a tense last day of the Premiership. Daddy was happy as Man Utd won.<\/p>","images":false},"title":{"value":"BBQ with the Sanders"},"version":1},{"date":{"d":10,"m":5,"y":2008},"datev":20080510,"images":1,"info":{"content":"<p>On a gloriously hot, sunny day we played in the garden and collected bugs in the bug box as well as making trains out of Lego. We went over to Jakes soft play for Ben Stockwell's birthday. Later, the Elders popped in to borrow our bike and play for a bit.<\/p><p>In the afternoon we went down to St. Andrews for the church fete. The usual games were there which the children enjoyed. There was also some face painting. Katie chose a butterfly with glitter. Our boy, our son had the choice of Spiderman, an army man, a pirate. What does he chose? A butterfly with glitter! Please. Obviously we need to toughen him up a bit! Not only that later, he managed to produce a puddle whilst we were watching Katie having a go on the skittles! Saying that, Ben is doing very well generally with his toilet training. Great grandma and granddad were also there enjoying the sunshine and a scone. Daddy spoke to the vicar for quite a while.... not about religion as such, well it's Daddy's religion. We spoke about Aston Villa and Brighton football clubs!<\/p><img src='images\/years\/2008\/2008_05_10-20a-ChurchFete.jpg' class='diaryImage' alt='Two little butterflies' \/><p class='diaryImageCaption'>Two little butterflies<\/p><p>We scooted from the fair over to the Jacquet household in Camberley. Katie and Ben played in the paddling pool and trampoline, whilst the grown-ups sat in the sun and relaxed.<\/p><p>The Fars came over to babysit whilst Mummy and Daddy went to Hardy's in Bagshot to celebrate Michael's 30th birthday. He got very drunk and went out clubbing for the night.<\/p><p>Jessica has been pretty bad at sleeping over the past few weeks. She is getting worse rather than better. She seems to wake at 8 or 9pm, then at 11pm, and then on and off until 5am, at which time she is ready to play.<\/p>","images":false},"title":{"value":"Ben Stockwell's  5th Birthday, Church Fete, Jacquets, Michael's 30th Birthday"},"version":1},{"date":{"d":6,"m":5,"y":2008},"datev":20080506,"images":1,"info":{"content":"<ul><li><i>Katie<\/i>(Comes home from school) Today, I've learnt how to pole dance!... Really she meant may-pole dance\u000a        <\/li><li><i>Ben<\/i>Jessica is 'wide asleep'... derived from 'wide awake' I guess.\u000a        <\/li><\/ul><p>\u000a        Continuing with the good weather we went to<a href=\"http:\/\/www.hollycombe.co.uk\/\">Hollycombe Steam Collection<\/a>. It's a place with some old fashioned steam driven fair rides and of course steam engines in all shapes and sizes. However, their favourite attraction was the walk-through haunted errr. room. A very simple thing. A big room painted black, no lights, a maze of corridors and feel your way in the dark.\u000a      <\/p><p>The swing boats. Ben got in a really bad mood because he couldn't work out how to swing the boat. He didn't know when to pull the rope and when to leave it alone. Of course mummy and daddy told him how, but he still couldn't grasp it initially. After a third attempt of explaining he got it and Katie and Ben merrily sailed up and down, up and down.<\/p><p>We went on the steam train and steam engine ride. We went to the 'magic lantern show' which was really old fashioned. Some old slides were shown accompanied with a poem and a song. Needless to say we embarrassingly had to walk out as the kiddies got restless. We ended on some more rides. A thoroughly enjoyable day out.<\/p><img src='images\/years\/2008\/2008_05_05-00-Hollycombe.jpg' class='diaryImage' alt='Hollycombe 2008' \/><p class='diaryImageCaption'>Hollycombe 2008<\/p>","images":false},"title":{"value":"Hollycombe Steam"},"version":1},{"date":{"d":4,"m":5,"y":2008},"datev":20080504,"images":1,"info":{"content":"<p>\u000a        Today we attended two events on opposite sides of the society spectrum, both within a mile of each other. First we went to the 'la de da'\u000a        <a href=\"http:\/\/www.aldershotshow.com\/\">\u000a          Aldershot Horse Show\u000a        <\/a>\u000a        at Tweseldown race course. We settled down at the main Arena to watch some show jumping. The fences were pretty high and we were initially unaware it was at international standard! Katie and Ben were interested up to a point, but were easily distracted by things, like going to the toilet multiple times! Ben is currently back in his 'big boy pants' with more success than previously. Out of the six widdles, four were successful and two times he forgot! Still it is progress and at least worth pursuing.\u000a      <\/p><p>\u000a        We sat and ate our picnic, then went over to see the animal rescue team which had some serious, but funny photo's of animals being stuck. There was also a\u000a        <a href=\"http:\/\/www.thesheepshow.co.uk\/\">\u000a          sheep show\u000a        <\/a>\u000a        which was really funny for both the children and adults. The kiwi man sheared a sheep first, then managed to get some of the sheep to dance. He was very amusing. Next door in complete contrast, was a disorganised family who ran the ferret racing. The man on the microphone went off on tangents and really no one was listening to him. Anyway, I'm glad to say that all three children were brave enough to stroke the animal before they raced, which is more than can be said for their mother! The race itself was very funny, with the ferrets going one way then another. Ben is a very, very poor loser. His ferret did not win and he got in an almighty strop because of this.\u000a      <\/p><p>Next stop was the army, inflatable assault course which Katie won easily, twice! There was a staged horse chasing show, then the sheep man was back again, this time with a sheep race which again was funny. Overall a very nice event. Not too packed, not too expensive. Just right. We saw one of Daddy's old football chums and we also managed to bump into the West family who were enjoying an ice cream.<\/p><p>\u000a        We moved a mile down the road to see if we could catch the last of the banger racing. After 16 years,\u000a        <a href=\"http:\/\/www.spedeworth.co.uk\/raceways\/aldershot.html\">\u000a          Spedeworth\u000a        <\/a>\u000a        have opened a track in Aldershot again, much to Daddy's delight. Anyway we sneaked in to watch the final three races, hoping that we may be able to go more regularly as a family. The bangers were a bit thin on the ground, but there were plenty of stock cars. We saw a few crashes and the smell of oil and rubber and the sound of metal scraping on tarmac were all reminiscent of days gone past. Anyway Ben seemed to enjoy it, but Katie was more interested in playing in the dust. The family looked a right mess, with chocolate ice cream around their chops and half their picnic down their clothes. This was about par for the course in the surroundings. We'll do it again one day.\u000a      <\/p><img src='images\/years\/2008\/2008_05_04--00-HorseShowBangerRacing.jpg' class='diaryImage' alt='Horse Show and Stock Car Racing' \/><p class='diaryImageCaption'>Horse Show and Stock Car Racing<\/p>","images":false},"title":{"value":"Horse Show - Stock Car Racing"},"version":1},{"date":{"d":3,"m":5,"y":2008},"datev":20080503,"images":3,"info":{"content":"<p>In the morning Daddy and Ben went on a long, long bike ride around the local area. They returned home with Doughnuts! Mmm.<\/p><p>The Surrey Heath show was been held at Frimley Lodge Park. We met up with the Fars and went on some fair rides, got our faces painted with camouflage from the army, stroked some pigs, groomed some donkey's, sat in a racing car, had some ice cream, went on the inflatable’s before settling down and watching some events in the main display area. There was a range of shows from some keep fit thing, not sure why we should be interested in that, to a dog show which Katie was particularly fond of.<\/p><img src='images\/years\/2008\/2008_05_03-03-SurreyHeathShow.jpg' class='diaryImage' alt='In The Army Now' \/><p class='diaryImageCaption'>In The Army Now<\/p><img src='images\/years\/2008\/2008_05_03-10-SurreyHeathShow.jpg' class='diaryImage' alt='The piggy’s' \/><p class='diaryImageCaption'>The piggy’s<\/p><img src='images\/years\/2008\/2008_05_03-32-SurreyHeathShow.jpg' class='diaryImage' alt='Surrey Heath Show' \/><p class='diaryImageCaption'>Surrey Heath Show<\/p><p>We finally went to the steam railway and had our first go around, much to the delight of all the boys! I think the best bit of the day was going down the large inflatable slide.<\/p>","images":false},"title":{"value":"Surrey Heath Show"},"version":1},{"date":{"d":1,"m":5,"y":2008},"datev":20080501,"info":{"content":"<p>We had a fire parade on Monday. Ben did really well lining up with other children.<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":27,"m":4,"y":2008},"datev":20080427,"info":{"content":"<p>In the afternoon we went over to the West's new house between Fleet and Church Crookham. It was a big old house.<\/p>","images":false},"title":{"value":"West Towers"},"version":1},{"date":{"d":26,"m":4,"y":2008},"datev":20080426,"images":1,"info":{"content":"<p>On this splendid morning we went around to Farmor's to begin her birthday celebrations. Mummy went to listen to Ma ma's talk to the WI about her trip to India.<\/p><p>Susan came around with breakfast from the bakers which was scrummy, after which we all rushed off to Runnymede to catch a pleasure boat down the Thames. Silly Daddy got the time wrong which gave us an opportunity to go on the merry go-round and motorbike ride. We scooted across the park to finally catch the boat. We had to shout to make it stop... and it did and turned around for us.<\/p><p>After playing musical chairs for a while we sat outside at the top and looked at all the other cruisers and lovely house as we motored in the Windsor direction. We stopped half way and began to open presents. We had made Farmor a 'Life Book', bird feeder (from Crafty Club) and Ben very kindly thought to give one of his trucks....which he also wrapped. I'm sure Farmor will treasure that. Other presents included a new bike and a bird table.<\/p><p>We enjoyed going up and down the river. Something to do again. After 45 minutes we disembarked back at the pleasure ground ready for our picnic that Daddy had prepared.<\/p><p>It was such a sunny, warm day it was lovely to be beside the river watching the boats go past eating our rolls. The Fars and Susan had to depart which left us five to go the bouncy castle and swing park, plus a little stroll up and down the river.<\/p><img src='images\/years\/2008\/2008_04_26-01a-FarmorBirthday.jpg' class='diaryImage' alt='Farmor 60th Birthday' \/><p class='diaryImageCaption'>Farmor 60th Birthday<\/p><p>We returned home and soon after Ma Ma, Charlotte and Pop Pop popped around to play and have a cup of tea. In the evening there was a meal for Farmor at the new-ish Italian in Frimley. We returned back to the Fars for birthday cake made by Susan, and coffee. Farmor had a lovely, special day.<\/p>","images":false},"title":{"value":"Farmor's 60th Birthday"},"version":1},{"date":{"d":20,"m":4,"y":2008},"datev":20080420,"info":{"content":"<p>We all played with Joey. We dressed him up in a pink ballerina outfit, upon his request.... we then went outside where Joey wanted to go on Katie's pink bike, wearing Katie's pink helmet! We are getting a little worried about the boy. Still saying that Ben was not much better.<\/p><p>In the afternoon Daddy BBQ'ed and roasted a leg of pork and we all went for a walk around the army estate stopping of at a couple of swing parks.<\/p>","images":false},"title":{"value":"Elders over and Swings"},"version":1},{"date":{"d":19,"m":4,"y":2008},"datev":20080419,"images":1,"info":{"content":"<p>Another miserable weather day which restricted our options. It would seem we can't get Katie a size 9 school shoe in Camberley, Farnborough, Crowthorne or now Fleet! Even Mr Ball hasn't come up with the goods! Anyway, Katie went to a school friend, Joseph's birthday party at Tomlinscote school. She loved the ropes and crash mats. Meanwhile the boys went swimming. Ben learnt to jump in from a standing up position, but sank like a stone when the armbands came off. Some work required there.<\/p><p>We all returned home to meet with Joey who was going to stay the night. The children were really looking forward for him to stay. It was a bit manic having 3 hyper-actives plus a Jessica. We settled down before bedtime watching Superman.<\/p><img src='images\/years\/2008\/2008_04_20-04a-JoeyOverToStay.jpg' class='diaryImage' alt='Joey, Katie and Ben' \/><p class='diaryImageCaption'>Joey, Katie and Ben<\/p>","images":false},"title":{"value":"Joey Over To Stay"},"version":1},{"date":{"d":18,"m":4,"y":2008},"datev":20080418,"info":{"content":"<p>We went to Nina's for lunch and in the afternoon we went shopping to try and get Katie some school shoes.<\/p>","images":false},"title":{"value":"Nina's for lunch"},"version":1},{"date":{"d":17,"m":4,"y":2008},"datev":20080417,"info":{"content":"<p>We went to the Look Out for another playschool outing. Really good fun building camps but freezing cold. Auntie Ellie, Joey and Lily came over in the afternoon. They all went upstairs to play and came down later all naked and covered in felt pen - they had been drawing on each other.<\/p>","images":false},"title":{"value":"Look Out and Naked Art"},"version":1},{"date":{"d":16,"m":4,"y":2008},"datev":20080416,"first":{"name":"benjamin","value":"Cinema"},"info":{"content":"<p>Ma Ma walked round Guildford with Jess while Mummy took Ben and Katie to the cinema. We saw the Bee Movie. This was Ben's first time in the cinema they enjoyed it especially the popcorn! Afterwards we met Ma Ma and had a McDonalds. In the afternoon we visited Uncle Peter and Great Grandma and Granddad.<\/p>","images":false},"title":{"value":"Bee Movie"},"version":1},{"date":{"d":15,"m":4,"y":2008},"datev":20080415,"images":1,"info":{"content":"<p>We drove to Farnborough and had to madly run to the station to catch our train to London. Katie is ten times fitter than Mummy. Mummy was really out of breath and Katie was fine when we got there. A nice lady helped Mummy across the bridge with the double buggy and we got on the busiest train and had to stand all the way. We ate our big bag of sweets (Katie’s highlight). We met Ma Ma under the clock at Waterloo and after another mad rush got to horse guards parade just in time to watch the change of the horse guards. The kids enjoyed this. We then walked up Pall Mall  to Buckingham Palace and saw the change of the guards there as well. It was really interesting with bands playing and the police stopping all the traffic.<\/p><p>We had a nice picnic in St James' park and a go in the park. We walked trough green park to Fortnum and Mason where we wanted to watch the clock. Supposedly two men come out of the clock and shake hands and there is some music on the hour every hour. It was two o'clock and we were waiting with our camera with other tourists but nothing happened much to our disappointment. We went in to the shop and there was a huge old fashioned sweet section, Katie wanted some boiled sweets and Mummy said \"no  you might choke2 but Katie kept going on and on so Mummy relented and said \"only if you sit in the pushchair and eat them\".<\/p><img src='images\/years\/2008\/2008_04_15-15-HorseGuards.jpg' class='diaryImage' alt='Jessica enjoying the sandpit in St. James' Park' \/><p class='diaryImageCaption'>Jessica enjoying the sandpit in St. James' Park<\/p><p>We stopped to feed Jess next and Katie and Ben were playing on the steps. Mummy kept telling Katie to sit still as she had a sweet in her mouth the next thing Katie was choking. Mummy just panicked and was screaming frantically banging Katie on the back and then suddenly the sweet flew out of her mouth. Mummy could not stop trembling, clinging on to Katie like a mad thing. Never again is Katie going to have a boiled sweet!!!!! We then went to the rainforest cafe. Ben and Katie had a big drink sitting on the animal bar stalls, fascinated by all the moving animals. Mummy then tried to feed Jess again while Ma Ma took Katie and Ben into the Trocodero, but Ma Ma got lost in there and couldn't find Mummy for ages. We all got the train home thoroughly exhausted!<\/p><woops rating=\"5\" woopstitle=\"Jessica throws up over commuter in train\"><p>On the way out of the packed commuter train, Mummy was holding Jessie around the tummy with one hand and Ben with the other. Jessie, then to Mummy's horror, was sick on this man's leg, all over his suit! He looked disgusted. Mummy had to apologise over and over and didn't know what to say - she didn't even have a tissue to offer and couldn't just run because there was a queue to get off the train!<\/p><\/woops><p>Ma Ma bathed the kids but Ben later told Mummy that Ma Ma does not put enough water in and That Mummy's baths are better!<\/p>","images":false},"title":{"value":"Horse Guard's Parade, Fortnum and Mason With Mama"},"version":1},{"date":{"d":14,"m":4,"y":2008},"datev":20080414,"info":{"content":"<p>Today we went to Natasha's house for an Easter egg hunt in her garden. Nina, Sophie and Grace came too. It was great fun. Natasha has a new trampoline which Katie and Ben loved. We also went to Asda to do the shopping. It was an expensive one with Katie adding loads of things she insisted she loves, only to find she didn't when she later went to eat them!<\/p>","images":false},"title":{"value":"Natasha's Eater Egg hunt"},"version":1},{"date":{"d":13,"m":4,"y":2008},"datev":20080413,"info":{"content":"<p>After church we went over to Auntie Susan's for a cup of tea and to put them off having children! We hurried over to the swimming baths in Wokingham for a splash around. Katie and Ben loved it as they were able to go down the slide to their hearts content. They were then thrown across the water, superman style, off for another turn. Jessica loved it as well, especially when she was placed flat on her back on a float and stared at the ceiling! She almost went into a fit of enjoyment. Strange girl.<\/p>","images":false},"title":{"value":"Auntie Susan and Swimming"},"version":1},{"date":{"d":12,"m":4,"y":2008},"datev":20080412,"info":{"content":"<p>Today we went over to Heatherside to have a go on the swings and have an ice cream. We went to see Daddy's old house as well. We had a lovely day just playing really.<\/p><p>Daddy's health results also returned today.<\/p><ul><li><i>Weight<\/i>74kg - 11.5 stone\u000a        <\/li><li><i>Blood Pressure<\/i>125 \/ 80 - Recommended 120\/80\u000a        <\/li><li><i>Cholesterol<\/i>4.57 mmol\/L - Recommended less than 5.18\u000a        <\/li><li><i>Triglycerides<\/i>1.3 mmol\/L - Recommended between 0.4 - 1.8\u000a        <\/li><li><i>Fasting Glucose<\/i>6.3 mmol\/L - Recommended between 3.5 - 6.0\u000a        <\/li><li><i>Haemoglobin<\/i>17.3 f\/dL - Recommended 11.5 - 18.0\u000a        <\/li><\/ul><p>\u000a        Also this week Daddy has been speaking with the Danish half of the family and has managed to get some additional relatives entered onto the family tree. It now dates as far back as 1624, when Daddy's 9th Great Grandfather, Poul Jensen was born, on an Island just off the remote west coast of Denmark!. Here is a\u000a        <a href=\"familytree\/KatiePedigree.pdf\">\u000a          'pedigree chart' (4.5mb)\u000a        <\/a>\u000a        for Katie. It stretches 14 generations. The latest tree now contains over 1500 people!\u000a      <\/p>","images":false},"title":{"value":"Heatherside"},"version":1},{"date":{"d":11,"m":4,"y":2008},"datev":20080411,"info":{"content":"<p>Katie had her friend Nina over to play in the morning then Farfar and Farmor came over to take Ben and Jessica to Wellington Country Park so Mummy and Katie could do a spot of retail therapy. We went to Camberley, had a McDonalds and then bought Katie some new summer clothes and Ben some Thomas trainers. We had a lovely time together.<\/p>","images":false},"title":{"value":"Wellington Country Park - Girly shopping"},"version":1},{"date":{"d":10,"m":4,"y":2008},"datev":20080410,"info":{"content":"<p>Drove to the hop farm to meet Auntie Karen, Summer and Alice. There was a circus big top  and we went in there first where the children did some dancing, then we had a go on some little rides and Katie went on a driving track. She drove a little car and there was roundabouts and traffic light and junctions. She was much better than some of the older children and she loved it. Ben was too small unfortunately. We had a lovely picnic and then went on the swings. Ben was so  brave, going down the hugest tube slide, Mummy could not believe he went down it and then so not to be outdone Katie went on it too. There was some bouncing cushions to jump on a bit light a bouncy castle with no roof and finally we did some painting in the craft tent.<\/p><p>As we were leaving we saw a magic show advertised in the big top so we stopped to watch. the magician put a sword through the neck of a volunteer. Ben and Katie were fascinated Mummy had to stress that they should not try this on each other at home with the kitchen knives!<\/p>","images":false},"title":{"value":"Hop Farm with Karen"},"version":1},{"date":{"d":9,"m":4,"y":2008},"datev":20080409,"info":{"content":"<p>We went over to Alton to see Auntie Ellie, Joey and Lily. We drove to the station and watched the Thomas steam trains, probably the highlight of the holidays for Ben. After the trains we went to a fantastic new park in Alton which Katie particularly loved.<\/p>","images":false},"title":{"value":"Steam Trains in Alton"},"version":1},{"date":{"d":8,"m":4,"y":2008},"datev":20080408,"info":{"content":"<p>We went to the King George V playing fields today, it was an arranged playschool get together but only three mums turned up! Ben played with his friends Oliver and Aimee and Katie played with Emma which she loved. In the afternoon we met Caroline and Henry at Lightwater Country Park.<\/p>","images":false},"title":{"value":"Lighwater Country Park"},"version":1},{"date":{"d":7,"m":4,"y":2008},"datev":20080407,"info":{"content":"<p>Met Auntie Fiona and Thomas for a picnic and a play on the swings at Horton Country Park.<\/p>","images":false},"title":{"value":"Horton Park with Fi"},"version":1},{"date":{"d":6,"m":4,"y":2008},"datev":20080406,"images":1,"info":{"content":"<p>We woke early to a picture of snow outside. In the space of about an hour there was enough to go sledging. The alarm bells rang and we quickly got ready to go out. We met with the Fars at Frimley Green Rec where there were already a handful of people.<\/p><p>It was bitterly cold with the wind. Daddy opened the car door to get Jessica out, and it was really difficult to get her out. She was in a nice warm car, asleep. When the door opened the blizzard conditions attacked her and she winced and began to wake. Daddy quickly shut the door again!<\/p><p>I think we should have left Ben behind as well. He cried and cried. He really is not one for the cold. He hated it. Conversely, Katie loved it. She went down with Mummy, Farmor and raced Daddy down. As time passed the hill became more and more busy and we could no longer put up with Ben's crying, so we ended this year's sledging.<\/p><img src='images\/years\/2008\/2008_04_06-04-Sledging.jpg' class='diaryImage' alt='Sledging down Frimley Green Rec' \/><p class='diaryImageCaption'>Sledging down Frimley Green Rec<\/p><p>Later, we went out again and built snowmen. Katie wanted to build her own, so we had two. We had the carrots, hat, scarf the works. Ben was the foreman figure. Just watching. Just grumpy. Did I say he doesn't like the cold?<\/p>","images":false},"title":{"value":"April (Snow) Showers"},"version":1},{"date":{"d":5,"m":4,"y":2008},"datev":20080405,"info":{"content":"<p>We headed west on this cold day to Longleat Safari Park. Ben tried to go with 'big boy' pants', so we had a couple of potty stops. We arrived and handed our Tesco vouchers which saved us the £60 admission fee.<\/p><p>The highlight of the safari park were the naughty monkeys which ran all over our car to the delight of all of us. They managed open our petrol cap, but fortunately there was no lasting damage, unlike other cars which had aerials and windscreen wipers ripped off.<\/p><p>We passed the tigers and lions. A lion happened to walk across our path and we heard a few mini-roars which was pretty cool. We finished and went and had our unhealthy picnic outside the house.<\/p><p>The rain started so we rushed to the train and toured around after which we had a go on the boat where we saw plenty of sea lions, another favourite, a silverback gorilla and the two huge hippos were rarely out of the water. They were very long and huge.<\/p><p>We finally stopped off in the adventure castle which we could have spent all day in. Daddy is thinking of starting a business locally which replicate's the adventure castle and charge a fiver for a day pass!!!<\/p><p>We returned home to have fish and chips with Ma Ma and Pop Pop.<\/p>","images":false},"title":{"value":"Longleat"},"version":1},{"date":{"d":4,"m":4,"y":2008},"datev":20080404,"info":{"content":"<p>Katie and Ben's last day of school and playschool for two weeks Easter holidays Mummy can't wait to have them both at home, lots of exciting things planned.<\/p>","images":false},"title":{"value":"Last day of term"},"version":1},{"date":{"d":30,"m":3,"y":2008},"datev":20080330,"images":1,"info":{"content":"<p>There was an Easter trail where we had to work out the clues to make a word up. We played on the playground and had an ice cream. We then walked along the woods next to the canal, playing hide and seek and climbing some trees. We surprisingly ended up at Frimley Lodge Park. We played again on the swings and looped around the miniature railway back to the canal centre.<\/p><img src='images\/years\/2008\/2008_03_31-01a-Jessica.jpg' class='diaryImage' alt='Jessica Lukeys' \/><p class='diaryImageCaption'>Jessica Lukeys<\/p>","images":false},"title":{"value":"Mytchett Canal Centre"},"version":1},{"date":{"d":29,"m":3,"y":2008},"datev":20080329,"info":{"content":"<p>We went swimming to the Arena and met up with Henry.<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":24,"m":3,"y":2008},"datev":20080324,"info":{"content":"<p>I had a lovely stay with Ma Ma, Pop Pop and Uncle Peter. Yesterday, when I first got to Ma Ma and Pop Pop's house I watched a little bit of television and played games with Ma Ma - it was great. Sadly it was time for bed, so I snuggled up with Ma Ma and read a book. I showed Uncle Peter how I could read my own book and some flash cards. He was most impressed.<\/p><p>In the morning I awoke bright and early and dragged Ma Ma out of bed to play some more games. She, of course, was more than willing and we had a nice time before Pop Pop and Uncle Peter emerged from their beds. The day was absolutely beautiful and so we headed off for an Easter Bunny Hunt near the Duck Pond in Southfleet. We collected all the answers to the quiz and I won a little fluffy duck. Uncle Peter kept making funny comments.<\/p><p>The day started to get a bit colder so when we arrived in Greenwich we decided to have a meal inside. We went to the Cafe Rouge and I had Cheese on Toast (croque monsieur) and a drink. After this delicious meal we set off for the funfair. It was such fun! I went on quite a few rides and then watched Pop Pop and Uncle Peter go on a really scary one (you wouldn't get me on it in a million years!) Following on from this we headed for the donkeys. I chose a lovely little grey one named Bimbo to ride and he was so sweet. I know Ma Ma wants me to take up riding and I think I will after this great ride. She even says she'll pay for me so come on Mummy book me in!<\/p><p>Anyway after that we went to a shopping area where Uncle Peter and Pop Pop went to look at printers while Ma Ma and I sat in the car and chatted.<\/p><p>At last it was time to meet Mummy at the Star. I was so glad to see her. I loved being with my Ma Ma and Pop Pop and Uncle Peter but I did miss my darling Mummy and Daddy and Ben and Jess so much! I am looking forward to the next time.<\/p><p>Katie Gay<\/p>","images":false},"title":{"value":"Stay over at Ma Ma's"},"version":1},{"date":{"d":23,"m":3,"y":2008},"datev":20080323,"images":1,"info":{"content":"<p>We began the day by decorating our boiled eggs. Didn't mean we ate them. In fact Daddy had four!<\/p><p>The Elders hosted a Barnett Easter party. First up was a lovely roast cooked by Michael's fair hands. Parsnips were top dollar. Later, the rest of the Barnett clan came over to join the mayhem. A huge egg hunt was setup out back. Overall we made a killing on the number of Easter Eggs. Daddy doesn't know whether to laugh or cry!<\/p><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/c6bl5LtcPp8&amp;hl=en_GB&amp;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/c6bl5LtcPp8&amp;hl=en_GB&amp;fs=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><p>Katie went off with the Weston’s and Uncle Peter to stay in Istead Rise for the night.<\/p><img src='images\/years\/2008\/2008_03_24-01-EasterMonday.jpg' class='diaryImage' alt='Egg Decorating' \/><p class='diaryImageCaption'>Egg Decorating<\/p>","images":false},"title":{"value":"Easter Gathering At The Elders"},"version":1},{"date":{"d":22,"m":3,"y":2008},"datev":20080322,"images":1,"info":{"content":"<p>\u000a        We braved the conditions and went to\u000a        <a href=\"http:\/\/www.nationaltrust.org.uk\/main\/w-vh\/w-visits\/w-findaplace\/w-clandonpark\/\">\u000a          Clandon Park\u000a        <\/a>\u000a        which is a National Trust stately home. We were not there to learn about the history of the place or marvel at the art and furniture. No we were there for an Easter egg hunt, which we enjoyed. Ben and Katie only got told a few times to not swing on the ropes or touch various bits and pieces. You just are slightly distracted when you can see Ben in the corner of your eye swinging around with the curtains, whilst a guide is trying to explain the history behind a spoon or something! Daddy could bare it no more. Ben going around in his muddy boots on carpets that look in better condition than our new one!\u000a      <\/p><p>Upstairs there was a face painting event. Ben was a monster and Katie a butterfly. They loved it. As the rain and sleet was coming across horizontally the gardens were closed and we had to eat our picnic in the car.<\/p><img src='images\/years\/2008\/2008_03_22-04-ClandonPark.jpg' class='diaryImage' alt='Scary looking lot' \/><p class='diaryImageCaption'>Scary looking lot<\/p>","images":false},"title":{"value":"Clandon Park"},"version":1},{"date":{"d":21,"m":3,"y":2008},"datev":20080321,"images":1,"info":{"content":"<p>It was a bitterly cold day. Daddy and Ben went off on a bike ride looking for the motorbike top box. Needless to say they didn't find it.<\/p><p>For lunch we went over to the Fars and had some lovely lamb. Katie dressed as an Indian for the day, including a spot on the forehead! Auntie Susan had brought round Katie's bridesmaid dress to try on. She was so happy and looked beautiful.<\/p><p>We later went for a walk to the ponds on the trolley.<\/p><img src='images\/years\/2008\/2008_03_21-08-EasterFars.jpg' class='diaryImage' alt='Farfar Trollied' \/><p class='diaryImageCaption'>Farfar Trollied<\/p>","images":false},"title":{"value":"Fars Easter Lunch"},"version":1},{"date":{"d":20,"m":3,"y":2008},"datev":20080320,"images":1,"info":{"content":"<p><b>Selling body for medical research<\/b><br \/>Seeing he can't give it away to his own wife, Daddy has embarked on medical trials at Reading University. Nothing life threatening, just the effects of fruit on the body.\u000a      <\/p><p><b>US company wanting our Paris picture for their website<\/b><br \/>An email out of the blue came from a lady who came across\u000a        <a href=\"images\/years\/2006\/2006_06_20-44-EiffelTower.jpg\">\u000a          this Paris picture\u000a        <\/a>\u000a        . Strange! Anyway it'll be appearing on their\u000a        <a href=\"http:\/\/www.internationalfamilytransitions.com\">\u000a          site\u000a        <\/a>\u000a        shortly.\u000a      <\/p><p><b>Katie wins 'Best Easter Hat' prize<\/b><br \/>Katie, Mummy and Paula had made a hat for the Easter Hat competition. She paraded around the school playground in front of parents and the rest of the school. She won \"best hat 'lambs' class\".\u000a        <img src='images\/years\/2008\/2008_03_19-03a-KatieEasterHatParade.jpg' class='diaryImage' alt='Katie - Easter Hat Winner' \/><p class='diaryImageCaption'>Katie - Easter Hat Winner<\/p><\/p><p><b>Jessica prodded by Osteopath<\/b><br \/>Jessica is still not sleeping well. She wakes several times during the night, sometimes screaming. From 5am onwards she is awake for the day. We would have thought she would have grown out of the colic stage. We turned to an Osteopath who subtly prodded her over her body. We'll see over the next few days if it has worked. Daddy is not holding out much hope. Researching, it would appear that there is not a great deal of medical facts that backs up the practice.\u000a      <\/p><p><b>Mummy accused of shoplifting in Tesco's<\/b><br \/>Mummy took Daddy's Valentines trousers back to Tesco as they had forgot to remove the security tag. As Mummy didn't have a receipt when she went to the customer service desk the lady was quite abrupt and called the manager. After some heated exchanges Mummy left the shop. Tesco later rung up and apologised!\u000a      <\/p>","images":false},"title":{"value":"A Week In The Gay Household"},"version":1},{"date":{"d":16,"m":3,"y":2008},"datev":20080316,"images":1,"info":{"content":"<p>In the afternoon we went for a walk through lots of puddles in the woods out back. Needless to say Ben filled his boots with water!<\/p><img src='images\/years\/2008\/2008_03_16-15-PuddlesWalk.jpg' class='diaryImage' alt='A Typical Sunday' \/><p class='diaryImageCaption'>A Typical Sunday<\/p>","images":false},"title":{"value":"Puddle Splashing"},"version":1},{"date":{"d":15,"m":3,"y":2008},"datev":20080315,"images":1,"info":{"content":"<p>\u000a        We embarked on an epic tour between Dalston, Hackney and Bethnal Green. Here's\u000a        <a href=\"http:\/\/maps.google.com\/maps\/ms?ie=UTF8&amp;hl=en&amp;msa=0&amp;msid=111027506527990496626.00044880eddfe7df9c399&amp;ll=51.540543,-0.06609&amp;spn=0.019325,0.045319&amp;z=15\">\u000a          our tour\u000a        <\/a>\u000a        . We began, as ever, rushing for the train from Sunningdale. Daddy dropped us off whilst he went off somewhere to park (for free of course). Daddy just made the train, he ran to a carriage about two down from where the rest of us had got on! Phew. The train took us to Richmond where we changed for the 'North Circular' train to Dalston Kingsland. In the rush we mistakenly took Jessica in her car seat, so we were burdened with carrying that around with us as well as Katie's scooter, the picnic rucksack and changing bag.\u000a      <\/p><p>We stepped out of the station to a typically gritty, untidy, multi-cultural, hustle and bustle of an unfashionable part of London. Daddy loved it for this. A part of London where a section of the Gay family originated. We explored the food market opposite, which was aimed at the locals. There were plenty of lovely fish, meat and fruit stalls as well as fake footwear and dodgy mobile phone fixers. We quickly moved on and walked a long way to London Fields where we surprisingly saw a lido that was open and with people swimming. Bearing in mind it was not the warmest of March days, it was refreshing to see some dedicated, hardened locals make use of this facility. It looked nice and clean and certainly one for the summer, especially as there is free parking nearby.<\/p><p>We were getting a bit tired and hungry so we de-camped at the swings for a bite to eat. There was one of those rope, pyramid apparatus that rises about 10 metres up. Well whilst Katie and Daddy were on it a little girl, slipped and fell down from near the top. It's one of those heart in the mouth times. Fortunately she wasn't hurt too badly.<\/p><p>\u000a        We headed south out of the park to<a href=\"http:\/\/www.broadwaymarket.co.uk\/\">Broadway Market<\/a>which seemed to stand in complete contrast to the area. It was a quaint, trendy street market populated with hooray Henry’s, selling scrummy foods and goods. There were a variety of lovely cooking smells wafting around. We dreamed of having some money to actually buy some bits, but we passed and moved on over the Regent's canal down to Haggerston Park where Katie and Ben had a run around the bmx track. There was a child no older than two that was on a 'running bike', like Joey's, who managed to go down the hills at great pace with no help. He balanced himself. I thought it was a neat bike to promote balance. Better than stabilizers.\u000a      <\/p><p><a href=\"www.hackneycityfarm.co.uk\/\">Hackney City Farm<\/a>was next door where we saw Farfar wallowing around in the mud! Ben was scared of the chickens that were free to roam around in the courtyard! Are you a man or a mouse? It turns out that one of the pigs was actually named Katie!\u000a      <\/p><p>We headed east to the huge Victoria park to play on the swings, then had an ice cream, then blagged a free bus ride to Dalston. We got off two stops too late and had to walk back to the station! We eventually made it home in the rain.<\/p><img src='images\/years\/2008\/2008_03_15-DalstonMontage.jpg' class='diaryImage' alt='Dalston, Hackney, Beth Green' \/><p class='diaryImageCaption'>Dalston, Hackney, Beth Green<\/p>","images":false},"title":{"value":"Five Gays travelling on four trains to three parks through two markets and a Farm"},"version":1},{"date":{"d":9,"m":3,"y":2008},"datev":20080309,"images":2,"info":{"content":"<p>In the morning we went over to see the new arrival of Natasha into the Burrows family. There was some scary conversation on the way from Mummy about when were people invented? .. and how along ago was 10000BC!<\/p><p>Natasha looked a real cutie and so small, I think the smallest we've seen. She was born two weeks prematurely and weighed 6lbs 9oz. She was asleep for most of our visit. Ben and Katie made themselves at home straight away playing in Thomas' bedroom. We played a bit on Kelly's Wii which was funny.<\/p><img src='images\/years\/2008\/2008_03_09-NatashaBurrows.jpg' class='diaryImage' alt='Natasha Burrows' \/><p class='diaryImageCaption'>Natasha Burrows<\/p><p>We bid our farewells and spent the afternoon in Gravesend with the Ma Ma and Pop Pop playing shoe shops and looking at their Canada holiday snaps.<\/p><p>\u000a        This week Daddy organised his motor biking holiday up in Scotland with Michael and Howard. Here's\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;hl=en&amp;geocode=9865987660547780913,56.024690,-5.429130%3B1698582816071664348,57.427470,-6.561860%3B2806981629327264912,57.682100,-6.339360%3B4909469997444266407,57.516890,-5.647910%3B12903604609614573531,57.858950,-5.550280%3B10557143863829452735,58.542910,-4.780490%3B984413387728499129,58.598080,-3.541980%3B8345075395421497397,58.638540,-3.068880%3B7344723383445364470,57.286440,-4.357820%3B11192583552287153898,57.452660,-4.247800%3B7504167617195831390,57.144380,-4.641930%3B10529302089146630054,55.971680,-3.204640%3B6030606032974967279,54.581270,-2.479990%3B1956579307842221359,54.304130,-2.202880%3B14040967757185177737,53.817860,-3.051010%3B7122008623831527543,51.281620,-0.733330&amp;saddr=frimley&amp;daddr=A83+%4056.024690,+-5.429130+to:A863+%4057.427470,+-6.561860+to:A855+%4057.682100,+-6.339360+to:A896+%4057.516890,+-5.647910+to:A832+%4057.858950,+-5.550280+to:A838+%4058.542910,+-4.780490+to:A836+%4058.598080,+-3.541980+to:A836+%4058.638540,+-3.068880+to:B851+%4057.286440,+-4.357820+to:B862%2FDores+Rd+%4057.452660,+-4.247800+to:B862+%4057.144380,+-4.641930+to:A902%2FFerry+Rd+%4055.971680,+-3.204640+to:A66+%4054.581270,+-2.479990+to:54.346151,-2.263184+to:A684+%4054.304130,+-2.202880+to:A583%2FChurch+St+%4053.817860,+-3.051010+to:A331+%4051.281620,+-0.733330&amp;mra=dpe&amp;mrcr=0&amp;mrsp=14&amp;sz=10&amp;via=1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16&amp;sll=54.318125,-2.208252&amp;sspn=0.334022,0.933838&amp;ie=UTF8&amp;ll=56.328721,-4.460449&amp;spn=5.081265,14.941406&amp;z=6\">\u000a          the route\u000a        <\/a><\/p><p>Some Ben'isms this week:<\/p><ul><li><i>My foot is rumbling<\/i>His foot is hurting\u000a        <\/li><li><i>My ball went in the pickles<\/i>My ball went in the prickles (prickly bushes)\u000a        <\/li><\/ul><img src='images\/years\/2008\/2008_03_09-KatieBenJessInBath.jpg' class='diaryImage' alt='Katie, Ben, Jessica enjoying a bath' \/><p class='diaryImageCaption'>Katie, Ben, Jessica enjoying a bath<\/p>","images":false},"title":{"value":"Natasha Grace Burrows - Weston’s"},"version":1},{"date":{"d":8,"m":3,"y":2008},"datev":20080308,"first":{"value":null},"images":1,"info":{"content":"<woops woopstitle=\"Jogged the 'Snip' surgeon\" rating=\"8\"><p>I went into having the 'snip' with a stiff upper lip and tried to be as ignorant as possible as to what the procedure entailed. Well after the bazillionth consultation, I entered the op theatre, or should I say a room at the doctor's surgery. The first thing that hit me was the electrical burning smell. Ah ha this must be the torture chamber!<\/p><p>The surgeon told me to lie down. He was first quite brutal in getting everything into position and then whilst casually chatting a needle was injected somewhere down below. It makes me wince just writing it now. Arrgghhh. The pain was pretty severe and I must admit I did make a groaning noise. I also immediately jerked my knee up as a natural reaction. The surgeon asked me to not to do that as it was \"jogging his steady hand\"! Probably the last person you would want to jog! I thought of saying you try and lie here and have someone inject your bits. I could feel whatever fluids being inserted entering my system which wasn't a pleasant feeling either.<\/p><p>The procedure continued. By this time I didn't know whether to be tense, as the slightest move brought some pain, or whether to relax to give my heart a chance to slow down! For 90% of the time I braced myself whilst trying to make polite conversation!  Anyway, I couldn't feel the actual fusing of the tubes. All I could hear was a buzz now and again, sounding like a loose electrical connection. This I presume was the burning\/fusing part.<\/p><p>Then all of a sudden. BAM. Another injection equally as painful as the first and totally unexpected. Another hit. I assume it was one for each testicle. I kept it together and saw out the ten minute operation.<\/p><img src='images\\years\\2008\\2008_03_08-01-Snip.jpg' class='diaryImage' alt='As it appears from my perspective' \/><p class='diaryImageCaption'>As it appears from my perspective<\/p><p>I put some tight swimming trunks on, had a coffee and went down to meet the family. They were pleased to see me. Ben came charging right for me. I think I almost gave him a forearm smash to stop him running into where nature didn't intend! Anyway I had to check if there was much blood coming from the wound, which there wasn't, so I was able to go home.<\/p><\/woops><p>The rest of the day was spent convalescing in front of the TV.<\/p>","images":false},"title":{"value":"Snipedy Snip Snip"},"version":1},{"date":{"d":2,"m":3,"y":2008},"datev":20080302,"info":{"content":"<p>After an extended church service and Sunday roast we went to the Quays to celebrate Granddad’s 85th birthday with the Barnett side of the family.<\/p><p>We then made a brief visit to the Fars before Jessica conked out and started to cry lots, just like she does at night time.<\/p>","images":false},"title":{"value":"Mother's Day, Granddad’s 85th Birthday"},"version":1},{"date":{"d":1,"m":3,"y":2008},"datev":20080301,"info":{"content":"<p>Due to financial constraints we again had a cheap day and explored the adjoining army housing estates. Sounds interesting eh? Anyway we enjoyed ourselves as we took in 3 sets of swings. Daddy got stuck in one of the tyre swings!<\/p>","images":false},"title":{"value":"More Walking"},"version":1},{"date":{"d":29,"m":2,"y":2008},"datev":20080229,"info":{"content":"<p>what a lovely day for mummy. In the morning She was invited to Ben's pre-school to listen to them singing some songs. Ben was lovely as he had only been there a few days so he could do the actions but didn't know the words but he tried singing anyway. He looked so little compared to the others. In the afternoon Mummy went to cross farm to listen to Katie singing songs. It was wonderful, Katie looked so happy and Mummy was very proud.<\/p>","images":false},"title":{"value":"Mothers Day Concert"},"version":1},{"date":{"d":24,"m":2,"y":2008},"datev":20080224,"images":1,"info":{"content":"<p>It was an early start as we went off to Heathrow airport to meet Ma Ma, Pop Pop and Howard from their holiday to Quebec and Montreal. We stopped to have a coffee and got some nice holiday presents.<\/p><p>After Sunday lunch the Fars popped over for a short while to play after which we moved onto Jakes, Bagshot which was the location of Freya's belated 3rd birthday party. It was nice to catch up again. In the football cage, the Daddies were playing keepy-upys, Jessica inadvertently joined in when the ball rebounded off her forehead!<\/p><p>The children played some games in a small room then had some party food and of course a birthday cake.<\/p><img src='images\/years\/2008\/2008_02_24-12-FreyaBirthday.jpg' class='diaryImage' alt='Jessica Playing With Farmor' \/><p class='diaryImageCaption'>Jessica Playing With Farmor<\/p>","images":false},"title":{"value":"Heathrow, Grandparents, Freya Birthday"},"version":1},{"date":{"d":23,"m":2,"y":2008},"datev":20080223,"images":1,"info":{"content":"<p>In the morning Mummy had written a job list out for us all. Hers seemed remarkably light, whilst the rest of us went to the garden to spread manure! After lunch we went to Heatherside swings. The girls by foot and scooter, the boys went on the bike and detoured via the ranges where we saw some big army trucks and camps which Ben enjoyed seeing.<\/p><p>The swings at Heatherside were accosted by the hoy-poloy of Heatherside which made Mummy and Daddy feel uneasy because of the difficulties they seem to have of stringing a sentence together without swearing in the middle of it. We schmoozed over to the shops where Katie and Ben were treated to some sweeties and Mummy a cakey.<\/p><p>On the way home there were definitely two camps. As Katie put it \"We're outdoor people [Daddy and Katie]\" as Ben and Mummy were looking forward to getting to a warm snuggley house. So Daddy and Katie went to a second set of swings at the Cheylsmore estate where we made some friends on the Monkey bars.<\/p><img src='images\/years\/2008\/2008_02_23-28a-Katie.jpg' class='diaryImage' alt='Smiley Katie Eyes' \/><p class='diaryImageCaption'>Smiley Katie Eyes<\/p><p>Jessica is a funny old bean. During the day she is as happy as Larry, giving Daddy especially some big smiles. At night time it is a completely different story. She wakes and cries continually. We, or should I say Mummy has tried various strategies: From ignoring the cries, to cuddling, from feeding solids to not, from in the cot to in our bed. We still have yet to have a good night's sleep. Daddy still on the sofa! She is getting a bit old for the colic excuse so we are a little worried as to what is wrong.<\/p>","images":false},"title":{"value":"Heatherside Stroll"},"version":1},{"date":{"d":17,"m":2,"y":2008},"datev":20080217,"info":{"content":"<p>Today was very much a chill out day. The weather continued to be very sunny and very cold. After church we headed off to the 'Garden Of Eden Swings'. Daddy and Ben went the scenic route through the woods on the bike, whilst the ladies went by foot, pushchair and bike. Jessica had a little go in the swing which she enjoyed. For some reason she would stare at the pivot points on the swing as to enquire if they are safe or not!<\/p><p>We then played football which Katie showed particular enthusiasm for. Ben on the other hand was in one of those 'tired moods'. If things do not go 100% his way then tears and general grumpiness ensues! Quite funny from a distance really.<\/p>","images":false},"title":{"value":"Playing Football"},"version":1},{"date":{"d":16,"m":2,"y":2008},"datev":20080216,"images":1,"info":{"content":"<p>We met up with the Elders in Southsea where we first went swimming in the Pyramids. The water I think was being pumped in from the sea as it was pretty cold. Anyway we all had fun jumping into the pool and going on the flumes.<\/p><p>We then had a picnic by the castle on the seafront before walking along towards the funfair. We spotted the hovercraft coming in to land on the beach and then leave again. Us older children had a couple of rides on the fairground. We then headed towards the playground where the coldness finally beat us and we made our way home.<\/p><img src='images\/years\/2008\/2008_02_16-16-Southsea.jpg' class='diaryImage' alt='Southsea' \/><p class='diaryImageCaption'>Southsea<\/p>","images":false},"title":{"value":"Southsea"},"version":1},{"date":{"d":11,"m":2,"y":2008},"datev":20080211,"first":{"name":"benjamin","value":"Ben's first day at playschool"},"info":{"content":"<p>After dropping Katie off at Cross Farm, the rest of us walked over to Balmoral Drive to let Ben go for his first day at playschool. He's been looking forward to it for weeks. He absolutely loved it. As soon as we were inside, that's it, he didn't want to know us!<\/p>","images":false},"title":{"value":"Ben's first day at playschool"},"version":1},{"date":{"d":10,"m":2,"y":2008},"datev":20080210,"info":{"content":"<p>\u000a        After church, Katie and Ben went out with Farmor and Farfar to<a href=\"www.birdworld.co.uk\">Birdworld<\/a>near Farnham. The day was very bright and the temperature was the highest of the year. We had a ride on a road train and saw emus, ostriches and vultures, as well as penguins. We then had lunch of fish and chips and after we hired a little car like trolley and took turns being pushed around by Farfar.\u000a      <\/p><p>On that drive we saw parrots and pink flamingos who were standing on one leg. We also played on the slides and climbing frames as well as going into the pets farm. We were both uncomfortable in having chickens and turkeys walk right up to us. Luckily, the crocodiles (Caymans) that we later saw in Underwater World were behind thick glass and could not get at us, so we we able to be far braver. (Thanks to Farfar for this contribution)<\/p><p>We then went straight over the Church Crookham for Karen Sanders' birthday party. Her immediate family were there and we all had a go at playing Twister! The tea was finished off with some lovely cakes and puddings. Mummy and Karen went off to Woking to watch Mama Mia, whilst Daddy got the full 90 minute Jessica crying treatment at home!<\/p>","images":false},"title":{"value":"Birdworld with the Fars, Karen's 32nd Birthday"},"version":1},{"date":{"d":9,"m":2,"y":2008},"datev":20080209,"images":1,"info":{"content":"<p>\u000a        It was a gloriously sunny day just right for a\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps\/ms?ie=UTF8&amp;hl=en&amp;msa=0&amp;ll=51.529759,-0.128832&amp;spn=0.011907,0.029182&amp;t=h&amp;z=15&amp;om=0&amp;msid=111027506527990496626.000445e729613d3d11391\">\u000a          walk in London\u000a        <\/a>\u000a        . We drove up to Turnham Green, but were unable to park in our normal spot, so went across to Chiswick Park, only to find the tube was shut for engineering works! So after we changed Jessica's nappy in a bus shelter on Chiswick High Street, she had gone right through 2 sets of clothes layers! We caught the 27 bus to Chalk Farm. This 80 minute bus journey certainly tested the staying power of all the children. All had a little sleep. It was nice to go through some bits of London which we hadn't seen.\u000a      <\/p><p>\u000a        We cut through Camdem High Street, which incidentally went down in a\u000a        <a href=\"http:\/\/news.bbc.co.uk\/1\/hi\/uk\/7237119.stm\">\u000a          big fire that night\u000a        <\/a>\u000a        ! The bus finally halted at Chalk Farm Morrisons. Nice. We then walked up the very relaxed and trendy Primrose Hill Road. It was lovely. Around the corner was the grassy hill itself with good views over London, better than Hampstead Heath in my opinion.\u000a      <\/p><p>Ben instantly found a lady friend of a similar age. The old dog managed to get a few hugs off her.... and he introduced me as \"And that's my Daddy\", which everyone (25 people) on top of hill heard and some laughed. We had our usually horrible picnic and walked down to the swings and play there for a bit.<\/p><img src='images\/years\/2008\/2008_02_09-41-London.jpg' class='diaryImage' alt='Katie on Primrose Hill' \/><p class='diaryImageCaption'>Katie on Primrose Hill<\/p><p>The children were getting ever so tired and we struggled passed London Zoo and strolled through Regents Park and headed to St Pancreas station as Ben wanted to see the Eurostar trains. Unfortunately he was asleep in the pushchair and Mummy didn't have the heart to wake him up. The station looked great after the refurbishment. We took some photo's, dreamed about affording a thimble full of champers at the champagne bar, £7.50 a glass was the cheapest!<\/p><p>We then headed back, only to find the bus replacement service was severely clogged up at Hammersmith! Not ideal when you have Ben saying \"my legs are breaking!\"<\/p>","images":false},"title":{"value":"London Tour"},"version":1},{"date":{"d":3,"m":2,"y":2008},"datev":20080203,"images":10,"info":{"content":"<p>Getting ready before the service was uncommonly calm and stress free. We got to St. Andrews 15 minutes before the service started and thankfully all the godparents were there, which was no mean feat, as some travelled from afar and some with kiddies.<\/p><p>Scott, the vicar made us feel very welcome and performed a lovely service. It seemed special as it was integrated with the regular service which only happened because all of us are regular church go-ers. Well almost all of us. Daddy always seems to have a headache or something when Sunday morning comes!<\/p><p>Jessica was certainly the star of the show. She behaved impeccably throughout the service. Katie and Ben went to crèche, as the vicar opened with a joke about how you never see children again at church after they have been christened.<\/p><p>The godparents: Fiona Burrows, Karen Teale, Graham Tremear and Richard Sanders all came to the font of the church along with the five of us as Jessica was christened. Jessica was carried around the church by the vicar to show her off. She was a star.<\/p><p>We retrieved Katie and Ben's christening candles which were lit in front of everyone. Katie made the congregation laugh when she blew hers out, just like a birthday candle!<\/p><p>The service drew to an end and Uncle Philip took a few photos of us by the font. We gave a cake for everyone in the congregation and made off to Mytchett bowls club for the celebrations.<\/p><p>It was so nice to see so many different people from both sides of the family and friends to. There were quite a few kiddies who played with a few of the toys we brought. Luckily the playground was only just outside and was new. However, it was pretty cold to stay out there for too long.<\/p><p>We would all like to say a big thank you to everyone who helped us on the day. Farmor, Susan, Ellie, Ma Ma and Grandma for providing the food, to Mytchett bowls club for letting us have use of their clubhouse on the cheap, and to Scott and St Andrew's church for actually christening Jessica. And thanks for all the so many wonderful presents which we opened in the afternoon. Fantastic, although some of the cards had fallen from the present itself, so it was difficult to know who gave what!<\/p><img src='images\/years\/2008\/2008_02_03-01a-JessicaChristening.jpg' class='diaryImage' alt='Church Gathering' \/><p class='diaryImageCaption'>Church Gathering<\/p><img src='images\/years\/2008\/2008_02_03-02a-JessicaChristening.jpg' class='diaryImage' alt='Lils and Yasmin' \/><p class='diaryImageCaption'>Lils and Yasmin<\/p><img src='images\/years\/2008\/2008_02_03-03-JessicaChristening.jpg' class='diaryImage' alt='Ella and Katie' \/><p class='diaryImageCaption'>Ella and Katie<\/p><img src='images\/years\/2008\/2008_02_03-04-JessicaChristening.jpg' class='diaryImage' alt='Mytchett Bowls Club' \/><p class='diaryImageCaption'>Mytchett Bowls Club<\/p><img src='images\/years\/2008\/2008_02_03-06a-JessicaChristening.jpg' class='diaryImage' alt='Farmor and Helen' \/><p class='diaryImageCaption'>Farmor and Helen<\/p><img src='images\/years\/2008\/2008_02_03-10-JessicaChristening.jpg' class='diaryImage' alt='Barrie and Laura' \/><p class='diaryImageCaption'>Barrie and Laura<\/p><img src='images\/years\/2008\/2008_02_03-11-JessicaChristening.jpg' class='diaryImage' alt='Alan, Linda and Farfar' \/><p class='diaryImageCaption'>Alan, Linda and Farfar<\/p><img src='images\/years\/2008\/2008_02_03-13-JessicaChristening.jpg' class='diaryImage' alt='Lisa, Yasmin and David' \/><p class='diaryImageCaption'>Lisa, Yasmin and David<\/p><img src='images\/years\/2008\/2008_02_03-17-JessicaChristening.jpg' class='diaryImage' alt='Ma Ma, Karen and Bradley' \/><p class='diaryImageCaption'>Ma Ma, Karen and Bradley<\/p><img src='images\/years\/2008\/2008_02_03-18-JessicaChristening.jpg' class='diaryImage' alt='Karen and Jessica' \/><p class='diaryImageCaption'>Karen and Jessica<\/p>","images":false},"title":{"value":"Jessica's Christening - St Andrew's Church, Frimley Green"},"version":1},{"date":{"d":2,"m":2,"y":2008},"datev":20080202,"images":1,"info":{"content":"<p>We went to Joey's big 3rd birthday party who he was sharing with two of his NCT friends. It was held at the Country Market, same place as last year. There was lots to play with including a bouncy castle which Daddy threw us across as we played Superman. There was also a craft table where Katie, Ben and Jessica all made crowns!<\/p><img src='images\/years\/2008\/2008_02_02-08-Joey3rdBirthday.jpg' class='diaryImage' alt='Pass The Parcel' \/><p class='diaryImageCaption'>Pass The Parcel<\/p><p>Lilly has started to walk her first few steps so it won't be long until she is running around with the others. Freya also came along to play with us lot. Ma Ma eventually turned up after some legendry organization of the location of the party. Still we laughed.<\/p><p>After three sets of Happy Birthday's and a slice of cake, the girls went off with Ma Ma to do some clothes shopping, whilst the boys went off to football.<\/p><p>It was a bitterly cold day and only the hardened turned up for the Combined Counties clash at Wembley. Not THE Wembley, but Wembley F.C. Ben actually was interested in watching the game for about 2 minutes. I think he'll like football when he gets older. He was very much in 'Why' mood. Everything was proceeded with a long 'Whhhyyy?'.<\/p><p>After a well fought 1-1 draw we said our goodbyes to Farfar and returned home. The 'Lodger' came and stayed the night, whilst Daddy made 5 bazillion sandwiches and Mummy went to set the bowls club up with Grandma and Granddad. Alan and Linda came down and spent the night at the Fars.<\/p>","images":false},"title":{"value":"Joey's 3rd Birthday, Wembley Football, Shopping"},"version":1},{"date":{"d":27,"m":1,"y":2008},"datev":20080127,"info":{"content":"<p>We went to the church New Year’s Party. Katie and Ben played all the games, pass the parcel, Simon says, musical bumps and statues. There was a raffle, everyone got a ticket free and Katie loved hers and wrote her name on it. All the way through the raffle, she was waiting for her number 182 to come up. Mummy was really hoping it would as Katie would have been so upset. Luckily it did get called out and Katie picked out a necklace and Ben won a car, Joey got a chocolate reindeer, and mummy a big box of chocolates. Katie and Ben also loved the chocolate game where you dress up and cut the chocolate with a knife and fork, they couldn't  believe their luck. Ma Ma and Uncle Peter won the quiz which pleased them.<\/p>","images":false},"title":{"value":"Church Party"},"version":1},{"date":{"d":26,"m":1,"y":2008},"datev":20080126,"info":{"content":"<p>We met Ma Ma, pops, Auntie Ellie, Uncle Michael, Joey and Lily at Woking swimming pool. We had a really nice time, Jessie had her second swimming experience and seemed to really enjoy it. Ben loved the flume wanting to go on it again and again, and Katie loved mucking around with Ma Ma. Afterwards we went for a cup of tea and a doughnut, Daddy had one breaking his new healthy eating routine!<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":24,"m":1,"y":2008},"datev":20080124,"info":{"content":"<p>Daddy decided to go on a 10 \/ 11 mile jog! He hadn't planned it. He completed the first 6 miles loop and didn't quite complete the second lap. Granddad had to give him a lift home.<\/p><p>This week Daddy also bought over 20 pounds worth of fruit \/ veg and other healthy food. Not really part of diet as such, just want to snack healthily.<\/p>","images":false},"title":{"value":"Run Forest Run"},"version":1},{"date":{"d":22,"m":1,"y":2008},"datev":20080122,"first":{"name":"jessica","value":"Roll over"},"info":{"content":"<p>Today I rolled over from my back to the front. The day after I could roll back again onto my back.<\/p>","images":false},"title":{"value":"Jessica rolls over"},"version":1},{"date":{"d":20,"m":1,"y":2008},"datev":20080120,"info":{"content":"<p>We went to Leah's birthday party held at Pine Ridge. Katie won the Tenpin bowling scoring a whopping 117!<\/p><p>Later in the afternoon Auntie Susan came around to play and have a cup of tea and a natter.<\/p>","images":false},"title":{"value":"Leah Party and Auntie Susan around"},"version":1},{"date":{"d":19,"m":1,"y":2008},"datev":20080119,"images":1,"info":{"content":"<p>We went down to visit Charlotte's digs down in Winton along with the Elder clan. Mummy was a bit vocal at her disgust with the state of the place for our liking, especially as all the housemates were quiet in their bedrooms!<\/p><p>After the tour of the house, we ventured into Bournemouth and walked down from the cliff top down to the pier and beach area. It was pretty windy and cold, but Daddy and Katie rolled up their trousers and went paddling. Not for long though as it was so cold it hurt! We snapped a line-up picture, then quickly seeked somewhere out of the wind.<\/p><img src='images\/years\/2008\/2008_01_19-03-Bournemouth.jpg' class='diaryImage' alt='Brazing and Brave at Bournemouth Beach' \/><p class='diaryImageCaption'>Brazing and Brave at Bournemouth Beach<\/p><p>We ate our lunch in Winter Gardens and then mooched around the high street, stopping for a hot, rhubarb and custard Shakeaway. Katie and Ben were getting a little tired, so we ventured back to the car and got home quickly.<\/p><p>Daddy and Katie then went out for a longish bike ride until it got dark. Lovely Jubbly.<\/p><p>We stopped feeding Jessica solids as she had a massive sick tonight.<\/p>","images":false},"title":{"value":"Bournemouth"},"version":1},{"date":{"d":12,"m":1,"y":2008},"datev":20080112,"info":{"content":"<p>In the morning we cleared the garage of the old carpet and had two trips to the dump. Interesting! We also played pirates and Katie was 'Spack Jarrow', which made us laugh. Not quite Jack Sparrow out of Pirates of the Caribbean!<\/p><p>We went to Farnborough and met with the Fars. There was an temporary ice skating rink. Daddy felt a right gypo. This is the snob rising out, but we were in Asda car park, with the down and outs of Farnborough, ice skating on a mobile, acrylic, 10 metre squared rink. Saying that the children didn't care. Katie absolutely loved the fact she couldn't keep her feet as mummy and daddy led her around. Ben also had a short go.<\/p><p>We moved onto King George V fields and showed the Fars our favourite playground.<\/p>","images":false},"title":{"value":"Ice Skating"},"version":1},{"date":{"d":11,"m":1,"y":2008},"datev":20080111,"first":{"name":"jessica","value":"Jessica's first solids"},"info":{"content":"<p>Jessica took some baby rice today and lapped it up. She loved it. She is piling on those pounds. Legs like Fatima Whitbread.<\/p>","images":false},"title":{"value":"Jessica begins to eat"},"version":1},{"date":{"d":6,"m":1,"y":2008},"datev":20080106,"info":{"content":"<p>Mummy decided we needed new carpets, so we had to get the old carpets up and out of the house. The Fars came around to help us shift furniture about.<\/p>","images":false},"title":{"value":"Up With Those Carpets"},"version":1},{"date":{"d":5,"m":1,"y":2008},"datev":20080105,"info":{"content":"<p>\u000a        In the morning when Ma Ma woke up we played trains. Then Pop Pop took us to Tenterden where we had a drink in a pub. Ben really liked this and hoped to see more of these sort of places in the distant future. After this we went on the\u000a        <a href=\"www.rhdr.org.uk\">\u000a          Romney, Hythe and Dymchurch railway\u000a        <\/a>\u000a        to Dungerness. Following rather a nice lunch, I had a chip and one bite of an ice lolly, we returned home.\u000a      <\/p><p>Mummy, Katie and Jessica turned up and we had a little party before setting off for home. I think Ma Ma and Pop Pop had tears in their eyes when we said goodbye. (author: Ma Ma)<\/p>","images":false},"title":{"value":"Ben - Romney-Hythe-Dymchurch Railway"},"version":1},{"date":{"d":4,"m":1,"y":2008},"datev":20080104,"info":{"content":"<p>Ben spent a great day with my Ma Ma, Granddad, grandma, Uncle Peter and Uncle Howard. We went to the pantomime to see Peter Pan, there were no scary men in it. Ben wanted an ice cream but when Ma Ma bought one, Ben found he didn't want it after all so Uncle Peter had two! After Peter Pan was finished we said goodbye to everyone but Ma Ma couldn't find her car. Luckily Uncle Peter turned up and helped us find it and said he would come home with us. Ben slept all the way home.<\/p><p>When we got in we watched Superman, then had some tea and a bath and went to bed. Ma Ma slept with Ben and he woke once for a drink. (author: Ma Ma)<\/p>","images":false},"title":{"value":"Ben - Peter Pan Pantomime"},"version":1},{"date":{"d":2,"m":1,"y":2008},"datev":20080102,"info":{"content":"<p>With Mummy at a funeral and Daddy first day back at work after Christmas, Ben spent the day with the Fars by first playing at their house for an hour then going out on a sunny but very sharp day to see aeroplanes at Southampton Airport. The journey down to Hampshire was by train from Farnborough which was an extra bonus.<\/p><p>After having a pizza lunch, we went outside on to the top of the car park to see the aeroplanes take off and land. Being quite a small airport there was only one movement roughly every fifteen minutes but the view of what was happening on the apron and runway was excellent. We stayed there for almost an hour in the cold but Ben never complained once and was always interested until we took the warm mid afternoon train home again.<\/p>","images":false},"title":{"value":"Ben - Southampton Airport"},"version":1}],"version":1032280408}