{"entries":[{"date":{"d":31,"m":12,"y":2009},"datev":20091231,"images":1,"info":{"content":"<p>The Elders again hosted another event, this time with the Sanders and Glidewells. We had some party games for the Children, including Mr and Mrs, a picture quiz and pass the parcel. In Mr and Mrs, Katie admitted she prefered Father Christmas to Daddy! Later in the evening we played more games and boys ended up victorious. Katie wouldn't sleep so she also stayed up. The 'funnel' trick was played on Richard who took it very well. The food was excellent. We sang in 2010. Happy New Year.<\/p><img src='images\/years\/2009\/2009_12_31-21-NewYearsEve.jpg' class='diaryImage' alt='The struggling girls team' \/><p class='diaryImageCaption'>The struggling girls team<\/p>","images":false},"title":{"value":"New Years Eve - Elders"},"version":1},{"date":{"d":28,"m":12,"y":2009},"datev":20091228,"images":2,"info":{"content":"<p>Over the past couple of days we are still trying to find homes for all the presents. We also have been playing with them. Daddy and Ben have made a couple of lego sets, an Indiana Jones and a Star Wars. Ben is getting quite good at following the instructions and piecing together the small bricks. Katie and Mummy have been playing many games, making bath bombs and apple juice lollies. Jessica has been adoring her pepper pig teddy bear and books.<\/p><p>Today, Uncle Peter hosted the Barnett clan, plus the Rout's came along to. It was manic with 8 children under 7 years old running around the house. The children played some games, but mainly played all together with alot of energy!<\/p><img src='images\/years\/2009\/2009_12_28-08-PeterBarnettXmasParty.jpg' class='diaryImage' alt='What a fine three' \/><p class='diaryImageCaption'>What a fine three<\/p><img src='images\/years\/2009\/2009_12_28-34-PeterBarnettXmasParty.jpg' class='diaryImage' alt='Party!' \/><p class='diaryImageCaption'>Party!<\/p>","images":false},"title":{"value":"Uncle Peter's Barnett Party"},"version":1},{"date":{"d":27,"m":12,"y":2009},"datev":20091227,"images":1,"info":{"content":"<p>We went over to the Fars in the morning to turn their house upside down!<\/p><img src='images\/years\/2009\/2009_12_27-08a-AtTheFars.jpg' class='diaryImage' alt='Family Portrait' \/><p class='diaryImageCaption'>Family Portrait<\/p>","images":false},"title":{"value":"Over to the Fars"},"version":1},{"date":{"d":26,"m":12,"y":2009},"datev":20091226,"images":1,"info":{"content":"<p>We returned home and had a bit of time to clear and play with some of the toys, before going to the Elders for the Barnett Boxing Day party. The usual crowd were there which was nice. It was girls against boys in the games stakes, and the boys slightly edged it and were the victors. Katie was allowed to stay up all night and join in as well. She was ever such a good girl and played nicely. Ma ma decided to play a trick, everyone was in it, except for the unfortunate target, Daddy. Daddy and Michael had to put a funnel down their trousers and try and drop a carrot from their head into the funnel. However, Ma ma had other ideas, and just as they were starting she poured water in to the funnel and Daddy's trousers and pants were soaked! Katie found it hard to keep a straight face through out this whole charad and was in hysterics after the deed had been done. Very amusing indeed! Thanks to Ellie and Michael for being sporting hosts.<\/p><img src='images\/years\/2009\/2009_12_26-05-BoxingDay.jpg' class='diaryImage' alt='Pass the Parcel' \/><p class='diaryImageCaption'>Pass the Parcel<\/p>","images":false},"title":{"value":"Boxing Day"},"version":1},{"date":{"d":25,"m":12,"y":2009},"datev":20091225,"images":3,"info":{"content":"<p>It was strangely an average wake up call, 6:30am. Jessica was out of sorts, Ben and Katie were in hyper drive mode. First, we opened their presents from Father Christmas in their room.<\/p><ul><li><i>Katie<\/i>Katie hauled a Hannah Montana scooter, a whiteboard, a school register, some pens, books, a digital camera and a bath bomb factory set.\u000a        <\/li><li><i>Ben<\/i>BMX bike, a Star Wars scooter, a Luke Skywalker figure, a Star Wars t-shirt, a digital camera.\u000a        <\/li><li><i>Jessica<\/i>Upsy Daisy bubble bath, Upsy Daisy dressing up outfit, Pepper Pig blanket, Pepper Pig necklace, chocolate and an In the Night Garden annual.\u000a        <\/li><\/ul><p>Next step, Mummy and Daddy's room, Daddy got a hoody, a pair of wellies, gardening gloves, sacatares, a hair brush and some sun dried tomatoes.<\/p><p>Mummy got a pair of jeans, some trainers, socks, banana chips and a nice pink fleece.<\/p><p>We then went down for a spot of additional Christmas present opening, this time from others. So many wonderful gifts.<\/p><img src='images\/years\/2009\/2009_12_25-59-ChristmasDay.jpg' class='diaryImage' alt='Under the tree' \/><p class='diaryImageCaption'>Under the tree<\/p><p>After breakfast we went over to the Fars for some more breakfast and more present opening, whilst Mummy went to church.<\/p><p>We then hot stepped it over to Istead Rise where the Elder's had already arrived. This year a change in plan, all the children had their traditional Christmas lunch first up, to allow the adults to have theirs in peace in the evening. After lunch and a walk around the block, another session of present opening. There were so many presents, it must have taken 20 minutes just to distribute them all. Let the commotion begin. It's like a box of fireworks being ignited. Wrapping paper flying everywhere.<\/p><img src='images\/years\/2009\/2009_12_25-15-ChristmasDay.jpg' class='diaryImage' alt='Chimps Tea Party' \/><p class='diaryImageCaption'>Chimps Tea Party<\/p><img src='images\/years\/2009\/2009_12_25-71-ChristmasDay.jpg' class='diaryImage' alt='Present Mainia' \/><p class='diaryImageCaption'>Present Mainia<\/p><p>There was an hour or so, to play with some of the toys whilst we had the nightmare sleeping arrangements. How do you fit 12 people into a house with 3 bedrooms? We managed it just.<\/p><p>Later in the evening we had our Turkey dinner which was excellently prepared by chef Weston, played a quiz game, then settled down to watch Gavin and Stacey and the Catherine Tate show.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2009},"datev":20091224,"images":2,"info":{"content":"<p>Daddy finished work at about 2:30pm, and headed home to play some games. We then went over to the Fars for the first of many Christmas gatherings. Farmor and Auntie Susan were busy in the kitchen, helped occassionally by Jessica, whilst Ben was entertaining Uncle Graham, with various Ben'isms!  We tracked Father Christmas's progress sporadically on the internet.<\/p><p>It was food time, and star of the show was the roast pork and lemon crunch dessert. Delicious.<\/p><p>Katie and Ben were egging for present opening time, and they went against the normal Gay tradition of one present only to be opened in the room at a time. It was almost a rush. Saying that, once opened they did spend time on each gift and much to our delight they said things like, 'this is what I really wanted', or 'I really could do with this'. This was not out of politeness, but what they really thought, which was nice to hear.<\/p><p>We returned home at 8pm, and prepared a glass of milk and mince pie for Father Christmas, plus a note from Katie telling him not to close her bedroom door when he leaves! We also sprinkled some reindeer oats on the path, although I'm sure most of them got spilt in the hallway! The children were shaking with excitement. However, they must have worn themselves out as they did not stay awake for very long.<\/p><p>Mummy went off to midnight mass, when she returned at 1am, Katie had woken, but still Father Christmas had not made an appearance. However, she seemed to wake every hour past 2am saying that Father Christmas had been and wondered if she could open them there and then.<\/p><img src='images\/years\/2009\/2009_12_24-18-ChristmasEve.jpg' class='diaryImage' alt='What a beaut' \/><p class='diaryImageCaption'>What a beaut<\/p><img src='images\/years\/2009\/2009_12_24-23-ChristmasEve.jpg' class='diaryImage' alt='Present time' \/><p class='diaryImageCaption'>Present time<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":22,"m":12,"y":2009},"datev":20091222,"images":1,"info":{"content":"<p>Daddy had a day off work so we all could go up to London to see Father Christmas. First we went on the tube to the Natural History Museum. All of a sudden Katie has got a fear of going on the underground, to go with her fear of ensuring doors are kept open. We think it stems back to the night where her bedroom door wouldn't open. Anyway, we trotted by the picturesque lights and ice rink outside the museum before going in. We didn't have much time so headed towards the blue whale area then on to the dinosaurs. The children seemed to enjoy themselves quite a bit.<\/p><img src='images\/years\/2009\/2009_12_22-11-NaturalHistoryMuseum.jpg' class='diaryImage' alt='Natural History Museum trip' \/><p class='diaryImageCaption'>Natural History Museum trip<\/p><p>We then headed to Selfridges on a double decker bus. Got off at Marble Arch and fought through the crowds. We were surprised to see Farfar waiting in line with us to see Father Christmas. He was allowed to join us on the magical train ride and into Father Christmas's cabin, where we had a little chat and a picture taken. Katie and Ben were a little shy, whilst Jessica was just plain scared. We reached the end. As we were sorting ouselves out, Katie happen to notice there was more than one Father Christmas working at a time, as there were multiple cabins. She was quite upset as she believed it to be the real Father Christmas. She said she was fed up on all the pretend Father Christmas's. She was confused and the pretence of a real Father Christmas existing was close to being destroyed. She put on a brave face, but certainly a big seed of doubt has been sown. Is this the final year for her?<\/p><p>Farfar joined us in a Pizza Express around the corner, before we made our way homeward bound.<\/p>","images":false},"title":{"value":"Natural History Museum, Selfridges and a meal"},"version":1},{"date":{"d":20,"m":12,"y":2009},"datev":20091220,"images":1,"info":{"content":"<p>In the morning Mummy took us to the Christingle which was brave as we had to carry a candle each stuck in an orange!<\/p><p>In the afternoon, our 'gypsy mother' and the rest of us went to see the West's to exchange Christmas presents.<\/p><img src='images\/years\/2009\/2009_12_20-11-Wests.jpg' class='diaryImage' alt='Present time!' \/><p class='diaryImageCaption'>Present time!<\/p>","images":false},"title":{"value":"Over to the West's"},"version":1},{"date":{"d":19,"m":12,"y":2009},"datev":20091219,"images":3,"info":{"content":"<p>We headed over to Purley for Thomas's 4th birthday party. There were 20+ children, which was very generous, not to mention brave. There was a dressing up theme to the party which wasn't just reserved for the children! There was an hours worth of softplay. Ben and Thomas played well together, tendering on the physical side. Later some party food and games in the second half.<\/p><img src='images\/years\/2009\/2009_12_19-10-Thomas4thBirthday.jpg' class='diaryImage' alt='Superman and spidy' \/><p class='diaryImageCaption'>Superman and spidy<\/p><img src='images\/years\/2009\/2009_12_19-01-Thomas4thBirthday.jpg' class='diaryImage' alt='Jessica crawler' \/><p class='diaryImageCaption'>Jessica crawler<\/p><img src='images\/years\/2009\/2009_12_19-17-Thomas4thBirthday.jpg' class='diaryImage' alt='Colourful Katie' \/><p class='diaryImageCaption'>Colourful Katie<\/p>","images":false},"title":{"value":"Thomas's 4th Birthday Party"},"version":1},{"date":{"d":13,"m":12,"y":2009},"datev":20091213,"images":6,"info":{"content":"<p>Today we dressed the house in Christmas decorations. the tree went up without too much bother. In the afternoon Daddy and Farfar took Jessica swimming over at Farnborough. She loved it. She just wanted to climb to the edge, jump in, goto the edge, jump in. We must have been in there for 45 minutes or so.<\/p><p>Last year, wit the troubles we were having with Jess and her sleeping we didn't host a Christmas Party, which we really missed. Katie and Ben were keen to join in, however it was a strictly adults affair, although Mummy and Daddy did feel sorry for Katie especailly, as she would be in her element.<\/p><p>The Elders were first to come, with Lily and Joey. We also had Karen, Rich, Evie, Helen, Nigel, Fee and Kelly. The traditional boys versus girls. Some dodgey memories of past results I feel.<\/p><p>This year's theme was 'I'm A Celebrity Get Me Out Of Here', which was an excuse to do some dodgey tasks with food.<\/p><p>First up was apple bopping. Ellie made what seemed a good first effort, getting soaked for her troubles, but Michael found a great technique and stormed to victory.<\/p><img src='images\/years\/2009\/2009_12_13-12a-ChristmasParty.jpg' class='diaryImage' alt='Michael Bopping' \/><p class='diaryImageCaption'>Michael Bopping<\/p><p>The Morley's next in marshmellow combat. Helen was far too much of a lady to be crowned as the one with the biggest gob, Nigel could have fit at least a dozen in his mouth.<\/p><img src='images\/years\/2009\/2009_12_13-15a-ChristmasParty.jpg' class='diaryImage' alt='Partial to a bit of marshmellow' \/><p class='diaryImageCaption'>Partial to a bit of marshmellow<\/p><p>Next a shoo in victory for the boys, a question of strength between the mighty Kelly and poor little Karen who must be so tired with Evie. No contest. Kelly posted a very impressive time, claiming he went long 'because you never can be sure'.<\/p><p>Karen, with litle confidence stepped up, and smahed Kelly's time. Need to insert a list of Kelly's excuses here! I think one of them was that he done it on his wrong arm.<\/p><img src='images\/years\/2009\/2009_12_13-23a-ChristmasParty.jpg' class='diaryImage' alt='A confident looking Kelly' \/><p class='diaryImageCaption'>A confident looking Kelly<\/p><p>The final trial was probably the worst to be involved in. The taste challenge and the brave warriors were, Richard for the boys and Fiona for the girls. There were four foods. First a snail. There were complaints of a gritty, earthy taste. Neither of them had tasted Escagots before I don't think they'll be ordering it from a restaurant quickly. Next was a mouthful of tongue, then hot, hot, hot Green Jalapeno's. Had a bit of a kick. Then finally it was the anchovy paste. Again not a particular favourite. Both done very well, not letting their teams down.<\/p><img src='images\/years\/2009\/2009_12_13-40a-ChristmasParty.jpg' class='diaryImage' alt='Fee taking a Jalapeno hit' \/><p class='diaryImageCaption'>Fee taking a Jalapeno hit<\/p><img src='images\/years\/2009\/2009_12_13-41a-ChristmasParty.jpg' class='diaryImage' alt='Snail trail' \/><p class='diaryImageCaption'>Snail trail<\/p><p>Dispersed amongst the trials was a spot of food and some other quiz games, including Michael's, Tv Themes Tunes, Film Sound Bites and 'Closest To The House Price' guessing game. At the end of the night scores were tied, and it was down to the final question. A Coronation Street piece of trivia. A girl must get this, but Nigel lept like a salmon and gave the boys galant victory.<\/p><img src='images\/years\/2009\/2009_12_13-18a-ChristmasParty.jpg' class='diaryImage' alt='The concentration levels were immense during the house price guessing game!' \/><p class='diaryImageCaption'>The concentration levels were immense during the house price guessing game!<\/p><p>Thanks to all who came, we really enjoyed ourselves. Same again next year, this time Kelly will have to proove his manlyness! Still can't believe it.<\/p>","images":false},"title":{"value":"Christmas Party"},"version":1},{"date":{"d":12,"m":12,"y":2009},"datev":20091212,"images":1,"info":{"content":"<p>In the morning we left for Notcutts to get some more Christmas Presents.<\/p><p>Daddy and Ben left about midday to catch a train to Reading and met up with 'Fat Phil', who isn't looking that fat (digging out frantically). Mmm. This then rather confirms things... we then went to McDonalds as a little treat for Ben, and not only did he have a happy meal, he got a Darth Vader toy and baloon. Ben was most pleased.<\/p><p>After filling our stomachs we caught a bus to the 'Mad Stadt', went into the 'Megastore' and 'Jazz Bar'. Phil then attempted to lure Ben away from Man Utd, and purchased a Reading top for Ben. Ben was most pleased!<\/p><p>We made it into the stadium about 10 minutes before kickoff. We sat very close to Phil, at the bottom of the stand, quite close to the corner flag. Ben was getting a little cold and tired. He finally wanted his coat on, and was wrapped under his blanket. He looked like an old man.<\/p><p>The game began and Ben fell asleep! It was quite an entertaining game, Reading were far the better team, asserting more pressure, creating more chances, but they only managed to convert one of them by half time.<\/p><p>Half time and we had our snacks, got a photo with Kingsley the Reading mascot and made our way to the very top of the stand. The view was great. Ben was most pleased.<\/p><p>The second half commenced and Ben got more into the game, asking some more questions about what was going on. Scunny scored late on, and like the previous occassion, the game turned into a real exciting finish. Both teams had great opportunities to go ahead. In the 89th minute Ben decided he was very desperate for the toilet! Thankfully we didn't miss anything. The final whistle blew and we made our way back to the bus, train and home. Ben wanted to get back for Strictly! Obviously Daddy needs to try harder to 'Man him up'!<\/p><img src='images\/years\/2009\/2009_12_12-02a-ReadingScunthorpe.jpg' class='diaryImage' alt='Ben with Kingsley' \/><p class='diaryImageCaption'>Ben with Kingsley<\/p><p>Thanks to Phil for a great treat out.<\/p>","images":false},"title":{"value":"Reading v Scunthorpe"},"version":1},{"date":{"d":5,"m":12,"y":2009},"datev":20091205,"info":{"content":"<p>In the morning we headed to other side of Guildford to go to Santa Firs. Basically it's a place that sells Chrsitmas Trees, but they've jazzed it up, offering horsey rides, tractor rides and a look at a real reindeer. It was good for what it was. We all loved it anyway.<\/p><p>Jessica was not 100%. She had a croaky voice. Anyway Mummy and Jessica went around the shops in Farnborough, while Daddy went for a long swim with Katie and Ben. Ben was able to swim a few metres under water, if not above it, and Katie swum the length of the baby pool, which I guess is about 20 metres!<\/p>","images":false},"title":{"value":"Santa Firs, Swimming"},"version":1},{"date":{"d":2,"m":12,"y":2009},"datev":20091202,"images":1,"info":{"content":"<p>Mummy was first person turning up... an hour early to ensure we had the best seats! Both Ben and Katie starred in the Nativity play, Ben as an angel, Katie as a servant. Katie did well with her one line. Mummy shed a tear of course and so did Daddy almost! Mummy and Daddy were very proud.<\/p><img src='images\/years\/2009\/2009_12_02-00-NativityPlay.jpg' class='diaryImage' alt='Ben singing, Katie the servant' \/><p class='diaryImageCaption'>Ben singing, Katie the servant<\/p>","images":false},"title":{"value":"Nativity Play"},"version":1},{"date":{"d":29,"m":11,"y":2009},"datev":20091129,"info":{"content":"<p>We were not feeling too well today, so had a low key affair. We went to church in the morning. Ben is really thriving and enjoying Sunday school. Katie went to a bowling, birthday party, but was taken home early as she was a little under the weather. Later in the afternoon the Fars popped over for a cup of tea.<\/p>","images":false},"title":{"value":"Illness Strikes"},"version":1},{"date":{"d":28,"m":11,"y":2009},"datev":20091128,"info":{"content":"<p>We went over to the Sanders household, and visited the garden centre where Father Christmas arrived on a horse and carriage. This is now a traditional annual event, this year shared with Uncle Michael, Lily, Joey and the Glidewell's. Karen and Richard laid on some nice food afterwards and we traded Ben for Lily for the rest of the day.<\/p>","images":false},"title":{"value":"Saw Father Christmas"},"version":1},{"date":{"d":27,"m":11,"y":2009},"datev":20091127,"images":1,"info":{"content":"<p>Mummy was feeling a little poorly, so Daddy took the day off and played Mummy's role. So we started by getting the children ready for school, taking them to school, then Daddy and Jessica went off to Swindon for a spot of Christmas shopping! Jessica was great, although she was constantly hiding amongst the clothes and running off. However, it was a successful trip. We rushed back to pick Katie and Ben from school. Katie was very proud to be taking Eddie The Teddy home for the weekend. Thankfully Mummy was feeling alot better when we returned.<\/p><img src='images\/years\/2009\/2009_11_27-03-EddieTheTeddy.jpg' class='diaryImage' alt='Katie with Eddie' \/><p class='diaryImageCaption'>Katie with Eddie<\/p>","images":false},"title":{"value":"Daddy being Mummy"},"version":1},{"date":{"d":22,"m":11,"y":2009},"datev":20091122,"info":{"content":"<p>The Sanders crew came over for tea. Little Evie was a star and must have wondered what on earth was going on around her. Jessica retrieved poo from her bum with her hands, Ben was jumping off the middle stair onto cushions at the bottom and when we went out Katie got soaked jumping in puddles! Anyone want three energy driven children?<\/p>","images":false},"title":{"value":"Sanders over for tea"},"version":1},{"date":{"d":21,"m":11,"y":2009},"datev":20091121,"images":1,"info":{"content":"<p>We headed for the Southfleet church Christmas Fair, where the star turn was Father Christmas, also known as Pop Pop. Katie had figured this out last year so we had to tell her that Pop Pop was filling in for Father Christmas, as the real one was a bit busy at the moment! As soon as we entered the den, I mean grotto, although looking very convincing, the south-east London accent wasn't reminicent of a Father Christmas. Not only did Ben figure it out, a loud cry of 'Pop Pop' came from Jessica! Anyway we carried on the pretence as we got some nice presents! We had a mad dash going around the busy fair. Lucky dip, guess the teddy bear name and pick the straw were some of the games played.<\/p><img src='images\/years\/2009\/2009_11_21-03-FatherXmasAndWalk.jpg' class='diaryImage' alt='Father Christmas with a south-east London accent!' \/><p class='diaryImageCaption'>Father Christmas with a south-east London accent!<\/p><p>We headed back to Istead Rise for some lunch, then went for a walk up a country road very close to Ma Ma and Pop Pop's house. We brieflt met Pop Pop and Ma Ma before returning for Star Wars and Strictly Come Dancing.<\/p>","images":false},"title":{"value":"Pop Pop Father Christmas"},"version":1},{"date":{"d":15,"m":11,"y":2009},"datev":20091115,"images":1,"info":{"content":"<p>It was Evie's Christening today. Mummy was proudly chosen as a Godmother. She's taking the role quite seriously. She even had to have a seperate card to write her own personal message! The church at Elvetham Heath was pretty contemporary in many aspects. The service generally was pretty liberal in content, with powerpoint presentations and even a live tv link to the creche! It was very much orientated towards a family audience.<\/p><p>The service proceeded with the baptism. Evie was such a good girl, she did not make a murmur throughout. All the parents and godparents, plus Ben, stood at the front of the church. The other godparents were: Jon, Rachel and Richard's friend Dave.<\/p><p>After the service we filtered back to the Sanders household for a celebration drinks and food, with particular mention to the excellent coronation chicken.<\/p><img src='images\/years\/2009\/2009_11_15-16-EvieSandersChristening.jpg' class='diaryImage' alt='Evie and her proud parents' \/><p class='diaryImageCaption'>Evie and her proud parents<\/p><p>Ben attended Joey's Star Wars 5th birthday party in Lightwater. He took quatre of an hour to warm up, but after that got really into it. Instead of pin the tail on the donkey, they had pin the lightsabre on the jedi knight! Cool. They also had a big trasure hunt which was excellent. Just up Ben's street.<\/p><p>Later in the evening Daddy went out with some of the Barnett clan, to the Banger racing at Wimbledon.<\/p>","images":false},"title":{"value":"Evie Sanders Christening, Joey's Birthday"},"version":1},{"date":{"d":14,"m":11,"y":2009},"datev":20091114,"info":{"content":"<p>The weather was shocking. We decided to go swimming at the Arena.<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":7,"m":11,"y":2009},"datev":20091107,"first":{"name":"benjamin","value":"Big Football Match"},"images":1,"info":{"content":"<p>We had a real busy day. Auntie Charlotte had come up and stayed the night, so we played with her in the morning. Daddy, Katie and Ben went swimming in the Arena whilst the three other girls went shopping around Camberley.<\/p><p>In the afternoon all us 4 girlies stayed in and watched Hannah Montana, whilst the boys went out to football. It was Ben's first professional game. He had the choice to go or not, and was quite looking forward to it.<\/p><p>We parked a long way from the ground and walked in. Unfortunately we missed 'Phat Phil'. We found out seats, but Ben wanted to see the view from the highest seats in the house. He didn't say a great deal so it was hard to gauge what he was thinking. Daddy likes to think he was absorbing the situation and atmosphere.<\/p><p>The first half was pretty drab on the pitch, and there was not much atmosphere as there was nothing for the home support to cheer about. Still Ben, was asking questions about the linesmen, referee and some of the laws of the game.<\/p><p>We failed to meet up with Phil at half time, on our way back to our seats, Stuart Church scored and came running towards us near the corner flag. The supporters went wild. This was Ben's favourite bit. The second half was a lot better, the floodlights and atmosphere coupled with a rousing finish completed a great aftermoon out. Final score 1-1.<\/p><img src='images\/years\/2009\/2009_11_07-03-ReadingIpswich.jpg' class='diaryImage' alt='At the Madejski Stadium' \/><p class='diaryImageCaption'>At the Madejski Stadium<\/p><p>We rushed home for fireworks. Ben unfortunately had tired himself out, so he was left at home with Daddy to watch Star Wars.... of course. Meanwhile the rest of us met with the Fars to watch the Ravenscote School Firework display. Farmor said they were the best she had seen in years!<\/p>","images":false},"title":{"value":"Swimming, Reading V Ipswich, Fireworks"},"version":1},{"date":{"d":3,"m":11,"y":2009},"datev":20091103,"info":{"content":"<woops woopstitle=\"Katie Locked In Her Bedroom Needing The Toilet\" rating=\"3\"><p>Katie got up during the night to go to the toilet, she got to the bedroom door which was shut, and tried to open it. She pulled the handle down, however, the door would not open, she shouted and Mummy woke, Mummy shouted and Daddy woke. Poor Katie was getting in a right state, crying and stressing that she couldn't get out.<\/p><p>Daddy attempted barging the door down, to no avail, took the door handle off, to no avail. Mummy was insisting on getting the fire brigade, Katie insisted on employing the option of jumping from her bedroom window, and Daddy licking his lips at the prospect of getting the circular saw out to cut a hole in the door! 'Mummy I really need the toilet'. Katie calmed down, but Mummy and Daddy heard her whispering a little prayer to herself. 'Please God, let the door open' and some other mutterings. Mummy and Daddy's heart melted, because she was so scared, but had composed herself so well. Ben of course somehow slept through all the noise and commotion.<\/p><p>We ran out of options, so Daddy rang Farfar at 2:30am. Luckily he had not gone to bed yet! Eventually Katie could not hold on any longer. As to not wee on the carpet she had decided she would assemble a pile of clothes and wee'ed on them! Farfar turned up with tools and within 5 minutes had used screwdrivers to force the spring stopper open. The spring was no longer very springy. What a relief. Katie came in and slept with Mummy and Daddy. She had been very brave. However, now she does not like to be in a room where the door is locked. We are very proud of how she handled herself though.<\/p><\/woops>","images":false},"title":{"value":"Katie Locked In Her Bedroom Needing The Toilet"},"version":1},{"date":{"d":2,"m":11,"y":2009},"datev":20091102,"first":{"name":"benjamin","value":"Full day at school"},"images":1,"info":{"content":"<p>Because Ben is one of the younger members of the class, his first full day at school was staged for today. Instead of a 3 hour day, it is now 6. We think he has been a bit more tired during the week, but otherwise it has not phased him at all. He really enjoys school, and seems to have picked up reading very well. I also think he's doing well at Maths, well compared with Katie he is anyway.<\/p><img src='images\/years\/2009\/2009_10_XX-KatieBenSchool.jpg' class='diaryImage' alt='Katie and Ben' \/><p class='diaryImageCaption'>Katie and Ben<\/p>","images":false},"title":{"value":"Ben's first full day at school"},"version":1},{"date":{"d":1,"m":11,"y":2009},"datev":20091101,"images":1,"info":{"content":"<p>We headed off to Istead Rise to celebrate Pop Pop's birthday. After church we had two sittings of Sunday lunch, those who are mature and those who weren't so much (yes and Mummy was in with us).<\/p><p>It was all a bit mad. We ventured out to the swings for a bit, but otherwise played in. Lily still had a poorly ankle from the previous week so she found it difficult to walk.<\/p><img src='images\/years\/2009\/2009_11_01-12-GeraldBirthday.jpg' class='diaryImage' alt='Mummy reading to Lily' \/><p class='diaryImageCaption'>Mummy reading to Lily<\/p>","images":false},"title":{"value":"Pop Pops Birthday"},"version":1},{"date":{"d":31,"m":10,"y":2009},"datev":20091031,"images":2,"info":{"content":"<p>We returned from a couple of days stay at Ma Ma and Pop and Pops yesterday which was nice, although Ben had a slight cold. This morning Joyce from Louisville came over to visit. Ben was straight in there telling the history behind his 'Lightsavers' and general Star Wars speak! Joyce had got perfect presents for them all. An Anakin Skywalker figure for Ben, High School Musical figures for Katie and a book for Jessica.<\/p><img src='images\/years\/2009\/2009_10_31-01-Halloween.jpg' class='diaryImage' alt='Katie, Ben and Joyce' \/><p class='diaryImageCaption'>Katie, Ben and Joyce<\/p><p>Farmor came over a little later and we went up to feed the ducks. Ben was intent on showing off his cycling skills, but the lack of stablizers ment he landed on the floor more often than not.<\/p><p>In the afternoon we carved out a pumpkin, attempting to model it on Darth Vader. We also attempted to make a birthday cake for Pop Pop, although the results were true to form! Daddy went out to watch Chertsey get beat by Camberley in a top of the table clash.<\/p><p>Katie had a halloween party in Fleet which was very good, whilst the rest of us hooked up with Ma Ma and Pop and went on a Trick or Treat trail around the area. We stopped off at Natasha's, Farmors, Auntie Sue's, Great Grandma and Grandad's and finally ending up at Uncle Peter's. All sweets and chocolates were gratefully received!<\/p><p>We were five again and ended up playing apple and doughnut dunking. We didn't really get time to watch 'Strictly'.<\/p><img src='images\/years\/2009\/2009_10_31-00-Halloween.jpg' class='diaryImage' alt='Katie, Ben and Joyce' \/><p class='diaryImageCaption'>Katie, Ben and Joyce<\/p>","images":false},"title":{"value":"Joyce Visit, Halloween"},"version":1},{"date":{"d":25,"m":10,"y":2009},"datev":20091025,"images":1,"info":{"content":"<p>Whilst the girls were at church, the boys went over to Chawton to watch Uncle Michael on his new Moto Cross bike. It was a really muddy test track ideal for beginers.<\/p><p>Then Daddy was invited to have ago. All kitted up and Daddy went on the test track, whilst Uncle Michael took me, Ben, to watch, right next to the biggest puddle in the world. One thing we didn't realize was how demanding on the arms moto-crossing is, and how different the skills needed are from an ordinary road bike.<\/p><p>When turning we have to move towards the handlebars so the front tyre gets more grip and poke your leg out. Rather than lean, you steer, and clutch and front brakes are a bit of a no no. 15 minutes and an interlude later, Daddy fully muddied himself out. It was really enjoyable, and he did get quicker and a little more confident as time went on. Uncle Michael the showed us how it was done.<\/p><p>Benny really got into it... well he got into the mud plenty of times, and pretended his bike was a moto cross bike, complete with sounds. When Joey turned up he was desperate to show how he can ride without stablizers, however, without success. He was so eager, to show off, but again ended in the mud! Anyway thanks to Uncle Michael.<\/p><img src='images\/years\/2009\/2009_10_25-04-MartinMotoX.jpg' class='diaryImage' alt='Daddy in a puddle' \/><p class='diaryImageCaption'>Daddy in a puddle<\/p><p>For the rest of the day we had Sunday lunch, did jobs, and played lots. Daddy took Jessica to watch the cars race around in the woods opposite. The weather was great. A lovely weekend.<\/p>","images":false},"title":{"value":"Moto Crossing"},"version":1},{"date":{"d":24,"m":10,"y":2009},"datev":20091024,"info":{"content":"<p>Katie went with her friend Nina to a Stagecoach acting school for an hour or so, then was treated to a McDonalds afterwards! The class would normally cost £30! Gulp.<\/p><p>Meanwhile the rest of us invaded the Fars for a spot of lunch, and to see how Farfar is after his trips to the hospital and doctors again this week.<\/p><p>After suitably giving Farmor plenty to tidy up for the afternoon, we left for the cinema in Basingstoke. Ellie and Joey came with us to see the Fantastic Mr Fox, whilst Michael looked after Lily and Jessica. We all enjoyed the film, despite it having a different story to the book, and despite Daddy falling asleep half way through it!<\/p><p>We returned back to Alton, to find Jessica all made up beautiful with her hair done. She had a great time with Michael and Lily.<\/p>","images":false},"title":{"value":"The Fars - Stagecoach - Fantastic Mr Fox, Cinema"},"version":1},{"date":{"d":18,"m":10,"y":2009},"datev":20091018,"images":1,"info":{"content":"<p>In the morning Daddy, Benny and Farfar went to a model railway exhibition. Surprisingly Ben seemed quite into it, asking plenty of questions, although I think the highlight was the chocolate cake, apple juice and a go on the playground come assault course afterwards. On the way home we quickly stopped off to watch some radio cotrolled helicopters being flewn.<\/p><p>After Sunday lunch, Daddy and Uncle Graham went to try 'Go Ape', a tree top assault course given from the Fars as a birthday present.<\/p><p>They both really enjoyed themselves. Susan, the Fars and Graham's mum endured the 2.5 hour journey around the course. Daddy was trying hard to do it properly, well attempting to do it without assistance from the safety ropes.<\/p><p>Afterwards we went around to the Tremear's for a quick cuppa.<\/p><img src='images\/years\/2009\/2009_10_18-33-GoApe.jpg' class='diaryImage' alt='Aerial Sliding' \/><p class='diaryImageCaption'>Aerial Sliding<\/p>","images":false},"title":{"value":"Go Ape"},"version":1},{"date":{"d":17,"m":10,"y":2009},"datev":20091017,"info":{"content":"<p>We had a relatively quiet day. In the afternoon we went over to the Windlesham swings and played there for over an hour. The big seat swing was top dog. Later in the afternoon Ma Ma and Pop Pop came over.<\/p>","images":false},"title":{"value":"Weston's Over"},"version":1},{"date":{"d":11,"m":10,"y":2009},"datev":20091011,"images":1,"info":{"content":"<p>4:30 this morning and Farfar was rushed to hospital with a kidney stone. Fortunately the pain subsided as time passed and was out in the afternoon. Daddy, Ben and Jessica all went to see him with Farmor. It is the first time that Daddy has known Farfar to go into hospital.<\/p><p>The weather was quite changeable. We got caught out when we went for a walk at Windlesham Arboritum. Still all of us enjoyed rolling down the hills and generally larking about. It was quite picturesque.<\/p><img src='images\/years\/2009\/2009_10_11-11-WindleshamArboritum.jpg' class='diaryImage' alt='Puddle-tastic' \/><p class='diaryImageCaption'>Puddle-tastic<\/p>","images":false},"title":{"value":"Farfar Kidney Stones, Walk In The Rain"},"version":1},{"date":{"d":10,"m":10,"y":2009},"datev":20091010,"info":{"content":"<p>In the morning we met with Ma Ma, Charlotte, Chris and the Elders for a frenzied swimming session. All the children were in hyper mode, and enjoyed been thrown about (in a nice way of course) by Chris and Michael.<\/p><p>Everyone came back for a BBQ.<\/p>","images":false},"title":{"value":"Swimming with the Elders and Westons"},"version":1},{"date":{"d":4,"m":10,"y":2009},"datev":20091004,"info":{"content":"<p>In the afternoon we went swimming. Afterwards Katie and Ben, were quite taken by the BMX and skateboard park.<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":3,"m":10,"y":2009},"datev":20091003,"info":{"content":"<p>In the morning we went to Camberley for a spot of shopping. It was a nightmare trip as we got a parking ticket, and then went swimming, got changed only to find the pool was only open for 10 minutes. We then got home then lost our only proper front door key and car key!<\/p><p>In the afternoon, us children were shipped over to the Fars to stay the night. Mummy spent the afternoon in bed, whilst Daddy watched a really good film, The Fastest Indian In The World. Here is Farfar's report of our stay.<\/p><p>We had no problems when the three kids came to stay the night on Saturday. They were very good, if demanding, as you might expect. Jette took the load alone from 4.00pm until I arrived from football two and a half hours later. All went well although they did get to bed later than planned; the older two at around a quarter to nine. We had watched Strictly Come Dancing on BBC which prompted them to participate themselves.<\/p><p>With Jette’s help, Katie had a change of costume for every dance. They went upstairs between each dance where she donned one of Jette’s petticoats or skirts which, with the aid of a bulldog clip, was changed into flowing full length dresses. Ben kept to his Spiderman outfit but joined in the dancing, even if it was somewhat frantic with the emphasis being on clenched fists and whirling arms.<\/p><p>We had to award points after each dance. They tended to receive 9 or 10 for each effort. Strange that!<\/p><p>The up side of them going to bed late was that they slept through the night without incident and carried on until about twenty to eight in the morning, so we all had a restful night. The parents arrived at 9.30am for disposal.<\/p><p>In the evening Mummy and Daddy went over to the West's for a scrummy dinner.<\/p>","images":false},"title":{"value":"Overnight Stay At The Fars"},"version":1},{"date":{"d":27,"m":9,"y":2009},"datev":20090927,"images":3,"info":{"content":"<p>We headed off with the Fars to the Steam Fair over in Woking. Farfar particularly was looking forward to it as it reminded him of his youth, 150 years ago!<\/p><p>The Helter Skelter was a firm favourite, although Katie enjoyed the 'chairoplanes' the most who she shared a go with Mummy. Ben enjoyed co-driving in the bumper cars with Farfar, especially when he bashed up Daddy and Farmor's car.<\/p><p>Jessica was very focused on her rides. You never know if she is enjoying it or not. We had a lovely 3 hours there in the delightful sunshine, and old time organ music.<\/p><img src='images\/years\/2009\/2009_09_27-07-SteamFunFair.jpg' class='diaryImage' alt='Jessica looking cool in her car' \/><p class='diaryImageCaption'>Jessica looking cool in her car<\/p><img src='images\/years\/2009\/2009_09_27-34-SteamFunFair.jpg' class='diaryImage' alt='Chairoplanes' \/><p class='diaryImageCaption'>Chairoplanes<\/p><img src='images\/years\/2009\/2009_09_27-42-SteamFunFair.jpg' class='diaryImage' alt='Traditional merry go round and helter skelter' \/><p class='diaryImageCaption'>Traditional merry go round and helter skelter<\/p>","images":false},"title":{"value":"Carters Steam Fun Fair"},"version":1},{"date":{"d":26,"m":9,"y":2009},"datev":20090926,"images":2,"info":{"content":"<p>We went with the Weston's and Elder's, plus Uncle Peter, over to Chessington World Of Adventures. We had a great day, the weather being real nice. Katie's favourite ride was the fast boat ride, Ben's was the scarey Pirate Boat, where we all sat at the back, which Katie certainly did not enjoy, and Jessica loved looking around the animals, showing particular affinity to the 'rars' or lions.<\/p><p>Ma Ma and Pop Pop queued for 70 minutes on the Vampire ride, only for Katie to lose her bottle at the last minute! Mummy was certainly in charge, deciding what we all should do, and when we should do it! Lucky our children have aryan characteristics and have signed up to her youth movement! Lily was a sweetie all day, Uncle Peter enjoyed a snooze on the monorail. I think all the adults were envious of him at that point in time. The big battle of the day, was not amongst the children, instead it was the donkey derby challange. Pop Pop versus Auntie Ellie.... and Pop Pop came on top, although I am sure there should have been a stewards enquiry after a bit of skulduggery from the Pop Pop camp. A good day had by all.<\/p><img src='images\/years\/2009\/2009_09_26-28-ChessingtonWorldAdv.jpg' class='diaryImage' alt='Elders on the boat ride' \/><p class='diaryImageCaption'>Elders on the boat ride<\/p><img src='images\/years\/2009\/2009_09_26-32-ChessingtonWorldAdv.jpg' class='diaryImage' alt='Uncle Peter and Jessica chillin'' \/><p class='diaryImageCaption'>Uncle Peter and Jessica chillin'<\/p>","images":false},"title":{"value":"Chessington World Of Adventures"},"version":1},{"date":{"d":20,"m":9,"y":2009},"datev":20090920,"images":1,"info":{"content":"<p>We awoke in Istead Rise, and trundelled down to Deal for Adam's christening. We met up with the rest of the Gay's. It was also Auntie Susan's birthday, so gave her birthday present, which was some table mats, coasters and a bath bomb! Exciting.<\/p><p>It was good to catch up with the Dixon clan. The church service was nice and relaxed, and we had some nice nosh at event afterwards. Ben and Katie got a huge cuddle from Yasmin.<\/p><img src='images\/years\/2009\/2009_09_20-02-AdamChristening.jpg' class='diaryImage' alt='Christening Lineup' \/><p class='diaryImageCaption'>Christening Lineup<\/p>","images":false},"title":{"value":"Adam Rashid's Christening"},"version":1},{"date":{"d":19,"m":9,"y":2009},"datev":20090919,"info":{"content":"<p>We went over to Greenwich today. After having a picnic at the top of the hill in Blackheath, we ventured down to the swing park. Ben was loving going down on his scooter. We had over-dressed for the day. It was pretty hot. We walked further through the market and town, to the Cutty Sark site, which now is reduced to some tents and on to the tunnel. We couldn't do the first race as the lift was out of order. All the children loved running through the tunnel and making lots of noise. Because Daddy lost the race to the top on the north side he had to buy a round of ice lollies. After a short peruse of the Thames, we wandered back to the car some 2 miles away!<\/p><p>We stayed the night in Istead Rise, however Ma Ma and Pop Pop were away sailing.<\/p>","images":false},"title":{"value":"Greenwich"},"version":1},{"date":{"d":18,"m":9,"y":2009},"datev":20090918,"info":{"content":"<p>Katie and Ben have been back at school for just over a week now. Katie is in a much bigger class now with 30 or so pupils, half of which are from the year below. She has had good remarks about her reading, especially the fact that she has put more expression into it. We attribute this down to Mummy reading the naugtiest little girl series of books in a similar style.<\/p><p>Ben has had mixed reviews, sometimes he has been told off, but not for being naughty as such. He has really enjoyed himself. He bounded up to the headmistress all proud that he had been given some homework. I'm going to learn how to draw the 'curly ker'. However, looking at his efforts, they are going to be long homework sessions!<\/p><p>Ben also has been having problems wetting himself. At P.E. he said that he didn't know that he was allowed to go to the toilet. On Wednesday, again he came proudly, bounding out of school and announced to all the mum's that he had actually put his willy in the toilet properly (rather than leaving it to its natural position which has soaked his trousers). A bit embarrassing for Mummy.<\/p><p>Next week, Katie and Ben will be in the same school photograph.<\/p>","images":false},"title":{"value":"School Daze"},"version":1},{"date":{"d":13,"m":9,"y":2009},"datev":20090913,"images":3,"info":{"content":"<p>We all went down for a 9:30 start at Littlehampton for the second attempt at the 10km. There was a large field, and we had all pretty much improved from last year. Daddy was happy with his 51mins. Ellie and Rachel came in next at 54mins, Jon in 55mins, Rich in 1hr 5mins and Charlottte started very well, but faded slightly towards the end.<\/p><img src='images\/years\/2009\/2009_09_13-06-Littlehampton10Km.jpg' class='diaryImage' alt='The joggers' \/><p class='diaryImageCaption'>The joggers<\/p><p>We raced back home, quickly had a bath and some lunch then headed straight out towards the eagerly awaited sprayground. It was the family celebration of Jessica's second birthday. Although it was overcast and a little windy, there was no question that the troops were going to get wet in the sprayground. They absolutely loved it.<\/p><p>We had a picnic, played football, cricket and bowls, fed the ducks and went into the playground. It was nice to have the family all together.<\/p><img src='images\/years\/2009\/2009_09_13-08-StainesLammasPark.jpg' class='diaryImage' alt='Sprayground action' \/><p class='diaryImageCaption'>Sprayground action<\/p><img src='images\/years\/2009\/2009_09_13-47-StainesLammasPark.jpg' class='diaryImage' alt='Sprayground action' \/><p class='diaryImageCaption'>Sprayground action<\/p>","images":false},"title":{"value":"Littlehampton 10km - Family Picnic Jessicas Birthday"},"version":1},{"date":{"d":12,"m":9,"y":2009},"datev":20090912,"images":1,"info":{"content":"<p>We went over to Farnham to play in the garden in the town centre then went over to the park. It was a lovely day.<\/p><img src='images\/years\/2009\/2009_09_12-12-FarnhamGarden.jpg' class='diaryImage' alt='The Guys' \/><p class='diaryImageCaption'>The Guys<\/p><p>In the afternoon we all invented a new game over the pond involving a football. Mummy kicked the football into the pond! Fortunately we did manage to retrieved it.<\/p>","images":false},"title":{"value":"Farnham Garden and Park"},"version":1},{"date":{"d":11,"m":9,"y":2009},"datev":20090911,"images":1,"info":{"content":"<p>Jessica's birthday started in mummy and daddy's bedroom at 6:30am. We opened them and Jessica was very pleased with her tea set and pushchair.<\/p><img src='images\/years\/2009\/2009_09_11-06-Jessica2ndBirthday.jpg' class='diaryImage' alt='Jessica's 2nd Birthday Party' \/><p class='diaryImageCaption'>Jessica's 2nd Birthday Party<\/p><p>Later in the day Jessica had a few friends over for a birthday party. This included: Natasha, Evie, Lily, Joey and Thomas.<\/p>","images":false},"title":{"value":"Jessica's 2nd Birthday"},"version":1},{"date":{"d":9,"m":9,"y":2009},"datev":20090909,"first":{"name":"benjamin","value":"First day at school"},"images":1,"info":{"content":"<p>Ben was very excited at starting school. He was shaking with anticipation. He couldn't wait to get a reading book, couldn't wait for PE, couldn't wait to get his smart uniform on, and walk in with his various bags and be part of the school run with his big sister.<\/p><img src='images\/years\/2009\/2009_09_09-08-BenFirstDayAtSchool.jpg' class='diaryImage' alt='Ben's First Day At School' \/><p class='diaryImageCaption'>Ben's First Day At School<\/p><p>When Ben returned from school, he had enjoyed it. Jokingly mummy asked whether he had got into trouble, not expecting the answer of 'yes' being returned! He had run in the classroom. However, he did receive a star sticker from the headmistress for being attentive and quiet during lunchtime. It was hard to find out what he had actually had done, but we think it was pretty relaxed and alot of play.<\/p>","images":false},"title":{"value":"Ben's first day at school"},"version":1},{"date":{"d":6,"m":9,"y":2009},"datev":20090906,"images":1,"info":{"content":"<p>It was a mammouth effort for Daddy and Farfar who attempted to build a bin shed. Mummy remarked it was like watching Frank Spencer and his dad! Still we found a use for our new bins...<\/p><img src='images\/years\/2009\/2009_09_06-01-Dustbin.jpg' class='diaryImage' alt='Bin action' \/><p class='diaryImageCaption'>Bin action<\/p><p>Later in the afternoon we went to Henry's belated 6th birthday party at the Camberley Gym club. We then popped over to Uncle Peter's.<\/p>","images":false},"title":{"value":"Henry's Birthday Party, Bin Sheds"},"version":1},{"date":{"d":5,"m":9,"y":2009},"datev":20090905,"images":1,"info":{"content":"<p>We walked over to the RLC Museum where there was an open day with a theme of ammunition and weapons. Katie had a go on the mine field and had her picture taken for the newspaper..... She's becoming a bit of a star. Daddy had a go on the 'wheelbarrow', which soon disapeared on a live call.<\/p><img src='images\/years\/2009\/2009_09_05-01-RLCMuseum.jpg' class='diaryImage' alt='I've got a wheelbarrow' \/><p class='diaryImageCaption'>I've got a wheelbarrow<\/p>","images":false},"title":{"value":"RLC Ammunition Day"},"version":1},{"date":{"d":31,"m":8,"y":2009},"datev":20090831,"info":{"content":"<p>In the morning we went swimming over at Wokingham. Katie loved going on the flume, and Ben gutted he couldn't go on it.<\/p><p>We went straight over to watch Chris compete in the Moto Cross over in Fleet. Unfortunately he wasn't feeling too well. Still we saw him in half a race.<\/p>","images":false},"title":{"value":"Swimming and Moto Cross"},"version":1},{"date":{"d":30,"m":8,"y":2009},"datev":20090830,"images":2,"info":{"content":"<p>Mummy took Katie and Ben to church, whilst Daddy and Jessica embarked on the final half of the Paddington Arm of the Grand Union canal. We picked up where we had left off at Greenford and headed into central London.<\/p><p>7.5 miles and we reached Little Venice, a trendy place in the west end. We stopped for a rest. A lady let Jessica stroke her dog, although Jessica was just curious and didn't dare touch. On our journey we could hear the Notting Hill carnival, so decided to have a look.<\/p><img src='images\/years\/2009\/2009_08_30-01-GrandUnionCanalPaddingtonArm-NottingHillCarnival.jpg' class='diaryImage' alt='Jessica At Little Venice' \/><p class='diaryImageCaption'>Jessica At Little Venice<\/p><img src='images\/years\/2009\/2009_08_30-05-GrandUnionCanalPaddingtonArm-NottingHillCarnival.jpg' class='diaryImage' alt='Jessica At Little Venice' \/><p class='diaryImageCaption'>Jessica At Little Venice<\/p><p>Not to sure what Jessica thought of it. A very loud, party atmosphere, with a lot of Carribbean people dancing and jigging along the street. Jessica was just taking it all in. Not showing much emotion. There were alot of people, alot of smells and alot of noise. Anyway Daddy was glad to show Jessica another experience.<\/p><p>Jessica was very jovial on the way home, playing with Daddy as we rode back to the car.<\/p><p>In the afternoon, Charlotte and Chris came over and played lego and had a cuppa which was very nice.<\/p>","images":false},"title":{"value":"Greenford - Little Venice Canal Ride - Notting Hill Carnival - Charlie and Chris Over"},"version":1},{"date":{"d":29,"m":8,"y":2009},"datev":20090829,"first":{"name":"jessica","value":"First night in proper bed"},"images":2,"info":{"content":"<p>We headed for Aldwick Beach, just outside Bognor Regis. The occassion, Rachel's 31st Birthday. We saw little Evie as well which was a delight. Sad to hear she is suffering from a little colic currently.<\/p><p>We had a picnic and birthday cake. We also had a go in the kayak. Rachel pulled us around at first, then Daddy. Daddy had a great time going on the choppy seas with Jon. Fantastic skimming through the top of the waves, getting sprayed in the progress. Definately something Daddy wants to do again.<\/p><img src='images\/years\/2009\/2009_08_29-20-AldwickBeach.jpg' class='diaryImage' alt='Kayaking Action' \/><p class='diaryImageCaption'>Kayaking Action<\/p><img src='images\/years\/2009\/2009_08_29-33-AldwickBeach.jpg' class='diaryImage' alt='The Girls' \/><p class='diaryImageCaption'>The Girls<\/p><p>Jessica slept in her new bedroom which Daddy had painted and re-arranged last week. New yellow walls, and Daddy's old bed. She slept well.<\/p>","images":false},"title":{"value":"Aldwick Beach - Rachel's 31st Birthday"},"version":1},{"date":{"d":28,"m":8,"y":2009},"datev":20090828,"info":{"content":"<p>We packed up which took two hours to get the tents down. We then stopped for a picnic at Herne bay again and a play on the beach. We eventually got home at 20:30 all plaesed to see Daddy!<\/p>","images":false},"title":{"value":"Girls Camping Holiday - Herne Bay"},"version":1},{"date":{"d":27,"m":8,"y":2009},"datev":20090827,"images":1,"info":{"content":"<p>Beautiful weather today. Went down for our lollypop and a go on the swings. We then went to Broadstairs. Broadstairs is a lovely beach. We were all in and out of the sea. We wathched punch and Judy (Jessica hated it). The children had a go on the swingboats and helterskelter. We attempted another Merry go round withh Jessie and this time she loved it. Although she was naked and as it went round Mummy thought shes doing a poo and when she picked her up at the end sure enough on the carriage was a poo. Mummy had no tissues and because the ride operator seemed quite scary Mummy had no choice but to pick the poo up and bury it in the sand!<\/p><p>In the evening we went for a meal in the pub.During the meal the parasol flew over the fence into the neighbours garden, we all laughed because it was so funny, but the next minute the neighbour came round and complained because it had hit him, I don't think he or the landlord believed us when wev said it was the wind.<\/p><img src='images\/years\/2009\/2009_08_27-68-HerneBayCamping.jpg' class='diaryImage' alt='Katie Swimming' \/><p class='diaryImageCaption'>Katie Swimming<\/p>","images":false},"title":{"value":"Girls Camping Holiday - Broadstairs"},"version":1},{"date":{"d":26,"m":8,"y":2009},"datev":20090826,"images":1,"info":{"content":"<p>We walked down to the shop for our lollypop again this morning and then we found a swing park and stayed there a while playing chase and in the trees. It wasn't really beach weather so we decided to go to Wildwood, a little animal park with wolves, foxes, badgers, horses, wild boar etc. <\/p><p>Once again the childrens best bit was the adventure playground. Jessica loved the tube slide. Katie managed to spot a tiny frog in a pond of alge which she was very proud of. Joey, Ben and Lily had trouble seeing it so Mummy thought she would throw a little stone next to it to make it move, after a few attempts and it still not moving she got a bigger stone threw it and it landed on top the poor frog. It disappered beneath the water then and everyone accused mummy of killing it, Joey thought it very funny.<\/p><p>We got back to the campsite and had a waterfight using the waterbombs we bought at the joke shop yesterday. Katie was happy all the time she was getting others wet but didn't like getting wet herself! Ben got Mummy soaked. Later Auntie Helen came down and because she has an open top car Katie was able to put the joke poo on the seat, we also offered her the fake biscuit. Katie loves her jokes. We had a nice BBQ. Auntie Helen showed us how to put toasted marshmellows in chocolate biscuits, lovely. She also bought lots of sweets for the children.<\/p><img src='images\/years\/2009\/2009_08_26-36-HerneBayCamping.jpg' class='diaryImage' alt='Joey and Katie enjoying the landscape' \/><p class='diaryImageCaption'>Joey and Katie enjoying the landscape<\/p>","images":false},"title":{"value":"Girls Camping Holiday - Wildwood Animal Park"},"version":1},{"date":{"d":25,"m":8,"y":2009},"datev":20090825,"images":1,"info":{"content":"<p>We were staying at St.Nicholas At Wade which is a tiny village with one little shop. We decided to walk down to it and get a few groceries because it was too early for the beach. The kids had a lollypop.<\/p><p>We then went to Westbrook bay, Margate, where Mummy and Auntie Ellie used to go alot when they were little. It wasn't a very nice weather and all the children were tired and not up for doing much. We attempted crabing but noone was very enthusiastic. We had a little sandcastle competion and a picnic. It then started pouring down and we had to pack everything up and take shelter.  It only lasted a few minutes and Mummy really wanted to do the short walk to Margate to see what that was like now. Margate was very run down, lots of derelict buildings and dreamland was completely shut. However the old joke shop we used to love was open and Katie delighted in buying some joke sweets, a fake biscuit and a dog poo, intending to trick Pop Pop. In the dreamland carpark was a travelling fair and Katie, Ben And Joey were allowed two gos on rides. They chose to go on the funhouse twice. They loved it. Mummy took Lily on a really fast twister ride which she seemed to enjoy. Jessie went on a Merry-goround, but she screamed and the ride had to be stopped. We had an icecream on Margate Beach and then went back to the campsite. In the evening Pop Pop came over and we had fish and chips. Once the children were asleep Ma Ma and Mummy beat Pop Pop and Auntie Ellie at cards.<\/p><img src='images\/years\/2009\/2009_08_25-18-HerneBayCamping.jpg' class='diaryImage' alt='Camping Breakfast' \/><p class='diaryImageCaption'>Camping Breakfast<\/p>","images":false},"title":{"value":"Girls Camping Holiday - Westbrook Beach"},"version":1},{"date":{"d":24,"m":8,"y":2009},"datev":20090824,"info":{"content":"<p>Katie, Ben and Jess wanted to be woken in the night to start our camping holiday as they thought that would be exciting, so we woke at 5:00 and set off for Ma Ma and Pop Pops soon after. We had eaten our big bag of sweets before even hitting the M25!<\/p><p>After meeting Ma Ma and the Elders, we set off for Herne Bay. It was lovely and warm and we found a nice spot on the beach. We had some lunch and Mummy took us in the sea. It was very scary as it went very deep as soon as you stepped in. Joey, Katie and Ben were swimming deeper than Mummy could stand! Jessica was a pickle not interested in the beach, only climbing the steps and trying to run along the promenade.<\/p><p>We then went to our campsite. Auntie Ellie was a complete pro putting up both tents in no time. We made it all cosy and then had a BBQ. The Marsh mellows would not toast. Jessica took a long time to sleep but evetually they all went off. Mummy needed the toilet 5 times in the night.<\/p>","images":false},"title":{"value":"Girls Camping Holiday - Herne Bay"},"version":1},{"date":{"d":23,"m":8,"y":2009},"datev":20090823,"images":1,"info":{"content":"<p>We split in the morning. Katie, Ben and Mummy walked to church, whilst Daddy and Jessica continued with the waterway cycle rides. This time we started at Staines and headed westwards. It was a gorgeous morning, and we admired the nice boats and luxurious houses. We made it all the way to Old Windsor Lock. Daddy turned around to see that, as usual, Jessica was asleep! Alright for some.<\/p><img src='images\/years\/2009\/2009_08_23_03-ThamesRide.jpg' class='diaryImage' alt='Staines To Old Windsor Thames Ride' \/><p class='diaryImageCaption'>Staines To Old Windsor Thames Ride<\/p><p>After Sunday roast we went to church for the 'Teddy Bears' service and then picnic which was very nice.<\/p><p>\u000a        Later in the afternoon we popped over to the Fars where Joan and Gert had just arrived for a weeks holiday. They gave us some packs of Lego and dominos. It was nice to see them.\u000a        <a href=\"http:\/\/www.youtube.com\/watch?v=2eyGBWwFTzE\">\u000a          Here\u000a        <\/a>\u000a        is a clip of Gert, touting for the Danish entry for the European Song Contest in 1978.\u000a      <\/p>","images":false},"title":{"value":"Thames Bike Ride, Teddy Bear's Picnic, Joan and Gert"},"version":1},{"date":{"d":22,"m":8,"y":2009},"datev":20090822,"info":{"content":"<p>In the morning we went to Haleemah's Birthday party at Byfleet village hall. It was nice to be invited as we've not known her for very long. We didn't know anyone else either. The kiddies had a nice time on the bouncey castle.<\/p><p>We then went over to Brooklands and went on their playground. It was quite cool as there were mini race tracks and luckily we had brought some bits and pieces to race on.<\/p><p>\u000a        We then went over to Alwyns Lane to see the mighty Chertsey Town and to give Farfar's Presents. Here are some\u000a        <a href=\"http:\/\/www.youtube.com\/watch?v=5klNzeTDOOM\">\u000a          highlights\u000a        <\/a>\u000a        from the game. Farfar got a Only Fools, Plonker T-Shirt and a bottle of bear. It is the first time all five of us watched a match.\u000a      <\/p>","images":false},"title":{"value":"Haleemah's Birthday, Farfar's Birthday, Chertsey Football"},"version":1},{"date":{"d":15,"m":8,"y":2009},"datev":20090815,"images":1,"info":{"content":"<p>Home day. Boo Hoo. The weather wasn't great. We awoke to rain... and an open sun roof in the car! We had one last dip in the swimming pool... and the joke of pushing Daddy in the cold pool wasn't wearing thin for the kiddies. I'm not sure we are getting value for money at £80 a term on the swimming lessons - Katie struggled to do three strokes!<\/p><p>The traffic wasn't great on the way home. We stopped off another National Trust house, Montacute. We had our picnic in the car park! There was a wedding in the house which made a picture.<\/p><p>Daddy explored the house with it's paintings, whilst the rest of us went to play on the swings. A great holiday, nice of the five of us to spend time together and have some fun.<\/p><img src='images\/years\/2009\/2009_08_15-11-MontacuteHouse.jpg' class='diaryImage' alt='Montacute House' \/><p class='diaryImageCaption'>Montacute House<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Montacute House"},"version":1},{"date":{"d":14,"m":8,"y":2009},"datev":20090814,"images":2,"info":{"content":"<p>Another swim in the morning, this time Katie pushing Daddy into the cold outdoor pool. We travelled south to the coast and Burgh Island. Well it wasn't an Island currently as it wasn't high tide. We picniced on the spit of sand before embarking on the walk across to the Island, with it's iconic, art deco hotel. Jessica done ever so well and moutaineered to the top of the Island where there was a deriliced old stone house, and views back to the various beaches and cliffs along the shore.<\/p><p>We returned back to the sand and paddled and made a big canal, which included some sand castles, a big hill and even a tunnel which Daddy was proud of. We all enjoyed the day only marred by the parking ticket we got. We arrived just as the officer was ticketing us!<\/p><img src='images\/years\/2009\/2009_08_14-31-BurghIsland.jpg' class='diaryImage' alt='Katie model shot in front of Burgh Island Hotel' \/><p class='diaryImageCaption'>Katie model shot in front of Burgh Island Hotel<\/p><p>Homeward bound back to the caravan, said goodbye to our friends Harry and Jessica, then went back to Dawlish Warren for Fish and Chips overlooking the beach.<\/p><p>In the evening Daddy beat Mummy on the week long, Top Trumps challenge. Ben has learnt to walk more on this holiday and not be carried by Mummy whilst Jessica has let mummy feed her without a big fight.<\/p><img src='images\/years\/2009\/2009_08_14-66a-BurghIsland.jpg' class='diaryImage' alt='Last Day Family Shot At Dawlish Warren' \/><p class='diaryImageCaption'>Last Day Family Shot At Dawlish Warren<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Burgh Island"},"version":1},{"date":{"d":13,"m":8,"y":2009},"datev":20090813,"images":1,"info":{"content":"<p>We headed south to Paignton Zoo and once we arrived realized we'd forgotten the picnic! At the entrance were the flamingo's, which Katie and Ben couldn't say. Jessica on the other hand was more interested in the ducks who were sharing the pond.<\/p><p>Early on we saw a lion prowl around it's enclosure, we found it hard to see the tigers, but the best bit was seeing the Orguntangs who were on their own island in the trees. They were stripping bark and sucking the sap out of them. One of them fell out of their tree!<\/p><p>We also saw the Gorillas which were fascintaing. One came surprisingly up to the edge of the cage where we were, which gave Jessica quite a fright. Daddy went off to buy a picnic with Jessica, then we had a go on the train around the zoo.<\/p><img src='images\/years\/2009\/2009_08_13-04-PaigntonZoo.jpg' class='diaryImage' alt='Katie and Paignton Zoo Train' \/><p class='diaryImageCaption'>Katie and Paignton Zoo Train<\/p><p>In the afternoon we went to the new crocodile swamp which was one of Katie's favourites. We saw a zebra, giraffes, a rhino and Jessie's favoutite elephants. Then came the best bit of the day for all three.... the soft play! Disappointing eh?<\/p><p>We made it back for a quick last swim and a trip down to the 'clubhouse' where there were some organised games for us.<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Paignton Zoo"},"version":1},{"date":{"d":12,"m":8,"y":2009},"datev":20090812,"images":2,"info":{"content":"<p>We swum in the morning. Katie and Ben were quite content going in the cold outdoor pool. Mummy started on the Secret Seven book on the way to another National Trust site, Killerton, just north of Exeter.<\/p><p>There was good weather and we struck lucky as there was a princess trail around the gardens. This of course excited us and Mummy the most. In our element. We found all the clues and rested on the verge. All three of us then played rolly-polly down the hill with great hillaritory.<\/p><img src='images\/years\/2009\/2009_08_12-39-Killerton.jpg' class='diaryImage' alt='Katie in front of the countryside' \/><p class='diaryImageCaption'>Katie in front of the countryside<\/p><img src='images\/years\/2009\/2009_08_12-40-Killerton.jpg' class='diaryImage' alt='Daddy and Ben enjoying a rest' \/><p class='diaryImageCaption'>Daddy and Ben enjoying a rest<\/p><p>Katie and Ben had there faces painted before swings and home time. We had a nice BBQ which seemed to atract a load of kids, especially when Mummy offered toasted marshmellows all around.<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Killerton"},"version":1},{"date":{"d":11,"m":8,"y":2009},"datev":20090811,"info":{"content":"<p>After numerous games of Top Trumps, a la Star Wars version, Ben 10 version and High School Musical we then went swimming. Katie and Ben had made friends with the two children in the next caravan, who happened to be in the swimming pool as well. Ben pushed Daddy into the cold, outdoor swimming pool. Everyone around the pool found it highly amusing.<\/p><p>Jessica wasn't so keen at the pool, so Mummy took Jessica back and prepared a picnic. The three of us then played for ages with the snorkle, goggles and flip-flops (flippers).<\/p><p>We headed off in the car and top just south of Teignmouth on a scenic spot overlooking the sea, which included 10 oil tankers moored off the coast.<\/p><p>Kent Caves in Torquay was next stop. These historic caves boasted some finds from hundreds of thousands of years ago. Before the tour we took the Woodland Trail, and completed the activity sheet which involved finding wooden animals in the trees and bushes. Katie was especially good at this. We then took the tour and all three weren't sure with the light and sound show at the start. All a bit scared. However, as we continued around we all got better, except Katie who really was clinging onto Mummy. At one point the guide switched all the lights out which was a bit scarey. It truly was pitch black.<\/p><p>After we scaled down on the cliff tram down to the Oddicombe beach which was close by. Ben spent Uncle Steven's birthday money on a rubber ring which was duely used straight away out on the sea. Katie and Ben loved playing out there as Daddy towed them up and down the beach.<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Kent Caverns, Oddicombe Beach"},"version":1},{"date":{"d":10,"m":8,"y":2009},"datev":20090810,"images":1,"info":{"content":"<p>The weather wasn't great today. After some crazy golf we headed into Dartmoor, the scenic route that only Daddy knows. Well we were in the clouds, it was very misty. So much so, we couldn't see any scenery. Whenever we passed sheep and goats in the road, Jessica went mad. She was so excited. Mummy read Enid Blyton's, Naughtiest Girl book, which gripped us all, even Daddy. 'Read another chapter'. It passed the time right to Lydford Gorge.<\/p><p>We whipped out the National Trust cards and entry was ours. We embarked on the 3 mile journey. Jessica on Daddy's back, and a mix of Katie and Ben on Mummy's. The canopy of tree cover, made up for the lack of raincoats. We had visited 4 years previous with just a single child. Now with three it's a bid harder treking around as there were some quite dangerous bits, remember we have the clumsiesed boy in the world, Ben. He was tripping all over the place. Doh. Katie calls Ben a 'Bongo', which is her derogitary term. Daddy took Jessica to Devil's Cauldron. Jess was having more fun putting her cold hands down Daddy's back! It felt as if we were in a Brazilian rainforest, with trees high, high above us, lots of mist and pretty humid.<\/p><img src='images\/years\/2009\/2009_08_10-11-CrazyGolfSwings.jpg' class='diaryImage' alt='Crazy Golfing' \/><p class='diaryImageCaption'>Crazy Golfing<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Lydford Gorge"},"version":1},{"date":{"d":9,"m":8,"y":2009},"datev":20090809,"images":1,"info":{"content":"<p>The weather was good waking up after a good nights sleep in our new home for a week. We mozied on down to the camp swimming pool. The outdoor one was freezing, and Ben pushed mummy in! What a tinker.<\/p><p>In the afternoon we set ourselves on the beach just around the corner on Dawlish Warren. We got the big black tyre and set Katie and Ben out on to the seas. Daddy meanwhile was having a whale of a time building dams by the rocks with Jessica. An ice cream later, we carried on all afternoon. Dawlish Warren was buzzing and very popular.<\/p><img src='images\/years\/2009\/2009_08_09-03-HolidayPark.jpg' class='diaryImage' alt='Ben in swimming gear' \/><p class='diaryImageCaption'>Ben in swimming gear<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Beach"},"version":1},{"date":{"d":8,"m":8,"y":2009},"datev":20090808,"images":1,"info":{"content":"<p>We set off a little earlier than expected and started off with the 'spotting game'. Spot something on our list and we all get a sweet. We decided to pop into Charlotte's in Salisbury only to find she wasn't in! Oh well it gave Daddy a chance to drive on some roads he hasn't done before. Sad!<\/p><p>There was quite a lot of traffic... Bloomin' holiday makers! Just after Dorchester we turned off into a country lane and picniced in some corn field in the sun.<\/p><p>We continued westwards and stopped at the popular Lyme Regis. A lovely place. It was a little strange half stone, half sand. We covered Katie in sand, then we went off to paddle in the water and look on the rocks for crabs.<\/p><p>We had a long walk back to the car, and then continued on to our holiday camp in Dawlish Warren. The kids were really excited with our static. It is so good to see. Running in and out of the rooms, around outside, exploring the swiming pool and adventure playgroud. We had a latish night. Jessica slept in her own bed.<\/p><img src='images\/years\/2009\/2009_08_08-23-LymeRegis.jpg' class='diaryImage' alt='Climbing up at Lyme Regis' \/><p class='diaryImageCaption'>Climbing up at Lyme Regis<\/p>","images":false},"title":{"value":"Dawlish Warren Holiday - Lyme Regis"},"version":1},{"date":{"d":5,"m":8,"y":2009},"datev":20090805,"images":2,"info":{"content":"<p>We had the Elders and Ma Ma over to help open the presents in Mummy and Daddy's room. Presents most interested in were anything Star Wars related of course. He got a Obi Wan ship and some Clone Wars figures. He also got Marble Madness from Mummy and Daddy. Another good'un was an Indiana Jones hat and whipp, with sound effects of course.<\/p><p>We camped infront of the TV at 8am waiting to see if Ben's card will make it on to CBeebies..... and as tradition follows, Andy read out the card to us all!<\/p><img src='images\/years\/2009\/2009_08_05-09-BenBirthday.jpg' class='diaryImage' alt='Ben's Card On Tele' \/><p class='diaryImageCaption'>Ben's Card On Tele<\/p><p>We hired the playschool hall out, and Ben was on adrenalin overload.... playing rough and tumble on the far too small bouncey castle. Thomas I think was the main buddy he was rough and tumbling with. Ben got a Man Utd. kit from Auntie Charlotte and Chris.... that's a Man Utd kit before any other kit English kit let it be known!<\/p><p>There were toys to play with from home, some party food and of course some games. There seemed to be more girls attending than boys! Daddy popped in his lunch break, and popped off again once the two hour session was up. Nice to see so many friendly, helpfull faces.<\/p><img src='images\/years\/2009\/2009_08_05-16-BenBirthday.jpg' class='diaryImage' alt='Party on dude' \/><p class='diaryImageCaption'>Party on dude<\/p><p>We had some more visitors over the afternoon including the Uncle Richard S, the West clan, and the Tremear's. However, Ben had overcooked it, and was slumped on the sofa asleep by 6:10!<\/p><p>In the evening Mummy went to find the results out from her CT scan. Thank goodness the results were good. As the doc said. We can now draw a line under this issue and move on. Ma ma and Pop Pop were waiting anxiously, as well as so many friends. Thanks to all the well-wishers.<\/p><p>Pop Pop took Ma Ma home after her week's stay. Ma Ma was such a help and it would have been hard to get through without her. Big thanks to Ma Ma. At least she got her own bed for the first time in weeks!<\/p>","images":false},"title":{"value":"Benjamin's 4th Birthday"},"version":1},{"date":{"d":4,"m":8,"y":2009},"datev":20090804,"info":{"content":"<p>In the afternoon we had a picnic down at Frimley Lodge Park with some of the family.<\/p><p>Katie, Ben, Mummy, Ma Ma, Ellie and Lily went to watch Beauty and the Beast at Woking theatre. Ben was pretty scared to begin with, then perked up. Didn't get to bed until gone 11pm!!!<\/p>","images":false},"title":{"value":"Beauty And The Beast - Woking"},"version":1},{"date":{"d":3,"m":8,"y":2009},"datev":20090803,"info":{"content":"<p>Went on our annual trip to Hayling Island to go scarecrow hunting. We found about 50 out of 170.<\/p>","images":false},"title":{"value":"Scarecrow Hunt"},"version":1},{"date":{"d":2,"m":8,"y":2009},"datev":20090802,"images":2,"info":{"content":"<p>David, Lisa, Yasmin and Reuben came over for a BBQ lunch. It was really nice. Katie got on very well with Yasmin. Reuben is almost the size of Jessica! A big old boy. We went to experience the feeding frenzy at the fish pond! Ma Ma was here and helping out heaps. Grandad even popped over as well for a bit! A real pot-pourri of family. Fantastico.<\/p><img src='images\/years\/2009\/2009_08_02-08-DixonsBBQ.jpg' class='diaryImage' alt='Yasmin Dixon' \/><p class='diaryImageCaption'>Yasmin Dixon<\/p><p>In the early evening we went over to see the Sanders and their new addition to their family. Evie was so sweet. Only two days old. Both Katie and Ben had a hold..... as well of course mummy and daddy.<\/p><img src='images\/years\/2009\/2009_08_02-03-EvieSanders.jpg' class='diaryImage' alt='Evie Sanders' \/><p class='diaryImageCaption'>Evie Sanders<\/p>","images":false},"title":{"value":"Dixons Over For BBQ, Visit Baby Evie Sanders"},"version":1},{"date":{"d":1,"m":8,"y":2009},"datev":20090801,"images":3,"info":{"content":"<p>Ma Ma has come over to stay for a few days which is really nice. So we all headed off towards Esher and the National Trust's, Claremont Park.<\/p><p>We didn't have a great start with Katie being stung by a wasp... However, we completed the treasure trail and won some colouring in packs. We even got Ben to walk some of the way around!<\/p><img src='images\/years\/2009\/2009_08_01-03-ClaremontPark.jpg' class='diaryImage' alt='The Claremont Krew' \/><p class='diaryImageCaption'>The Claremont Krew<\/p><img src='images\/years\/2009\/2009_08_01-35-ClaremontPark.jpg' class='diaryImage' alt='The Boyz' \/><p class='diaryImageCaption'>The Boyz<\/p><img src='images\/years\/2009\/2009_08_01-62-ClaremontPark.jpg' class='diaryImage' alt='Beaut' \/><p class='diaryImageCaption'>Beaut<\/p><p>Later in the afternoon Pop Pop, popped over.<\/p>","images":false},"title":{"value":"Claremont Park"},"version":1},{"date":{"d":31,"m":7,"y":2009},"datev":20090731,"info":{"content":"<p>A bit overdue, the wait is over and Evie was born at 7lbs 7oz. All are healthy. Congratulations to the Sanders family.<\/p>","images":false},"title":{"value":"Evie Sanders Born"},"version":1},{"date":{"d":26,"m":7,"y":2009},"datev":20090726,"images":1,"info":{"content":"<p>Today we went with the Elders over to see Charlotte's boyfriend, Chris and his brother compete in a Moto Cross event near Fleet. All the kiddies enjoyed themselves, not just for the motorbikes, but for the chance to build some camps.<\/p><p>Chris came second in three races and first in another. Alex also done really well. He was in the lead in the last race but ended up somehow in the river at the side of the track.<\/p><p>\u000a        See the <a href=\"images\/motoX\/postcardviewer\/index.html\">gallery of pics.<\/a><\/p><img src='images\/motoX\/2009_07_26-07-ChrisMotoX.jpg' class='diaryImage' alt='Chris powering through the dirt' \/><p class='diaryImageCaption'>Chris powering through the dirt<\/p><p>On our way home we popped into the Fars for a quick cup of tea, just before their trip up on the overnight train to Scotland.<\/p>","images":false},"title":{"value":"Motocross With Chris"},"version":1},{"date":{"d":25,"m":7,"y":2009},"datev":20090725,"info":{"content":"<p>In the morning we went to spend Katie's birthday money on books and two more High School Musical dolls in Camberley.<\/p><p>We went down Park Street where there was a family fun day. We released some balloons in a balloon race, and watched a Punch and Judy show....well Katie of course got too scared and moved on quickly.<\/p><p>In the afternoon we went to play on the swings for ages!<\/p>","images":false},"title":{"value":"Camberley Fun Day"},"version":1},{"date":{"d":24,"m":7,"y":2009},"datev":20090724,"images":1,"info":{"content":"<p>Our little girl, is no longer that little. She's now reached 6 today. Katie opened her presents in Mummy and Daddy's bed. She got plenty of lovely presents.... alot revolved around High School Musical. She got:<\/p><ul><li>High School Musiscal dolls<\/li><li>High School Musicial dressing up outfit<\/li><li>Book tokens<\/li><li>Pads, booklets, pens, etc.<\/li><li>High school musical watch<\/li><li>Beauty and the Beast theatre tickets<\/li><\/ul><p>We went down and switched the TV on to see if the card that Mummy made for her would make an appearance on CBeebies. There was some tension and almost an acceptance that it wouldn't be shown 4 years on the trot. However, it made it. We were all so excited to see the card and hear our names read out by Andy the presenter.<\/p><p>We organised a mini-party for some of Katie's friends. Leah S, Nina and Natasha from school came over to join the Elders for some party food. They all played well.... although what a mess that was made!<\/p><p>Later in the day the Fars popped across to drop their present off.<\/p><img src='images\/years\/2009\/2009_07_24-17-KatieBirthday.jpg' class='diaryImage' alt='Katie's birthday Cake' \/><p class='diaryImageCaption'>Katie's birthday Cake<\/p>","images":false},"title":{"value":"Katie's 6th Birthday"},"version":1},{"date":{"d":21,"m":7,"y":2009},"datev":20090721,"info":{"content":"<p>Ben and farfar had time out together on the Watercress steam railway. They set off just after twelve o’clock on the 48 bus to Brookwood where they caught an electric train to Alton. A short wait there was all that was needed before the steam engine Lord Nelson arrived and took them to Alresford. After filling up with sweets and drink, they took the diesel train back to Alton, sitting on the front seat behind the driver and seeing all the track and signal in front on their way. They also they saw Thomas and Gordon stuck in the sidings at Ropley.<\/p><p>It was then another electric train to Aldershot to catch the number 1 bus to Farnborough. There was only one minute spare there so they ran to the next bus, the 48, which took them back to Deepcut home again just before six o’clock. The drizzly weather did not spoil a happy day out travelling on all sorts of different vehicles; two electric, one steam and one diesel train, plus three buses,<\/p>","images":false},"title":{"value":"Eclectic modes of travel Ben and farfar 'training' together"},"version":1},{"date":{"d":19,"m":7,"y":2009},"datev":20090719,"images":3,"info":{"content":"<p>Katie and Mummy ran in the Southsea race for life today. It was a 5km (3 mile) run. Katie jogged the whole distance. We were all so proud of her. People in the crowd were cheering her on and the other runners were encouraging her. At the end we got a medal and a goody bag, it took us 40 minutes. Daddy, Ben and Jess were in the crowd but unfortunately we didn't see them.<\/p><p>Sorry no pics of the racers just of the spectators.... well under control.<\/p><img src='images\/years\/2009\/2009_07_19-05-RaceForLife.jpg' class='diaryImage' alt='Sisterly Love' \/><p class='diaryImageCaption'>Sisterly Love<\/p><img src='images\/years\/2009\/2009_07_19-09-RaceForLife.jpg' class='diaryImage' alt='The Body Slam' \/><p class='diaryImageCaption'>The Body Slam<\/p><img src='images\/years\/2009\/2009_07_19-12-RaceForLife.jpg' class='diaryImage' alt='Cutey-pants' \/><p class='diaryImageCaption'>Cutey-pants<\/p>","images":false},"title":{"value":"Race For Life"},"version":1},{"date":{"d":18,"m":7,"y":2009},"datev":20090718,"images":1,"info":{"content":"<p>A day of birthday parties, starting with Emma's 6th birthday. Katie and Ben were on fire. They were hyper and played so well together. Whilst Katie was playing in Jakes, the rest of us walked around Bagshot and ended up at a playground.<\/p><p>After lunch, we ventured over to the West mansion for Harrison's 2nd birthday. Harrison is really growing quick and seems streets ahead of Jessica in terms of speech.<\/p><p>Then came the main event. This year we decided to have a joint party with Natasha. 28 kids! Paula had done so much work to organise most of it. It was held at Tomlinscote School.<\/p><p>The first half an hour we had games which involved alot of running around. The second tranche involved the swing rope and bouncey castle, and the final part was the party food. All the kiddies had such a good time, although I think the whistles in the party bag was a step too far. Special mention to Teales and Weston's for coming over from Kent especially.<\/p><img src='images\/years\/2009\/2009_07_18-24-KatieBirthdayParty.jpg' class='diaryImage' alt='Katie and Natasha' \/><p class='diaryImageCaption'>Katie and Natasha<\/p><p>We returned home and began to open the loads of presents that we received. Favourites were the football and gardening tool set.<\/p>","images":false},"title":{"value":"Katie and Natasha's Birthday Party - Harrison's and Emma's Birthday"},"version":1},{"date":{"d":12,"m":7,"y":2009},"datev":20090712,"images":1,"info":{"content":"<p>We had a real busy day ahead of us. Daddy cycled down to the village and spent 3 hours dressing the playschool lorry, particularly proud of the bushy front!<\/p><p>Meanwhile the rest of us were on the Green setting up the tombola stall which also had a rubber duck pool and cakes for sale. Ma ma and Pop Pop where split between our stall and Uncle Peter's who was there selling Uncle John's royal china.<\/p><p>The Fars and Sanders came to watch procession. The theme for the playschool lorry was the Lion King, and for Cross Farm it was Noah's Ark. I think Katie and Ben enjoyed it.<\/p><img src='images\/years\/2009\/2009_07_12-00-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Frimley Green Carnival' \/><p class='diaryImageCaption'>Frimley Green Carnival<\/p><p>After the procession we swiftly went on to Lewis' birthday party at Jake's softplay.<\/p>","images":false},"title":{"value":"Frimley Green Carnival and Lewis' Birthday"},"version":1},{"date":{"d":10,"m":7,"y":2009},"datev":20090710,"images":1,"info":{"content":"<p>An early wake, and we all camped in Mummy and Daddy's bed. Ben opened Daddy's presents. He got an IPod Shuffle, a trip on Go Ape, some belts, socks, a t-shirt, and some favourite foods. Woo Hoo<\/p><img src='images\/years\/2009\/2009_07_10-00-MartinBirthday.jpg' class='diaryImage' alt='Celebrating 34 years of age' \/><p class='diaryImageCaption'>Celebrating 34 years of age<\/p>","images":false},"title":{"value":"Daddy's 34th Birthday"},"version":1},{"date":{"d":5,"m":7,"y":2009},"datev":20090705,"images":2,"info":{"content":"<p>Whilst Mummy, Katie and Ben walked to church, Daddy and Jessica decided to go for a bike ride off the Grand Union. The initial plan was to go to the picturesque Slough. However, we found the Paddington Arm first so headed east towards London. Within the first 200 yards we had to detour through the even more picturesque Southall!<\/p><p>The plan was to see how far we got after an hour then turn back. We reached Greenford. Jessica was very sweet banging the saddle as Daddy got off for a rest. On the return leg she fell asleep, as Daddy kept feeling her bobbing head hitting his back.<\/p><p>We rushed back, stopping on the M25 to refit the bike to the back of the car! Woops see the picture.<\/p><img src='images\/years\/2009\/2009_07_05-00-HayesToGreenfordCanal.jpg' class='diaryImage' alt='Canal Ride' \/><p class='diaryImageCaption'>Canal Ride<\/p><p>We met up with the Fars and Tremears in Richmond Close for a joint celebration of Daddy's 34th birthday and the Tremear's first wedding aniversary. Farmor went to so much effort to prepare a Danish style lunch, which included herring, breads, cheeses, meats, frekideller allsorts, including two puddings!<\/p><p>Uncle Graham was architecting a big cardboard house which included a chimney and Sky dish, whilst the rest of us had a go at painting it. Farfar had also devised a genius treasure hunt which took us up and down the street. Not sure who enjoyed it more, the children or Mummy! We had a real nice time. Thanks Farmor and Farfar.<\/p><img src='images\/years\/2009\/2009_07_05-08-DanishLunch.jpg' class='diaryImage' alt='Our new house' \/><p class='diaryImageCaption'>Our new house<\/p>","images":false},"title":{"value":"Hayes to Greenford Canal Ride - Danish Lunch"},"version":1},{"date":{"d":4,"m":7,"y":2009},"datev":20090704,"info":{"content":"<p>In the morning Daddy and Benny went off to do some errands around town which was nice to do some father - son bonding.<\/p><p>In the afternoon we went with the fars to a 'pick your own'... with Farfar and Jessica leaving evidence about their chops and tops that not all the fruit went into the punnets!<\/p><p>Jessica wasn't feeling too well. She had been sick over night and during the day, so Daddy stayed at home with the Fars and Jessica and treated Ben to a Stars Wars and chocolates night. Ben could not stop talking all the way to the film's end at 9:15. Wow, his invisible friend has quite a lot, including having the seventh episode of Star Wars. We love Ben.<\/p><p>Meanwhile, Mummy and Katie went to Karen's baby shower down in Alton. They had a great time, with Katie turning into Mummy at the party.<\/p>","images":false},"title":{"value":"Fruit Picking With The Fars, Karen's Baby Shower"},"version":1},{"date":{"d":28,"m":6,"y":2009},"datev":20090628,"images":1,"info":{"content":"<p>We picked Katie up from Rainbow camp. She really enjoyed herself and the leader had presented her with Olivia, the Rainbow doll. Awarded for being a really good girl and having lovely manners. Very proud parents!<\/p><p>Then on the way on home we saw the opposite behaviour. If only the Rainbow leader could see her then! If Katie is tired then we all know about it.<\/p><woops woopstitle=\"Faced with the Army at a shooting range, ready to shoot\" rating=\"8\"><p>Later I went for a bike ride up on Mytchett Ranges, where we had gone before for walks. Anyway about a couple of miles in and I coast down this hill which has a big mound at the bottom and to one side.<\/p><p>I cycle past and on the other side there are about 30 soldiers all crouched down with their guns ready to shoot at the target which is about 5 yeards to my right! Woops.<\/p><img src='images\/years\/2009\/2009_06_28-HenleyRanges.jpg' class='diaryImage' alt='I came down the path on the right' \/><p class='diaryImageCaption'>I came down the path on the right<\/p><p>There is just silence, and lots of intimidation. They just stare at me as I trundle past. Even 20 yards past, they say nothing, freeze their positions and just stare. Goodness knows what they must have thought. It dawned on me that they wouldn't be too happy. Anyway 50 yards further and I am out of sight, and a volley of gunfire rattles of into the targets!<\/p><p>Cycling back I noticed that the red danger flags were out.... which I kind of missed. Thinking about it, I now know why I didn't see anyone else on the ranges! Mmmm.<\/p><\/woops><p>Later in the day, Daddy borrowed a spare motorbike helmet, and took both Farmor then Farfar on a short ride..... Farfar was confident enough just to be in shorts!<\/p>","images":false},"title":{"value":"Daddy Faces Firing Squad and Takes The Fars On The Motorbike"},"version":1},{"date":{"d":27,"m":6,"y":2009},"datev":20090627,"first":{"name":"katie","value":"Away from family overnight"},"images":1,"info":{"content":"<p>It was a super hot day. In the morning we went over to the RLC show, which is Deepcut's best kept secret. A 'free' army show. The Fars came and joined us. We went on some army vehicles, the fairground's 'fun house', and roundabout rides. Ben and Daddy went on the ghost train, which Daddy felt was a bit X-rated. Ben wasn't sure when he went round, butafterwards was positive he was not scared and wanted to go again! Katie won the inflatable assault course race and climbed the highest on the climbing wall.<\/p><p>We unfortunately didn't have long, and straight after lunch we took Katie over the girl guides site near Tilford, where she was to stay the night with her 'Rainbows' pack. She was very excited and was involved in loads of activities. The theme was countries around the world. They done craft and cooking related to different countries. They made Russian dolls, American cookies, Italian pizza, etc. She didn't go to bed until 9:30pm!<\/p><p>The rest of us returned home to meet with the Elders. Mummy and Jessica went with them back over to the last of the Army show, whilst Daddy and Ben went to Jakes for Amy's birthday party.<\/p><p>Joey and Lily stayed whilst Michael took Ellie on the motorbike for the first time. Successfully! They were both very well behaved and we played games and even got Joey into Star Wars probably much to their parents disgust.<\/p><img src='images\/years\/2009\/2009_06_27-00-RLCShow.jpg' class='diaryImage' alt='RLC Fun' \/><p class='diaryImageCaption'>RLC Fun<\/p>","images":false},"title":{"value":"Army Show, Rainbows Camp, Amy Tyas Birthday, Elders Over to sleep"},"version":1},{"date":{"d":25,"m":6,"y":2009},"datev":20090625,"images":1,"info":{"content":"<p>We woke early and opened presents in Mummy and Daddy's bed. Mummy got a sports outfit for her keep fit, some nice socks, cuttlery, Mama Mia tickets and lots of smellies.<\/p><img src='images\/years\/2009\/2009_06_25-01-LauBirthday.jpg' class='diaryImage' alt='Present Opening' \/><p class='diaryImageCaption'>Present Opening<\/p>","images":false},"title":{"value":"Mummy's 33rd Birthday"},"version":1},{"date":{"d":24,"m":6,"y":2009},"datev":20090624,"info":{"content":"<p>Katie had her Sports Day today. Unfortunately she fell over in her race and came last. She wasn't too bothered.<\/p>","images":false},"title":{"value":"Katie Sports Day"},"version":1},{"date":{"d":21,"m":6,"y":2009},"datev":20090621,"info":{"content":"<p>We took an array of bikes, scooter and buggies to the Heatherside swings where we played for seemingly hours!<\/p>","images":false},"title":{"value":"A Long Walk"},"version":1},{"date":{"d":20,"m":6,"y":2009},"datev":20090620,"images":1,"info":{"content":"<p>Back over to the Weston's for a take on Ascot. We saw Charlotte's new boyfriend, Chris, for the first time. Daddy managed to win £65.<\/p><img src='images\/years\/2009\/2009_06_20-26-Iscot.jpg' class='diaryImage' alt='Iscot Birthday Cake' \/><p class='diaryImageCaption'>Iscot Birthday Cake<\/p>","images":false},"title":{"value":"Iscot"},"version":1},{"date":{"d":19,"m":6,"y":2009},"datev":20090619,"info":{"content":"<p>Daddy went into school with Katie as part of Father's Day. There were lots of fathers in compared with last year. Daddy planted some carrots with Katie as well as supervised a painting session. Katie was very pleased to see Daddy and seemed to be proud of him, which was very nice for Daddy.<\/p>","images":false},"title":{"value":"Daddy Into School With Katie"},"version":1},{"date":{"d":17,"m":6,"y":2009},"datev":20090617,"first":{"name":"katie","value":"Man Of The Match Award"},"info":{"content":"<p>Katie only being going to football for 3 or 4 weeks and she won the 'Man Of The Match' award. She took home a medal which she was very proud of. This week she didn't score a goal, but made a good all round contribution.<\/p>","images":false},"title":{"value":"Man or Lady of the match award"},"version":1},{"date":{"d":14,"m":6,"y":2009},"datev":20090614,"images":1,"info":{"content":"<p>Katie was representing her 'Rainbows' group during church parade, whilst Daddy and the two young'uns were terrorizing the Fars household. Making boats from the sofas was the order of the day.<\/p><p>We then all met up at St. Andrews for the parish lunch which we had to hurry as we had the next lunch engagement around the 'Strangles'. It was Phoebe's birthday.<\/p><img src='images\/years\/2009\/2009_06_14-01-PhoebeStroudBDay.jpg' class='diaryImage' alt='Would you like an ice cube down your back?' \/><p class='diaryImageCaption'>Would you like an ice cube down your back?<\/p>","images":false},"title":{"value":"Church Lunch, Fars, Parish Lunch, Phoebe's Birthday"},"version":1},{"date":{"d":13,"m":6,"y":2009},"datev":20090613,"info":{"content":"<p>We went swimming with the Weston's and Elder's. Ben went down the 'black hole' flume on his own for the first time. Jessica also went on their with Daddy!<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":7,"m":6,"y":2009},"datev":20090607,"images":3,"info":{"content":"<p>Daddy on a shipping vessel. Everyone is at risk. Ranging from throwing up, on more than one occassion, on a ferry, to almost knocking Uncle Michael on a yacht, or playing bumper boats and catching fishing lines in a small motor boat, going on a shipping vessel is never a relaxing time with Daddy. However, there was the five of us plus the fars in a small rowing boat for 3 hours.... That surely defines a relaxing Sunday afternoon, especially Ben's recent record of falling into a river!<\/p><p>We started with a picnic by the boathouse in Farncombe and then Farfar started rowing north in the Guildford direction. We weren't too sure on how it was going to go, but all of us were enjoying it. Benny wanted to have a go at rowing, but it was pretty difficult to get him involved as he wanted to do it all himself. On the way, we saw a few baby ducklings on the water's edge which was very cute. About an hour in and we came to our first lock. Very exciting as well never had to manage the lock gates before. All went without a hitch thank goodness.<\/p><img src='images\/years\/2009\/2009_06_07-14-RowBoat.jpg' class='diaryImage' alt='Blind leading the blind' \/><p class='diaryImageCaption'>Blind leading the blind<\/p><p>At the half way point at Shalford we disembarked and popped to the Parrot for some refreshments. Us children enjoyed playing with the ice cubes in the water and partiucularly enjoyed all the crisps.<\/p><img src='images\/years\/2009\/2009_06_07-22-RowBoat.jpg' class='diaryImage' alt='Refreshments for the sailors' \/><p class='diaryImageCaption'>Refreshments for the sailors<\/p><p>Daddy had a go at rowing next, and after pushing away from the banks on a few occassions we made steady progress, although Mummy prefers Farfar doing it as he was faster! Back to the lock again, and this time Katie, Ben and Daddy stayed in the boat whilst in the lock. I think this was there favourite bit. Oh and just before hand, at the crucial moment, Ben needed the toilet. There was no option but to go over the side! Honestly, you can't take the Gay's anywhere!<\/p><img src='images\/years\/2009\/2009_06_07-37-RowBoat.jpg' class='diaryImage' alt='Better out the boat than in!' \/><p class='diaryImageCaption'>Better out the boat than in!<\/p><p>After about 3.5 hours the children were getting a bit restless, so everyone except Daddy and Farfar got off and decided to hurl abuse and leafs at Daddy and Farfar who were rowing back to the boathouse. After four hours, we eventually made it back. At £12 an hour it wasn't the cheapest afternoon, but the children really enjoyed themselves and it was good to give them a different experience. Thanks Farfar and Farmor.<\/p>","images":false},"title":{"value":"Rowing Up The Wey Navigation"},"version":1},{"date":{"d":6,"m":6,"y":2009},"datev":20090606,"images":2,"info":{"content":"<p>We arrived at Drayton Manor, or as we know it, Thomas Land and met with the Burrows'. Daddy was assuring everyone that the rain would clear and it'll all be OK. Next time he should not raise expectations! Strangely enough the wet weather was a blessing, as the queues were short allowing us to have plenty of go's on rides.<\/p><p>First up was Thomas Land. The particular hit was the Troublesome Trucks rollercoaster, and the Cranky Crane vertical drop ride, which Kelly dipped out of, citing fartherly baby sitting duties as an excuse, and Mrs Burrows coming off a little bit worried! All the children loved it. There were rides in Thomas Land even for the little'uns, Jessica and Natasha.<\/p><img src='images\/years\/2009\/2009_06_07-13-DraytonManor.jpg' class='diaryImage' alt='Cranky Cranes' \/><p class='diaryImageCaption'>Cranky Cranes<\/p><p>Rosie gave us a ride to the picnic area, where we actually snuck into the cafe to eat. It was pouring with rain outside. Daddy was sporting a ripped, yellow poncho which was the most useless thing ever. It was later binned.<\/p><p>Hungry for some more action, we took the cable car over the park which Thomas really enjoyed, especially looking out for Ben and Katie in the car infront. Daddy and Fiona managed to have a quick go on G-Force, a really fast rollercoaster. We were very impressed as they went upside down!<\/p><p>We moved to the big wheel, and the shooting gallery, where we are all slighlty concerned at Kelly's handy use with a firearm. The Burrow's thrashed the Gay team's score by 12 to 1!<\/p><p>The ride, which went down a lead baloon was the pirate boat ride. Kind of a ghost train on water. Mummy assurred everyone that it was not scarey at all. Anyway after the 10th skeleton popping out on us, the children were not very amused, and I think managed to get most of them crying!<\/p><p>Katie's favourite was the Buffalo rollercoaster, or as Thomas called it a, 'roaster coaster'. We squeezed a final, second go on the bumper cars at the end of the day, which was Ben's best ride.<\/p><p>We returned home via the chip shop rather tired, but had a lovely day.<\/p><img src='images\/years\/2009\/2009_06_07-20-DraytonManor.jpg' class='diaryImage' alt='Bootifull girls' \/><p class='diaryImageCaption'>Bootifull girls<\/p>","images":false},"title":{"value":"Drayton Manor with Thomas and Natasha"},"version":1},{"date":{"d":31,"m":5,"y":2009},"datev":20090531,"images":1,"info":{"content":"<p>After church we headed over to Swanley park where it was absolutely packed. Ben was proud of his new pants that Ma Ma had got him. He really is a clothes concious dude. So proud of his new stuff.<\/p><p>We then hot trotted it over to Terminal 5 at Heathrow to meet Farmor and Auntie Susan who have been in Copenhagen. There was a noisey lot of Indian's who were chanting tribal tunes which was rather nice. There was also some sweet kids who held out a 'Welcome Home Daddy' poster..... only to find 10 minutes later the Daddy was Gary Gale! Spooky. Tapped him on the shoulder and said hello.<\/p><p>Susan and Farmor followed shortly afterwards. We said our hello and goodbyes, then made a mad rush through the fountains of water which was fun.<\/p><img src='images\/years\/2009\/2009_05_31-05-HeathrowAirport.jpg' class='diaryImage' alt='It's Terminal For The Five' \/><p class='diaryImageCaption'>It's Terminal For The Five<\/p>","images":false},"title":{"value":"Swanley Park and Terminal 5"},"version":1},{"date":{"d":30,"m":5,"y":2009},"datev":20090530,"images":2,"info":{"content":"<p>We spent this weekend down at Ma Ma and Pop Pop's. The weather was glorious. We headed further east towards Westgate, near Margate. A large sandy beach. We of course made sand castles and dug for victory. We attempted a bit of rock pooling but had no luck on finding anything.<\/p><p>Although hot, there was a chilly wind, but this did not deter Mummy, Katie and Ben who all went into the sea. Playboy Benny just lay naked in the shallow parts loving the lapping waves. Katie when quite far out on the inflatable dolphin. An ice cream later we decided to move on to Minis Bay. However, the playground was the only port of call. As Benny said, we're all beached out!<\/p><img src='images\/years\/2009\/2009_05_30-38-WestgateOnSea.jpg' class='diaryImage' alt='Sea monsters!' \/><p class='diaryImageCaption'>Sea monsters!<\/p><p>On our return we stopped off at Reculver Towers, a roman fort and castle, drove through Mount Ephraim Gardens and saw lots of hop fields. Picturesque village where we want to go to the pub = Hernhill. Lovely.<\/p><img src='images\/years\/2009\/2009_05_30-47-WestgateOnSea.jpg' class='diaryImage' alt='Reculver Towers' \/><p class='diaryImageCaption'>Reculver Towers<\/p>","images":false},"title":{"value":"Kent Seaside and Countryside"},"version":1},{"date":{"d":25,"m":5,"y":2009},"datev":20090525,"info":{"content":"<p>In the morning we went swimming at Farnborough. Jessica is pretty confident in the water for her age. She even jumps in off the side without worrying about going under water. Farfar came to watch and then took us out for a Hungry Horse meal!<\/p><p>In the afternoon the Wests came over to show off their tan after their recent return from Turkey.<\/p>","images":false},"title":{"value":"Wests and Swimming"},"version":1},{"date":{"d":24,"m":5,"y":2009},"datev":20090524,"images":2,"info":{"content":"<p>\u000a        In the afternoon we went over to <a href=\"http:\/\/en.wikipedia.org\/wiki\/Windsor_Great_Park\">Windsor Great Park<\/a>, and our objective was to reach the King George III Statue. Katie and Ben took their bikes and we took bats and balls and various games to play. It was a really nice day again, almost too hot!\u000a      <\/p><p>We climbed the rocks and some logs in the woods. We tried cricket, but after about 2 minutes the only players were Mummy and Daddy! We also played football and then Mummy and Daddy's childhood game, Polo.<\/p><img src='images\/years\/2009\/2009_05_24-10-WindsorGreatPark.jpg' class='diaryImage' alt='Trunk Shot' \/><p class='diaryImageCaption'>Trunk Shot<\/p><img src='images\/years\/2009\/2009_05_24-23-WindsorGreatPark.jpg' class='diaryImage' alt='Trunk Shot' \/><p class='diaryImageCaption'>Trunk Shot<\/p>","images":false},"title":{"value":"Windsor Great Park"},"version":1},{"date":{"d":23,"m":5,"y":2009},"datev":20090523,"images":3,"info":{"content":"<p>Another exciting trip to London to seek pastures new. We headed north towards Gospel Oak which had an entrance to Hampstead Heath. A huge park which had a fantastic playground. It was a really hot day, so the paddling pool was a welcome relief. Probably the bigest play area we've been to.<\/p><p>After our picnic we moved down to Kentish City Farm. I'm not sure what it is about these city farms we visit, there is something we like about them (....yeah probably because they are free!!!). Anyway, all the usual animals were there. Katie as usual, a cowardly custard, running scared of most of the animals, Jessica really enthusiastic and making some of the animal noises. Ben was just being Ben.<\/p><img src='images\/years\/2009\/2009_05_20-14-HampsteadHeath.jpg' class='diaryImage' alt='Ice Cream Licking Good' \/><p class='diaryImageCaption'>Ice Cream Licking Good<\/p><p>They had a riding ring, so Katie was fortunate enough to be led around two circuits which she enjoyed.<\/p><img src='images\/years\/2009\/2009_05_20-17-HampsteadHeath.jpg' class='diaryImage' alt='Horsey Horsey Don't You Stop' \/><p class='diaryImageCaption'>Horsey Horsey Don't You Stop<\/p><p>We returned to the playground again, due to popular demand to have another run around. Game of the day, was 'Monsters'. We caught a double decker and sat at the top and at the front back to a busy Oxford Circus. We hadn't seen so many people in one place before. We had a really nice day out and everyone was well behaved, even Daddy! It was heart warming to see Katie and Ben skipping along hand in hand through out the day.<\/p><img src='images\/years\/2009\/2009_05_20-25-HampsteadHeath.jpg' class='diaryImage' alt='Jessmunta' \/><p class='diaryImageCaption'>Jessmunta<\/p>","images":false},"title":{"value":"Hampstead Heath and Kentish City Farm"},"version":1},{"date":{"d":18,"m":5,"y":2009},"datev":20090518,"info":{"content":"<p>Katie and Mummy went to church whilst Daddy tried to take Ben and Jessica to swimming. Tried, but failed. Arena not open, Farnborough too busy. We ended up in B and Q instead!<\/p><p>In the afternoon we went around to the Fars where we packed alot in. We played trains, cars and made camps out of the Fars sofas and blankets.<\/p>","images":false},"title":{"value":"Over To The Fars"},"version":1},{"date":{"d":16,"m":5,"y":2009},"datev":20090516,"images":1,"info":{"content":"<p>Katie was again involved in her school's Maypole Fair. She performed with her class in front of alot of parents and grandparents and done very well. Daddy was in charge of the bouncey slide afterwards. I'm sure there was a health and safety risk with so many children on it at once! Anyway, Katie is very lucky to have 3 grandparents, 2 great grandparents and a great uncle there.<\/p><p>In the afternoon Ma Ma and Pop Pop popped around for a cup of tea, then we watched High School Musical 3 which down very well. Katie, especially hooked!<\/p><img src='images\/years\/2009\/2009_05_16-06-Maypole.jpg' class='diaryImage' alt='Katie Maypoling' \/><p class='diaryImageCaption'>Katie Maypoling<\/p>","images":false},"title":{"value":"Cross Farm Maypole Fair"},"version":1},{"date":{"d":11,"m":5,"y":2009},"datev":20090511,"info":{"content":"<p>Since November, Mummy has had nausia and appetite problems. With countless trips to the doctors and even a specialist, Mummy went in for a CAT scan to hopefully find the problem. We wait anxiously for the results.<\/p>","images":false},"title":{"value":"CAT Scan"},"version":1},{"date":{"d":10,"m":5,"y":2009},"datev":20090510,"info":{"content":"<p>Daddy, Ben and Jessica went to Lauren's 4th birthday party at Jakes, whilst Katie was representing the Rainbows in the church parade.<\/p><p>In the afternoon we delivered Christian Aid envelopes around Deepcut.<\/p>","images":false},"title":{"value":"Lauren Birthday, Church Parade and Christian Aid Envelopes"},"version":1},{"date":{"d":9,"m":5,"y":2009},"datev":20090509,"images":3,"info":{"content":"<p>We ventured over to Alton where Katie and Joey went rock climbing on the auto belay. Joey ascended like a monkey. Katie was a little more cautious but enjoyed it enough to have another go some time in the future. Unfortunately Ben was too young.<\/p><img src='images\/years\/2009\/2009_05_09-01-RockClimbing.jpg' class='diaryImage' alt='Joey and Katie Rock Climbing' \/><p class='diaryImageCaption'>Joey and Katie Rock Climbing<\/p><p>We popped back to the Elders for some lunch, before returning back to St Andrews' church fair. Great Grandad was running the trasure map stall. We quickly flittered away our budget on games which was enjoyed by all.<\/p><p>We then rushed home as Mummy and Daddy had to prepare for Phil and Anna's wedding. Ma Ma and Pop Pop came over to babysit us.<\/p><p>The wedding was really good and a lot of fun. The wedding ceremony itself happened on Thursday, but the main celebrations happened today at Audley Woods, Basingstoke. The congregation was 150 strong, and a chance for Mummy to be with Daddy's friends without the children.<\/p><p>So many nice touches, all that wine (which Daddy later regrets), the troll like people, the toys on the tables and the characterture artist.<\/p><img src='images\/years\/2009\/2009_05_09-00-PhilAnnaWedding.jpg' class='diaryImage' alt='Charactertures' \/><p class='diaryImageCaption'>Charactertures<\/p><p>Anyway needless to say a good time had by all. Daddy was worse for wear after leaving. He was sick out of the car as we sped down the M3 back home. However, not everything finished outside of the car. Having got home Daddy realized that his shirt was covered and needed to take it off before meeting the in-laws! What a state. Mummy was not happy and Daddy spent an hour and a half cleaning the car the morning after!<\/p><img src='images\/years\/2009\/2009_05_10-04-PhilAnnaWeddingMorningAfter.jpg' class='diaryImage' alt='Aftermarth' \/><p class='diaryImageCaption'>Aftermarth<\/p>","images":false},"title":{"value":"Rock Climbing, Church Fair and Phil and Anna's Wedding Celebration"},"version":1},{"date":{"d":8,"m":5,"y":2009},"datev":20090508,"images":2,"info":{"content":"<p>Phil having got married yesterday was funding a golf day at Mapledurham, which was on the other side of Reading. Seeing that all the other players were coming from hotels locally, I had a bit of a problem in terms of getting my golf clubs to the course. I ended up bungee straping them to the back of the bike<\/p><p>The journey made all the more hazardous by putting the clubs on the wrong side of the bike and of course it started raining! Anyway there was only just one incident, where a car almost hit my clubs on the A322!<\/p><img src='images\/years\/2009\/2009_05_08-03-PhilGolf.jpg' class='diaryImage' alt='Golfing motorbike styley' \/><p class='diaryImageCaption'>Golfing motorbike styley<\/p><p>We had a nice lunch and a survivors pack which included some food and whiskey! Then the golf began. Daddy was in the group of plebs! Steve and Nick. To spice up proceedings we hired a golf buggy which Steve had to learn pretty quickly. Especially when Daddy firmly planted his large feet on the accelerator.<\/p><img src='images\/years\/2009\/2009_05_08-05-PhilGolf.jpg' class='diaryImage' alt='Kingster made good use of his book' \/><p class='diaryImageCaption'>Kingster made good use of his book<\/p><p>The weather had improved and the golf was good, and the buggy was tested! Nick cheated a couple more times than Daddy, but a round of 122 was a pleasing score, especially as it was the first ever 18 holes played. Thanks to Phil for laying on a great day and golfing partners Nick and Steve.<\/p><p>In the evening we went over to Hardy's in Bagshot to celebrate both Michael and Charlotte's birthday. We had a nice Mexican meal and a few Corona's. The Elders stayed the night. All four of them in Mummy and Daddy's bed!<\/p>","images":false},"title":{"value":"Phil's Wedding Golf Day - Charlotte and Michael birthday meal"},"version":1},{"date":{"d":4,"m":5,"y":2009},"datev":20090504,"info":{"content":"<p>After the excesses over the last couple of days, we spent the bank holiday pottering around the house playing games and doing jobs.<\/p><p>In the afternoon we popped over to see Susan and Graham as we hadn't seen them for a while. Ben was trying to get the hang of the Star Wars game on the computer, whilst Jessica was teasing herself by seeing how close she could get to Bomber or Muriel before screeching!<\/p><p>We did our customary walk around the block, playing on the swings and attempting to feed the overfed ducks!<\/p>","images":false},"title":{"value":"Over To The Tremear's"},"version":1},{"date":{"d":3,"m":5,"y":2009},"datev":20090503,"images":3,"info":{"content":"<p>Today we went down to Deal to meet up with the whole Dixon clan. There were two new additions to the family since we last saw them. Reuben is now 7 months old and a big chap. He was such a good boy through out the day. Adam is just a couple of months old and so small and cute. Amazingly Mummy didn't walk away wanting more babbies. I think she has learnt her lesson and we've got more than enough.<\/p><p>All the crew were well and happy. Linda was retiring next week and plans to have some 'Linda' time which Daddy is very envious of. Daddy can't wait till retirement age! David and Lisa have recently move to a larger house so all good there.<\/p><img src='images\/years\/2009\/2009_05_03-07-Dixons.jpg' class='diaryImage' alt='Reuben in Alan's capable' \/><p class='diaryImageCaption'>Reuben in Alan's capable<\/p><img src='images\/years\/2009\/2009_05_03-10-Dixons.jpg' class='diaryImage' alt='Adam, Yasmin and Alan' \/><p class='diaryImageCaption'>Adam, Yasmin and Alan<\/p><p>It was nice to see Katie and Ben being mummy and daddy with their child, Yasmin. Katie was reading her a bedtime story. Ben couldn't distinguish between the name Yasmin and Jasmin (of the Disney princess fame).<\/p><p>We had a picnic in the backgarden and was on edge everytime a youngster went near the pond. It was good to see everyone and we departed with David, Lisa, Yasmin and Reuben for Joss Bay near Broadstairs.<\/p><p>Joss Bay was great. It had a sandy beach, the water was a little too cold to go swimming, however, we made the long trip to fetch water for our sand castles and holes which we were digging.<\/p><p>Next up was a trip down to the rocks where we all looked for crabs. We worringly don't know if some of them were dead before picking them out of the water. However, we did eventually find a live one, although it had some legs missing!<\/p><p>Jessica was wandering all over the place, invading peoples areas. She is a nosey parker. She also enjoyed putting her head literally in sand! Emerging with snot and sand stuck to her face. Urrghh.<\/p><p>We ended with a game of football. Lisa played well in goal, Ben regularly missing the 4 foot wide goal from about a yard out! He's obviously inherited Daddy's right foot!<\/p><p>Thanks to the Dixons for a lovely day.<\/p><img src='images\/years\/2009\/2009_05_03-17-Dixons.jpg' class='diaryImage' alt='Lisa and Jessica sharing a moment' \/><p class='diaryImageCaption'>Lisa and Jessica sharing a moment<\/p>","images":false},"title":{"value":"Meet Up With The Dixons"},"version":1},{"date":{"d":2,"m":5,"y":2009},"datev":20090502,"images":1,"info":{"content":"<p>This year Mummy has been working very hard preparing for the Surrey Heath Show as she was managing the Playschool stall. It was to sell cakes and a Teddy Tombola all of which were donated by the parents of the playschool.<\/p><p>Mummy went down early to setup the stall, then we all went down at midday and help out and to roam around going on some of the fairground rides, watching the main display area where there was some dancing and the general stuff at a show.<\/p><p>Jessica toddled up to a little merry-go-round all excited and tried to get on it as it was moving. We waited our turn, popped Jessica on, she loved it for about 3 revolutions and then burst out crying for some reason. The ride had to be stopped! Funny girl.<\/p><p>Farmor came along for a bit, as did most of the Elders minus Ellie. In the end we raised £128 and spread the good word of the playschool.<\/p><p>In the evening Mummy and Daddy went around to Auntie Karen and Richards for a BBQ. Main topic of conversation was how bad Daddy's packed lunches are.<\/p><img src='images\/years\/2009\/2009_05_02-25-SurreyHeathFair.jpg' class='diaryImage' alt='Our Stall' \/><p class='diaryImageCaption'>Our Stall<\/p>","images":false},"title":{"value":"Surrey Heath Show"},"version":1},{"date":{"d":30,"m":4,"y":2009},"datev":20090430,"info":{"content":"<p>Today at playschool, the teacher asked if anyone would like to stand up and sing a song. Adam first stood up and sang 'Baa Baa Black Sheep'.<\/p><p>Ben then stood up and sang from start to finish, Abba's Mama Mia. The playschool teachers were wetting themselves with laughter. I only wish it was videoed.<\/p><p>The other day Ben came into the kitchen crying. He said 'Look mummy I've got tear rolling down my cheeks'. Mummy concerned at first, then realized it was because he was so touched on the film 'Mama Mia' which he was watching!<\/p><p>Ben is very much into his music and clothes. In the morning the first thing he does is pretty much empty his drawers deciding what to wear. Quite often he'll wear a number of t-shirts and change his trousers just because he likes so many of them.<\/p><p>On the music front, Ben is the main dude deciding what radio station to have on. He loves 'Daddy and Benny' music. Quite often whilst driving, he'll peer over to Daddy, look intently, and then copies Daddies head bopping moves! So sweet. He loves Drums and Guitar. Good Boy!<\/p>","images":false},"title":{"value":"Ben And Abba"},"version":1},{"date":{"d":26,"m":4,"y":2009},"datev":20090426,"info":{"content":"<p>We decided against taking all the children to church after last week, so just Mummy, Jessie and Pop Pop went and she was as good as gold. We then went to Swanley park for a picnic. We got the miniture train over to the swings, had a paddle in the paddling pool, a play in the sandpit and an ice cream. Jessie and Katie loved the paddling pool, going in naked and the water was freezing, although the weather was very warm. When we got home, Katie cycled while Mummy jogged and we went 3.5 times round the block with Katie encouraging Mummy all the way she is so sweet.<\/p><p>It was Farmors birthday, so the Fars made a late, brief appearance. We sang happy birthday and gave her cards and presents. We also played Top Trumps with her!<\/p>","images":false},"title":{"value":"Swanley Park"},"version":1},{"date":{"d":25,"m":4,"y":2009},"datev":20090425,"info":{"content":"<p>In the morning we drove to Herne Bay to check out a campsite for the Summer holiday. It looks really nice. We were impressed by the swing park there. Then we drove to the seafront had a coffee, bought a picnic in the bakers and sat and ate it on the beach.  We threw stones in the sea. Jessie and Ben loved doing this. We then had a slightly stressful trip round Sainsbury's to do Ma ma and Pop Pop's shopping. Ma Ma bought Katie some new clothes though.<\/p><p>In the evening we drove to Chelmsford to meet Auntie Christine and Steve for tea at a pub. There weas a softplay attached and the kids had a great time in there while we waited for our food. By the time we left the children were exhausted so we thought we would get a lie in the next day but no 06:30 Ben this time.<\/p>","images":false},"title":{"value":"Herne Bay and Chelmsford"},"version":1},{"date":{"d":24,"m":4,"y":2009},"datev":20090424,"info":{"content":"<p>Back to Gravesend again. Mummy picked up Katie from school and we drove straight there. We all had bikes this time to cycle round the block. Mummy had trouble getting us all off to sleep, Jessie in particular, as we all slept in one room.<\/p>","images":false},"title":{"value":"Back to Gravesend"},"version":1},{"date":{"d":23,"m":4,"y":2009},"datev":20090423,"first":{"name":"benjamin","value":"Ben Football Training"},"images":1,"info":{"content":"<p>Ben went to Frimley Green rec for his first hour's football training session. He listened to the trainer intently, dressed in his favourite Denmark kit!<\/p><p>Down to business, skills up first. Dribbling, wasn't sure to laugh or cry as he fell over the ball. He didn't quite get the kicking the ball out of the hand. Down to the game, and he ran, not always in the right direction, but he did run. All in all he really enjoyed, it'll be really good to be involved in a team game and an excuse to run about.<\/p><p>Katie loved watching so much so, she now wants to sign up.<\/p><img src='images\/years\/2009\/2009_04_22-03-BenFirstFootballLesson.jpg' class='diaryImage' alt='Ben at Football Training' \/><p class='diaryImageCaption'>Ben at Football Training<\/p>","images":false},"title":{"value":"My boy plays football"},"version":1},{"date":{"d":22,"m":4,"y":2009},"datev":20090422,"info":{"content":"<p>Last Sunday, another early start 6:30. We went to church, the five were really noisy and disruptive. Pop Pop went and disowned us and sat at the other side of the church. We then drove to Godstone farm for a picnic. It was so sunny and the kids had a great time. We met with Felicity and Fraser. Katie and Felicity seem to really like each other. We saw some animals which Jessie loved, except the noisy cow, but most of the time was spent on all the adventure playgrounds. We had an ice cream and didn't leave until it shut as there was so much to do. I think we wore out Ma Ma and Pop Pop enough!<\/p>","images":false},"title":{"value":"Godstone Farm"},"version":1},{"date":{"d":21,"m":4,"y":2009},"datev":20090421,"info":{"content":"<p>Last Saturday, an early start 06:15, thanks to Jessie! Ma Ma's school was taking part in an Indain celebration called Vasarki which was a bit like a carnival, with lorries and a procession through Gravesend high street. Katie walked with Ma ma in it. Mummy, Ben, Jessie and Pop Pop watched. It was very colourful with lots of Bangra music which Mummy loves. Katie got given lots of crisps, drinks and sweets as it is the Indian celebration of Harvest.<\/p><p>After this we went to Eltham church to try and find some gravestones of relatives as Mummy is starting to look at the Weston family tree. We found three names. After briefly stopping at Bluewater we went back to Ma ma and Pop Pops for more rides round the block and tea and bath. Lily gave Jessie strict instuctions not to poo in the bath.<\/p>","images":false},"title":{"value":"Vasarki"},"version":1},{"date":{"d":20,"m":4,"y":2009},"datev":20090420,"info":{"content":"<p>Last Friday, we drove to Gravesend and after calling in to see Summer and Alice for lunch we went to Ma ma and Pop Pops. Joey and Lily were already there. We had tea and then staggered baths as 5 no longer fit, the older ones took it in turns to cycle Joey's bike round the block. Much to Lily's absolute disgust Jessie pooed in their bath and it had to be abandoned early!!<\/p>","images":false},"title":{"value":"The Teales"},"version":1},{"date":{"d":19,"m":4,"y":2009},"datev":20090419,"images":1,"info":{"content":"<p>\u000a        Today's\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;source=s_d&amp;saddr=Welshpool&amp;daddr=A483%2FNew+Rd+to:52.48738,-3.34671+to:Unknown+road+to:A40+to:A40+to:Unknown+road+to:Frimley&amp;geocode=%3BFWhLIQMdxnHN_w%3B%3BFRrMGwMdahXM_w%3BFcj1FgMdkgvR_w%3BFZ6OFgMdLJ7W_w%3BFSRkFQMdCAPX_w%3B&amp;hl=en&amp;mra=dpe&amp;mrcr=0&amp;mrsp=2&amp;sz=12&amp;via=1,2,3,4,5&amp;sll=52.471697,-3.175392&amp;sspn=0.205372,0.528717&amp;ie=UTF8&amp;ll=52.010246,-2.101135&amp;spn=1.660184,4.229736&amp;z=9\">\u000a          ROUTE\u000a        <\/a><\/p><p>\u000a        We awoke and watched a bit of the Chinese Grand Prix. We had a big breakfast on small plates. After getting Jon's bike started we began our way south and homeward bound. We still had some top roads to ride, which included the prize Newtown to Crossgates. Tarmac heaven with very little traffic. I managed to tag onto a Hells Angels group called the\u000a        <a href=\"http:\/\/www.patriotsmc.co.uk\/Club%20History.htm\">\u000a          Patriots\u000a        <\/a>\u000a        . They even had club, biker, leather jackets!\u000a      <\/p><p>We stopped in the sleepy Buith Wells for some more latte, before pushing on past Abergeveny, which hosted some VFR event, so Michael proudly told us, onto Monmouth where we stopped again for lunch. Another interesting town centre.<\/p><p>Then we had some fun down to Chepstow. A Wheelie from Howard, and a drag race won by Michael over Howard as well, which caused a stir. Howard staunchly defending his top dog status giving the excuse of missing 2nd gear! Michael wasn't having any of it.<\/p><img src='images\/years\/2009\/2009_04_19-05-Day3-WelshpoolToHome.jpg' class='diaryImage' alt='Tintern Abbey' \/><p class='diaryImageCaption'>Tintern Abbey<\/p><p>It was then a leisurely ride back home over the second Severn bridge. A really nice time had by all. Cheers chaps.<\/p>","images":false},"title":{"value":"Wales Motorbike Holiday - Welshpool to home"},"version":1},{"date":{"d":18,"m":4,"y":2009},"datev":20090418,"images":4,"info":{"content":"<p>\u000a        Today's\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;source=s_d&amp;saddr=Aberystwyth,+Dyfed,+UK&amp;daddr=B4343+to:A470%2FWest+St+to:A470+to:A470+to:A470+to:A487+to:A470+to:A4212%2FHeol+Ffrydan+to:A494+to:Unknown+road+to:52.718931,-3.690548+to:welshpool&amp;geocode=%3BFRQfHwMdXCDF_w%3BFY4KHgMdOm_K_w%3BFa0rHwMdGjnJ_w%3BFV1FIAMdbgnK_w%3BFZBQIQMdIrPL_w%3BFVigIgMddCvF_w%3BFf42JwMdzDPE_w%3BFVZhJwMdniXJ_w%3BFbSkJgMdLuvH_w%3BFaXqJQMdN8XI_w%3B%3B&amp;hl=en&amp;mra=dpe&amp;mrcr=0&amp;mrsp=11&amp;sz=13&amp;via=1,2,3,4,5,6,7,8,9,10,11&amp;sll=52.744814,-3.594589&amp;sspn=0.102047,0.264359&amp;ie=UTF8&amp;ll=52.615556,-3.701019&amp;spn=0.818804,2.114868&amp;z=10\">\u000a          ROUTE\u000a        <\/a><\/p><p>We awoke to sunshine. Yes. Where we really begin to enjoy our trip. I had to see the castle in 'Aber', so we circled this and the endless one way system and headed east out of town. We soon hit some scenery. What struck me was how lush the grass looked. Just fancied lying in one of the fields and do a spot of relaxing under the sun. However, Devil's Bridge was next stop.... and what a let down. Without paying the £3.50 we saw nothing. So we promptly took the scenic route to Rhayader which was just fantastic. The boys, who were more interested in the racing aspect of the journey, left me way behind as I poodled along enjoying the Elan valley. Fantastic.<\/p><p>We stopped for tea and after having a bit of trouble (as Frank Spencer would say) with Jon's bike we continued north. Now this is where not sticking together got us into a spot of bother. Basically we lost Howard, and I hate to think of the speeds attained in trying to find one another. Just as we were resigned on not seeing Howard for a long time we stopped off at a supermarket for supplies. Michael then happened to see Howard down the bottom of the road. He quickly sprinted onto his bike and chased him down!<\/p><img src='images\/years\/2009\/2009_04_18-16-Day2-AberystwythToWelshpool.jpg' class='diaryImage' alt='Wales wouldn't be Wales without the sheep' \/><p class='diaryImageCaption'>Wales wouldn't be Wales without the sheep<\/p><img src='images\/years\/2009\/2009_04_18-17-Day2-AberystwythToWelshpool.jpg' class='diaryImage' alt='Spooky trees' \/><p class='diaryImageCaption'>Spooky trees<\/p><p>We then had some really nice tarmac, weather and scenery on the journey to Machynlleth. Probably as a group voted as best 20 mile stretch on our tour. A pattern was begining to appear. Michael and Howard playing silly buggers up front. Myself and Jon trying to cling onto the road miles behind.<\/p><p>Machynlleth was lunchtime and the town much like every other. Really nice character buildings and atmosphere to boot. We moved on and continued north through Dolgellau and up to Trawsfynydd where Jon and I almost had a coming together on the bikes. Totally my fault. I was overtaking Michael, but hadn't mirrored or signalled.... just manouvred! Jon had the same idea. Anyway it's on YouTube if you want to see. Howard broke the land speed record again, much to the annoyance of an oncomming cyclist.<\/p><img src='images\/years\/2009\/2009_04_18-24-Day2-AberystwythToWelshpool.jpg' class='diaryImage' alt='Boys cruising to Dolgellau' \/><p class='diaryImageCaption'>Boys cruising to Dolgellau<\/p><p>We turned onto a side road and continued along past mountains and lakes. Very picturesque and the weather was still great. Low on petrol we limped into Bala and filled up, before hurrying again onto Welshpool.<\/p><img src='images\/years\/2009\/2009_04_18-34-Day2-AberystwythToWelshpool.jpg' class='diaryImage' alt='Enjoying the views at Capel Celyn' \/><p class='diaryImageCaption'>Enjoying the views at Capel Celyn<\/p><p>Howard dropped his bike in town!.. and then 5 minutes later, when the engine was no longer flooded, he almost dropped it once more! Doughnut. We stayed at an elderly man's B&amp;B next to a pub. We watch some of the FA Cup semi final in the pub before moving into town for an Indian.... The boys ribbed me with my scampi and chips! Typically Indian right? It was freezing cold, didn't stay in town long and returned home for a bit of poker.<\/p>","images":false},"title":{"value":"Wales Motorbike Holiday - Aberystwyth to Welshpool"},"version":1},{"date":{"d":17,"m":4,"y":2009},"datev":20090417,"images":2,"info":{"content":"<p>\u000a        Today's\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps?f=d&amp;source=s_d&amp;saddr=frimley&amp;daddr=B4267%2FRedlands+Rd+to:A470+to:A465+to:52.206344,-3.957138+to:Aberystwyth,+Dyfed,+United+Kingdom&amp;geocode=%3BFdzTEAMd7F3P_w%3BFbZbEwMdOC3N_w%3BFZhyFQMd7lHK_w%3B%3BFXjOHwMdqq_B_w&amp;hl=en&amp;mra=dpe&amp;mrcr=0&amp;mrsp=4&amp;sz=11&amp;via=1,2,3,4&amp;sll=52.232846,-4.084167&amp;sspn=0.41297,1.057434&amp;ie=UTF8&amp;ll=51.689585,-3.35083&amp;spn=3.344321,8.459473&amp;z=8\">\u000a          ROUTE\u000a        <\/a><\/p><p>Howard came over to mine and we set off to the rendezvous point on the M4 to meet up with Michael and Jon. The weather was awful, there was so much rain. Infact it pierced Howard's waterproof jacket which had his expensive phone in. The phone didn't survive. Still at least we got the expensive bit out of the way, to go on top of the GPS system and pillion seat (still not rectified) from previous trips! We soildered on, hit Wales then took refuge in the Elder mansion in Penarth, where we warmed up, dryed out and had some teas and food. Michael looked as if he were ready to stay, getting comfy in Mama Elder's slippers and endless cups of teas!<\/p><img src='images\/years\/2009\/2009_04_17-02-Day1-HomeToAberystwyth.jpg' class='diaryImage' alt='The biker boys' \/><p class='diaryImageCaption'>The biker boys<\/p><p>The weather cleared a bit so we headed north through the Brecon Beacons. The heavens opened once more so unfortunately not much sight seeing, however, it did mean more tea drinking! We made it through the muddy roads to Aberystwyth where the sun shone for the first time. After Howard's attempts at putting us up in a crack house for the night, we eventually found a nice guest house overlooking the seafront. 'Aber' as the locals call it, looked really good at night time, especially with the big cliff\/rock to the north of town, illuminated with a green light. It was spooky.<\/p><p>We spent th evening in a chippy then onto the pier to sink a couple of beers. Opened the window to our room and slept to the sound of the crashing waves! Very nice.<\/p><img src='images\/years\/2009\/2009_04_17-12-Day1-HomeToAberystwyth.jpg' class='diaryImage' alt='The strip at Aberystwyth' \/><p class='diaryImageCaption'>The strip at Aberystwyth<\/p>","images":false},"title":{"value":"Wales Motorbike Holiday - Home to Aberystwyth"},"version":1},{"date":{"d":13,"m":4,"y":2009},"datev":20090413,"images":3,"info":{"content":"<p>On this fine day we headed towards west London and a National Trust property as Osterley park. We had a nice picnic before completing our final Easter Trail of the holidays. This time we had to follow a map and answer questions. It was't a surprise when Mummy took us the wrong way when she was map reader!<\/p><img src='images\/years\/2009\/2009_04_13-05-OsterleyPark.jpg' class='diaryImage' alt='Osterley House' \/><p class='diaryImageCaption'>Osterley House<\/p><p>Our prize was .... an Easter egg each and a face paint!<\/p><p>We then went in the house, and were able to try some 18th century clothes on and do some interactive stuff. We played in the trees in the grounds before ventyring home for dinner.<\/p><img src='images\/years\/2009\/2009_04_13-35-OsterleyPark.jpg' class='diaryImage' alt='Osterley House' \/><p class='diaryImageCaption'>Osterley House<\/p><img src='images\/years\/2009\/2009_04_13-12-OsterleyPark.jpg' class='diaryImage' alt='Osterley House' \/><p class='diaryImageCaption'>Osterley House<\/p>","images":false},"title":{"value":"Osterley House"},"version":1},{"date":{"d":12,"m":4,"y":2009},"datev":20090412,"info":{"content":"<p>It was take 2, as Daddy 'One trick pony' did another BBQ pork, this time entertaining the Weston and Elder crews. Ma Ma relayed her recent trip to France with Uncle Peter which had us all in tears.<\/p><p>In the afternoon the Barnett family all met at Uncle Peter's for the family egg hunt. We somehow have ended up with 24 big eggs!<\/p>","images":false},"title":{"value":"Weston's, Elder's BBQ - Uncle Peters Easter Egg Hunt"},"version":1},{"date":{"d":11,"m":4,"y":2009},"datev":20090411,"info":{"content":"<p>We went over to Pangbourne to do the village Easter trail. We picked up our sheet and had to look for 30 posters each in different shop windows around the village, and then solve the anagram. It was fun trying to spot where the posters were. We found all 30 and received a chocolate bunny rabbit as a prize. We then went over to the swings by the river.<\/p><p>In the afternoon Daddy went to watch Chertsey play in an important match, whilst the rest of us did craft at home.<\/p>","images":false},"title":{"value":"Pangbourne Easter Trail"},"version":1},{"date":{"d":10,"m":4,"y":2009},"datev":20090410,"info":{"content":"<p>Daddy did a lovely BBQ'ed roast pork type affair with all the trimmings as we entertained the Fars for lunch.<\/p><p>Later in the afternoon we went to Windsor Leisure Pool. It was great fun going on the long slide. It was funny as Katie noticed that she could see Farfar's bottom!... and sheepishly mentioned it to Farmor. Farfar had a builders bottom going on!<\/p>","images":false},"title":{"value":"Good Friday - Fars BBQ, Swimming"},"version":1},{"date":{"d":6,"m":4,"y":2009},"datev":20090406,"images":1,"info":{"content":"<woops woopstitle=\"Mummy and Daddy just found out they're related\" rating=\"7\"><p>Daddy's Great, Great, Great, Great Grandfather's, Cousin's, Great, Great Grandson's, Wife's, Mother's cousin's, great granddaughter is Mummy! Ok admitidly not a close tie, but a tie nonetheless. It would seem the chain of 24 people were all based in Surrey pretty much. The West side based near Midhurst and the Gray's from Chobham.<\/p><p>\u000a        I wonder how many people have managed to actually trace such a distant connection to their spouse? Not many. Please check out the full family tree from\u000a        <a href=\"http:\/\/trees.ancestry.co.uk\/pt\/pedigree.aspx?tid=10182680&amp;pid=-682921136#pedigree=-682919505\">\u000a          Ancestry.com\u000a        <\/a>\u000a        or from my tree\u000a        <a href=\"\/familytree.htm\">\u000a          page\u000a        <\/a>\u000a        .\u000a      <\/p><p>This inbreeeding might explain why our children are like they are!!<\/p><img src='images\/years\/2009\/2009_04_06-MartinLauraRelatedTree.jpg' class='diaryImage' alt='A slice of family tree' \/><p class='diaryImageCaption'>A slice of family tree<\/p><\/woops>","images":false},"title":{"value":"We're Related. Mummy is a distant relative of Daddy! Inbreds."},"version":1},{"date":{"d":5,"m":4,"y":2009},"datev":20090405,"images":1,"info":{"content":"<p>A bright morning saw Daddy, Richard and Jon compete in the Frimley Park 10km. The girls wimped out with excuses ranging from being pregnant to wanting a lie in bed! Daddy had plenty of support all around the course. Mummy and us high fived Daddy and some of the other runners by the Esso garage. Rob May and Pauline Worrall were out there, along with the Fars on their bicycle. Karen and Rachel also cheered us on. There were a few hills on this course which might explain a slightly slower time than Littlehampton. Daddy's fitness coach, Barrie did encourage the beer Daddy had the day before! Also, Daddy ran last week and it took him 1hr 15mins, so knocking 20 mins off that was a good achievement.<\/p><p>We then scooted around to the Sanders for a lovelllly Sunday Roast. What a spread. We then went to the swings where Uncle Richard pushed Ben off the swing, and kicked the ball in Katie's face from about a yard away! Is this man fit to father a child? We had a great afternoon.<\/p><img src='images\/years\/2009\/2009_04_05-11-SandersLunch.jpg' class='diaryImage' alt='Katie enjoying the playground' \/><p class='diaryImageCaption'>Katie enjoying the playground<\/p>","images":false},"title":{"value":"Frimley Park 10km Run - Sanders Sunday Lunch"},"version":1},{"date":{"d":4,"m":4,"y":2009},"datev":20090404,"images":1,"info":{"content":"<p>Today the West gang came over for the afternoon. We had a sweepstake on the Grand National, which Harrison won!<\/p><img src='images\/years\/2009\/2009_04_04-12-WestsOver.jpg' class='diaryImage' alt='Harrison and Jessica Duck walk' \/><p class='diaryImageCaption'>Harrison and Jessica Duck walk<\/p>","images":false},"title":{"value":"Wests Over"},"version":1},{"date":{"d":31,"m":3,"y":2009},"datev":20090331,"info":{"content":"<p>Tonight Daddy and the Casuals team won the first trophy in a few years. A closely fought competition with all the teams evenly matched. Daddy was one of the youngest in the team at 33 years old!!! We beat the Rushmoor Pirates 1-0 in the final.<\/p>","images":false},"title":{"value":"5 a-side Cup Champions"},"version":1},{"date":{"d":29,"m":3,"y":2009},"datev":20090329,"info":{"content":"<p>Katie had a ballet exam in the morning. She said she had done alright, but we will not know. It is such a shame as Daddy has never seen Katie actually ballet yet. Parents are not allowed to watch as it is said to distract the chidren too much.<\/p><p>In the afternoon we went over to the swimming baths at Wokingham. Katie showed how good and confident she is swimming in the water. She could consistently swim 15 metres which is very impressive. She also loved going down the long slide on her own.<\/p>","images":false},"title":{"value":"Ballet Exam - Swimming"},"version":1},{"date":{"d":28,"m":3,"y":2009},"datev":20090328,"info":{"content":"<p>We went to Ham House for an Easter trail. We had such trouble finding it Katie said Mummy was the worst map reader ever although as Mummy pointed out Katie was the one in the front holding the map and therefore she was the map reader, Mummy just the driver. Ben suggested we get a lady in a box who tells you the way like Pop Pop has (Sat. Nav). Apparently she lives in there. We stopped at a bakers for lunch and eventually arrived and did the trail. There was photos of things around the house and garden and we had to find them. It was great fun. We found most things Katie ticking them off on her clipboard. We won some lettuce seeds which we will plant.<\/p><p>On the way home we found a smashing park which Ben described as the best one ever and we had great fun. Ma Ma, Pop Pop and Uncle Peter came and bought fish and Chips!<\/p>","images":false},"title":{"value":"Easter Hunt - Ham House, Weston's Over"},"version":1},{"date":{"d":27,"m":3,"y":2009},"datev":20090327,"images":1,"info":{"content":"<p>Ten years ago, Mummy and Daddy got engaged in New York! Wow that seems such a long time ago. Since then they have got married, bought two houses and had us three children.<\/p><p>Benny has been excited about Daddy coming into play at playschool. I'm not too sure if the teachers were thrilled, especially after he got the chikdren into such a frenzy the chief teacher had to ring the bell to calm all the children down. All he was doing was trying to play hide and seek. More and more children wanted to join in!<\/p><p>It was quite interesting to see what goes on. It was organised in structured sessions. There was sharing time, eating time and story and singing time. In between each of these was play time, and some group work. Ben doesn't mix in with the other children that much. If Oliver Strangle was there it might be a different story. Anyway Daddy noticed how fickle Ben is. Normally it is Mummy to serve all his needs, but with some additional playtime and attention from Daddy it all changes. Daddy felt good that Ben enjoyed the company.<\/p><img src='images\/years\/2009\/2009_03_27-06-MartinPlayschool.jpg' class='diaryImage' alt='Playschool buddies' \/><p class='diaryImageCaption'>Playschool buddies<\/p>","images":false},"title":{"value":"10 Year Engagement Anniversary, Daddy at Playschool"},"version":1},{"date":{"d":26,"m":3,"y":2009},"datev":20090326,"info":{"content":"<p>Mummy is trying to get a little fitter, so for the second week she attended the Urban Rebound. This week she dragged Daddy along as well.<\/p><woops woopstitle=\"Falling off trampoline\" rating=\"2\"><p>The Urban Rebound class included 25 or so others who all enjoyed bouncing up and down on a trampoline. For Daddy it was the first time..... and it showed. He concentrated so hard at keeping on the damm thing he didn't focus on the instructor who barked out the next moves.<\/p><p>Anyway Daddy fell off! The noise echoing around the sports hall and people looking around as they were still bouncing, with a look of disgust at him. All Daddy could do is laugh and get back on, this time with double concentration. He knows what it is like to have big feet!<\/p><\/woops>","images":false},"title":{"value":"Urban Rebound onto the floor!"},"version":1},{"date":{"d":21,"m":3,"y":2009},"datev":20090321,"images":2,"info":{"content":"<p>Today Ma Ma and Pop Pop took Katie and Ben for a special treat. Asked where they most liked to go, Drusilla's was the response even though we'd only gone there 4 weeks ago!! I think the lure of that amazing adventure playground was too much for them.<\/p><p>After dropping off the merchandise at the Star in Leatherhead, Mummy, Daddy and Jessica made their way to Brixton. Finally we found somewhere to park for free and we walked into the markets on Electric street. There were many butchers and fishmongers all run by the ethnics and even a couple of different people on their soap box which is good to see. Always makes me laugh because I never know if anyone actually listens to them. Any excuse to hear the West Indian accent though!<\/p><p>Our walk continued westwards past where our Great Granny (Doris Rosa) was born, 54 Sandmere Road. It was a nice house in a nice street, which is a bit of change to normal. We don't know whether she actaully lived there or not. It seems a bit out of the area. The family came from north of the river in the Marylebone area.<\/p><img src='images\/years\/2009\/2009_03_21-02-54SandmereRoadBrixton.jpg' class='diaryImage' alt='54 Sandmere Road, Brixton. Great Granny was born here' \/><p class='diaryImageCaption'>54 Sandmere Road, Brixton. Great Granny was born here<\/p><p>We caught the tube from Clapham North up to Moorgate. We disembarked and made our way past Liverpool Street Station, where there were lots of police and celery singing football supporters! So funny because there was a greengrocers next to them and he was fast running out of celery!! Celery, Celery, If She Dont Come...... that song.<\/p><p>We made it to the edge of Spitalfields market where we stopped for a flask of tea and for Jessica's lunch. It would appear that we were too late for the actual market, so we didn't explore in the regenerated building. Save that for another time. Instead we continued to Brick Lane. A place where none of us hadn't been before. It was full of Indian and Banglideshi restaurants mainly. Restaurant after restaurant. Now here highlights Daddy's lack of Indian knowledge. 'So what would you like?'.... 'Just a vegetable Balti' .... 'Just one vegetable please Gupta'. Low and behold that's what we got. Apparently it is implied that you get \/ order rice with that. Oh well, Mummy suggested it was like eating bolognese sause without the mince! Ah well.<\/p><img src='images\/years\/2009\/2009_03_21-11-BrixtonBrickLane.jpg' class='diaryImage' alt='Spitalfields Walk' \/><p class='diaryImageCaption'>Spitalfields Walk<\/p><p>We continued northwards right to the end of Brick Lane. It had a similar feel as Camden. A young persons area, as the Fars would say.<\/p><p>\u000a        Next stop was <a href=\"http:\/\/www.spitalfieldscityfarm.org\/\">Spitalfields City Farm<\/a>. Our speciality visting these city farms. We were greeted by a special needs chap who came sprinting up to open the gate for us! First stop was to see Farfar. aka Itchy The Pig. We saw him being fed. Couldn't see his eyes but Jessica certainly got a good view of his teeth. Urrgghh. His eating manners were akin some monkies that I know!\u000a      <\/p><p>Jessica absolutely loved the farm. As time was passing she was getting more confident with them. She stayed along time with the goats. Even tried to say 'Goats'. We went in the with the gineau pigs and chickens and even tried to stroke a rabbit, although her arm was forced by Daddy.<\/p><p>We finished up after a couple of hours with another flask of tea in the nearby park, before walking to where the Allard's used to live, near Old Street tube, back in the middle of the nineteenth century. This was a bit more like it. A nothing street with conncil flats! Mummy wants to see where her London based relatives used to live.<\/p><p>We returned back to the car and home after a lovely day out with our Jessica.<\/p>","images":false},"title":{"value":"Brixton, Brick Lane, Drusillas"},"version":1},{"date":{"d":20,"m":3,"y":2009},"datev":20090320,"info":{"content":"<p>Today Mummy was treated to two concerts. The first was at Ben's pre-school and he sang three lovely songs, one about a bath and bubbles and one about being good because its Mothers Day. He looked gorgeous and Mummy cried. The second in the afternoon at Cross Farm with Katie's lovely singing. Mummy got there early to baggsy a front row seat and Katie sat right in front of me. There was lots of singing and a poem called \"O.k Mummy dear\" which was very funny. After the children invited the Mummies for tea and cakes.<\/p>","images":false},"title":{"value":"Mothers Day Concerts"},"version":1},{"date":{"d":15,"m":3,"y":2009},"datev":20090315,"images":2,"info":{"content":"<p>Another lovely sunny day greeted great grandma and granddad's diamond wedding aniversary. Held at Mytchett bowls club there were 60 or so family and friends cramed in. It was nice to see the whole family there together.<\/p><p>Katie played really well with Felicity. So much so, Felicity burst out in tears when she left because she wanted to be with Katie! Of course Ben and Joey were being tinkers and Jessica enjoyed toddling around everywhere!<\/p><p>There was a nice buffet, which lots of people contributed towards, a really good cake and the main present was a 'This is your life' style family album full of photo's. Something to treasure and a keepsake for generations to come.<\/p><img src='images\/years\/2009\/2009_03_15-09-GrandDadMaDiamondWedding.jpg' class='diaryImage' alt='Ben and Joey' \/><p class='diaryImageCaption'>Ben and Joey<\/p><img src='images\/years\/2009\/2009_03_15-16-GrandDadMaDiamondWedding.jpg' class='diaryImage' alt='Great Grandma And Grandad' \/><p class='diaryImageCaption'>Great Grandma And Grandad<\/p>","images":false},"title":{"value":"Great Grandma and Granddad's Diamond Wedding Aniversary"},"version":1},{"date":{"d":14,"m":3,"y":2009},"datev":20090314,"images":2,"info":{"content":"<p>Ben is well into what clothes he wears. He has so many t-shirts he likes. He often cannot decide so wears all of them. During the week he had 7 t-shirts on!<\/p><p>\u000a        Today we picked out another walk from Uncle Steven's book. And today's lucky winner was a trip down to Winchester. We parked up and began to walk through the town passing the impressive\u000a        <a href=\"http:\/\/www.winchester-cathedral.org.uk\/history\/\">\u000a          cathedral\u000a        <\/a>\u000a        and posh collage.\u000a      <\/p><woops woopstitle=\"Ben falls into river\" rating=\"6\"><p>The Itchen awaited us. Ben and Katie loved walking along, playing around near the bank, pretending to fish. About a mile or so into the walk all of a sudden we hear a splash. Ben has stumbled in and is up to his neck in water. Luckily we were able to drag him out, but he was soaked and muddy from neck to toe! He was not a happy bunny. We had to strip him and mummy and daddy gave up some clothes to stop him from getting cold. He had to sit in Jessica's seat where there was the cosi-toes to keep his legs warm. He looked every so grumpy in the pushchair. Like an old granny.<\/p><\/woops><img src='images\/years\/2009\/2009_03_14-12-Winchester.jpg' class='diaryImage' alt='Winchester' \/><p class='diaryImageCaption'>Winchester<\/p><p>This ended our trek, we turned and returned to the car and home.<\/p><p>In the afternoon, the Wests were going to come around, however, Freya was sick. Instead Daddy and Jessica went for a nice bike ride in the woods at Pirbright. Although it is only 5 minutes down the road, a largely unexplored area. On our relatively short ride, we managed to see: a goods train, some good mountain bike runs, loads of troops and army trucks, some horses, cows, a buffalo (in joke) and even a dear. We also saw Guildford cathedral in the distance. A real nice ride.<\/p><p>In the evening Daddy went with the Gay's to the opening of the refurbished Chertsey Town F.C. clubhouse for a race night.<\/p><img src='images\/years\/2009\/2009_03_14-07-PirbrightHeath.jpg' class='diaryImage' alt='Pirbright Landscape' \/><p class='diaryImageCaption'>Pirbright Landscape<\/p>","images":false},"title":{"value":"Ben Falls Into The River Itchen"},"version":1},{"date":{"d":8,"m":3,"y":2009},"datev":20090308,"info":{"content":"<p>We walked to church today which was nice. Susan and Graham went with us to the fars for Sunday lunch roast. Lamb. Daddy's favourite. In the afternoon we went for a little walk around Tomlins pond in the trolley.<\/p>","images":false},"title":{"value":"Gay Sunday Lunch"},"version":1},{"date":{"d":7,"m":3,"y":2009},"datev":20090307,"images":1,"info":{"content":"<p>A sunny day welcomed us so we decided to go to London. We went to Turnham Green as usual and caught the tube to Bank. Benny was entertaining the customers on the underground with his infectious cackle. Hard to put into words, but he was a jolly old soul.<\/p><p>We walked down from Bank to Monument which is one of our favourite old haunts. It has been shut for the past year for refurbishment. We lost count of the number steps we had to climb. Katie was the only one who reached the top unaided. Finally at the top we could see for miles. We received our certificates on the way out and headed for the river.<\/p><p>Jessica fell asleep, and Katie and Ben let us know in their style that they needed refuelling! So we stopped at a bench by the Millenium Bridge. We wished it still was 'wibbley wobbley'. Mummy had 'he-cups' (hicups) according to Ben!<\/p><p>\u000a        Ben was continuing to be on top, top form making passers by smile with his laugh and expressions. Ben and Katie were in their element. Whilst mummy and Jessica stopped for lunch, Katie, Ben and Daddy went on the beach and also played on some wooden toys at\u000a        <a href=\"http:\/\/www.coinstreet.org\/gabriels_wharf.aspx\">\u000a          Gabriel's Wharf\u000a        <\/a>\u000a        .\u000a      <\/p><p>We continued past the skateboarders under Festival Hall and onto the street performers by the London Eye. Katie was scared of the double jointed performers who managed to turn themselves inside out it would seem. We also saw Darth Vader. I think Ben was a bit star struck.... then Jessica didn't know what to make of the 'tin man' with extendable arms!<\/p><p>We of course couldn't end our tour without a go on the playground and a bus journey from Westminster back to Hamersmith, then tubed it back to the car. Katie and Ben really enjoyed themselves, they were a delight to be with today.<\/p><img src='images\/years\/2009\/2009_03_07-00-LondonMonumentSouthBank.jpg' class='diaryImage' alt='London Stroll' \/><p class='diaryImageCaption'>London Stroll<\/p><p>Later we watched a MC Hammer dance on TV. Ben tried to do some break dancing to it in his brown and pink dress! He ended crying as he squashed his nose attempting a special move!!<\/p>","images":false},"title":{"value":"Bank To South Bank"},"version":1},{"date":{"d":1,"m":3,"y":2009},"datev":20090301,"info":{"content":"<p>In the morning we went to Poppy and Nina's joint party. There was a magic man who was excellent called Magic Mikey. He kept us entertained for two hours!<\/p><p>We rushed on down to Gravesend for Alice's birthday.<\/p>","images":false},"title":{"value":"Magic Mikey and Alice's Birthday Party"},"version":1},{"date":{"d":28,"m":2,"y":2009},"datev":20090228,"info":{"content":"<p>We went for a walk around the estate and along the canal from Frimley Lodge Park to Mytchett Centre. The boys done some tree climbing and we played football at the end which was funny.<\/p>","images":false},"title":{"value":"Canal Walk"},"version":1},{"date":{"d":21,"m":2,"y":2009},"datev":20090221,"info":{"content":"<p>Whilst Ben and Mummy were at a playschool birthday party, Daddy and the girls went to watch Chertsey win at Alwyns Lane.<\/p>","images":false},"title":{"value":"Party - Chertsey Football"},"version":1},{"date":{"d":20,"m":2,"y":2009},"datev":20090220,"images":1,"info":{"content":"<p>Myself, Mum and Dad went up to London for two reasons. Mum wanted to go and see Portabello Road market which we did briefly. After a knockout Sausage And Mash under the A4, we headed on for leg two which was to look up some old Gay residence.<\/p><p>\u000a        After a slow painful bus, tube and walk we attempted to find\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps\/ms?ie=UTF8&amp;hl=en&amp;t=h&amp;msa=0&amp;ll=51.545214,-0.120485&amp;spn=0.010716,0.021887&amp;z=16&amp;msid=111027506527990496626.00046380e4a35769a792a\">\u000a          Nailor Street\u000a        <\/a>\u000a        where William Gay lived with his daughter's family, Susannah at the age of 70. This was a less than impressive venue being situated directly opposite Pentonville prison on the Caledonian Road. The house and road no longer existed. After talking to some local old dears, the houses were demolished because they didn't have bathrooms inside! The site now was an Islington council estate. The houses weren't particularly big or nice. Disapointing not to actually to see the original street or house.\u000a      <\/p><p>\u000a        We marched on eastwards towards Highbury, for street number 2,\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps\/ms?ie=UTF8&amp;hl=en&amp;msa=0&amp;ll=51.54803,-0.08568&amp;spn=0.010715,0.021887&amp;t=h&amp;z=16&amp;msid=111027506527990496626.00046387abd1302fe2ec4\">\u000a          Mildmay Street\u000a        <\/a>\u000a        , N1. Not too sure who lived here, but again another house that hasn't survived, and now an Islington council estate.\u000a      <\/p><p>\u000a        Next stop was\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps\/ms?ie=UTF8&amp;hl=en&amp;msa=0&amp;ll=51.542892,-0.077999&amp;spn=0.010716,0.021887&amp;t=h&amp;z=16&amp;msid=111027506527990496626.00046387abd1302fe2ec4\">\u000a          Hertford Road\u000a        <\/a>\u000a        which was Auntie Grace's family home when a child in the early part of the 20th century. A nice street and at last an actual house to see on the edge of another council estate in Dalston.\u000a      <\/p><p>\u000a        A short trip across the Regents Canal to the desirable Hoxton, saw our original William Gay residence from the mid 19th century. 9 Whitmore Street and\u000a        <a href=\"http:\/\/maps.google.co.uk\/maps\/ms?ie=UTF8&amp;hl=en&amp;msa=0&amp;ll=51.536813,-0.086058&amp;spn=0.010718,0.021887&amp;t=h&amp;z=16&amp;msid=111027506527990496626.0004639c0f654192e68da\">\u000a          77 Felton Street\u000a        <\/a>\u000a        could be one in the same place. Whitmore Street no longer exists and Felton Street has been trimmed in length, again it is now another council estate of flats, which didn't look great. Not sure why, but I do find it interesting to see the areas where my ancestors lived. I'm an east end boy!\u000a      <\/p><p>Author: Daddy<\/p><img src='images\/years\/2009\/2009_02_20-00-LondonGayHeritageWalk.jpg' class='diaryImage' alt='Gay Heritage Walk' \/><p class='diaryImageCaption'>Gay Heritage Walk<\/p>","images":false},"title":{"value":"Gay Heritage Walk"},"version":1},{"date":{"d":19,"m":2,"y":2009},"datev":20090219,"images":1,"info":{"content":"<p>We headed into Eastbourne, first stopping off at a Sainsbury's Cafe for a spot of breakfast. Jessica managed to pebble dash the cafe floor in a nice blend of Rice Krispies!<\/p><p>We embarrassingly slinked out and headed to the seafront. The weather wasn't as good as yesterday but the kiddies were on fire. Dancing, singing and skipping down the promenade. We had a nice long walk along the beach from the pier to blow the cobwebs out.<\/p><img src='images\/years\/2009\/2009_02_19-02-Eastbourne.jpg' class='diaryImage' alt='The happy crew' \/><p class='diaryImageCaption'>The happy crew<\/p><p>We then tried to get in the local swimming pool, but were told that we needed a 1:1 ratio for the children. Apparently it is the law for flumed pools. This upset Ben in particular who loooooves flumes.<\/p><p>We instead headed towards Beachy Head and went for another long walk up a big hill. We could see the sea all around. Daddy reckoned there was a mini-tornado out to sea. We later returned to the car and made our way slowly home.<\/p>","images":false},"title":{"value":"Eastbourne"},"version":1},{"date":{"d":18,"m":2,"y":2009},"datev":20090218,"images":1,"info":{"content":"<p>\u000a        Daddy had the half term week off work, and he had planned a surprise trip down to\u000a        <a href=\"http:\/\/www.drusillas.co.uk\/\">\u000a          Drusilla's\u000a        <\/a>\u000a        . It's a small zoo, come massive adventure playground, ideal for a 1, 3 and 5 year old. We particularly enjoyed competing against each other in the zoo olympics. Our favourite was 'How loud are you?' Here a person would go into an old style telephone box and shout, scream, make as much noise as possible. Ben attained the highest figure of 112 decibels. He even beat mummy and daddy's best efforts!\u000a      <\/p><p>We also tried sprints, hopping, stretching, seeing. All great fun for the kiddies. Jessica was fascintated with some of the monkey's. Probably because she feels some afinity with them, being one herself! After an early lunch, we went onto the packed, huge adventure playground. Loads of rope bridges, slides, swings, outposts. We lost the children a couple of times in the maze of apparatus. That burnt off some energy.<\/p><p>We then split. Katie decided she wanted to sift for gold. However, we didn't get an apron on her in time and she managed to soak the sleeves of her top, trousers and shoes. Nevermind. Benny went down the big inflatable slide with the playschool teddy, which we had to get photos of and show next week. 'We' then somehow managed to lose this teddy, despite our best efforts of looking for him. Daddy is glad he has not got to tell playschool.<\/p><p>One of the attractions was Thomas The Tank Engine railway. We queued and boarded the train which ran around the perimeter of the park. We ended the day by double backing through the park to see all the animals again quickly. It was quite refreshing as there were no crowds. The children thoroughly enjoyed it.<\/p><img src='images\/years\/2009\/2009_02_18-00-Drusillas.jpg' class='diaryImage' alt='Drusilla Action' \/><p class='diaryImageCaption'>Drusilla Action<\/p><p>Time was marching on and we had to find our hotel and something to eat. A fish and chip meal in our room just outside Hailsham. All five of us managed to settle down and get a reasonable night's kip.<\/p>","images":false},"title":{"value":"Drusilla's"},"version":1},{"date":{"d":15,"m":2,"y":2009},"datev":20090215,"images":2,"info":{"content":"<p>Jette and I are pooped! We have been entertaining Katie and Ben since eleven o'clock and although they are as good as gold, it is still a wearing experience. It began with us going round to Deepcut to collect the youngsters and drive to Brookwood for the train to London. We caught the 11.48am  for Waterloo which, on a Sunday, was not the quickest train up to the capital and was well filled. However, we found a nice corner in a first class section of the train after speaking with the train's conductor.<\/p><p>We left the train at Clapham Junction and wandered round the corner through a very busy shopping area, considering it was a Sunday, and boarded a number 77 bus which, by coincidence, also had Waterloo as its final destination. We quickly stamped upstairs where both children were fully occupied for the 20 minutes journey through less well heeled suburbs of Battersea and Vauxhall before alighting on the grey but fairly pleasant day for a short walk past the London Eye to the London Aquarium.<\/p><p>I can recall that little stretch of the South Bank of the Thames being quite a sterile run when the building there housed only the city's municipal administration but now is a fully commercial edifice. There are a number of exhibitions and general opportunities to relive cash from your pocket. Fortunately, we unknowingly picked a day when there was a special promotion whereby children entered free of charge. With entry and all travel, we had only spent £16.50, but of course we did not entirely 'escape.'<\/p><p>Our pockets felt a lot lighter after a snack in the cafe there, a face painting session and the shop at the exit but we could not really complain. A very light drizzle had started up but the time we departed just after four and the painted faces were under threat in the damp, but survived. We had a little time to waste and Ben, in particular, found great delight in travelling up and down a set of escalators.<\/p><p>The train comfortably took us back to Brookwood by which time it was almost dark. We stopped off at Frimley Green to me to buy some bits and pieces to provide for a much requester treasure hunt; some sweets, balloons, magazine and piggy bank change. So by the time Jette rustled up a meal, dominated by sautéed potatoes, baked beans, fruit jelly and ice cream and a bath that finally saw the demise of the now well smudged facial artworks, it was eight o'clock by the time they had a shortened bedtime story and lights out.<\/p><p>Oh, I also had to give a short tour of the water pipes! It seemed that they were both a bit upset the last time they were here by the strange house noises at night, The clunking and creaking that occurs in most homes. They have the same concerns when staying at Laura's parents' home. I explained how the water came into the house and through the boiler to be heated up and then be distributed through pipes to the radiators and how the differing changes of temperature causes noise from time to time in the hope that taking the mysticism out of it all.<\/p><p>It is now approaching 11.30pm and, so far, there has not been a peep out of them. let's hope it stays like that until we get them back to Deepcut tomorrow morning when they can raise hell if they want!<\/p><p>Author: Farfar<\/p><img src='images\/years\/2009\/2009_02_15-03-LondonAquarium.jpg' class='diaryImage' alt='Fish Tank Face' \/><p class='diaryImageCaption'>Fish Tank Face<\/p><p>Meanwhile Mummy and Daddy were finally able to spend some quality time with Jessica. We went over to Trilakes to visit the farm animals and walk around the lake, then onto the swimming.<\/p><img src='images\/years\/2009\/2009_02_15-07-TriLakes.jpg' class='diaryImage' alt='Daddy and Jess enjoying the walk' \/><p class='diaryImageCaption'>Daddy and Jess enjoying the walk<\/p><p>Later in the afternoon Karen and Richard popped over to watch Man Utd vs Derby in the F.A Cup.<\/p>","images":false},"title":{"value":"London Aquarium with Fars, TriLakes and Swimming"},"version":1},{"date":{"d":14,"m":2,"y":2009},"datev":20090214,"images":1,"info":{"content":"<p>We decided to go down to Hayling Island today. It was sunny if a little chilly. We hit the seafront and first visited the fun fair. Ben and Katie went on a car ride then up the Helter Skelter, Katie came down, Ben didn't. Where was he? Who knows. Mummy in the end had to go up and give him a shove. Jessica looked on jealously. They both came down luge style.... flat on their back. Not sure who made that up.<\/p><p>Around to the beach railway and we sat and had our picnic on the station. The train trundelled in and we sat right at the front behind the engine. It was a dirty diesel! It was a long old journey, finally ending up by a playground in the Eastoke area. After a play in the sandy playground, we went to the stoney beach and threw stones into the water. Ben almost accidently threw one at Katie's head! We almost got caught out with the incoming tide!<\/p><p>Down to the exercise area. It was funny to see mummy do the step up, step down exercise. Then Jessica put her finger in some dog poo, so we all returned back to the station and toliets to refresh. We caught the returning train to the fairground and had one last go on the daring wulitzer type ride. Well it circled around, each car spun on it's own axis and went up and down. Ben especially got to love it.<\/p><p>One final go in another playground, before time, coldness and tiredness caught up with us. We left Ben's coat in the playground!<\/p><img src='images\/years\/2009\/2009_02_14-00-HaylingIsland.jpg' class='diaryImage' alt='Hayling Island' \/><p class='diaryImageCaption'>Hayling Island<\/p>","images":false},"title":{"value":"Hayling Island"},"version":1},{"date":{"d":8,"m":2,"y":2009},"datev":20090208,"info":{"content":"<p \/>","images":false},"title":{"value":"Baptism Church Party"},"version":1},{"date":{"d":7,"m":2,"y":2009},"datev":20090207,"info":{"content":"<p>We popped over to the Country Market for Joey's birthday party which he shared with a couple of his friends. There was a bouncey castle, an alternative pass the parcel and plenty of craft stuff which occupied Katie and Ben for a long time.<\/p><p>Jess-munta enjoed running around and squarking at the top of her voice.<\/p>","images":false},"title":{"value":"Joey's 4th Birthday Party"},"version":1},{"date":{"d":2,"m":2,"y":2009},"datev":20090202,"images":3,"info":{"content":"<p>Wow. What a lot of snow we woke to. Too much for going to work or school. We played outside, well Daddy didn't because he had to work. We loved it... but only for a short while... until the cold set in.<\/p><p>The Fars popped around with chocolate buscuits and a wooden sledge. Later in the afternoon the girls went to Frimley Green rec to sledge down the 'hill'. Katie absolutely loved it.<\/p><img src='images\/years\/2009\/2009_02_02-02-Snow.jpg' class='diaryImage' alt='Snowy Back Garden' \/><p class='diaryImageCaption'>Snowy Back Garden<\/p><img src='images\/years\/2009\/2009_02_02-11-Snow.jpg' class='diaryImage' alt='Sleigh Ride' \/><p class='diaryImageCaption'>Sleigh Ride<\/p><img src='images\/years\/2009\/2009_02_02-13-Snow.jpg' class='diaryImage' alt='Martin and Laura' \/><p class='diaryImageCaption'>Martin and Laura<\/p>","images":false},"title":{"value":"Snow, Snow, Snow"},"version":1},{"date":{"d":1,"m":2,"y":2009},"datev":20090201,"info":{"content":"<p>After church and Jessica weighing in with a 3 hour morning sleep, we headed to Woking for Joey's birthday swim. The talk was of which flumes we'll be attempting. Mummy and Daddy have heard it all before. When push comes to shove, Ben and Katie generally chicken out!<\/p><p>We had a bit of a scare as Ben wandered off and we spent 5 minutes looking for him. He was found looping around the lazy river! Thank goodness he was fine. Mummy kept cuddling Ben and making sure he was OK and making sure he knew we all loved him. Eventually he got fed up with this and told Mummy 'Let's stop talking about this now Mummy!' Brilliant.<\/p><p>We had a good time with Ben and Katie keeping their word. Ben was brave enough to go down the black flume lots of times, Katie the slow green flume. They all love the water, even Jessica enjoys herself. Woking pool is just ideal for the three of them. It offers so much.<\/p><p>We sang happy birthday to Joey in the restaurant and gave him presents. He got a game called Magic Carpet and an American Football top from us.<\/p>","images":false},"title":{"value":"Joey's Swimming Birthday"},"version":1},{"date":{"d":31,"m":1,"y":2009},"datev":20090131,"images":1,"info":{"content":"<p>In the morning Daddy popped out for his haircut whilst the rest of us were sorting stuff out from the loft and preparing for another house viewing.<\/p><p>It was lunchtime and we went to the Arena to attend Freya's 4th Birthday party. First up the bouncey castle assualt course. Ben and Katie are so sweet together. They waited for each other and even held hands as they ran round for another go! Jessica enjoyed the freedom to run around lots as well. We happened to bump into Lorraine as well, our old next door neighbour.<\/p><p>We moved onto some play apparatus and built a little house together until some nasty boys came and bashed it down. Ben was a hit with one of the helper ladies! Jessica was in heaven. So many things to climb up.<\/p><p>The third stage was in a dance hall where party food was served as well as the cake presentation.<\/p><p>We were then invited with some family back to the West ranch, where Daddy and Uncle Barrie rolled back the years and played football in the back garden. They both kicked the ball over the fence! Ben was fascinated at Barrie's Star Wars collection and one of the other boys introduced him to the Clone Wars series. Katie was loving the huge trampoline in the back garden.<\/p><img src='images\/years\/2009\/2009_01_31-05-Freya4thBirthday.jpg' class='diaryImage' alt='Freeeedom' \/><p class='diaryImageCaption'>Freeeedom<\/p>","images":false},"title":{"value":"Freya's 4th Birthday Party"},"version":1},{"date":{"d":30,"m":1,"y":2009},"datev":20090130,"info":{"content":"<p>Ben said he has loved playing in the rocker with Oliver Strangle, Matthew and Theo. This week we have also had some lovely chats about his family and told me you are taking him to a hotel as I was writing this. Ben is sat next to me drawing and he said his mummy is really going to be impressed with it, which was a very impressive word!<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":28,"m":1,"y":2009},"datev":20090128,"info":{"content":"<woops woopstitle=\"Slammed motorbike into a stationary car at 30mph\" rating=\"6\"><p>For the second time in 6 days Daddy had another motorbike accident. This time it was his fault. He crash into a stationary car on he main Deepcut road. The car was waiting to turn right, and Daddy hadn't noticed he'd stopped and went into the back of him at 30mph!! Ouch. Daddy flung forward and crushed his bits against the petrol tank and ended up on the floor again, this time quite winded. Again shockingly there was next to no damage caused. The chap got out of his car and wasn't best pleased even though there was no damage. It took about 30 mins to get rid of the winding and a few days for the crushing pain to go away!<\/p><\/woops>","images":false},"title":{"value":"Motorbike Crash 2"},"version":1},{"date":{"d":27,"m":1,"y":2009},"datev":20090127,"info":{"content":"<p>Yes I know how to spell 'son'. This is a story that came back from playschool today.<\/p><p>The playschool teacher was talking about planets to the whole group and naming each one, and said 'and the largest planet of all is the sun'. At which point Ben piped up and said 'No, No, the sun is a star, not a planet', at which point all the teachers just started cracking up.<\/p><woops woopstitle=\"Leave keys in motorbike ignition for 2 days at busy carpark!\" rating=\"4\"><p>Daddy has been in Manchester for the past 2 days installing his new web application at Greater Manchester Police. Anyway he rode his motorbike and parked at Farnborough Main railway station on Monday morning. On the way home today, Daddy couldn't find his motorbike keys. Looked in pockets and bags, everywhere. Oh know he might have left them on the bike! Convinced that the bike would be stolen, the train pulled up back into Farnborough station and the bike was still there!!! First glanced at the top box, nothing there... the ignition, keys there!!! The motorbike had been sitting in the carpark for 36 hours with the keys in the ignition. Not exactly unnoticable. Daddy laughed.<\/p><\/woops>","images":false},"title":{"value":"Motorbike anyone? Ben My Sun"},"version":1},{"date":{"d":24,"m":1,"y":2009},"datev":20090124,"images":2,"info":{"content":"<p>In the morning Katie went to another Leah's birthday. Again the parents went to alot of effort. It had a 'crafty' theme. Katie came back with a heart, bag and some home made biscuits.<\/p><p>Whilst she was there, the rest of us popped around to the Fars for a cuppa and then on to the swings at Heatherside.<\/p><p>In the afternoon we went down a really bumpy, puddley road. Finally we stopped and went for a walk. Of course all of us children got completely soaked in the puddles even though we had boots on. We could see really far. We saw Guildford cathedral from a distance. A lovely walk. Definately go back there.<\/p><img src='images\/years\/2009\/2009_01_24-19-Pirbright.jpg' class='diaryImage' alt='Puddle Walk' \/><p class='diaryImageCaption'>Puddle Walk<\/p><img src='images\/years\/2009\/2009_01_24-16-Pirbright.jpg' class='diaryImage' alt='Pirbright Sunset' \/><p class='diaryImageCaption'>Pirbright Sunset<\/p>","images":false},"title":{"value":"Fars, Another Leah Party, Pirbright Walk"},"version":1},{"date":{"d":22,"m":1,"y":2009},"datev":20090122,"info":{"content":"<woops rating=\"7\" woopstitle=\"Motorbike Crash!\"><p>On the way home from work, it's dark and a lot of traffic about. I'm on the main road travelling 30 or 35mph sitting behind a white van at a reasonable distance.<\/p><p>All of a sudden a car pulls out from a side turning after the van passes the junction. I have a split second to react, skid and slide into the door of the car which pulled out. I catch the car at an angle and bounce of the door and fall into a heap in the middle of the busy road. It all happened so quick.<\/p><p>Then the next bit was strange. I lay in the road, not hurt, but for some reason I didn't get up straight away. It took a couple of seconds. I remained so calm, I wondered if I lay on the road because it was nice to have a rest and a lie down! Mmm. Anyway as I say I'm not sure what happened in those few seconds.<\/p><p>Thankfully the car behind had stopped in time. The car I hit stopped and the 17 year old got out to check I was OK and apologised. I managed to pick the bike up and move it to the side of the road. The chap looked more shaken than myself. I told him not too worry and that it was just an accident. What I was most concerned about was the state of the bike. It was the front wheel that hit the car. It was hard to tell in the dark. I took the chaps details, and just rode home. There didn't seem to be anything of concern. Just the gear peg may have been damaged a bit as it was difficult to traverse through the gears.<\/p><p>I couldn't blame the chap. He didn't see me behind the van, and he would have to push himself out of the junction in order to join the busy road, otherwise he'd be there forever. I could easily do what he's done.<\/p><\/woops>","images":false},"title":{"value":"Motorbike Crash!"},"version":1},{"date":{"d":18,"m":1,"y":2009},"datev":20090118,"images":2,"info":{"content":"<p>Jessica unwittingly had lost Katie's teddy bear, 'Bear Bear', during the week. So Katie and mummy made posters and stuck them around the Green in Frimley Green. At lunchtime we received a call that a bear which looked like the one in the picture was found at One Stop on the counter. We later trotted down and guess what... Bear Bear and Katie were again re-united. Just a number of things: 1) Not sure putting posters around with our home phone number was a good idea. 2) For someone to describe the bear looking like it did in the picture. Well you would have to have a good imagination. 3) And thirdly the woman who rang happened to be one of Katie's classmates mother!<\/p><img src='images\/years\/2009\/2009_01_18-03-JoeyLilyToStayII.jpg' class='diaryImage' alt='Katie and here poster' \/><p class='diaryImageCaption'>Katie and here poster<\/p><p>After retrieving the bear we went over to the new swing park over in Windlesham. It was a shame to see the old 80's style park go. It was bitterly cold, but the children enjoyed it, especially the swinging basket.<\/p><img src='images\/years\/2009\/2009_01_18-13-JoeyLilyToStayII.jpg' class='diaryImage' alt='Katie and Ben enjoying the park' \/><p class='diaryImageCaption'>Katie and Ben enjoying the park<\/p><p>We stood the cold no more and returned home. We had visits from Ellie, Joey, Lily and all four grandparents. Needless to say it was a bit manic. Katie played schools for ages with the Fars. She is a very convincing teacher! Ellie went to work, so the five children were all bathed, fed and put to bed for the night.<\/p>","images":false},"title":{"value":"Lost Teady Bear - Family Gathering"},"version":1},{"date":{"d":17,"m":1,"y":2009},"datev":20090117,"images":1,"info":{"content":"<p>In the morning we played around the house. Benny enjoyed playing trains. Katie went to Leah Somner's 6th birthday party. It was refreshing to see it was a house party, with face painting and normal games! It was a girls only party. Daddy got as far as the front door!<\/p><p>Meanwhile the rest of us went over to visit the West's briefly. It was Laura's 28th birthday.<\/p><p>In the afternoon we all went over to Fizzy Kids for a run around in the soft play. In the evening we sat to have tea watch Wipeout.<\/p><p>This week Daddy managed to contact a distant Uhrskov relative in Denmark which was nice.<\/p><img src='images\/years\/2009\/2009_01_17-02-BenTrain.jpg' class='diaryImage' alt='Ben in training' \/><p class='diaryImageCaption'>Ben in training<\/p>","images":false},"title":{"value":"Leah's Birthday, Fizzy Kids"},"version":1},{"date":{"d":16,"m":1,"y":2009},"datev":20090116,"info":{"content":"<p>Its been a fantastic day for Ben today, no tears and lots of smiles. He was very helpful with the tidying up and at song and story time he was a little superstar. Have a good weekend.<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":12,"m":1,"y":2009},"datev":20090112,"first":{"name":"katie","value":"Rainbows"},"info":{"content":"<p>Katie's name went down on the list when she was 1 year old. Finally she began her first Rainbow session. It's a pre-brownies group. She played 'Who stole the cookie from the cookie jar' and made some biscuits.<\/p><p>She now has almost every day where she does an activity or belongs to a club<\/p><ul><li><i>Monday<\/i>Rainbows\u000a        <\/li><li><i>Wednesday<\/i>Swimming\u000a        <\/li><li><i>Thursday<\/i>Ballet\u000a        <\/li><li><i>Friday<\/i>fter school club (Methodist church, Frimley Green\u000a        <\/li><li><i>Sunday<\/i>Sunday School (St. Andrews, Frimley Green\u000a        <\/li><\/ul>","images":false},"title":{"value":"Katie starts Rainbows"},"version":1},{"date":{"d":11,"m":1,"y":2009},"datev":20090111,"images":1,"info":{"content":"<p>\u000a        With Ben still out, the rest of us went up to the <a href=\"http:\/\/www.sciencemuseum.org.uk\/\">Science Museum<\/a>. We parked close by, Daddy quickly went to get loads of treats for lunch, and then we walked through the University to get to the museum.\u000a      <\/p><p>Mummy and Daddy had a 'discussion' about the dog, Laika, who was the first dog in space. Mummy believed it was the only passanger on Sputnik 2. However, Daddy laughed that she believed the dog could pilot a space rocket on it's own into space.<\/p><p>Jessica was contented in her pushchair, Katie showed some interest in the older exhibits. Mummy and Daddy reminised over the 80's and 90's collection of electrical goods and computers. Were Nintendo Gameboy's really that big and chunky?<\/p><p>\u000a        The girls tummy's were growing rather fond of the lunch packed.... so we stopped for a bit on the third floor. After lunch we moved through to the interactive bits and pieces, known as the\u000a        <a href=\"http:\/\/www.sciencemuseum.org.uk\/visitmuseum\/galleries\/launchpad.aspx\">\u000a          Launchpad\u000a        <\/a>\u000a        . It was quite manic in there with so many parents and children milling about from one apparatus to another. Kaite liked the one where she had to pedal to make electricity for a light. There were loads of things to for her to do.\u000a      <\/p><p>\u000a        We later went down to <a href=\"http:\/\/www.sciencemuseum.org.uk\/visitmuseum\/galleries\/the_garden.aspx\">'The Garden'<\/a> which was aimed at under 5's. Something down there that kept Jessica entertained. She liked banging on the xylaphone!\u000a      <\/p><img src='images\/years\/2009\/2009_01_11-00-ScienceMuseum.jpg' class='diaryImage' alt='Science Museum' \/><p class='diaryImageCaption'>Science Museum<\/p><p>On returning to the car we couldn't find the keys! Of course the car was left unlocked and the keys found on the drivers seat!<\/p><p>We returned home and were met by Ma Ma, Pop Pop, Uncle Peter and of course Ben.<\/p>","images":false},"title":{"value":"What if we had 2 children?"},"version":1},{"date":{"d":10,"m":1,"y":2009},"datev":20090110,"images":1,"info":{"content":"<p>Micheal back to working abroad and Ellie also working, we had the pleasure of Joey and Lilzo for half the day. They came late the night before, so this morning our first chance to play. It was really, really cold. Well below freezing. The tenpin bowling was all booked up, so we foolishly decided to go to the army swings. Everything we quite slippery, including the slide, which made us go down extra fast! We played a mixture of Star Wars, glueing and dressing up. At one point we ganged up on Daddy with our Bob The Builder gear. Katie was sawing my neck, Joey drilling into the side of his head, Lily hammering his head and Ben gouge his eyes out with the tip of a screwdriver. Great!<\/p><p>In the afternoon Ben went to watch the Aladin panto at Woking, with Ma Ma, Pop Pop, Great Grandma, Great Granddad and Uncle Peter. He then went to stay the night at Ma Ma and Pop Pop's.<\/p><img src='images\/years\/2009\/2009_01_10-02-JoeyLilyToStay.jpg' class='diaryImage' alt='Frosty playtime' \/><p class='diaryImageCaption'>Frosty playtime<\/p>","images":false},"title":{"value":"What if we had 5 children?"},"version":1},{"date":{"d":9,"m":1,"y":2009},"datev":20090109,"info":{"content":"<p>Ben only stayed with me for 5 minutes then he went off to play. He has loved painting and the wanted to play in the empty cardboard box. When I took him to the toilet he was telling me that 2 and 2 made 4 (fantastic). Ben alwats chats much more when he is in the toilets and number seem to be the main topic. Oliver joined us in the toilets and the boys helf a long conversation about what number the toilet they had used. They both became very animated and giggley which was great to see.<\/p><p>Author: Tracey (Ben's playschool teacher)<\/p>","images":false},"title":{"value":"Comments from Ben's playschool teacher"},"version":1},{"date":{"d":1,"m":1,"y":2009},"datev":20090101,"images":1,"info":{"content":"<p>We had a lot of tidying up to do from the night before, which consumed most of the day actually. We did venture out and meet with the Elders at Farnham park. Joey showed us how he can now cycle without stabilizers. Jessica loved the slide, Katie and Ben the aerial slide.<\/p><img src='images\/years\/2009\/2009_01_01-17-NewYearsDay.jpg' class='diaryImage' alt='Aerial Sliding' \/><p class='diaryImageCaption'>Aerial Sliding<\/p>","images":false},"title":{"value":"New Years Day"},"version":1}],"version":-1200299682}