{"entries":[{"date":{"d":31,"m":12,"y":2010},"datev":20101231,"images":1,"info":{"content":"<p>We found a book we were given last Christmas, Walks around London. We found our closest near Henley on Thames so decided to trek up in the car and have ago on the three mile walk. We got there and found that we'd forgotten all the children's coats. Ooops!<\/p><p>We started with a pushchair and two scooters. Ben's scooter went after 500 yards, and Katie's was carried halfway through. We treked across farmers fields and onto the river. We stopped for a picnic at Hambleden wier then went across the bridge which was good to see the rushing water. We then headed back towards Henley seeing the Island that they start the rowing races from for the regatta before returning back to the car. The children were cold and hungry and surprisingly a bit moany!<\/p><p>After picking up the scooter we headed to the flower pot which was a country pub where we had a lovely meal in front of a roaring fire.<\/p><p>Later in the afternoon the Elders came around and the children had a mini New Years Eve party which ended in singing Auld Langsine at about 6pm. A bit wierd.<\/p><p>After a few attempts at getting the kiddies to bed the adults amongst us started our fun and games. Katie had made the teams up. Daddy, Ellie, Richard, Charlotte and Luke, against Mummy, Michael, Karen, Rachel and Jon.<\/p><p>We played games right up to midnight, only stopping for food. Daddy had BBQ'ed some pork and gammon.<\/p><img src='images\/years\/2010\/2010_12_31-00-NewYearsEveParty.jpg' class='diaryImage' alt='Happy New Year' \/><p class='diaryImageCaption'>Happy New Year<\/p><p>After we saw midnight, some ofthe boys tried to launch 4 lanterns tied together. It was slightly troublesome and only managed to get one up in the end.<\/p>","images":false},"title":{"value":"Walk 1: Reminham Walk, News Eve Party"},"version":1},{"date":{"d":29,"m":12,"y":2010},"datev":20101229,"images":1,"info":{"content":"<p>A whole gaggle of us went to Basingstoke to watch this year's panto, Sleeping Beauty. Jessica stayed back with Uncle Michael and Joey as we thought it was maybe a year too early still.<\/p><p>The cast had PC Plum from Balamoray, Abi Titmus and Wendy Craig. We had really good seats, right at the front. Pop Pop was very uncomfortable when he got picked out to be the nurse's boyfriend, basically being the butt of a series of 20 jokes through out the act.<\/p><p>Ben really got into it, epsecially on some of the funny name calling jokes. He was booing and shouting at the actors. A really good time had by all.<\/p><img src='images\/years\/2010\/2010_12_29-01-SleepingBeauty.jpg' class='diaryImage' alt='The cast' \/><p class='diaryImageCaption'>The cast<\/p>","images":false},"title":{"value":"Pantomime - Sleeping Beauty"},"version":1},{"date":{"d":28,"m":12,"y":2010},"datev":20101228,"info":{"content":"<p>We're still not sorted out places for all our presents just yet. It's quite hard. We are getting through to play or attend to each present.<\/p><p>Katie went over to Leah's to play in the afternoon and stayed for a sleep over at her Dad's house. Playing on the DS and the Wii were the main sources of attraction.<\/p><p>The rest of us attended Pete's party which was down in numbers for one reason or another. Anyway we had a good time playing with Pete's interesting toys up in his bedroom. He had loads of funny things, including a fake poo!<\/p>","images":false},"title":{"value":"Uncle Pete's Christmas Party"},"version":1},{"date":{"d":27,"m":12,"y":2010},"datev":20101227,"images":1,"info":{"content":"<p>Probably a record when we went swimming at Farnborough. We had both the baby pool and main pool all to ourselves. It seemed we had our own 3 personal lifeguards! Still we managed to get told off for running along the edge of the pool.<\/p><p>The Fars came around later to play games. Ben played a best of 3 with his new mini table football game, and won!<\/p><img src='images\/years\/2010\/2010_12_27-04-FarsOverToPlay.jpg' class='diaryImage' alt='Football crazy' \/><p class='diaryImageCaption'>Football crazy<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":26,"m":12,"y":2010},"datev":20101226,"images":2,"info":{"content":"<p>After a good night's sleep for all for once, we played a little more in the morning before returning home. After running a few errands with Uncle Peter we drove over to the Elders for a Barnett gathering.<\/p><p>The usual compendium of games, food and catch up ensued. It was good to see great grandma and grandad joining in as well. The bathroom door broke which left Pop Pop having to mobile phone down to Auntie Ellie to let him out!<\/p><p>The auction this year was probably the highest quality yet. Mummy won some jewelery that had an RRP of $200!<\/p><img src='images\/years\/2010\/2010_12_26-49-BoxingDay.jpg' class='diaryImage' alt='Jessica cuddling Eva' \/><p class='diaryImageCaption'>Jessica cuddling Eva<\/p><img src='images\/years\/2010\/2010_12_26-64-BoxingDay.jpg' class='diaryImage' alt='Find a place to sit and stay there' \/><p class='diaryImageCaption'>Find a place to sit and stay there<\/p>","images":false},"title":{"value":"Boxing Day"},"version":1},{"date":{"d":25,"m":12,"y":2010},"datev":20101225,"images":4,"info":{"content":"<p>Katie woke during the night, 2am, and made it known that Father Christmas had come as there were a load of presents at the end of the bed. However, it wasn't until 6:20am before the Katie, Ben siren piped up and all had to awake. We decamped into Katie and Ben's room and bought in all Jessica's presents as well. How good have they been?<\/p><p>Did Katie get a Nintendo DS? Yes. Did Ben get his pink scooter? No! Ben's main present was a toy boat and Jessica's a CD player for her bedroom as she is always listening to Katie and Ben's. You could tell they were flagging after about 20 minutes worth of opening.<\/p><p>Mummy and Daddy opened theirs. Mummy's main presents were a load of Marks and Spencer bras and a pair of boots. Daddy got a coat, mainly because Mummy was getting fed up with his current jacket.<\/p><p>We all ventured over to the Fars once more, had a lovely breakfast, Mummy went to church. Despite having opened a load of presents over the past 24 hours, we decided to play camps. Auntie Susan came back around and mummy returned from church so part III of opening presents could commence.<\/p><img src='images\/years\/2010\/2010_12_25-107-ChristmasDay.jpg' class='diaryImage' alt='Christmas Day 1' \/><p class='diaryImageCaption'>Christmas Day 1<\/p><p>We said out goodbyes to the Fars and got over to the Weston household for about 1pm, when the children had their Christmas lunch. The Elder children were a lot better at eating Christmas lunch than the Gay's. All ate the turkey though.<\/p><img src='images\/years\/2010\/2010_12_25-25-ChristmasDay.jpg' class='diaryImage' alt='Christmas Day 2' \/><p class='diaryImageCaption'>Christmas Day 2<\/p><p>The girls, plus Daddy walked over to the Fitzgerald household. There was still alot of ice about, so we gingerly made our way over. We saw Helen and Nigel and got a present from them which was very nice. We left in typical style with children screaming. Mummy trod on Katie's feet with her new heavy boots. Because Mummy picked up Katie, Jessica then also started sobbing. If I were the Fitzgeralds, I'd be glad of the piece of quiet when we departed.<\/p><p>We got home and began opening presents that were to and from the Barnett side of the family. Katie received the Sylvanian Families which she was looking to get, Ben a Star Wars lego spaceship and Jessica a CD player! All done very excitedly. Each of us were proud to also be sorting the presents out before hand.<\/p><img src='images\/years\/2010\/2010_12_25-11-ChristmasDay.jpg' class='diaryImage' alt='Christmas Day 3' \/><p class='diaryImageCaption'>Christmas Day 3<\/p><img src='images\/years\/2010\/2010_12_25-17-ChristmasDay.jpg' class='diaryImage' alt='Christmas Day 4' \/><p class='diaryImageCaption'>Christmas Day 4<\/p><p>After playing with some of the toys, a spot of tea and a bath, it was time for bed.<\/p><p>The adults then could start their Christmas with a feast of Turkey and all the trimmings, after which they had the carmness in which to open their presents. Yeah right! We finally finished at 10pm just in time for the new Walliams and Lucas comedy about an airport.<\/p><p>Overall this year was much carmer than previous which was good for all.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2010},"datev":20101224,"images":1,"info":{"content":"<p>Daddy worked until 1:30. We played games then went over to the Fars for a Danish Christmas Evening. First up a game of Coppit, which Uncle Graham won despite Mummy and Ben ganging up on everyone else. Meanwhile Katie was checking the internet to see which country Father Christmas was currently in. Pakistan apparently. Jessica on the otherhand was helping Farmor on the last few touches to the dinner. Roast Pork, caramelized and boiled potato, red cabbage, sausage (for the non-porkers), carrots. Yum. Pudding was a butterscotch tarte and of course our favourite, Ris Alamonde. Farfar won the prize for getting the nut (equivilent to a sixpence). By this stage we had all got up from the table as we are not great eaters outside pasta, rice and chicken nuggets!<\/p><p>We all mucked in clearing up and then it was time for the main event. Katie and Ben had already sorted the presents into piles of who they were for. Jessica was really into this year and appreciated what presents were. Anyway Daddy took the helm and distributed the presents so one or two people were opening them at a time. These were all presents to or from Susan, Graham, Farmor and Farfar. All got a tidy haul.<\/p><p>After present opening we had a game of bingo some more coffee and chocolates. It was coming up 8:30 and time to leave.<\/p><p>We returned home and put out some milk and food for Father Christmas and his reindeer. All three children were asleep by 9pm. Mummy went to midnight mass and returned at 12:40am!<\/p><img src='images\/years\/2010\/2010_12_24-13-ChristmasEve.jpg' class='diaryImage' alt='Christmas Eve Lineup' \/><p class='diaryImageCaption'>Christmas Eve Lineup<\/p>","images":false},"title":{"value":"Christmas Eve at the Fars"},"version":1},{"date":{"d":20,"m":12,"y":2010},"datev":20101220,"images":1,"info":{"content":"<p>After school we raced up to Kew and caught the tube to Piccadilly Circus where we saw the Christmas lights up Regents street. We got to go around in the train at Selfridges. Katie was being purposely moody. 'The train just goes around in circles!'. We still all enjoyed it.<\/p><img src='images\/years\/2010\/2010_12_18-03-Selfridges.jpg' class='diaryImage' alt='Tubed' \/><p class='diaryImageCaption'>Tubed<\/p>","images":false},"title":{"value":"Santa at Selfridges"},"version":1},{"date":{"d":19,"m":12,"y":2010},"datev":20101219,"images":1,"info":{"content":"<p>There was double church again this morning. In the afternoon Daddy took Ben and Jessica to Thomas' birthday party. However, the poor weather lead to the motorway being closed. Still spirits were high and we arrived half way through, just in time for the food and then the magic act. It was nice to see Thomas and Natasha.<\/p><img src='images\/years\/2010\/2010_12_20-01-ThomasBurrowsBirthday.jpg' class='diaryImage' alt='Magic Man' \/><p class='diaryImageCaption'>Magic Man<\/p>","images":false},"title":{"value":"Thomas Burrows 5th Birthday"},"version":1},{"date":{"d":18,"m":12,"y":2010},"datev":20101218,"info":{"content":"<p>We were split up this morning. The night before Mummy took us down to Ma Ma and Pop Pop's while she went out on the annual Teale-Weston Christmas meal. Both Ben and Katie were not feeling too well, and in the middle of the night Mummy went out to find a 24 hour pharmacy. Meanwhile Ma Ma thought it was morning time and got Jessica up. When Mummy returned at 4am she wondered why Ma Ma and Jessica were playing Barbie's!<\/p><p>Meanwhile Daddy was using his feet as ski's as he motorcycled home in the snow! Not bad seeing he hadn't his motorbike boots and a broken toe! Daddy then went out with his old work colleagues in Guildford which was really nice!<\/p><p>We took 3 hours to battle our way home. Unfortunately we had to cancel the Christmas Party. First time for quite a few years! Instead we had an at home day and played loads of board games.<\/p>","images":false},"title":{"value":"Snow"},"version":1},{"date":{"d":15,"m":12,"y":2010},"datev":20101215,"info":{"content":"<p>Frmiley C of E school had filled St Andrews church for their annual carol service. It was really nice to hear the school sing.<\/p>","images":false},"title":{"value":"Katie Carol singing at church"},"version":1},{"date":{"d":13,"m":12,"y":2010},"datev":20101213,"info":{"content":"<p>Daddy played in his 5 a-side team, Casuals tonight. The referee wasn't playing at his peak performance and Daddy helpfully pointed a few areas where he could improve. The referee took exception to this and sent Daddy off. Daddy not 100% agreeing with the decision, took out his frustration on the wooden boarding. That ended in a broken toe, un be known to Daddy though! We drew the game 3-3. Daddy had it diagnosed two days later, when the pain was getting too much so visited casulty in the early hours of Wednesday morning.<\/p>","images":false},"title":{"value":"Sent off and broken toe for Daddy's troubles"},"version":1},{"date":{"d":12,"m":12,"y":2010},"datev":20101212,"images":1,"info":{"content":"<p>Double church this morning. A normal, then a toy service! In the afternoon we entertained the West's and swapped Christmas prezzies. Katie, Ben, Jess and Harrison all seemed really happy with their hauls. Freya's, Make your own apron didn't go down a hit. Nice one Daddy. We could tear Harrison away from the Thomas The Tank Engine set that we had and kicked a fuss up when he had to leave. There was a fleeting visit from Ma Ma, Pop Pop and Uncle Peter. Ben was most pleased to beat Uncle Peter at a game of Stratego... and didn't we hear about it!<\/p><img src='images\/years\/2010\/2010_12_12-03-Wests.jpg' class='diaryImage' alt='Harrison enjoying his present opening' \/><p class='diaryImageCaption'>Harrison enjoying his present opening<\/p>","images":false},"title":{"value":"The Wests Over"},"version":1},{"date":{"d":11,"m":12,"y":2010},"datev":20101211,"images":1,"info":{"content":"<p>Evie came over with the Sanders crew for a child swap day! We get Evie, whilst the Sanders get us delightful 3!<\/p><p>Mummy and Daddy bathed in the calmness over lunch, then took Evie to Santa Firs where she met some reindeer and a giant inflatable Father Christmas. Evie took Mummy on the horse and cart ride, then took Daddy on the tractor ride. We had a look around all the Christmassy things in the shop. Not too sure what she was thinking when Mummy put on the novelty hats on her! The rendez vous point was McDonalds at Farnborough Gate, and yes they had an unhealthy meal! <\/p><p>We rushed home as Katie was performing in Deepcut barracks to some important soldiers. After they sang carols a magic man came onto stage and Katie was picked out to assist him in one of his tricks. She was most pleased about that. Katie also has been taking a shine to one of the boys in here year, Lucas. As parents we are not taking the micky out of her or embarrassing her just playing along.<\/p><p>Mummy coincidently also went to watch a band perform at the same barracks.<\/p><img src='images\/years\/2010\/2010_12_11-01-EvieSanders-SantaFirs.jpg' class='diaryImage' alt='Reindeer food to your left.' \/><p class='diaryImageCaption'>Reindeer food to your left.<\/p>","images":false},"title":{"value":"Child Swap - Take Evie to Santa Firs"},"version":1},{"date":{"d":10,"m":12,"y":2010},"datev":20101210,"images":1,"info":{"content":"<p>Last night mummy hosted a baby shower for Paula who is due in a week's time.<\/p><p>Daddy had the day off and went Christmas shopping in the morning. Mummy meanwhile was raising money for the playschool with her sacks of reindeer food and cakes she had made for the Christmas Fair.<\/p><p>Jessica was an angel in her nativity play and had Katie's angel costume, which was about 10cm too big for her! It was a packed performance with over 50 parents and grandparents there. Jessica was either overwhelmed or in her own little world during the performance, uttering a few lines here and there to the songs. Still it was lovely to see, and she looked proud that mummy and daddy were there to watch her.<\/p><img src='images\/years\/2010\/2010_12_10-01-JessicaNativityPlay.jpg' class='diaryImage' alt='What an angle' \/><p class='diaryImageCaption'>What an angle<\/p>","images":false},"title":{"value":"Jessica's First Nativity Play"},"version":1},{"date":{"d":5,"m":12,"y":2010},"datev":20101205,"images":1,"info":{"content":"<p>Whilst we went to church, Daddy stayed back to make Sunday lunch. BBQ'ed gammon with chocolate torte for desert.<\/p><p>Steven, Joyce and the beautiful Eva came round. Eva was such a smiley good girl. We of course all had a little cuddle and play with Eva. Ben meanwhile challenged Uncle Steven to a game of Stratego, which they agreed a draw.<\/p><img src='images\/years\/2010\/2010_12_05-02-EvaBarnett.jpg' class='diaryImage' alt='Joyce and Eva' \/><p class='diaryImageCaption'>Joyce and Eva<\/p>","images":false},"title":{"value":"A Dawgs Dinner"},"version":1},{"date":{"d":4,"m":12,"y":2010},"datev":20101204,"images":1,"info":{"content":"<p>It was bitterly cold again today. In the afternoon we went over to the Frimley C of E Christmas Fair at Katie's school. Of course Mummy had volunteered to run a couple fo stalls. Thankfully we had half an hour where we could go around all the other rooms and get things. We had a budget of £2 each. It was a case of seeing something we liked and spending the money, rather than wait to see everything then decide. Ben spent most of his money on Match Attax, a bit like football stickers. He's been into them all weekend and beyond, so certainly money well spent. We all had a go at decorating a bauball and a few goes on various things.<\/p><p>Later, the Fars turned up, who we subsequently fleeced and they came around to help us do things. After a couple of hours we tidied up and returned home.<\/p><img src='images\/years\/2010\/2010_12_04-07-FrimleyCofEXmasFete.jpg' class='diaryImage' alt='Bauball Factory' \/><p class='diaryImageCaption'>Bauball Factory<\/p>","images":false},"title":{"value":"Frimley C of E Christmas Fair"},"version":1},{"date":{"d":1,"m":12,"y":2010},"datev":20101201,"images":1,"info":{"content":"<p>Daddy had the day off today. It was really cold at -2 and there was snow and ice all over the place. Daddy's motorbike wouldn't start. He and Jessica went to playschool. Jessica was vey excited and wanted Daddy to do everything with her. They drew, glued stuff together at craft, played at the workbench, shared fruit at snack time, and read stories. In fact Daddy read 'Clicl Clack Crocodile's Back' to the whole playschool at storytime. It was really nice for Jessica to see Daddy there.<\/p><p>In the afternoon, the Fars looked after Jessica whilst Mummy and Daddy arrived 45 minutes early for Ben's Nativity play. The early arrival was because Mummy wanted the best seats. Ben played a shepherd and sang a couple of songs. A sweet production. Mummy said he was the cutest, Daddy said he looked like a serving maid!<\/p><img src='images\/years\/2010\/2010_12_01-05-BenNativityPlay.jpg' class='diaryImage' alt='Ben the shepherd' \/><p class='diaryImageCaption'>Ben the shepherd<\/p><p>After picking the children up from school and delivering Evie Sanders' advent candle we went to the Fars for a cup of tea and to pick Jessica up.<\/p>","images":false},"title":{"value":"Ben's Nativity, Daddy back to school"},"version":1},{"date":{"d":28,"m":11,"y":2010},"datev":20101128,"images":1,"info":{"content":"<p>After church, we headed up to London for the celebration of advent at the Christmas Bazaar inside the Danish YMCA. It was really busy and crowded, but managed to navigate our way around the Christmas and food stalls. We met with the Fars and sat in the cafe eating some æbleskive (pancake ball things), smørbrød (open sandwich) with a tipple of glogg (mulled wine). Mmm.<\/p><p>We bought some small bits and pieces, Mummy almost fainted when she had to pay £3 for a packet of crisps. After a few circulations, we headed outside for a hot pølser (sausage), before returning home via the London Christmas lights.<\/p><img src='images\/years\/2010\/2010_11_28-01-DanishBazaar.jpg' class='diaryImage' alt='Eating Danish Food' \/><p class='diaryImageCaption'>Eating Danish Food<\/p>","images":false},"title":{"value":"Danish Christmas Bazaar"},"version":1},{"date":{"d":27,"m":11,"y":2010},"datev":20101127,"info":{"content":"<p>We first headed over to Elvetham Heath to drop Katie off at Leah's sister's 9th Wii birthday party. They played the Wii pretty much for the whole 2.5 hours!<\/p><p>Meanwhile the rest of us went over to the Sanders for a chat, a play and some lovely Christmassy lunch. The Elders joined us for the Father Christmas arrival at Redfields Garden Centre. It was packed out. We saw the Vince's in there as usual, along with some animals from the mobile farm which Ben and Jessica really enjoyed.<\/p>","images":false},"title":{"value":"Redfields Santa Visit"},"version":1},{"date":{"d":23,"m":11,"y":2010},"datev":20101123,"info":{"content":"<p>Daddy went to watch Jimmy Eat World with Duncan, Leanne, Evan. Fantastic night. Song of the night was 'Praise Chorus'. Duncan and Evan were rocking. So nice to see all three enjoying the same thing.<\/p><div class=\"youtube\"><object width=\"640\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/deC87rLihJQ?fs=1&amp;hl=en_GB\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/deC87rLihJQ?fs=1&amp;hl=en_GB\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"640\" height=\"385\"><\/embed><\/object><\/div>","images":false},"title":{"value":"Jimmy Eat World - Brixton Academy"},"version":1},{"date":{"d":21,"m":11,"y":2010},"datev":20101121,"images":1,"info":{"content":"<p>Daddy and Auntie Ellie rose early for a morning run. However, not knowing the area they made the route up as they went along. 10km later they eventually turned up back at the hotel via some nice countryside and almost got mown down by an HGV truck as they run on the main trunk road to the motorway!<\/p><p>We were hungry for breakfast, so made our way to McDonalds in Stroud, via Sainsbury's and a stroll around Stroud. The kids were euphoric, whilst Daddy was a little less enthusiastic. After filling our mouths with Grease, we headed to the Cotswolds Country Park.<\/p><p>It was bitterly cold so we weren't long at the playground, before heading off back home.<\/p><img src='images\/years\/2010\/2010_11_21-10a-CotswoldWaterPark.jpg' class='diaryImage' alt='The Weekend Crew' \/><p class='diaryImageCaption'>The Weekend Crew<\/p>","images":false},"title":{"value":"Cotswold Country Park"},"version":1},{"date":{"d":20,"m":11,"y":2010},"datev":20101120,"images":1,"info":{"content":"<p>We joined up with the Elders to spend the weekend visiting Charlotte and her boyfriend Luke. We met in Stroud for a cup of tea and for some reason Mummy wanted to look at Wilkinson's! We moved onto our nearby hotel in Eastington and began a GeoCache hunt. This took us along a canal and onto a graveyard. It took a while to find the treasure, however, Auntie Ellie eventually found it and we added our names to the list.<\/p><img src='images\/years\/2010\/2010_11_20-14-Stonehouse.jpg' class='diaryImage' alt='Katie ghosting in the graveyard!' \/><p class='diaryImageCaption'>Katie ghosting in the graveyard!<\/p><p>It was getting dark so we returned to the hotel, unpacked and got ready to head to Cheltenham. We arrived at Luke's house where Charlotte was part lodger, part worker and part girlfriend! She cooked a large curry which was far too hot for Daddy, but everyone else enjoyed it. Luke was really nice and easy to talk to and the two of them made a good couple.<\/p><p>Us children had a great time playing around with each other, sliding around on the floors, watching Strictly and just having fun. Jessica and Lily went to bed, whilst we finished ice cream desert.<\/p><p>A really nice evening. Thanks to Charlotte.<\/p>","images":false},"title":{"value":"Charlotte Evening"},"version":1},{"date":{"d":14,"m":11,"y":2010},"datev":20101114,"images":1,"info":{"content":"<p>Daddy went for another early turn at work, whilst the rest of us also got up early to drive to Gravesend to fetch Katie. We had the normal service at 9:30, the Rememberance service at 11, then a baptism party in the afternoon. We had great time at the party making loads of craft stuff!<\/p><img src='images\/years\/2010\/2010_11_14-06-BaptismParty.jpg' class='diaryImage' alt='What angles' \/><p class='diaryImageCaption'>What angles<\/p>","images":false},"title":{"value":"Church, Church, Church"},"version":1},{"date":{"d":13,"m":11,"y":2010},"datev":20101113,"images":1,"info":{"content":"<p>Daddy and Ben went to Football pracetice in the morning. Ben really enjoyed himself and joked with some of the others down there, all of whom he hasn't met previously.<\/p><p>Whilst Daddy went to Southampton to pickup his new Kayak, Karen, Summer and Alice came around to pickup Katie who went to the Teale household for the night. She watched Strictly Come Dancing, played Sylvainian families, had loads of sweets and goodies and stayed upto midnight watching Grease. Needless to say she enjoyed herself thoroughly.<\/p><p>The Fars came over to babysit Ben and Jessica, whilst Mummy and Daddy went out to the final leg of Come Dine With Me at the Elders. They really pushed the boat out with a firepit where we roasted chestnuts and marshmellows, there was a racing a chinese lantern and of course a lovely three course meal. All the scores were totted up from all the rounds and we....... came last. The results were the Glidewell's, the Sanders follwed by the Elders and the Gay's bringing up the rear.<\/p><img src='images\/years\/2010\/2010_11_13-01-ElderComeDineWithMe.jpg' class='diaryImage' alt='Happy eaters' \/><p class='diaryImageCaption'>Happy eaters<\/p>","images":false},"title":{"value":"Football, Kayak Pickup, Teale Sleep Over, Elder Come Dine With Me"},"version":1},{"date":{"d":8,"m":11,"y":2010},"datev":20101108,"images":1,"info":{"content":"<p>Katie was sworn in for her Brownie pack today. She has been going for 3 months now and quite enjos it. She's looking forward to attempting some of the badges.<\/p><img src='images\/years\/2010\/2010_11_08-01-BrowniePromiseCeremony.jpg' class='diaryImage' alt='Katie with her sixer and buddy' \/><p class='diaryImageCaption'>Katie with her sixer and buddy<\/p>","images":false},"title":{"value":"Katie's Brownie Promise Ceremony"},"version":1},{"date":{"d":7,"m":11,"y":2010},"datev":20101107,"images":3,"info":{"content":"<p>We headed early to Kent. Mummy took Ben to Southfleet church where she met up with Ma Ma and Pop Pop. Meanwhile the others went to buy treats for the afternoon.<\/p><p>The girls plus Pop Pop had a Sunday roast before having a nice afternoon in playing.<\/p><p>Meanwhile Daddy and Ben went off to Thurrock to watch Firecracker XIX, a big Banger event. We met up with the late coming Fars. It was Ben's first real time at a Banger meeting. Daddy thought he'd love it. There must have been 4 or 5 thousand people there. On the card were 10 races, including unlimited Bangers, a few Robin Reliant races and of course the Destruction Derby. We were not disapointed by the action. Ben's favourites were:<\/p><ul><li><i>Bangers<\/i>Because the cars were so big Ben loved it when the track was blocked so the cars had to bash a route through!\u000a        <\/li><li><i>Robins<\/i>When they turned over the stewards ran over and pushed them the right way up again!\u000a        <\/li><li><i>Pits<\/i>We get close to the bashed up cars!\u000a        <\/li><\/ul><img src='images\/years\/2010\/2010_11_07-12-FirecrackerXIX.jpg' class='diaryImage' alt='Burger King' \/><p class='diaryImageCaption'>Burger King<\/p><img src='images\/years\/2010\/2010_11_07-22-FirecrackerXIX.jpg' class='diaryImage' alt='Ben's dream car' \/><p class='diaryImageCaption'>Ben's dream car<\/p><img src='images\/years\/2010\/2010_11_07-30-FirecrackerXIX.jpg' class='diaryImage' alt='A pair of Robins' \/><p class='diaryImageCaption'>A pair of Robins<\/p><p>We moved around the track a bit to get some good spots to see, Ben always had the best place on Daddy's shoulders! Farfar queued for 45 minutes to get Ben a burger, and of course he got himself one as well! There were long gaps between the races, luckily Farmor bought some cakes and coffee.<\/p><p>Overall we saw loads of crashes, next year we'll bring some crates to stand on. We can't wait for next year.<\/p>","images":false},"title":{"value":"Firecracker XIX"},"version":1},{"date":{"d":6,"m":11,"y":2010},"datev":20101106,"images":1,"info":{"content":"<p>This weekend was 'boyley' orientated, focused around boys stuff. In the morning Daddy took Ben to football training which was back at Frimley. Jessica came along to watch as well. They did football skills for the first 40 minutes. At one point Ben came last in a task which meant a forefeit which he didn't want to do. It was a little humiliating for him to run 20 metres like a chicken. Straight after he cried and wanted to go home. That tactic of the coaching staff was unsuccessful with the three children they tried it on. Ben finished with a flurish in the game and looks forward to next week, of course wearing his Denmark kit.<\/p><p>In the afternoon the same team went out to watch the Tempest Rally picking up Daddy's friend Michael on the way. Dolly Daddy got the timings a little bit out so only saw a couple of cars in the Warren stage! We then all went over to the Yateley stage and waited patiently for the 4 wheel drive cars and the impressive 2 wheel cars. Daddy loved seeing his old Escort go through. Ben and Jessica had fun scrambling around in the woods. Ben must have gone for a wee about 10 times!<\/p><img src='images\/years\/2010\/2010_11_06-25-TempestRally.jpg' class='diaryImage' alt='King of the road - Ford Escort' \/><p class='diaryImageCaption'>King of the road - Ford Escort<\/p><p>In the evening we went to Ravenscote School for their firework display. We met up with Susan, Graham and the Fars. I think for the first time, none of us felt scared and so we were all able to enjoy the 20 minute display. All very pretty. It was extremely busy.<\/p>","images":false},"title":{"value":"Tempest Rally - Fireworks"},"version":1},{"date":{"d":5,"m":11,"y":2010},"datev":20101105,"images":1,"info":{"content":"<p>When daddy got home from work we 'sparkled'!<\/p><img src='images\/years\/2010\/2010_11_05-03-Sparklers.jpg' class='diaryImage' alt='The Sparklers' \/><p class='diaryImageCaption'>The Sparklers<\/p>","images":false},"title":{"value":"Sparklers"},"version":1},{"date":{"d":31,"m":10,"y":2010},"datev":20101031,"images":2,"info":{"content":"<p>In the afternoon we had a Halloween party and the participants for this slightly frenetic, mad affair were the Fars, Ma Ma and Pop Pop, the Elders, Lise, Jørgen and Julie.<\/p><p>First was Halloween bingo, followed by apple bobbing, then dangling doughnuts and pin the wart on the witch! The funniest things were seeing the adults attempting to eat the doughnuts and watching Farfar lumber to the apple bobbing like an elephant to a trough of water!<\/p><p>The fars dropped off home whilst the rest of us conveyed around the area trick or treating. First stop was an unwell Uncle Peter, then Great Grandma's where we had some excellent ginger cake. We stopped off quickly at Paula's before surprising Auntie Sue and Richard. It was scary around the Fars, but Uncle Howard felt the full force of the team when he refused to open the door. we thought it highly ammusing stuffing our sweet wrappers through his letterbox. He had some feeble excuse of not being in because he thought Halloween was yesterday!<\/p><img src='images\/years\/2010\/2010_10_31-11-Haloween.jpg' class='diaryImage' alt='Doughnuts!' \/><p class='diaryImageCaption'>Doughnuts!<\/p><img src='images\/years\/2010\/2010_10_31-18-Haloween.jpg' class='diaryImage' alt='Mummy' \/><p class='diaryImageCaption'>Mummy<\/p>","images":false},"title":{"value":"Halloween Party"},"version":1},{"date":{"d":30,"m":10,"y":2010},"datev":20101030,"images":1,"info":{"content":"<p>In the morning Daddy and Katie biked through the woods to Rollerskating down at Tomlinscote school. We were the only ones not dressed in Halloween gear! We played 'it'. After we looked around Tomlinscote School. It's got so much bigger. Katie then decided we should pop into the Fars, where Lise, Jørgen and Julie were staying for the week. We had some food and a nice chat before returning home for lunch.<\/p><p>In the early afternoon we went into Farnborough for provisions and a spot of swimming. Again it was such a laugh. Everyone loves a splash about.<\/p><p>Later in the afternoon, the Danish came around to visit. Katie got on particularly well with Julie, although it was difficult to communicate with one another. It was good to see nothing has changed, Jørgen still enjoying his beer and fags, whilst Lise was very into everything.<\/p><img src='images\/years\/2010\/2010_10_30-10-LiseJorgen' class='diaryImage' alt='Lise, Julie and the crew' \/><p class='diaryImageCaption'>Lise, Julie and the crew<\/p>","images":false},"title":{"value":"Rollerskating, Swimming, Lise and Jørgen"},"version":1},{"date":{"d":24,"m":10,"y":2010},"datev":20101024,"images":2,"info":{"content":"<p>Another three games of Stratego before 9am! In the morning we went to the church that Mummy and Daddy were married, for the morning service.<\/p><p>In the afternoon we went down to Babar and set sail along the Medway heading east towards Chatham. It was pretty cold, but there were bright blue skies overhead. The children were everywhere.<\/p><img src='images\/years\/2010\/2010_10_24-07-Sailing.jpg' class='diaryImage' alt='Katie on Babar' \/><p class='diaryImageCaption'>Katie on Babar<\/p><img src='images\/years\/2010\/2010_10_24-30-Sailing.jpg' class='diaryImage' alt='Mummy and a laughing Jessica' \/><p class='diaryImageCaption'>Mummy and a laughing Jessica<\/p>","images":false},"title":{"value":"Sailing on the Med"},"version":1},{"date":{"d":23,"m":10,"y":2010},"datev":20101023,"images":1,"info":{"content":"<p>We headed down towards Eastbourne to meet with Ma Ma, Pop Pop and the Elders for a trip to Druscilla's. All the kiddies were loving looking around the animals at first, then moving on to the animal olympics, where the Elders did well in the 'screaming' contest. We played for a long time at the playground area whilst we also had lunch. Later, we went on the Thomas train ride and maze.<\/p><p>In the evening we went back to Ma Ma and Pop Pop's for fish and chips and to stay the night. Daddy and Auntie Charlotte went for a long run.<\/p><p>Ben and Katie were introduced to the board game Stratego. Many a battle was fought. They are obsessed by the game.<\/p><img src='images\/years\/2010\/2010_10_23-31-Druscillas.jpg' class='diaryImage' alt='Ben and Joey climbing the poles' \/><p class='diaryImageCaption'>Ben and Joey climbing the poles<\/p>","images":false},"title":{"value":"Druscilla's"},"version":1},{"date":{"d":17,"m":10,"y":2010},"datev":20101017,"info":{"content":"<p>Daddy worked for the 3rd Sunday out of 5. The rest of us had church. When Daddy returned, Mummy, Ben and Jessica went to Tia's 4th birthday party at the catholic church. Tia is a good friend's Jessica's from playschool. Her first friend that she has choosen from herself.<\/p><p>Meanwhile Katie wanted to cycle through the woods to the Fars. It was a lovely ride. Farmor was in and we sat in the back garden colouring in and having a cup of tea.<\/p>","images":false},"title":{"value":"Jessica's to birthday party, Katie bike ride"},"version":1},{"date":{"d":16,"m":10,"y":2010},"datev":20101016,"info":{"content":"<p>The weather is turning and getting cold. In the morning Daddy and Jessica went into Farnborough and got some bread and a packet of eye patches from the fancy dress shop. The eye patches are for Daddy who is going to try and strengthen the muscles in his lazy left eye.<\/p><p>In the afternoon we went to St Georges excellent playground and then onto swimming. We of course had a great laugh with the mats playing crocdiles and generally mucking around. Jessica was performing some expert slow rolly polies from the edge of the pool into the water. It was the funniest thing ever. Daddy knew he should stop her from doing it, but it was so funny he had to leave it to the lifegaurd to tell her to stop it!<\/p><p>The evening again was taken up by Strictly Come Dancing, Katie stylishly and elegantly gracing the dance floor, Ben and Jessica end up going round in circles as quickly as possible and then wrestling on the floor!<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":10,"m":10,"y":2010},"datev":20101010,"images":1,"info":{"content":"<p>In the morning Daddy took Jessica on the bike of his bike and decided to go on a new river route in our quest to do as many river side rides as possible.<\/p><p>We started at Shalford and headed north up the River Wey, through Guildford up to Send. It was really tough and Daddy over-estimated what could be achieved. By half way he was beginning to feel dizzy and very hungry. Jessica was excellent company and was chatting, tickling and singing for most of the way. We stopped off a number of time to share the water. We spotted lots of wildlife from ducks in the water to cows lying right by a fence in a farmers field. Next stage is Send to Byfleet.<\/p><p>The rest of us had two church services; the normal and later a children's service. We walked home.<\/p><p>In the afternoon we had a nice time going for a walk around the estate and played by the garage.<\/p><img src='images\/years\/2010\/2010_10_01-BenStory-BeastQuestSnakeDog.jpg' class='diaryImage' alt='A Beast Quest Story by Ben Gay' \/><p class='diaryImageCaption'>A Beast Quest Story by Ben Gay<\/p>","images":false},"title":{"value":"Shalford - Send: River Wey"},"version":1},{"date":{"d":9,"m":10,"y":2010},"datev":20101009,"images":1,"info":{"content":"<p>The Elders came over in the morning and we went to SkateJam at Tomlinscote. It was Joey's first atempt and he was able to do it by himself come the end. Meanwhile Daddy went for an 8 mile jog for some reason!<\/p><p>After lunch we then all ventured over to Brooklands to scoot and ride our bikes. WE also went in the playground for a bit. Mummy got us lost on the way back. Daddy went to watch Chertsey beat Croydon 4-1. They're top of the league.<\/p><img src='images\/years\/2010\/2010_10_09-05-Brooklands.jpg' class='diaryImage' alt='Jessica and Lily playing around Brooklands' \/><p class='diaryImageCaption'>Jessica and Lily playing around Brooklands<\/p>","images":false},"title":{"value":"Skate Jam and Brroklands with Elders"},"version":1},{"date":{"d":3,"m":10,"y":2010},"datev":20101003,"images":1,"info":{"content":"<p>Daddy went to work again to earn some extra cash for the kayak.<\/p><p>In the afternoon we went for a really long autumn walk through the woods down to the Warren estate and back again. Us children did really well especially up that big hill at the end.<\/p><p>Katie rollerscated which was interesting in the woods, Ben went on his bike, which was interesting next to the main road - we had to tell him to get off as he was making the rest of us nervous with his constant uncontrolled weaving from side to side, and Jessica had her scotter, which she used for about 30 seconds!<\/p><img src='images\/years\/2010\/2010_10_03-01-WoodsWalk.jpg' class='diaryImage' alt='Ben biking through the woods' \/><p class='diaryImageCaption'>Ben biking through the woods<\/p>","images":false},"title":{"value":"Daddy To Work - Longest walk ever"},"version":1},{"date":{"d":2,"m":10,"y":2010},"datev":20101002,"info":{"content":"<p>In the morning Daddy took Katie and Jessica over to the Fars to wreck the house and go for a nice walk around the estate. In the meantime Muumy and Ben went to the shops for a couple of things.<\/p><p>In the afternoon Ma Ma and Pop Pop came over to play. We went for a rollerskate and bike ride.<\/p>","images":false},"title":{"value":"Over to the Fars, Ma Ma and Pop Pop over"},"version":1},{"date":{"d":26,"m":9,"y":2010},"datev":20100926,"images":1,"info":{"content":"<p>Great Grandma and Grandad came over for a Gay Sunday lunch which was BBQ'ed pork. The Elder's came over a little later on as well.<\/p><img src='images\/years\/2010\/2010_09_26-02-SundayLunch.jpg' class='diaryImage' alt='Sunday lunch with Great Grandad and Grandma' \/><p class='diaryImageCaption'>Sunday lunch with Great Grandad and Grandma<\/p>","images":false},"title":{"value":"Great Grandma and Grandad over for Sunday Lunch"},"version":1},{"date":{"d":25,"m":9,"y":2010},"datev":20100925,"images":1,"info":{"content":"<p>Mummy had found a scarecrow festival in Horley which was about an hour away in the car. We arrived walked through the town of Horley. There were a few stalls and a few scarecrows and a mad women on the PA system. Overall we were not that impressed, so after an hour we moved on.<\/p><p>We found a nice spot in White Bushes where there was a swing park and a chance for us to eat our picnic. Autumn was arriving, and although sunny it was a little on the chilly side. Us three children played nicely together.<\/p><p>We again moved on a little further this time stopping at the favoured spot of Reigate Park. A new one for daddy. And he had to admit it was a good playground. We were on the tyre swings for ages before going on the zip slide and climbing the crows nest on the boat. We left and headed for the 'ramps'. All three of us had scooters with us. After many aborted attempts, Ben braved going on the busy ramps on his scotter. Mummy couldn't bare to look, worrying that he was going to get knocked by one of the other children. He absolutely loved it. He described something like, 'my heart was beating so fast it felt like it had stopped.'.... that sounds like he had an adrenaline rush!<\/p><p>On the way home we again stopped off at Reigate Hill for a sleep on the hill for Mummy and Daddy and an opportunity to do backwards rollie pollies.<\/p><img src='images\/years\/2010\/2010_09_25-30-Reigate.jpg' class='diaryImage' alt='Backwards Rollie Pollies' \/><p class='diaryImageCaption'>Backwards Rollie Pollies<\/p>","images":false},"title":{"value":"Horley Scarecrow Fete - Reigate Park"},"version":1},{"date":{"d":19,"m":9,"y":2010},"datev":20100919,"images":2,"info":{"content":"<p>Daddy did another very early shift at work - 6am start! He's trying to save up for a kayak. Meanwhile we went to church.<\/p><p>In the afternoon we battled through the traffic and parked right outside Millbank Tower. We had a scooter, pushchair and bikes and rode along the Thames to the Houses Of Parliament, stopping off of course at some swings which we found on the way.<\/p><p>We were nervous seeing Ben winding uncomfortably on his bike through the crowds by Westminster bridge where we crossed. A very kind Japanese tourist took a couple of phots of us. He was very helpful.<\/p><img src='images\/years\/2010\/2010_09_19-14-WestminsterSouthBank.jpg' class='diaryImage' alt='Houses of Gay' \/><p class='diaryImageCaption'>Houses of Gay<\/p><p>We headed to South Bank, stopped for a cuppa and a go on the playground, before watching some of the entertainment. I think we were mesmerized by the cat in the hutch. Hard to describe really. We also saw a man with very long arms, a man with 3 legs, some limbo dancers, Elvis and some silver statues.<\/p><p>We then returned back to the car this time going along the south path of the Thames and crossing Lambeth bridge. Jessica was showing off her 'tooter' skills, by racing along and then lifting one leg in the air. She's copied this off her older siblings. She's so cute!<\/p><img src='images\/years\/2010\/2010_09_19-22-WestminsterSouthBank.jpg' class='diaryImage' alt='Jessica's got the skills' \/><p class='diaryImageCaption'>Jessica's got the skills<\/p>","images":false},"title":{"value":"Westminster and South Bank"},"version":1},{"date":{"d":18,"m":9,"y":2010},"datev":20100918,"info":{"content":"<p>Leah sumner came over in the morning and we split straight away. Mummy took Ben and Jessica to Sofia's 4 th birthday party held at Jake's softplay, whilst Daddy took Katie and Leah to Tomlinscote for SkateJam. It was packed there, must have been 50 children skating around in circles. Katie getting more and more confident. She is able to go around now quite steadily. Daddy helped Leah around and tried to teach her how to skate. In the end Leah was able to go across the hall by her self, without falling over or holding onto anything.<\/p><p>The weather was good in the afternoon so went around Dettingen estate and played on the swings. Katie and Leah played an extensive game of teachers. Jessica and Ben made dens, plaster of paris figures and generally a lot of mess!<\/p><p>After watching Matilda (Daddy having just read the book to us) we went to bed in our den!<\/p>","images":false},"title":{"value":"Skate Jam, Sofia's 4th birthday, Leah Sumner over to stay"},"version":1},{"date":{"d":14,"m":9,"y":2010},"datev":20100914,"first":{"name":"jessica","value":"First day at playschool"},"images":1,"info":{"content":"<p>Jessica has been ready for playschool for a while, but due to the waiting list, but now she is 3 she has risen to top of the list. She has had a few taster sessions with Mummy and all have gone well. Today she was going to be left! We had a little trouble with Ben and especially Katie at this bit, however, Jessica took it all in her stride and was ready to immerse herself in all the toys.<\/p><p>Reports back from the teacher was that she had a good time and behaved herself very well. Mummy for the first time in 7 years has now got a couple of hours free, three times a week to herself!<\/p><img src='images\/years\/2010\/2010_09_14-02-JessicaFirstDayAtPlayschool.jpg' class='diaryImage' alt='Ready and waiting for playschool' \/><p class='diaryImageCaption'>Ready and waiting for playschool<\/p>","images":false},"title":{"value":"Jessica starts playschool"},"version":1},{"date":{"d":12,"m":9,"y":2010},"datev":20100912,"images":3,"info":{"content":"<p>40 years ago, the Fars were married with a congregation of 13 people. Today there were 13 of us who set sail from Shepperton up the Thames on a nice little boat. The weather thankfully was good which made all the difference and allowed us to stay outside and marvel at the rich boy houses which lined the river. Farfar was first to drive us as we went through a number of locks and navigated around a few nutter sail boats.<\/p><p>We stopped off at The Wier pub for a nice spot of lunch and worrying about being moored up next to the 'Valhalla' barge. The ladies looked mean, the barge was mat black all over. Farfar did his best to sink us when mooring up in Molesey lock. It was rather a heavy brush with the side. Pop Pop on the other hand grounded us when looking for a half time rest. Thankfully after 5 minutes of reverse and moving about the boat we were freed!<\/p><p>On the journey with us were Auntie Susan and Graham, Graham's parents and Ma Ma and Pop Pop. We could climb around on the roof and we all even had a go at steering the boat, although we needed to stand on a chair to see where we were going. We made it as far as Hampton turned around and stopped off by the church for some cake and coffee. Farfar made a little speach and opened the present that we got him, a box!<\/p><p>We were dropped off back at Shepperton, leaving the Fars to sail off into the sunset to return the boat back to the marina. A thoroughly nice time had by all.<\/p><img src='images\/years\/2010\/2010_09_12-02-ChrisJetteRubyThames.jpg' class='diaryImage' alt='Chris and Jette's Wedding 1' \/><p class='diaryImageCaption'>Chris and Jette's Wedding 1<\/p><img src='images\/years\/2010\/2010_09_12-10-ChrisJetteRubyThames.jpg' class='diaryImage' alt='Chris and Jette's Wedding 2' \/><p class='diaryImageCaption'>Chris and Jette's Wedding 2<\/p><img src='images\/years\/2010\/2010_09_12-90-ChrisJetteRubyThames.jpg' class='diaryImage' alt='Chris and Jette's Wedding 3' \/><p class='diaryImageCaption'>Chris and Jette's Wedding 3<\/p>","images":false},"title":{"value":"Fars Ruby Wedding Aniversary"},"version":1},{"date":{"d":11,"m":9,"y":2010},"datev":20100911,"images":1,"info":{"content":"<p>Jessica didn't really comprehaned that she was 3 today, but she did know she would be eventually getting a 'tooter' (scooter). We awoke standard time, Jessica a little weary opening here presents in Mummy and Daddy's bedroom. Along with the 'tooter' she got a Peppa Pig umbrella and some Peppa Pig figures that she likes playing with her dolls house.<\/p><p>After a couple of 'happy birthday' phone calls, and a nice visit from the Sanders, Mummy and Ben went off to Waitrose with a tin collecting for Grandad's Wing charity. The rest of us went around to the Far's house to destroy it for a bit! Climbing the tree in the front garden is the main attraction at the moment.<\/p><p>After a spot of lunch we all prepared for the party which was to be held on the patch of park opposite our house. An ingenious plan as it gave us room to spread out. We pitched the gazebo up, got table and chairs and a load of outdoor toys. The weather thanfully had improved quite considerably. Daddy was on BBQ duty and we had about 20 guests.<\/p><p>Jessica had Joey, Lily, Summer, Alice, Thomas and Natasha to play with. We did 'parcel parcel', but mainly we played on the playground and Uncle Michael's make up parlour! We sang happy birthday and cut the cake. The older ones later played football. Thomas displaying his no mercy, savage tackling tactics! Ben was bouncing around the goal, he was pretty excited whenever the ball came close to him. Never quite sure if it was excitement or he just needed the toilet!<\/p><woops woopstitle=\"Both great grandparents kiss two random children instead of their great grandchildren!\" rating=\"6\"><p>Continuing playing football, a boy of about 10 and girl of 8 asked if they could join in. we of course said yes. This was getting to the end of the party and Great Grandma and Grandad were heading off home. They came around to say goodbye to everyone. They got a little confused, grandad gave a hug to the girl, which we thought was a bit friendly, then gave her a kiss goodbye and talked to her probably thinking she was Katie. Daddy and Uncle Michael were a little stunned. Grandma then doddered over and done exactly the same thing. The poor girl didn't know what had hit her. Surrounded by a load of strangers and two old people who they didn't know coming to give her a kiss goodbye. The girl sloped away 5 minutes later!<\/p><\/woops><p>A good time had by all. Thanks so much for the lovely presents, and for all those making the effort to come. Jessica is a lucky girl to have so many friends.<\/p><img src='images\/years\/2010\/2010_09_11-30-Jessica3rdBirthday.jpg' class='diaryImage' alt='Cake blowing out' \/><p class='diaryImageCaption'>Cake blowing out<\/p>","images":false},"title":{"value":"Jessica's 3rd Birthday Party"},"version":1},{"date":{"d":9,"m":9,"y":2010},"datev":20100909,"first":{"name":"jessica","value":"Ballet"},"info":{"content":"<p>Jessica has been saying she has wanted to do ballet for ages. We enrolled her into the same classes Katie went to a few years back. She loves it.<\/p>","images":false},"title":{"value":"Jessica starts ballet"},"version":1},{"date":{"d":5,"m":9,"y":2010},"datev":20100905,"images":1,"info":{"content":"<p>Mummy and Daddy returned in the afternoon after a shopping trip in Swindon. Daddy got a couple of work trousers and mummy a rain coat.<\/p><p>We all went to the swings with Ma ma.<\/p><img src='images\/years\/2010\/2010_09_04-18-Bath.jpg' class='diaryImage' alt='Biking Benny' \/><p class='diaryImageCaption'>Biking Benny<\/p>","images":false},"title":{"value":"Ma ma look after us"},"version":1},{"date":{"d":4,"m":9,"y":2010},"datev":20100904,"images":1,"info":{"content":"<p>Mummy and Daddy treated themselves to celebrate their tin wedding anniversary by going to Bath for the day and an overnight stay in a hotel. Ma Ma therefore dared to come over the night before and look after us for the day. We were excited at the prospect of this and weren't bothered at all that Mummy and Daddy were off although we kept in regular contact with them through out the day.<\/p><p>After waving Mummy and Daddy off, we went over to pick Uncle Peter up as he was to look after us as well. We first went to Farnborough to do some Tenpin bowling, then went into the softplay in the leisure centre. One we hadn't been to before. Later in the afternoon we dropped Katie off at Alistair Rushforth's, whilst the four of us went around to Farmor's house for a chat and a play.<\/p><p>In the evening we read stories until quite late.<\/p><p>Meanwhile, Mummy and Daddy eventually got into Bath and first walked through the city centre streets and went in to the Jane Austin museum which Mummy enjoyed. She bought the book Persuasion. After a posh baguette, they strolled around and ended at the Spa. There was a roof top spa which was heated lovely, and had views onto the hills around Bath. There was also lots of steam rooms and a big spa pool on the bottom floor. Mummy and Daddy enjoyed their two hours in there. The famous tea rooms, Sally Lunns was next where they both went for one the big buns. Walking by the river, there was a game of lacross by the rugby ground, so decided to stop by and watch. It was a pretty agressive. A pub was found for dinner. Daddy had some lovely lamb. Mmmm. They stayed in the Travelodge hotel on the M4. How romantic.<\/p><img src='images\/years\/2010\/2010_09_04-11-Bath.jpg' class='diaryImage' alt='Bath' \/><p class='diaryImageCaption'>Bath<\/p>","images":false},"title":{"value":"Ma Ma and Uncle Peter Babysit - Mummy and Daddy off to Bath"},"version":1},{"date":{"d":2,"m":9,"y":2010},"datev":20100902,"images":1,"info":{"content":"<p>What a ten years - 3 children, 2 houses and 1 wedding. Not a big thing made of it other than a card each.<\/p><p>It was also Katie's first day at Frimley C of E - Year 3. Hard to get any information about how the day has gone. She is in Mrs Cope's class. She sit's next to Leah Sumner. She got a homework diary and has now started French, Science and Personal, Social, Health Education lessons.<\/p><p>Ben is in Year 1 and in Mrs Sollars' class. Something a bit dodgey goes on for registration. There are 11 year 1 pupils which go down into reception for registration, to make it look as though there are additional children in the lower year. He's on Panda table, with 33 in his class.<\/p><img src='images\/years\/2010\/2010_09_02-08-FirstDaySchool.jpg' class='diaryImage' alt='First Day Back At School' \/><p class='diaryImageCaption'>First Day Back At School<\/p>","images":false},"title":{"value":"10 Year Wedding Anniversary - Back To School"},"version":1},{"date":{"d":30,"m":8,"y":2010},"datev":20100830,"images":2,"info":{"content":"<p>In the morning Daddy and Jessica went on a lovely bike ride along the Thames from Old Windsor to Windsor. There was not a cloud in the sky. We went back via Windsor Castle.<\/p><img src='images\/years\/2010\/2010_08_30-06-MartinJessicaWindsorBikeRide.jpg' class='diaryImage' alt='Jessica on a bridge in Datchet' \/><p class='diaryImageCaption'>Jessica on a bridge in Datchet<\/p><p>We were invited over to Warrendale by Peter and Norma Garrett along with the Elders. We had a great time playing all around the house and garden. We were all over the place.<\/p><img src='images\/years\/2010\/2010_08_30-08-PeterNormaGarrett.jpg' class='diaryImage' alt='Garrett, Elder and Gay lineup' \/><p class='diaryImageCaption'>Garrett, Elder and Gay lineup<\/p><p>Later, Joey and Lily came over to stay with us for the night.<\/p>","images":false},"title":{"value":"Over to Warrendale, Joey and Lily over to stay the night"},"version":1},{"date":{"d":29,"m":8,"y":2010},"datev":20100829,"info":{"content":"<p>We sent Daddy off early to work, leaving us to go to an extended church service. In the afternoon we went off to Farnborough swimming. We had a great time there. The last of the free swims for us children.<\/p>","images":false},"title":{"value":"Daddy to work, Swimming"},"version":1},{"date":{"d":28,"m":8,"y":2010},"datev":20100828,"images":1,"info":{"content":"<p>In the morning Daddy set us all a challenge. Daddy was to jog about 1.5 miles. Katie and Ben were to keep track and set the pace on their bikes. Mummy had to get to Colony Gate before Daddy went to the Red Road roundabout and back again.<\/p><p>Katie faultered immediately and decided not to go by bike, instead choosing her scooter. Ben did very well on his bike keeping up with Daddy barking encouragment whilst jogging. Ben found it a little hard to go up the slight inclines, but he never gave up. The boys beat the slow girls to Colony Gate. Muumy citing Jessica's non biking and walking policy as the main reason for their failings!<\/p><p>All five of us then went to Tomlinscote and Skate Jam. There were not many there to begin with and only Mummy and Katie wanted to participate. However, bith Ben and Jessica were running round with the skaters. Ben was also getting into photography again and taking pictures of everyone!<\/p><img src='images\/years\/2010\/2010_08_28-09a-SkateJam.jpg' class='diaryImage' alt='Skate Jam' \/><p class='diaryImageCaption'>Skate Jam<\/p><p>After lunch we split. Daddy went off to watch Chertsey play Chatham in the FA Cup, whilst the rest of us went to Reigate Park and met up with the Teale's.<\/p>","images":false},"title":{"value":"Meet up with the Teale's"},"version":1},{"date":{"d":22,"m":8,"y":2010},"datev":20100822,"images":2,"info":{"content":"<p>We went around to the Far's house for a long breakfast and present opening. Mummy and Ben went off to church. We loved climbing the tree out the front of the house. Katie got stuck up there twice! Jessica called them monkeys.<\/p><img src='images\/years\/2010\/2010_08_22-01-FarfarBirthday.jpg' class='diaryImage' alt='A birthday treat for Farfar' \/><p class='diaryImageCaption'>A birthday treat for Farfar<\/p><p>In the afternoon we went to the Barnett family picnic which was held at Staines Llamas park where the sprayground was. We loved it in there. Frazer pushed Daddy through the rainbow bit twice which meant he got soaked! It was nice to see Peter and Norma there. We played a big game of cricket. Daddy was out with two golden ducks. We played with Felicity and Frazer and of course Joey and Lily.<\/p><p>After our picnic we had a go on the train and had some lovely lollies before dipping back into the sprayground!<\/p><img src='images\/years\/2010\/2010_08_22-04-FamilyPicnic.jpg' class='diaryImage' alt='Frazer and Jessica' \/><p class='diaryImageCaption'>Frazer and Jessica<\/p>","images":false},"title":{"value":"Farfar's 64th Birthday - Family Picnic"},"version":1},{"date":{"d":21,"m":8,"y":2010},"datev":20100821,"images":1,"info":{"content":"<p>We went over to Ma Ma and Pop Pop's on Friday and stayed the night. All was pretty calm during the nigt except that Katie would not goto sleep. We headed early into Gravesend to look for school accessories. It's been a while since we been there. We stopped off for a drink and a cake at a cafe.<\/p><p>We then moved on to Chatham and to the dissapointing discount village where the got two pairs of school shoes for nearly £40! <\/p><p>We parted ways from Ma Ma and Pop Pop and moved on to see Helen and Nigel's new house which was only around the corner from their previous home. It was huge and of course Nigel's pride and joy was his double garage. Us children enjoyed playing on the Wii. Ben took over on the sword fighting game.<\/p><p>We raced home, picked up Farmor to babysit us, whilst Mummy and Daddy headed down to Littlehampton as the Glidewell's hosted the next round. They did extremely well with their Thai themed meal. We were trying all our tricks with the Fars in order to stay up late. A drink of apple juice, a drink of milk, need the toilet, read a book, read another chapter, etc. They fell for some of them.<\/p><img src='images\/years\/2010\/2010_08_21-18-GlidewellComeDineWithMe.jpg' class='diaryImage' alt='Diners' \/><p class='diaryImageCaption'>Diners<\/p>","images":false},"title":{"value":"Ma Ma and Pop Pop's, The Morley's and Come Dine With Me"},"version":1},{"date":{"d":18,"m":8,"y":2010},"datev":20100818,"info":{"content":"<p>Ben returned the invite to Thomas to come and stay the night which he was very excited about. Bless him, he's desperate to have one of his friends over. Well they got on like a house on fire. No conflicts, just mainly wrestling each other and showing off. It's so nice to see that Ben and Thomas get on really well, especially as we don't see Thomas all that often.<\/p><p>Games mainly involved sword fighting and playing with cars, and being naughty at bed time when they would not go to sleep! For a bit anyway. Mummy and Daddy were struck how well mannered Thomas was ,saying please and thank you and putting stuff in the bin. The 'See you in the morning' comment was very cute. Just need some of those manners to be transfered across onto us lot!<\/p><p>Meanwhile, Katie went over to the Elders to stay for the night to make way for Thomas. Thankfully she handled being away from mummy ok. She loved her stay.<\/p><p>Feel sorry for Ben a bit, despite our efforts, Ben has not seen much of his two closest mates from school, Oliver and Joey, over the holidays. Mummy has invited them both over, however they have not been any return invites and they didn't turn up for his party which Ben was a little upset about. They are also both in a different class to Ben next year. As socialable and likeable Ben is, he does not have many friends and he's not the loner type. We hope he'll make some really good new friends in the next school year.<\/p>","images":false},"title":{"value":"Ben - Thomas Burrows Over To Stay, Katie at overnight at Elders"},"version":1},{"date":{"d":13,"m":8,"y":2010},"datev":20100813,"images":2,"info":{"content":"<p>We went home the scenic route via Weston Super Mare and Bowood. We were going to stop at Bowood but it was quite pricey for what we were going to get out of it. Happy to be home<\/p><img src='images\/years\/2010\/2010_08_13-04-Day8-BowoodJessica.jpg' class='diaryImage' alt='Jessy at Bowood' \/><p class='diaryImageCaption'>Jessy at Bowood<\/p><img src='images\/years\/2010\/2010_08_12-48-Day7-Porlock.jpg' class='diaryImage' alt='The Doniford Crew' \/><p class='diaryImageCaption'>The Doniford Crew<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Homeward Bound"},"version":1},{"date":{"d":12,"m":8,"y":2010},"datev":20100812,"images":2,"info":{"content":"<p>After a swim and some crazy golf we hired out some pedal go-karts which was great fun. We all had a go and taking passengers around the park. Daddy went to go and pick up the car which cost a whopping £350! A new starter motor needed.<\/p><img src='images\/years\/2010\/2010_08_12-09-Day7-Porlock.jpg' class='diaryImage' alt='Would you trust him cycling around?' \/><p class='diaryImageCaption'>Would you trust him cycling around?<\/p><p>A sense of freedom we decided to venture out into Exmoor, although everyone seemed more interested in listening to Mummy's Charlie and the Glass Elevator. We stopped off for a picnic before moving onto a dissapointing and wet Porlock. We parked up expecting a beach or something. Nothing. It was Porlock Weir we wanted. So we shifted down the road.<\/p><p>We loved Porlock Weir. We played around the pill box and walked around the harbour before getting some yummy ice creams.<\/p><img src='images\/years\/2010\/2010_08_12-44-Day7-Porlock.jpg' class='diaryImage' alt='Ice Cream at Porlock Weir' \/><p class='diaryImageCaption'>Ice Cream at Porlock Weir<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Porlock Weir and Exmoor"},"version":1},{"date":{"d":11,"m":8,"y":2010},"datev":20100811,"images":1,"info":{"content":"<p>Daddy was organising for the car to get towed away to a local garage this morning, whist the rest of us went swimming and soft playing.<\/p><p>Early afternoon we decided to get the bus again into Minehead. We coincidently picked a day when the Red Arrows were doing their display. We walked down the nice, but busy high street, spending Uncle Steven's birthday money on a body board. We made the promenade where there seemed to be thousands of people lining the beach wall waiting for the aerobatics display. Katie, Ben and Jessica didn't seemed all that bothered by the Red Arrows whilst Mummy and Daddy watched the 20 minute show. After, we headed onto the beach and played around before heading to the supermarket for more food and a long bus journey home. Mummy read Charlie And The Glass Elevator to everyone on the bus it seemed.<\/p><img src='images\/years\/2010\/2010_08_11-02-Day6-Minehead.jpg' class='diaryImage' alt='Minehead Beach' \/><p class='diaryImageCaption'>Minehead Beach<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Minehead"},"version":1},{"date":{"d":10,"m":8,"y":2010},"datev":20100810,"images":1,"info":{"content":"<p>It was raining quite a bit today. Without the car we first went for a swim of course then caught the bus into the local village, Watchett. We wandered around the harbour before surprisingly going into a little cafe for lunch.<\/p><p>We returned back to camp and went to watch the wrestling which we enjoyed immensely. Ben returned wanting to be a wrestler! Surprise, surprise.<\/p><p>We finally headed on to the beach adjoining the holiday park. It wasn't really a beach that anyone sunbathed or swum from. It was rocky and the water was quite muddy. Not really very inviting. Daddy tried to build a dam on one of the streams reaching into the sea. It started to rain. Daddy and Katie went for a long walk in the sea upto Doniford. It wasn't the nicest of beaches to walk across. Alot of building rubble there. However, the waves were crashing in. Daddy really enjoyed his walk with his eldest.<\/p><p>We got back and went Aqua Gliding which was like a junior, inflatable jet ski. This was held in the swimming pool and involved the instructor giving the children some tasks whilst also trying to put them off. Katie and Ben absolutely loved it. Continually laughing and smiling.<\/p><img src='images\/years\/2010\/2010_08_10-17-Day5-Watchet.jpg' class='diaryImage' alt='Ben Aqua Gliding' \/><p class='diaryImageCaption'>Ben Aqua Gliding<\/p><p>We played Bingo again and lost. Mummy kept Katie up extra late to enjoy the special Hanah Montana, High School Musical and Grease show which she loved. The dirty sto outs did not return till 11:15pm!<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Watchet"},"version":1},{"date":{"d":9,"m":8,"y":2010},"datev":20100809,"info":{"content":"<p>The car was now completely broken and despite Daddy's efforts he couldn't get it going. So we made our own plan of events which included swimming, softplay, arcades, a Dick Whittington pantomime, bingo in the evening followed by a childrens competition which all three of us joined in. Ben is not shy in coming forward, Katie clung onto Mummy and Jessica dancing around beautiful.<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - On Camp"},"version":1},{"date":{"d":8,"m":8,"y":2010},"datev":20100808,"images":1,"info":{"content":"<p>After another fried breakfast we headed to the arcades where we were introduced to the penny shove game. Of course we lost.<\/p><p>Today we decided to use our National Trust cards and headed just up the road to Dunster Castle. We climbed the hill and first off was some shows about the English Civil war. We first looked at how the soldiers dresses and their weaponary. Ben was quite into this and when they asked for a volunteer to see how heavy the helmet was, Ben stood up like a shot.<\/p><p>We went around the castle trying to answer the family quiz as we went. Ben was getting a little bored. There was a garden right up high, with some views to the sea and Exmoor, and down to the battle re-enactment which were good fun to see.<\/p><p>We had our picnic in the grounds, then returned to our broken car again! Stress-aloni. Whilst we were waiting for Daddy to sort things out we wondered around Dunster village, which was picture perfect and just right for tourists. We went in the dolls museum and went around the shops and bought some postcards to return home.<\/p><p>Daddy got the car going and we returned mid-afternoon to go swimming for two hours! After dinner we went for the Haven Entertainments! Bingo, which we lost then the Chinese National Circus which Katie particularly enjoyed. There were alot of supple chinese ladies. A late night to bed.<\/p><img src='images\/years\/2010\/2010_08_08-11-Day3-Dunster.jpg' class='diaryImage' alt='Dunster Castle' \/><p class='diaryImageCaption'>Dunster Castle<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Dunster Castle"},"version":1},{"date":{"d":7,"m":8,"y":2010},"datev":20100807,"images":1,"info":{"content":"<p>We awoke at normal time, 6:30am and headed for the football courts and playgrounds and mucked about there for a bit. We then went for our first breakfast which consisted of a fry-up. Daddy was worried we would all turn fat! We went to the pirate soft play whilst Daddy went to get the swimming stuff. The weather was awful as it rained on and off. We didn't mind as we were wet anyway. Beside the outdoor pool was a four lane race slide which we had great fun going down. Katie won most of the races. We played piggy in the middle in the indoor pool.<\/p><p>We then decided to head towards Weston Super Mare. We stopped off for some food at Burnham On Sea only to find our car wouldn't start again! Oh dear. We decided to ditch the car and take the long walk into Burnham and have lunch on the beach. It was really windy and the seagulls circled us looking for some scraps. Whilst we were playing on the sandy and muddy beach, the naughty seagulls swooped down and stole our bread. Ben valiantly tried to shoo them away. We played hop scotch, find what mummy says to get, races and dug big holes. Daddy and Jesscia went to get the car which fortunately started again.<\/p><p>We returned back home, fitted in a quick swim again before getting ready for the camp's evening entertainment. We were all a bit shy in getting up and joining in the dancing.<\/p><p>We had bangers and mash for dinner, watched our favourite TV programme, 101 Ways To Leave A Game Show before going to bed.<\/p><img src='images\/years\/2010\/2010_08_07-05-Day2-BurnhamOnSea.jpg' class='diaryImage' alt='Just us on a sandy, sunny beach' \/><p class='diaryImageCaption'>Just us on a sandy, sunny beach<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Burnham On Sea"},"version":1},{"date":{"d":6,"m":8,"y":2010},"datev":20100806,"images":1,"info":{"content":"<p>We left on time, managed to fit everything into the car easily and without too much stress which is quite amazing for us lot. We headed south, by the time we hit Hook, we had to stop one of a bazzilion time for a toilet break. Stop, start, stop, start.<\/p><p>We arrived a little late of Mummy's school friend, Jessica. It was really nice to meet up again, first time in 2.5 years. They had a little girl called Sine, pronounced Sheena, who was born two days before Jessica. She was such a well behaved sweet girl. We had our little Jessica, who bounded in with her big pink sunglasses, on upside down and her handbag and purse. She looked a right proper diva. She looked trouble all over.<\/p><p>Tobias was woken up, He was a sweetie at 10 months old. We played in the backgarden and turned the toy box upside down. We all played very nicely together. Sheena and Jessica took a while to warm to each other but played nicely towards the end. We had scrummy pizza. We spent over 2 hours there before moving on.<\/p><p>Quatre of an hour into the journey down to Doniford, Daddy had forgotton his wallet! Daddy told Mummy to ring Jessica to let her know. Mummy then goes, 'Oopie' as she had also forgotten her handbag which had the mobiles in it. We then proceeded to get hopelessly lost on our return. All a bit of a nightmare, but we eventually completed the 90 minute second leg of our journey.<\/p><p>We settled into our challet (sha-laaay) which was the nicest out of all our previous accomodations. We were quite impressed. We quickly caught the last part of a swimming session.<\/p><p>After unpacking, Daddy went to drive to the supermarket. Disaster, the car wouldn't start. Wouldn't even turn over. Electrics all OK. Had an argument because Mummy said she had renewed our breakdown cover, but hadn't and would cost an extra £90 to join up! Daddy, being tight refused to pay this. Thankfully after a couple of hours the car worked again. Must be a problem when the car gets hot.<\/p><img src='images\/years\/2010\/2010_08_06-01-Day1-TheScotts.jpg' class='diaryImage' alt='Jessica in her pink glasses stroking Tobias' \/><p class='diaryImageCaption'>Jessica in her pink glasses stroking Tobias<\/p>","images":false},"title":{"value":"Doniford Bay Holiday - Visiting The Scott's"},"version":1},{"date":{"d":6,"m":8,"y":2010},"datev":20100806,"first":{"name":"katie","value":"Brownies"},"title":{"value":"Katie starts Brownies"},"version":1},{"date":{"d":5,"m":8,"y":2010},"datev":20100805,"images":1,"info":{"content":"<p>We had a bright start today. Ben opened his presents which were revolved pretty much all alround Star Wars. He got a storm troopers helmet from Uncle Howard, some figures from Auntie Karen and Uncle Barrie, a ball, a book and a Star Wars T-Shirt. He got a football goal, a scooter and a scooby doo board game to name but a few things.<\/p><p>After opening his presents we then proceeded to the main event of the day which was a trip to Legoland. Woo Hoo. We got there before the opening time at 9:30 and waited till the gate was raised. We rushed to the dragon rollercoast rides, the pirate boat, the adventure playground, laser quest, the balloon wheel before taking in lunch. All three were loving it. Jessica fortunately was 0.5 centimetre tall enough to go on most rides. <\/p><p>Ben and Jessica went on the junior version of the driving school. They were both surprisingly better than expected. Jessica managed to actually keep her foot on the pedal and kind of steered ok, although she was looking around alot at others. Ben's rides was quite low key. Anyway they both really enjoyed it. Katie went on the 7-14 year old version. She did not enjoy it, because she could not see Daddy all of the time. This is becoming quite a handicap for her and limits her ability to join in many activities.<\/p><p>We played around in the water splash area, went around the mini lego countries before going on the tyre ride. Our last go was on the racing game where we had to design our drivers and car before sitting in a race car and playing a computer game race. We ended at 8pm when the park shut. We were treated to fish and chips on the way home.<\/p><img src='images\/years\/2010\/2010_08_05-04-Legoland.jpg' class='diaryImage' alt='Dragon Castle' \/><p class='diaryImageCaption'>Dragon Castle<\/p>","images":false},"title":{"value":"Ben's 5th Birthday - Legoland"},"version":1},{"date":{"d":1,"m":8,"y":2010},"datev":20100801,"images":1,"info":{"content":"<p>Our 2nd cousins, the Dixons came up from Deal to come for a Gay BBQ. Reuben, now 20 months has grown beyond belief, speaking, walking, could be mistaken for a 2.5 year old. He was calling Daddy, 'Man'. Yasmin played so nicely with all three of us.<\/p><p>Whilst the BBQ was slowly grilling away we went over to play football. Katie, sporting her new boots impressed us all with her enthusiasm and skills. Jessica wasn't in her sharing mood when it came to her bike, and Ben was rooted to being goalkeeper at the wrong end of the pitch!<\/p><p>The food just really never came, the coffee was out of date, thank goodness the Tremear's brought some nice homemade puddings. Ben showed off how good at crashing his bike he was!<\/p><p>It so nice for us all to meet up, just a shame in some respects that there was such a comotion with all the children. All five kiddies ended up in the nudey pants in the backgarden!<\/p><img src='images\/years\/2010\/2010_08_01-06-DixonsOver.jpg' class='diaryImage' alt='Jessica and Yasmin' \/><p class='diaryImageCaption'>Jessica and Yasmin<\/p>","images":false},"title":{"value":"Dixons Over"},"version":1},{"date":{"d":31,"m":7,"y":2010},"datev":20100731,"images":1,"info":{"content":"<p>We went over to the Sanders for Evie's first birthday. All the christening guests were there. Nice to see so many travel from Derby and Kent.<\/p><p>Later in the afternoon it was Katie and Ben's joint birthday party at Tomlinscote School. We decided on a joint party this year not only for financial reasons, but time was an issue and the fact they quite enjoyed to have the same sort of party. First off was some football, then musical statues, then we moved into the gym where a load of aparatus was out which was made into a circuit for us to go around. The favourite item was the rope swing.<\/p><p>We then went for some party food and a birthday cake where the candles couldn't be blown out.<\/p><img src='images\/years\/2010\/2010_07_31-47-KatieBenBirthday.jpg' class='diaryImage' alt='Blowing the candles out' \/><p class='diaryImageCaption'>Blowing the candles out<\/p>","images":false},"title":{"value":"Katie and Ben Joint Birthday Party - Evie 1st Birthday Party"},"version":1},{"date":{"d":30,"m":7,"y":2010},"datev":20100730,"info":{"content":"<p>Packed up and came home early as Mummy had lots to prepare for Katie and Ben's birthday party tomorrow.<\/p>","images":false},"title":{"value":"Hayling Island Camping - Return Home"},"version":1},{"date":{"d":29,"m":7,"y":2010},"datev":20100729,"info":{"content":"<p>Auntie Karen, Lynne, Rachel and Evie came to visit us today. We went to the other end of the beach this time to the other swing park. There was also a beach volleyball court there and the kids loved playing throwing and catching the ball over the high net. Auntie Sue and Uncle Richard came for another little visit. After, we went to an old railway line and all cycled along. There was also a bmx track which the older ones loved. Ben has become so confident at cycling. He could barely cycle before he went but can now do it fine, just needs a bit more practice at breaking! Jessica has also learnt the art of pushing the pedals all the way around, 360 degreees, rather than 180 and going back. We also all took a present from a geocache box we found and put one back.<\/p>","images":false},"title":{"value":"Hayling Island Camping - Beach 2"},"version":1},{"date":{"d":28,"m":7,"y":2010},"datev":20100728,"info":{"content":"<p>Caught the ferry to the Isle of Wight, then a very long bus ride to Black Gang Chine. Had a great time in there, especially the fairy casle and the giant bug walk. Had fish and chips in Ryde and caught the ferry back. Six hours of travelling, five very tired childfren fell asleep instantly!<\/p>","images":false},"title":{"value":"Hayling Island Camping - Black Gang Chine"},"version":1},{"date":{"d":27,"m":7,"y":2010},"datev":20100727,"info":{"content":"<p>came down today and we decided to go on the Hayling Billy, a train that runs on the front, to the swing park. We had to walk in the end as we had just missed the train. The children all had a nice time on the swings and we got the train back. We then played on the beach. Katie, Ben and Joey all went in the sea with Mummy. It was so warm in there! We were then allowed two goes on the fun fair. In the evening Pop Pop came for a BBQ and we sang some songs around the fire!<\/p>","images":false},"title":{"value":"Hayling Island Camping - Beach 1"},"version":1},{"date":{"d":26,"m":7,"y":2010},"datev":20100726,"info":{"content":"<p>We got to the Oven campsite, Hayling Island, put up our tent easily with the help of Auntie Ellie. We had brought all the bikes and all the children were happy cycling around the field while we awaited Ma Ma's arrival, funnily enough she got lost! Once Ma Ma arrived we had some lunch and headed for the onsite pool. It was still lovely and warm as we had remembered from 3 years ago. However, this time after having a lovely swim we all got out and found the pool had taken all the colour from our costumes! We all decided not to go in again. We had an ice cream and then headed to the beach. We intended to do some of Auntie Ellies new hobby geocaching (searching for treasure boxes) but the children wanted to skinny dip in the sea. Auntie Ellie cooked a lovely curry for tea.<\/p>","images":false},"title":{"value":"Hayling Island Camping - Geocaching"},"version":1},{"date":{"d":25,"m":7,"y":2010},"datev":20100725,"images":1,"info":{"content":"<p>We went over to the Fars for a nice Danish Lunch which included a fish tart, pickled herrings, frikadeller and sausages for the uncultured!<\/p><p>Graham made up a boat from cardboard which we duly painted. Farfar also designed a treasure hunt which landed us lots of small presents and sweets!<\/p><p>Ben managed to show how good he was on his bike, although he left his mark in Richmond Close! He almost crashed into next door's car.<\/p><img src='images\/years\/2010\/2010_07_25-13-FarsLunch.jpg' class='diaryImage' alt='Our cardboard boat' \/><p class='diaryImageCaption'>Our cardboard boat<\/p>","images":false},"title":{"value":"Fars Danish Lunch"},"version":1},{"date":{"d":24,"m":7,"y":2010},"datev":20100724,"images":2,"info":{"content":"<p>It was birthday's day. Katie was prohibited from opening too many presents in the morning as we waited for Daddy to return from the airport. Grandma, Grandad, Peter, Ma Ma and Pop Pop all came around early to give Katie her presents.<\/p><p>Katie was also allowed to open her main present from Mummy and Daddy which was a pair of rollerskates, so we could go off to SkateJam at Tomlinscote. Meanwhile the Fars took Jessica and went off to Terminal 5 to pick up Daddy. Daddy was so pleased to see his Jessica.<\/p><img src='images\/years\/2010\/2010_07_24-10-KatieHarrisonBirthday.jpg' class='diaryImage' alt='Our 7 year old' \/><p class='diaryImageCaption'>Our 7 year old<\/p><p>We all returned home and opened the rest of the presents. We did not have much time as Daddy and Jessica went over to the West's for Harrison's 3rd Birthday. It was nice to see them, and see Duncan whom we haven't seen for ages. His girlfriend made the most amazing Thomas The Tank Engine birthday cake. We also enjoyed the Farnborough Airshow, seeing the Vulcan and Red Arrows. Jessica and Harrison were getting on like a house on fire. Laughing at each others observations. It was so cute to see.<\/p><p>Meanwhile, Mummy, Katie and Ben went to Jacob's 6th Birthday Party. Not a person we know that well. He just invited everyone that is in his class, plus siblings and parents. Now this was an amazing party at Frimley Lodge House. First off there was an outbuilding with a swimming pool inside which the children enjoyed. There was an inflatable slide, a go-karting track and they had hired outside caterers to feed the children and adults. It was quite amazing.<\/p><p>Later we went up to Pine Ridge for Oliver's Ten-Pin bowling party.<\/p><img src='images\/years\/2010\/2010_07_24-37-KatieHarrisonBirthday.jpg' class='diaryImage' alt='Jessica and Harrison enjoying a moment' \/><p class='diaryImageCaption'>Jessica and Harrison enjoying a moment<\/p>","images":false},"title":{"value":"Katie's 7th Birthday - Jacob's 6th Birthday Party - Harrison's 3rd Birthday Party - Oliver's 7th Birthday Party"},"version":1},{"date":{"d":23,"m":7,"y":2010},"datev":20100723,"images":4,"info":{"content":"<p>Daddy had a two day meeting in Washington D.C. relating to a big contract that his company has just won. The meeting was about a security device that is in 150+ schools in Washington.<\/p><ul><li>Wednesday - Terminal 5, Heathrow. Nice Hot Chocolate with Dad.<\/li><li>Upgraded to World Traveller Class. Slightly more room, talking inches.<\/li><li>Plane left late becaue the plane tow truck broke down and they couldn't move it.<\/li><li>9 hour flight. Forgot battery for laptop. Arrghhh. Made friends with German chap who sat next to me. Swapped email addresses.<\/li><li>Michael was there to pick me up. The heat and humidity hit me. 32 centigrade at 10pm!<\/li><li>Kept getting lost. Eventually arrived at hotel, it was nice and new.<\/li><li>Meeting went well, although the offices were big and empty. Got what I needed from it.<\/li><li>Went off to Washington in the evening. Went to the White House. Not very busy. Got closer than I thought I would. Looks far away on the tele.<\/li><\/ul><img src='images\/years\/2010\/2010_07_22-05-Washington.jpg' class='diaryImage' alt='Martin dropping in on Obama' \/><p class='diaryImageCaption'>Martin dropping in on Obama<\/p><img src='images\/years\/2010\/2010_07_22-10-Washington.jpg' class='diaryImage' alt='Martin dropping in on Obama' \/><p class='diaryImageCaption'>Martin dropping in on Obama<\/p><ul><li>Walked to the Washington memorial. Had a nice Fillet Mignon<\/li><li>Did some work until midday. Michael dropped me off at the airport where I caught a bus into Washington again.<\/li><li>Caught metro to Crystal City for a spot of shopping. It was a poor mans Farnborough. Not impressed.<\/li><li>Went to the Pentagon. Got comfronted by a security guard for violating a secure area! Weren't allowed to take photo's. Disapointed with the Pentagon.<\/li><li>Did a lot of walking. Archives to Capitol Hill, to Washington Memorial, to Lincoln Memorial.<\/li><\/ul><img src='images\/years\/2010\/2010_07_22-31-Washington.jpg' class='diaryImage' alt='Martin trying to find Obama still' \/><p class='diaryImageCaption'>Martin trying to find Obama still<\/p><img src='images\/years\/2010\/2010_07_22-48-Washington.jpg' class='diaryImage' alt='Washington Memorial' \/><p class='diaryImageCaption'>Washington Memorial<\/p><ul><li>It was so hot, 37 degrees. Wheel at bottom of suitcase melted! Scraped suitcase across the parks! I was so fed up.<\/li><li>Enjoyed walking along the 3 mile Washington Mall. Relieved to finally get in bus. Air conditioning.<\/li><li>Bus, airport, holiday presents, flight on time, sleep on plane, arrive at Heathrow early. Noone there to meet me. Boo Hoo.<\/li><li>Saw Jessica. I was so happy to see my beautiful girl. Nice to see Mum and Dad as well. Thanks for the lifts.<\/li><\/ul>","images":false},"title":{"value":"Washington D.C."},"version":1},{"date":{"d":19,"m":7,"y":2010},"datev":20100719,"info":{"content":"<p>The year's commendations were handed out today. One for each class in the school. We couldn't be prouder parents, Ben won a certificate for his class and Katie for hers. It is such a great feat to be chosen out of your 30 class mates to be the one that is commended. To get both children coming top of their respective classes makes as extremely proud. Well done Katie and Ben.<\/p>","images":false},"title":{"value":"Katie and Ben Commended from School"},"version":1},{"date":{"d":18,"m":7,"y":2010},"datev":20100718,"images":1,"info":{"content":"<p>After collecting Katie from Rainbow camp, we were invited by the Fars to go to the Cockrow railway over in Chertsey. We got there early and Daddy and Jessica perched at the side of the track and watched some of the trains go past. Farfar's childhood friend, Jamie Leicester was there driving one of the engines which was nice to see.<\/p><p>We went on two long trips around the track. All enjoyed it. We must have spent over 3 hours there.<\/p><img src='images\/years\/2010\/2010_07_18-33-CockrowRailway.jpg' class='diaryImage' alt='Jessica training' \/><p class='diaryImageCaption'>Jessica training<\/p>","images":false},"title":{"value":"Cockrow Railway"},"version":1},{"date":{"d":17,"m":7,"y":2010},"datev":20100717,"images":1,"info":{"content":"<p>Katie was on her final weekend of being at Rainbows. She really has enjoyed her time with them and will shortly be moving up to Brownies. Katie went over to the Tilford camp to stay overnight and she done plenty of fun things.<\/p><p>Meanwhile the rest of us went over to see Steve and Joyce's new addition to the family, Eva May Barnett. She was so tiny and cute. Mummy and Daddy wanted another baby! Steve and Joyce were taking it all in their stride and doing a fine job. I don't think they quite realized how little sleep they were going to get. It's one of those things you have to experience yourself before you realize this!<\/p><img src='images\/years\/2010\/2010_07_17-03-EvaMayBarnett.jpg' class='diaryImage' alt='Eva May Barnett' \/><p class='diaryImageCaption'>Eva May Barnett<\/p>","images":false},"title":{"value":"Rainbow Camp - Eva May Barnett"},"version":1},{"date":{"d":16,"m":7,"y":2010},"datev":20100716,"images":1,"info":{"content":"<p>The whole school were in the leavers assembly which was presented to the parents. Daddy came to watch, and Mummy cried! Ben fell on the floor whilst singing 'Dingle Dangle Scarecrow'. Katie had some speaking parts.<\/p><img src='images\/years\/2010\/2010_07_16-03-KatieCrossFarmLeavingAssembly.jpg' class='diaryImage' alt='Katie singing in leavers assembly' \/><p class='diaryImageCaption'>Katie singing in leavers assembly<\/p>","images":false},"title":{"value":"Leavers Assembly"},"version":1},{"date":{"d":11,"m":7,"y":2010},"datev":20100711,"images":1,"info":{"content":"<p>Today was the Frimley Green Carnival.... which only means 'stress time'. Laura had volunteered to run the school stall at the very time the procession slithers down the main room.<\/p><p>The theme was sports from around the world. Cross Farm choose American Football. Katie went as a cheerleader and Ben as an American Football player. Bean bags for shoulder pads, a cycle helmet and some black paint! It was blisteringly hot.<\/p><p>There was so many family and friends that came to watch. That's what the children like the most, spotting people they know in the crowd. Anyway they proceeded through Frimley Green which took about half an hour.<\/p><woops woopstitle=\"Ben Landing On His Face\" rating=\"5\"><p>After, we went to the green where there was a fair, it was very busy. We all went on the big inflatable slide. Daddy told Ben to bounce his way down to get more of a thrill. He managed to bounce so much, he did a forwards sommersault during his descent. The 'man' told Ben off. Mummy told Daddy off!<\/p><div class=\"youtube\"><object width=\"500\" height=\"405\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/6eI7J2ZSdiw&amp;amp;hl=en_GB&amp;amp;fs=1?border=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/6eI7J2ZSdiw&amp;amp;hl=en_GB&amp;amp;fs=1?border=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"405\"><\/embed><\/object><\/div><\/woops><p \/><img src='images\/years\/2010\/2010_07_11-12-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Cross Farm float' \/><p class='diaryImageCaption'>Cross Farm float<\/p>","images":false},"title":{"value":"Frimley Green Carnival"},"version":1},{"date":{"d":10,"m":7,"y":2010},"datev":20100710,"images":1,"info":{"content":"<p>Daddy was awoken to breakfast in bed and pressured into opening and cards and presents as quickly as possible! Daddy got a nice pair of sunglasses, some socks, boxer shorts, nice food, a pair of shorts, a sweatshirt and a barometer!<\/p><p>We had a surprise trip organised for Daddy. We went over to Runnymede to the park next to the river. We had a great time. We took the bikes and Daddy took us girls on a ride up the river to Staines. Katie and Daddy were marvelling at all the nice houses. Katie picked a house with plenty of 'green' windows as she put it.<\/p><img src='images\/years\/2010\/2010_07_10-13-Runnymede.jpg' class='diaryImage' alt='Biking along the Thames' \/><p class='diaryImageCaption'>Biking along the Thames<\/p><p>Later we went in the paddling pool and had a scrummy picnic. Ma Ma and Pop Pop came along and took Jessica back to Istead Rise. She went to see Tiki the horse and played loads.<\/p><p>Meanwhile we headed back quickly. Ben went to Bethany's 5th birthday at Cross Farm whilst Daddy and Katie chilled and played at home. It was nice and calm!<\/p><p>We watched Toy Story 3 in the evening. Ben got really scared through out. Both he and Mummy cried! The Fars came over with some more presents to round off the day perfectly.<\/p>","images":false},"title":{"value":"Daddy's 35th Birthday"},"version":1},{"date":{"d":9,"m":7,"y":2010},"datev":20100709,"info":{"content":"<p>Katie's SATs results came through today. She scored the required level, 2, for all subjects except for 'Reading' where she got top marks. Mummy and Daddy are pleased.<\/p><ul><li><i>Writing<\/i>2B\u000a        <\/li><li><i>Numeracy<\/i>2B\u000a        <\/li><li><i>Reading<\/i>3\u000a        <\/li><li><i>Science<\/i>2\u000a        <\/li><li><i>Speaking and Listening<\/i>2\u000a        <\/li><\/ul>","images":false},"title":{"value":"Katie's SATS result"},"version":1},{"date":{"d":4,"m":7,"y":2010},"datev":20100704,"images":1,"info":{"content":"<p>We were supposed to go fruit picking, but on a glorious day, on a Sunday in the middle of summer the pick your own farm was shut!<\/p><p>We therefore went close by to Pinewood where there was a big playground with 'different' aparatus. The fars came as well. We stopped of for a nice ice cream.<\/p><img src='images\/years\/2010\/2010_07_04-22-Pinewood.jpg' class='diaryImage' alt='Katie spinning around' \/><p class='diaryImageCaption'>Katie spinning around<\/p>","images":false},"title":{"value":"Pinewood"},"version":1},{"date":{"d":3,"m":7,"y":2010},"datev":20100703,"images":1,"info":{"content":"<p>It was a boiling hot day. We decided to give tennis ago. None of the children had played this before. They all enjoyed playing, although Ben was more interested in throwing the ball around. None were naturals unfortunately, but we had a laugh.<\/p><p>Later Katie went around to Leah's to play.<\/p><img src='images\/years\/2010\/2010_07_03-06-RectoryPark.jpg' class='diaryImage' alt='Jessica in her summer hat' \/><p class='diaryImageCaption'>Jessica in her summer hat<\/p>","images":false},"title":{"value":"Tennis"},"version":1},{"date":{"d":28,"m":6,"y":2010},"datev":20100628,"info":{"content":"<p>Today Mummy and Daddy went into see Ben's teacher, Mrs King for a progress report on the year. She couldn't be any more glowing in all aspects of Ben. He's clever, attentive, respectful, helpful and has surpassed what a reception year child should attain this year, which is quite remarkable given his parentage and he's the youngest in the class. Apparently Mrs King, who is heavily pregnant, told the headmistress that if she had a boy she would want him to just be like Ben. She has not obviously seen Ben get in a bad mood! Still Mummy and Daddy are immensely proud. A comment from Mrs King was that he soaks up what he's been told like a sponge. Something we've noticed as well. Well done 'Big Boy'.<\/p>","images":false},"title":{"value":"Ben - Parents Evening"},"version":1},{"date":{"d":27,"m":6,"y":2010},"datev":20100627,"info":{"content":"<p>Today was England v Germany in the 2nd round of the world cup. We had a few around, the game was really disapointing. Us children didn't bother watching it.<\/p>","images":false},"title":{"value":"England BBQ"},"version":1},{"date":{"d":26,"m":6,"y":2010},"datev":20100626,"images":4,"info":{"content":"<p>The Burrows came over for the RLC Show. We went over in the later morning and had fun on lots of things. Ben and Thomas get on really well. They are quite a like in their 'boy-ish-ness'. Both like a bit of rough and tumble and pretty vocal as well. We looked in some of the vehicles which were pretty big and menacing and watched a bit of tug of war. Even the adults had a sprint race and a go on the assault course. Ben and Katie had a go on the tight rope, where they hung and traversed across the rope, above the cold pool of water. The crowd were impressed, the parents proud. The BBQ beckoned.<\/p><p>The Elder clan came over and we went for a second stint at the show. Star of the show this time was Thomas' efforts in the boxing ring. Left, right, whammmooo. Even the other pretenders were at risk of getting the Burrows' right hander! Ben, very confident going onto the ghost train ride, was a little less sure of himself when he left the car. Katie took mummy on the speedy Twister ride. Unfortunately we ran out of time and missed the main show events. Still we had a great time on this baking hot day.<\/p><img src='images\/years\/2010\/2010_06_26-21-RLCArmyShow.jpg' class='diaryImage' alt='Boxer Ben' \/><p class='diaryImageCaption'>Boxer Ben<\/p><img src='images\/years\/2010\/2010_06_26-43-RLCArmyShow.jpg' class='diaryImage' alt='Katie and Mummy on Twister' \/><p class='diaryImageCaption'>Katie and Mummy on Twister<\/p><img src='images\/years\/2010\/2010_06_26-63-RLCArmyShow.jpg' class='diaryImage' alt='Monkey boy Ben' \/><p class='diaryImageCaption'>Monkey boy Ben<\/p><img src='images\/years\/2010\/2010_06_26-46-RLCArmyShow.jpg' class='diaryImage' alt='The Krew' \/><p class='diaryImageCaption'>The Krew<\/p>","images":false},"title":{"value":"RLC Army show"},"version":1},{"date":{"d":25,"m":6,"y":2010},"datev":20100625,"info":{"content":"<p>We awoke early not because the children were excited, but Mummy got us all up so we could watch her open her presents and cards... and as Brucey says, didn't she do well. We got her a black cardigan (that she wanted), a pink t-shirt, some make up, big sunglasses and jewelery. She also got some money, a new handbag and a trip to the Globe theatre to watch Henry VIII.<\/p><p>Pop Pop came across and watched Ben in his grandparents assembly. The Fars also went for the afternoon session when Katie done her piece.<\/p><p>In the evening we played party games, musical chair bumps and statues.<\/p>","images":false},"title":{"value":"Laura's 34th Birthday - Grandparents Day"},"version":1},{"date":{"d":20,"m":6,"y":2010},"datev":20100620,"images":2,"info":{"content":"<p>In the morning Daddy went with Uncle Michael mountain biking on Surrey Hill, Swinley Forrest.<\/p><p>The afternoon of Father's day was spent at Sandhurst Collage where there was an Army fete type event. We watched a game of polo, got our faces painted and performed an army excercise using water bombs to throw at a real soldier.<\/p><img src='images\/years\/2010\/2010_06_20-24-HeritageSandhurst.jpg' class='diaryImage' alt='Jessica in front of the Polo match' \/><p class='diaryImageCaption'>Jessica in front of the Polo match<\/p><img src='images\/years\/2010\/2010_06_20-41-HeritageSandhurst.jpg' class='diaryImage' alt='Ben joins the army' \/><p class='diaryImageCaption'>Ben joins the army<\/p>","images":false},"title":{"value":"Army Heritage Day"},"version":1},{"date":{"d":19,"m":6,"y":2010},"datev":20100619,"info":{"content":"<p>In the morning we went off to Camberley for a swimming assessment for Katie. Apparently she swims well, but needs work on her leg action. Meanwhile the rest of us were having a great time on the swings.<\/p><p>In the afternoon Charlotte came over and we prepared for Daddy's Denmark Vs Cameroon BBQ. Daddy also took everyone biking. Jessica had her first go on Katie's old bike with stablizers. It was funny to see her do little tiny pedals. Ben was on the oversized BMX. He had to get the hang of setting off when he couldn't touch the floor too well. Crash, bang, wallop. We decided to go where there was more space, so we went over to the crescent. He was so proud, having a big smile on his face, looking at Daddy constantly and not where he was going! Another crash. A bit worse this time. The front wheel gave way on the shingle and the handlebar dug into his forehead. Blood spilling out as well as a few tears. Ben doesn't like plasters so he's going around with a bullet wound to his head.<\/p><p>In the evening we left Daddy at home and went over to Richard Barnett's 60th and retirement party. Meanwhile Daddy had: Barrie, James, Susan, Graham, Michael and Richard over to watch the Denmark game. Barrie got drunk and fell asleep. It was a good game, Denmark beating Cameroon 2-1.<\/p>","images":false},"title":{"value":"Swimming Assesment, Denmark BBQ"},"version":1},{"date":{"d":16,"m":6,"y":2010},"datev":20100616,"info":{"content":"<p>Mummy and Jessica were walking to pick up Katie and Ben from school. Jessica ran in front then suddenly fell forward. A normal fall. Jessica screamed, Mummy sprinted to comfort her. Jessica then flopped into Mummy's arms and seemingly went unconsious for a matter of 20 seconds. In that time she seemed to fit as well. She began to go blue. Luckily there were people around as Mummy screamed for an ambulance and really paniced. Fortunately Jessica came around and she got the biggest cuddle from Mummy. They then went to the doctors surgery. They could not diagnose the problem. A really strange event. Maybe her body couldn't cope and couldn't breathe for a while. We'll never know. There has been no ill effect from it.<\/p>","images":false},"title":{"value":"Jessica - Unconsious"},"version":1},{"date":{"d":13,"m":6,"y":2010},"datev":20100613,"images":1,"info":{"content":"<p>It was an early start as Daddy try to squeeze in a full day's overtime. Well what a cock up. Daddy made into the office for 6:30am, went to the toilet and locked himself out of the office! The motorbike keys and phone were all inside. So Daddy had to find someone, borrow their mobile phone (because Daddy's rubbish at mobiles) and ring us up at real early to get a lift back home. Ben was still asleep. So Daddy worked at home, until the next person was due into the office.<\/p><p>Later in the morning we had church parade, then Daddy finished work and joined us for the Parish lunch. The weather again was very kind. We all had our picnic on the lawn and played with Poppy and James. Grandma and Grandad were also there.<\/p><p>Later in the afternoon we went over to the Big Apple in Woking and had a game of Ten Pin bowling. Free tickets as Farmor had won them in the school raffle. It was a good game as we didn't need the ramp. Well the final scores were very close. Mummy and Daddy tied on 97 points, whilst Katie ended on 96! We all shared the Curly Wurly prize.<\/p><img src='images\/years\/2010\/2010_06_13-03-BigAppleBowling.jpg' class='diaryImage' alt='Ben launching a big one' \/><p class='diaryImageCaption'>Ben launching a big one<\/p>","images":false},"title":{"value":"Daddy work - Parish Lunch - Ten Pin Bowling"},"version":1},{"date":{"d":12,"m":6,"y":2010},"datev":20100612,"images":3,"info":{"content":"<p>In the morning we did some gardening and homework. In the afternoon Joey, Lily, Michael, Farmor and Farfar went with us to the Pirbright Fete, which was themed around scarecrows. There were 30 or so exhibits standing in the green. The main 'Gruffalo' unfortunately got burnt down the night before. All the scarecrows were themed mainly around children's characters. Our favourite was Peppa Pig I think. <\/p><img src='images\/years\/2010\/2010_06_12-08-PirbrightScarecrowFete.jpg' class='diaryImage' alt='Peppa' \/><p class='diaryImageCaption'>Peppa<\/p><p>There was reportidly 3,000 people there. We couldn't quite see that, however it was very busy and quite hot. We each had a go on the horses. Katie, Ben and Lily loved it, whilst Jessica looked a little unsure and Joey didn't want to try. After watching the tug of war and an ice cream of course we ended the afternoon with a trip on the underground train. Good fun had by all.<\/p><img src='images\/years\/2010\/2010_06_12-33-PirbrightScarecrowFete.jpg' class='diaryImage' alt='Jess the Jockey' \/><p class='diaryImageCaption'>Jess the Jockey<\/p><img src='images\/years\/2010\/2010_06_12-39-PirbrightScarecrowFete.jpg' class='diaryImage' alt='Katie pleased with the ride' \/><p class='diaryImageCaption'>Katie pleased with the ride<\/p><p>Mummy then looked after us 5 children, whilst Daddy and Uncle Michael went around to Steven's house to watch England's opener against the USA. First time Daddy's seen Steve's big house in Reading. The game will be remembered for ITV putting on an advert break whilst Gerrard scored the first goal, and for the unfortunate goalkeeping mistake made by Robert Green! Us children watched it back at home, however after about 10 minutes we lost interest and mucked about amongst ourselves.<\/p>","images":false},"title":{"value":"Pirbright Scarecrow Fete"},"version":1},{"date":{"d":5,"m":6,"y":2010},"datev":20100605,"images":3,"info":{"content":"<p>Farmor was in Denmark, so Farfar suggested that we'd have a day out at Robin Hill on the Isle Of Wight. Mummy has always wanted to return back after a trip down here in her childhood. As it was quite a late decision there was quite a scamble to book ferry tickets, get a picnic and sort ourselves out. We made the 9:30 car ferry crossing. Farfar had gone by train and so caught a different boat across. It was quite funny because his Seacat overtook our slow, old boat. We could see each other waving.<\/p><p>We everntually all arrived (11am) at Robin Hill. The weather was fabulous, as Katie would say. First, we went on the train and pirate ship rides. There weren't many other people, so we got on first time. In fact we had 3 goes. The park was designed so you would follow a path around and after 50 yards or so there would be another attraction. There was a maze, mini village, plenty of adventure playgrounds, Troll Island and best of all a taboggen run. We barely fitted it all in. If only we had some more time. Katie and Ben said it was their best attraction park. Better than Thorpe Park, Chessington and Drayton Manor. The park was designed just right for them. It cost £33 for the 6 of us which was excellent value for money. It has persuaded us to maybe have our 2011 summer holiday on the Isle of Wight.<\/p><p>We left for our 4pm sailing back to the mainland. However, the boats were running an hour late we were told. So the boys and Katie went for a walk on to the jetty to splash our feet in the water. Half and hour later we got a phone call from Mummy to say she was on the boat that was currently docked. She'd been let on a boat half an hour earlier!  It meant the rest of us had to hurry and walk on to the boat. We were the last on, but thankfully made it in time. We had a good crossing back. Another lovely day.<\/p><p>In the evening Mummy went to see a Beach Boys tribute band with the Barnett clan.<\/p><img src='images\/years\/2010\/2010_06_05-04-RobinHillIsleOfWight.jpg' class='diaryImage' alt='Where's the wally' \/><p class='diaryImageCaption'>Where's the wally<\/p><img src='images\/years\/2010\/2010_06_05-10-RobinHillIsleOfWight.jpg' class='diaryImage' alt='Me hearties' \/><p class='diaryImageCaption'>Me hearties<\/p><img src='images\/years\/2010\/2010_06_05-38-RobinHillIsleOfWight.jpg' class='diaryImage' alt='Jessica from the 70's' \/><p class='diaryImageCaption'>Jessica from the 70's<\/p>","images":false},"title":{"value":"Robin Hill - Isle Of Wight"},"version":1},{"date":{"d":31,"m":5,"y":2010},"datev":20100531,"images":10,"info":{"content":"<p>We awoke around the 7am mark which wasn't too bad considering. It was a lovely sunny morning and the troops were in fine fettel. Had a few games of 'Please mister crocodile'.<\/p><img src='images\/years\/2010\/2010_05_31-114-DurdleDoor.jpg' class='diaryImage' alt='Thunderbirds are go' \/><p class='diaryImageCaption'>Thunderbirds are go<\/p><img src='images\/years\/2010\/2010_05_31-123-DurdleDoor.jpg' class='diaryImage' alt='Jessica running riot' \/><p class='diaryImageCaption'>Jessica running riot<\/p><p>After a scrummy cooked breakfast we parted ways. The others were heading home, whilst we decided to make the most of our location and free time and pop across to Lulworth and Durdle Door.<\/p><p>The climb up the cliff was pretty hard in the heat, although the children all did very well in their attempts. We looked down onto Durdle Door which was quite a site. Mummy was fretting that we were getting too close to the edge.<\/p><img src='images\/years\/2010\/2010_05_31-136-DurdleDoor.jpg' class='diaryImage' alt='Overlooking Lulworth Cove' \/><p class='diaryImageCaption'>Overlooking Lulworth Cove<\/p><img src='images\/years\/2010\/2010_05_31-140-DurdleDoor.jpg' class='diaryImage' alt='Overlooking Durdle Door' \/><p class='diaryImageCaption'>Overlooking Durdle Door<\/p><p>We headed down to the beach, and had our picnic lunch. It was quite stoney. Although it was quite hot, the sea was blimin' freezing. Mummy and KAtie had to abort their swimming attempt. Daddy knew that if we were to continue over a rockpool 5 minutes on, then we would have the whole beach pretty much to ourselves, as well as being closer to the car for the return journey. We had a lovely stretch of sandy beach which only the occasional passer by interupted our private spot. We ventured over to the rock pools which were not populated by much wildlife. However, we had a good time searching.<\/p><p>By the time it was late afternoon we decided to head back. We were all pretty worn out. A good time had by all.<\/p><img src='images\/years\/2010\/2010_05_31-155-DurdleDoor.jpg' class='diaryImage' alt='Katie' \/><p class='diaryImageCaption'>Katie<\/p><img src='images\/years\/2010\/2010_05_31-04-DurdleDoor.jpg' class='diaryImage' alt='Early morning call from Lily and Jessica' \/><p class='diaryImageCaption'>Early morning call from Lily and Jessica<\/p><img src='images\/years\/2010\/2010_05_31-52-DurdleDoor.jpg' class='diaryImage' alt='Mermaids on the rocks' \/><p class='diaryImageCaption'>Mermaids on the rocks<\/p><img src='images\/years\/2010\/2010_05_31-57-DurdleDoor.jpg' class='diaryImage' alt='Katie and Ben on the rocks' \/><p class='diaryImageCaption'>Katie and Ben on the rocks<\/p><img src='images\/years\/2010\/2010_05_31-73-DurdleDoor.jpg' class='diaryImage' alt='Ben pulling Katie along our private beach' \/><p class='diaryImageCaption'>Ben pulling Katie along our private beach<\/p><img src='images\/years\/2010\/2010_05_31-86-DurdleDoor.jpg' class='diaryImage' alt='Just one more photo...' \/><p class='diaryImageCaption'>Just one more photo...<\/p>","images":false},"title":{"value":"Camping - Durdle Door"},"version":1},{"date":{"d":30,"m":5,"y":2010},"datev":20100530,"images":6,"info":{"content":"<p>We soldiered down, the long way around to Studland Bay where we met up with the Elders and Glidewells. It was a baking hot day. We first played in the sand, attempting to build a river from the sea to the mound. After lunch and an ice cream there were trips on the Kayak. For some reason Uncle Michael vowed not to go on a Kayak with Daddy again. Not sure why. Anyway Daddy took Ben out to sea and over to the 'secret' beach and caves. Ben enjoyed the trip, taking it all in, anyway that's what we hope. Daddy get's the same sort of reaction when he takes the children on bike rides. You can never quite tell 100%.<\/p><p>We played a bit more on the beach, football and frisbee. Then Mummy, Daddy, Katie and Jessica all went on a pedalo. Mummy's efforts were feeble. I think we were going backwards more than forwards! We had fun. Katie and Mummy dived in the cold, cold water and waded back to shore.<\/p><p>We headed to the campsite in East Creech, late afternoon. The Elders tent was huge. Enough to sleep the 9 of us. Michael cooked up a scrummy BBQ, whilst us lot went to find a nice playground in the woods. The tyre swing was the most popular ride.<\/p><p>After dinner we played a bit more. Daddy was sent out to get some medicine for Ben. He wasn't feeling very well. No shops were open, in the end a car flashed daddy down, waving a medicine bottle out of the window. He'd overheard us looking for some Calpol and had some spare. Never too sure to accept it or not. Well we did and all was well. The children struggled to get to sleep as the adults played cards inside.<\/p><img src='images\/years\/2010\/2010_05_30-04-StudlandBay.jpg' class='diaryImage' alt='Ben Kayaking with Jon and Rachel' \/><p class='diaryImageCaption'>Ben Kayaking with Jon and Rachel<\/p><img src='images\/years\/2010\/2010_05_30-11-StudlandBay.jpg' class='diaryImage' alt='Jessica coming out of the sea' \/><p class='diaryImageCaption'>Jessica coming out of the sea<\/p><img src='images\/years\/2010\/2010_05_30-17-StudlandBay.jpg' class='diaryImage' alt='Katie Kayaking with Jon and Rachel' \/><p class='diaryImageCaption'>Katie Kayaking with Jon and Rachel<\/p><img src='images\/years\/2010\/2010_05_30-35-StudlandBay.jpg' class='diaryImage' alt='Ben - Don't bury your head in the sand!' \/><p class='diaryImageCaption'>Ben - Don't bury your head in the sand!<\/p><img src='images\/years\/2010\/2010_05_30-43-StudlandBay.jpg' class='diaryImage' alt='Katie' \/><p class='diaryImageCaption'>Katie<\/p><img src='images\/years\/2010\/2010_05_30-47-StudlandBay.jpg' class='diaryImage' alt='A civilized meal' \/><p class='diaryImageCaption'>A civilized meal<\/p>","images":false},"title":{"value":"Camping - Studland Bay"},"version":1},{"date":{"d":29,"m":5,"y":2010},"datev":20100529,"info":{"content":"<p>In the morning, Daddy made a Treasure Hunt around the estate. There were about 8 clues which led to the treasure, 2 jumbo pencils, Star Wars cards and a whiteboard.<\/p><p>After lunch we ventured into Farnborough and went swimming. We stayed in the pool for almost 2 hours! Daddy cooked roast duck for the first time ever. Only he wanted it though!<\/p>","images":false},"title":{"value":"Treasure Hunt, Swimming"},"version":1},{"date":{"d":23,"m":5,"y":2010},"datev":20100523,"images":1,"info":{"content":"<p>In the morning we went off to church leaving Daddy to go with Farfar to the blue flag event of the European Golf tour. It was a scorchingly, hot day at Wentworth. They saw the likes of Ernie Ells, Paul Casey, Luke Donald, Lee Westwood and Paul Broadhurst. Not too many birdies, but some cracking drives. They sat in the stand at the 14th which had a great view. No cameras though!<\/p><img src='images\/years\/2010\/2010_05_23-02-WentworthGolf.jpg' class='diaryImage' alt='On the first at Wentworth' \/><p class='diaryImageCaption'>On the first at Wentworth<\/p><p>In the afternoon Katie went to her friend's Oliver's birthday party. It was in the stlye of Gladiator held at Tomlinscote. The idea now is for Ben and Katie to have a joint party doing the same thing.<\/p>","images":false},"title":{"value":"Wentworth PGA Championship, Olivers 6th birthday"},"version":1},{"date":{"d":22,"m":5,"y":2010},"datev":20100522,"images":1,"info":{"content":"<p>In the morning Daddy, Jessica and Ben went over to the Fars to play where they met up with cousins Anne and Theresa. Our cousins sampled the whirlwind effect we have on the Fars house. We had the train set out, cream crackers and other toys booby trapped around the house! Meanwhile Mummy took Katie and her best friend Leah to Skate Jam.can  It was Leah's first attempt at rollerskating. Katie is getting more and more confident.<\/p><p>In the afternoon we ran the 'can shy' at the church fete at St. Andrews church. We all tried lots of things and had a good time in the sun.<\/p><img src='images\/years\/2010\/2010_05_22-13-ChurchFete.jpg' class='diaryImage' alt='A butterfly eating ice cream' \/><p class='diaryImageCaption'>A butterfly eating ice cream<\/p>","images":false},"title":{"value":"The Reardons, Fars, Skate Jam and Church Fete"},"version":1},{"date":{"d":21,"m":5,"y":2010},"datev":20100521,"first":{"name":"jessica","value":"Jessica's first splinter"},"info":{"content":"<p>Jessica had a suspected splinter. It was not an easy retrieval. How she wailed and fought Daddy. Daddy had to forcibly pin Jessica's hand down before attempting piercing the skin with a pin. Anyway blood was drawn, and we weren't sure if we got everything out. Jessica was a very good, brave girl and there was a special hug for Daddy at the end.<\/p>","images":false},"title":{"value":"Jessica's first splinter"},"version":1},{"date":{"d":16,"m":5,"y":2010},"datev":20100516,"info":{"content":"<p>In the morning was jobs, jobs, jobs. First job was to fix the radiator which had been separated from the wall after Ben attempted to use it as a ladder in order to get to the coat rack!!! Luckily there was no leaking pipes. Other jobs included, fixing the leaking shower, fixing the bin shed and planting some flowers.<\/p><p>After church and Sunday lunch we ventured over to the West household for a play and natter. Old Harrison and Freya are growing up fast. They noted that Katie had grown quite a bit since the last time they saw her. Jessica spent most of the afternoon asleep, the other four played nicely in Freya's room. Ben and Katie had to comprehend the West rules of playing. Before starting on a new toy, you must first clear away the old toy. This was told to them by Freya. Good on Freya, perhaps she can come to our house and install some discipline into the children!<\/p>","images":false},"title":{"value":"Over to the Wests"},"version":1},{"date":{"d":15,"m":5,"y":2010},"datev":20100515,"images":2,"info":{"content":"<p>In the early part of the morning Daddy took Jessica on a long, long bike ride basically around the firing range. Starting from our house, down the Red Road to Bisley and then back along the Basingstoke canal. I think Jessica enjoyed herself. She was pretty quiet and very polite if asked if she was having a good time. Daddy wonders how comfortable a ride it must be at the back being bounced around, starring into Daddy's back. Anyway, Daddy under estimated the length of ride, running late, we powered home, meeting mummy on her way down to the school.<\/p><p>The annual May Fair, this year Ben was debuting. He said that skiping was easy and was very matter a fact about it. The facts were he was the worst 'skipper' in town. It was his turn, and he was so proud and happy to be showing off to us and the crowd. He beamed, the Benny smile continously throught the performance. We couldn't help but be elated for his hapiness and the fact he thought he was good at skipping.<\/p><p>Katie later did a more complicated routine which involved platting the ribbons on the pole. There was quite a following for the Gay children. There was the Elder clan and all four grandparents, plus Uncle Peter.<\/p><p>Dadddy and Farfar left soon after for their trip to go and watch the FA Cup final at Wembley: Chelsea v Portsmouth. The first time either had been to watch a game at the new Wembley. The stadium was fantastic. 88,000 fans, half alloted to each of the teams, although the stadium bared blue at both ends. Farfar and Daddy sat high in the 'gods' section, pretty close to the half way line, above the royal box. The game itself was a little strange. Chelsea hit the woodwork 5 times in the first half, and a penalty miss from each of the sides. Chelsea had the class that told in the end. We stayed for the raising of the cup and then funneled back to the underground and home.<\/p><img src='images\/years\/2010\/2010_05_15-11-FACupFinal.jpg' class='diaryImage' alt='Daddy and Farfar outside Wembley' \/><p class='diaryImageCaption'>Daddy and Farfar outside Wembley<\/p><img src='images\/years\/2010\/2010_05_15-18-FACupFinal.jpg' class='diaryImage' alt='Wembley and its infamous pitch' \/><p class='diaryImageCaption'>Wembley and its infamous pitch<\/p><p>Meanwhile, the rest of us went back to Alton to watch Lily perform in her ballet production. Jessica was showing enough interest for her to take up ballet when she is a little older.<\/p>","images":false},"title":{"value":"May Fair - Lily Ballet - FA Cup Final"},"version":1},{"date":{"d":9,"m":5,"y":2010},"datev":20100509,"images":3,"info":{"content":"<p>In the morning Ben and Daddy joined Joey and Michael for a spot of MotoX over at Four Marks. The track had been done up and was dry. Daddy went on the main track for the first time. He wasn't happy at his performance. It was quite technical and physically and mentally tiring. Later we went in the woods over the back which was fun. There were a couple of teenagers who were literally flying in the air over the jumps and a couple of more mature chaps who got really stuck in some mud.<\/p><img src='images\/years\/2010\/2010_05_09-04-MotoX.jpg' class='diaryImage' alt='Kid flying high' \/><p class='diaryImageCaption'>Kid flying high<\/p><img src='images\/years\/2010\/2010_05_09-64-MotoX.jpg' class='diaryImage' alt='On the pull' \/><p class='diaryImageCaption'>On the pull<\/p><p>Meanwhile the rest of us went to church where Ma Ma and Pop Pop saw Katie doing church parade with Rainbows.<\/p><p>In the afternoon Charlotte and the Elders came over as well and we all had a go at Ten Pin Bowling at Farnborough. Katie won the children's competition.<\/p><img src='images\/years\/2010\/2010_05_09-18-TenPinBowling.jpg' class='diaryImage' alt=''aving a laugh' \/><p class='diaryImageCaption'>'aving a laugh<\/p>","images":false},"title":{"value":"MotoX, Weston's, Elders Ten Pin Bowling"},"version":1},{"date":{"d":8,"m":5,"y":2010},"datev":20100508,"first":{"name":"katie","value":"Lost first tooth, middle, bottom."},"images":2,"info":{"content":"<p>In the morning the team split: Daddy, Katie and Ben went to Skate Jam at Tomlinscote. Ben was quite good, managing to keep his balance, although it was pretty difficult as the smallest skates were size 12 and he's only an 8! He did well. Katie continued by skating well. Not sure Ben wants to continue with it. When we finished we walked to the Fars house. They were out. We climbed their tree in the front garden. Ben is like a monkey! Meanwhile Mummy and Jessica stood outside 'Focus' with a tin collecting for Christian Aid. The weather was cold and wet.<\/p><p>In the afternoon Mummy wanted to get on with preparing for the Come Dine With Me this evening. So Daddy took Jessica and Ben swimming at a packed Farnborough swimming pool, we also dropped off a pink birthday card for Barrie!<\/p><p>Come 7pm and the first guests arrived and were greeted by Katie who was hired as a waitress. 'Welcome to the best restaurant. My name is Katie and I'm your waitress for the evening'. That has to be worth a point or two! We had seven adult guests and three children, so a full house.<\/p><p>Katie's tooth wobbled out at about 7:30pm. The first child in the family to lose one. This seemed to affect her. She needed some re-assurance that it was not the end of the world. She managed to earn £1.50 from the tooth fairy and a £1 for waitressing. She eventually went to bed at about 10pm.<\/p><img src='images\/years\/2010\/2010_05_08-07-ComeDineWithMe.jpg' class='diaryImage' alt='Toothless Wonder' \/><p class='diaryImageCaption'>Toothless Wonder<\/p><p>Our ploy was to get everyone drunk so they could be more liberal with the scoring and try not to taste the food too much. Saying that Mummy did very well. We started with mummy's French Onion Soup, followed by Chicken Basque and ended with Daddy's Chocolate Torte. There weren't too many disaters. Just Mummy left cling film on top of the ciabatta bread when she put it in the oven!<\/p><img src='images\/years\/2010\/2010_05_08-20-ComeDineWithMe.jpg' class='diaryImage' alt='The ladies before poisoning' \/><p class='diaryImageCaption'>The ladies before poisoning<\/p><p>After dinner, we retired and had a great laugh with a wide range of topics of conversations, from the gory bits of Charlotte's nursing job to child birth and cracked nipples! We ended about midnight. The Elders and Charlotte stayed over.<\/p>","images":false},"title":{"value":"Skate Jam, Christian Aid collecting, Swimming and Come Dine With Me"},"version":1},{"date":{"d":3,"m":5,"y":2010},"datev":20100503,"info":{"content":"<p>Daddy replaced a patch of the front lawn with some turfs which don't look like they have too much life in them! We just hope they survive.<\/p><p>In the afternoon we walked \/ biked down to Frimley Lodge Park and me up with the Fars briefly. The weather was quite changable. We played football and in the secret hide out. They are still rebuilding the playground. The Fars also treated us to some bits in the cafe aftrwards.<\/p><p>Later Daddy went off with Uncle Michael for some serious mountain biking near Peaslake. We climbed Holmbury Hill and managed some downhill biking. Daddy wasn't quite as skillful as the other seasoned bikers.<\/p>","images":false},"title":{"value":"Frimley Lodge Park"},"version":1},{"date":{"d":2,"m":5,"y":2010},"datev":20100502,"images":1,"info":{"content":"<p>Early in the morning Daddy went running with Auntie Ellie around the woods in Chawton and Four Marks. A total of 7.5 miles in about 1hr 15mins!<\/p><img src='images\/years\/2010\/2010_05_02-MartinEllieJogRoute-Chawton12.2km.jpg' class='diaryImage' alt='Daddy and Auntie Ellie's Jog Route' \/><p class='diaryImageCaption'>Daddy and Auntie Ellie's Jog Route<\/p><p>After homework and lunch we went off to Tesco's to do a shop for the 'Come Dine With Me' which we are hosting this weekend. Daddy managed to bump into Max, a school friend last seen at Ravenscote (25 years ago). He's doing very well for himself, working in the city and living in Croydon.<\/p><p>We then went swimming at the Arena. We believe we need to get Ben back into swimming lessons again. It's about time he lost those armbands. Jessica is fearless in the water. She loves going down the slide as fast as possible.<\/p>","images":false},"title":{"value":"Long Run - Shopping - Swimming"},"version":1},{"date":{"d":1,"m":5,"y":2010},"datev":20100501,"images":1,"info":{"content":"<p>After SkateJam at Tomlinscote School, the Elders came over and we went to the Surrey Heath show down at Frimley Lodge Park. We all came back and played games.<\/p><p>Daddy headed on a motorbike trip down to the seaside, stopping at Wareham and then onto Lulworth Cove. The tide was out and the beach towards Durdle Door was pretty empty, so it almost seemed like some paradise, private beach with picturesque views.<\/p><img src='images\/years\/2010\/2010_05_01-08-Lulworth.jpg' class='diaryImage' alt='Durdle Door' \/><p class='diaryImageCaption'>Durdle Door<\/p>","images":false},"title":{"value":"Surrey Heath Show - Lulworth and Durdle Door"},"version":1},{"date":{"d":25,"m":4,"y":2010},"datev":20100425,"images":3,"info":{"content":"<p>Another early start. We parked up at Stockwell, caught a bus and the tube to Canary Wharf where we were presented with a wall of noise and support for all the runners. We looked out for cousin David who was due around the time we were there. Unfortunately we didn't see him. We loved the atmosphere and had huge admiration for all the runners.<\/p><img src='images\/years\/2010\/2010_04_25-00-LondonMarathon.jpg' class='diaryImage' alt='David Dixon' \/><p class='diaryImageCaption'>David Dixon<\/p><p>We had a picnic at Cabbot Square, then caught the DLR to South Quays where it was a little less crowded. Katie, and particularly Jessica, loved spotting all the fancy dress joggers who went passed. We stayed for about an hour, then headed home.<\/p><img src='images\/years\/2010\/2010_04_25-29-LondonMarathon.jpg' class='diaryImage' alt='Benny in his tram tshirt which used to be Daddy's' \/><p class='diaryImageCaption'>Benny in his tram tshirt which used to be Daddy's<\/p><img src='images\/years\/2010\/2010_04_25-23-LondonMarathon.jpg' class='diaryImage' alt='Underground Motion' \/><p class='diaryImageCaption'>Underground Motion<\/p>","images":false},"title":{"value":"London Marathon"},"version":1},{"date":{"d":24,"m":4,"y":2010},"datev":20100424,"images":3,"info":{"content":"<p>Our now annual trip to Drayton Manor was upon us. We left early and arrived at opening time. Everybody, including Jessica was looking forward today. As we arrived we saw thousands of girl guides, brownies and rainbows. A gathering to celebrate 100 of girl guiding. This did not please mummy as she feared that the 8,000 strong congregation were going to clog up the queues. However, it did not really effect our day. First stop, was of course Thomas Land. Ben just had to go on the rollercoaster first - Troublsome Trucks. The deal was to raise our hands. Meanwhile the ladies went on the aeroplane ride. We continued around Thomas Land, then headed over to the water tyre ride. We got wet!<\/p><p>We've worked out that Jessica is a bit of a thrill seeker which just sits right in the Gay family. Just Katie is a little scared of some of the rides.We continued around the park, and stopped for lunch over in Spencer's playground. The afternoon was more of the same. We tried to go on as much as possible. It was really nice that we all went on the rides, a real family day out. Ben's favourite was the shooting gallery, Katie's was the dragon rollercoaster, and Jessica just loved everything second. We exited at 6:15, went to our usual fish and chip shop, and made the 2.5 hour journey back home.<\/p><img src='images\/years\/2010\/2010_04_24-16-DraytonManor.jpg' class='diaryImage' alt='Brave Ben on the Boats' \/><p class='diaryImageCaption'>Brave Ben on the Boats<\/p><img src='images\/years\/2010\/2010_04_24-24-DraytonManor.jpg' class='diaryImage' alt='Hubba Hubba' \/><p class='diaryImageCaption'>Hubba Hubba<\/p><img src='images\/years\/2010\/2010_04_24-84-DraytonManor.jpg' class='diaryImage' alt='Jessica' \/><p class='diaryImageCaption'>Jessica<\/p>","images":false},"title":{"value":"Drayton Manor"},"version":1},{"date":{"d":18,"m":4,"y":2010},"datev":20100418,"images":3,"info":{"content":"<p>Daddy prepared bbq roasted pork for Sunday lunch out in the back garden with the Fars in attendance. It was a lovely sunny day.<\/p><p>After we played over in the field a few games: Polo, Please Mr Crocodile and Shirley Temple is a star S-T-A-R. All 7 of us played football for a bit. Jess quickly lost interest. A lovely family afternoon.<\/p><img src='images\/years\/2010\/2010_04_18-16-FarsSundayLunch.jpg' class='diaryImage' alt='Jessica Swinging' \/><p class='diaryImageCaption'>Jessica Swinging<\/p><img src='images\/years\/2010\/2010_04_18-22-FarsSundayLunch.jpg' class='diaryImage' alt='Playing Polo' \/><p class='diaryImageCaption'>Playing Polo<\/p><img src='images\/years\/2010\/2010_04_18-36-FarsSundayLunch.jpg' class='diaryImage' alt='Katie in her Indian gear' \/><p class='diaryImageCaption'>Katie in her Indian gear<\/p>","images":false},"title":{"value":"Fars over for Sunday Lunch"},"version":1},{"date":{"d":17,"m":4,"y":2010},"datev":20100417,"images":2,"info":{"content":"<p>We headed for the Vaisakhi Festival which is an Indian celebration which presents itself as a carnival through Gravesend. Ma Ma was included in the procession so was able to take Katie along as well. There was certainly plenty of colour and noise.... I think those two were the only ones who were not Indians in the procession! After a spot of lunch in Gravesend town centre with Pop Pop, we headed over to Cascades for a swim.<\/p><img src='images\/years\/2010\/2010_04_17-03-Vaisakhi.jpg' class='diaryImage' alt='A pair of Indians' \/><p class='diaryImageCaption'>A pair of Indians<\/p><img src='images\/years\/2010\/2010_04_17-11-Vaisakhi.jpg' class='diaryImage' alt='Pop Pop and Jessmunda' \/><p class='diaryImageCaption'>Pop Pop and Jessmunda<\/p><p>Ben of course wanted to go on the flumes, and Katie was hesitant at first, but later went down. Jessica loved playing on the smaller slides.<\/p><p>We popped back to Istead Rise for a cup of tea, before heading to Tatsfield to lay some flowers on Great Nan and Pop Pop's grave. A beautiful area.<\/p>","images":false},"title":{"value":"Vaisakhi Festival, Gravesend - Cascades"},"version":1},{"date":{"d":16,"m":4,"y":2010},"datev":20100416,"first":{"name":"benjamin","value":"Splinter"},"info":{"content":"<p>Ben was squeeling like a girl, before hand. 'I'm not a brave boy'... 'No Daddy'. Daddy cleared the room, tussled with Ben who was told it would hurt more if he struggled. Anyway he momentarily calmed down. Daddy pierced the skin at the base of Ben's thumb, then got the tweesers and slid the  splinter out. Done in about 5 seconds. Ben then continued to make as much fuss afterwards even though he was fine for the delicate operation.<\/p>","images":false},"title":{"value":"Ben gets a splinter"},"version":1},{"date":{"d":11,"m":4,"y":2010},"datev":20100411,"images":1,"info":{"content":"<p>In the morning Richard came around to take Daddy to the Frimley Park Hospital 10km run. He met up with Michael who sits next to him at work and who never has gone close to a 10km run.... so  he should come 1st out of these 3. Wrong. Very wrong. Michael completed the course in a staggering 43 minutes, which is so unfair, but Richard also pipped Daddy in the last mile to finish a second quicker than Daddy! I know it's not fair. Daddy hadn't posted a bad time at 55 minutes, but Richard's training paid off as he re-joined Daddy at about the 9km marker. The final kilometer was a had fought affair between the two. Richard overtook Daddy in the final 100 metres in a sprint finish. Very exciting!<\/p><img src='images\/years\/2010\/2010_04_11-MartinRichardFrimleyPark10km.jpg' class='diaryImage' alt='Nothing between Daddy and Richard' \/><p class='diaryImageCaption'>Nothing between Daddy and Richard<\/p><p>We all watched along with Karen and Evie. They came around after for a drink. They couldn't quite believe the result. Well done Richard.<\/p><p>In the afternoon Ben wanted Daddy to take him to Sophie Ann's birthday party held at her house. There were 9 girls and just 3 boys. Ben was a little shy and didn't mix with the other children much. Initially he said he didn't want to be there. However, he warmed up and enjoyed winning some sweets. They are all his class mates, but he has his two favourites: Joey and Oliver. Outside of that he's not interested. Katie is a little more socialable.<\/p><p>We all met up at Frimley Lodge Park and played cricket and football. The playground was being re-built.<\/p><p>Ben was asking if he keeps breathing, then will he run out of breath. Then he asked if air goes into my body then where does it go? Is the air we breathe dirty? He was thinking through all the answers and coming up with very logical follow up questions. He's a little bright button.<\/p>","images":false},"title":{"value":"Frimley Park 10km - Sophie Ann 5th Birthday Party"},"version":1},{"date":{"d":10,"m":4,"y":2010},"datev":20100410,"images":1,"info":{"content":"<p>Last night we had Katie's best friend, Leah Sumner to stay. They get along very well together, and she is such a nice girl, we're really pleased Katie has a good friend. Anyway they stayed up until gone 11pm, sleeping downstairs in the camp they had made. Katie didn't like sleeping downstairs without an adult, so dragged Mummy to sleep on the sofa, then later got on the sofa with her.<\/p><first name=\"katie\">In the morning Daddy took Katie for her first rollerskating experience at the Arena. After a wobbly start Katie found her rythem and managed to go up and down 25m without slipping over. She loved it and wants to go again.<\/first><p>On this fine, sunny day we cycled over to the Garden Of Eden swings for some playtime. Daddy and Ben played football. Jessica embarrassingly, lifted her dress and went to the toilet in the middle of the playground. Shocking. Luckily no one else saw.<\/p><img src='images\/years\/2010\/2010_04_10-07-GardenOfEden.jpg' class='diaryImage' alt='Our bike ride' \/><p class='diaryImageCaption'>Our bike ride<\/p>","images":false},"title":{"value":"Leah over to stay, Skate Jam, Garden Of Eden"},"version":1},{"date":{"d":8,"m":4,"y":2010},"datev":20100408,"info":{"content":"<p>It was time for us to take Ma Ma out for her annual Mothers day outing. It has become tradition for the day to have a horsey theme, but Mummy is running out of places to take her. In the end Mummy googled horse sanctuaries and the nearest was in Buckinghamshire. She also found out that the Roald Dahl childrens gallery is close by and Katie and Ben are great fans of his books so this seemed a good idea. In typical Mummy fashion she hadn't bothered to check out the directions and we ended up in Reading. We eventually arrived in Ayelsbury at midday, then could not find the museum and we had to lugg the kids round and round the town centre, eventually we found it but were then told you have to book time slots! This day was not going well, five hungry fed up children. However we booked a one 0 clock slot, Mummy and Katie went and got the picnic from the car and then we sat in the lovely sunshine in the gardens of the museaum and had a yummy picnic with the kids running round having fun. We went into the museum and it was very good. There was a giant peach, fantastic Mr fox's den to crawl in, the twits house and lots of fun things to do. After this we drove towards the horse santuary but again we had no idea how to get there, luckily a passer by gave some good instuctions. After stopping at a great park we got to the horses with 20 minutes until it shut. It was a lovely place with lots of retired police and military horses that were huge. There was about 70 stables with horses in and beatuiful paddocks. Ma ma and the children loved it.<\/p>","images":false},"title":{"value":"Roald Dahl Children's Gallery, Home Of Rest For Horses"},"version":1},{"date":{"d":5,"m":4,"y":2010},"datev":20100405,"images":3,"info":{"content":"<p>In the morning Daddy spread horse poo around the garden much to the dismay of Mummy.<\/p><p>We then headed to the highest point in Surrey, Box Hill, where we met up with the Sanders to participate in the Cadbury's Easter Egg trial. Within 5 minutes all three children were muddy, and that's whilst we were sorting ourselves out.<\/p><p>Although we were at Box Hill, we could have been in any woods, as we didn't go up or down or see any views! It started quite muddy, but re-assured when a passer by said it'll get better. Well it didn't. We had fun solving the clues and Mummy got the key phrase impressively early on.<\/p><p>It took an hour or so to get around. We then had a nice picnic. The children all went off to play. Ben was very proud of himself climbing a tree. His personality can't help put a smile on your face!<\/p><p>Ben latest word usage:<\/p><ul><li><i>Hail Stones<\/i>Hail Balling\u000a        <\/li><li><i>Aftershave<\/i>Aftershade\u000a        <\/li><li><i>Pins and Needles<\/i>Nuts and bolts\u000a        <\/li><li><i>Hicups<\/i>Hee-cups\u000a        <\/li><\/ul><img src='images\/years\/2010\/2010_04_05-02-EasterBoxHill.jpg' class='diaryImage' alt='Spiderman' \/><p class='diaryImageCaption'>Spiderman<\/p><img src='images\/years\/2010\/2010_04_05-06-EasterBoxHill.jpg' class='diaryImage' alt='Fi Fi' \/><p class='diaryImageCaption'>Fi Fi<\/p><img src='images\/years\/2010\/2010_04_05-17-EasterBoxHill.jpg' class='diaryImage' alt='What a bunch of animals' \/><p class='diaryImageCaption'>What a bunch of animals<\/p>","images":false},"title":{"value":"Sanders, Box Hill Easter Egg Trail"},"version":1},{"date":{"d":4,"m":4,"y":2010},"datev":20100404,"info":{"content":"<p>In the morning we went to church, leaving Daddy to make some cakes for this afternoon: Lemon Crunch and Flapjack.<\/p><p>We made it over to the Elders for a lovely roast pork.<\/p><woops rating=\"5\" woopstitle=\"Football volleyed into Katie's face\"><p>We played alot of football on the green behind the Elders house. There was one unfortunate incident where Daddy volleyed the ball, quite hard, into Katie's face, right where she had a bruise from the day before. Katie was very brave, didn't cry, just a bit shocked and carried on!<\/p><br \/><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/Wrv93A5108w&amp;hl=en_GB&amp;fs=1&amp;rel=0\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/Wrv93A5108w&amp;hl=en_GB&amp;fs=1&amp;rel=0\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><\/div><br \/><\/woops><p>Joey was as good at football as Ben was bad. I just can't see Ben making it as a footballer, hope he proves Daddy wrong! Katie knows what she is doing on the pitch as well.<\/p><p>Later in the afternoon some of the other Barnett family turned up and we played Family Fortunes DVD game.<\/p>","images":false},"title":{"value":"Elders Easter Party"},"version":1},{"date":{"d":3,"m":4,"y":2010},"datev":20100403,"info":{"content":"<p>Katie, Ben and Daddy cycled through the muddy woods to the Fars house. Unfortunately Katie, when racing down the first hill, fell off. Crash, slap, thud, arrgghh. A bump on the head for her troubles. Anyway after a certain amount of trashing of the Fars house, we cycled back without incident.<\/p><p>In the afternoon we went over to the Sanders to drop off Evie's Easter present, went to the playground and then made pastry cakes, before we played board games in the evening.<\/p>","images":false},"title":{"value":"Fars"},"version":1},{"date":{"d":2,"m":4,"y":2010},"datev":20100402,"info":{"content":"<p>In the morning Daddy and Jessica spent time with the Fars, whilst Mummy, Ben and Katie participated in the Easter Workshop held at church. Mummy manned the stained glass window station. Ben and Katie made some Eater bits and bobs which they were very proud of. We all came back and after Ben danced to the 'Conker' song, known to the rest of us as 'Conga'!<\/p><p>We then headed west to Polesden Lacey (NT) where there was an Easter Egg hunt. Of course there were certain members of our group who were very excited whilst going around the grounds looking for eggs. We then played ball games on the lawn afterwards. We didn't actually get very near the house at all!<\/p>","images":false},"title":{"value":"Easter Workshop and Polesden Lacey Easter Egg Hunt"},"version":1},{"date":{"d":28,"m":3,"y":2010},"datev":20100328,"images":3,"info":{"content":"<p>In the morning Daddy and Ben joined Michael, Joey and Charlotte at the Moto Cross track at Four Marks. Daddy fell off whilst going around a particularly muddy corner. Still he loved every minute of it.<\/p><img src='images\/years\/2010\/2010_03_28-37-MotoX.jpg' class='diaryImage' alt='Brummm Brumm' \/><p class='diaryImageCaption'>Brummm Brumm<\/p><img src='images\/years\/2010\/2010_03_28-43-MotoX.jpg' class='diaryImage' alt='Off I go' \/><p class='diaryImageCaption'>Off I go<\/p><img src='images\/years\/2010\/2010_03_28-62-MotoX.jpg' class='diaryImage' alt='Finally off' \/><p class='diaryImageCaption'>Finally off<\/p>","images":false},"title":{"value":"Moto Cross"},"version":1},{"date":{"d":27,"m":3,"y":2010},"datev":20100327,"images":2,"info":{"content":"<p>There was an advert for free boat trips down the Thames which we took advantage of. We first drove to Hampton Court Palace and had a quick look around the free bits. Then got on the paddle boat and headed eastwards. We all loved playing about on the boat, probably to the determent of the other passangers. There was a lower deck which we had all to ourselves where we made up games. Mummy and Daddy forced us outside so we 'could enjoy the river views'. We spotted people's gardens, islands, boats people lived in and other vessels sailing down the river.<\/p><p>After half an hour we reached Kingston, got off and had our picnic and another chance for Katie and Ben to scooter. Ben is the absolute worst. He just doesn't look where he is going so others on the promenade have to dodge him rather than the other way around. He also tends to fall off alot.<\/p><p>We went in WHSmiths to look at childrens books and board games, before returning to the wharf for our return journey. The weather was just about OK. We did plenty of walking.<\/p><img src='images\/years\/2010\/2010_03_27-20-ThamesBoatTrip.jpg' class='diaryImage' alt='Scooter terrorizer at Hampton Court Palace' \/><p class='diaryImageCaption'>Scooter terrorizer at Hampton Court Palace<\/p><img src='images\/years\/2010\/2010_03_27-26-ThamesBoatTrip.jpg' class='diaryImage' alt='Picnic at Kingston' \/><p class='diaryImageCaption'>Picnic at Kingston<\/p>","images":false},"title":{"value":"Hampton Court to Kingston boat trip"},"version":1},{"date":{"d":26,"m":3,"y":2010},"datev":20100326,"images":1,"info":{"content":"<p>Daddy had the day off work. After taking Katie and Ben to school, Mummy, Daddy and Jessica went to Tri Lakes, as Jessie is always bery excited about seeing farm animals. It was a very nice walk around the lakes, although Jessica was on Mummy's shoulders for 90% of the circuit. She likes to try and meet the animals, however, as soon as the animals approach, the nervousnous descends and Jessica backs away.<\/p><p>We later had Hallemah around for tea. Mummy and Daddy tried to watch 'Blood Diamond' (a film), however it was too violent and switched it off after half an hour. It was only rated a 15!<\/p><img src='images\/years\/2010\/2010_03_26-01-TriLakes.jpg' class='diaryImage' alt='Mummy and Jessica enjoying the sheep' \/><p class='diaryImageCaption'>Mummy and Jessica enjoying the sheep<\/p>","images":false},"title":{"value":"Tri Lakes"},"version":1},{"date":{"d":21,"m":3,"y":2010},"datev":20100321,"images":1,"info":{"content":"<p>Daddy was at work so we went to Ma Ma and Pop Pops to pick up Ben and to take part in the sport relief mile. We all ran except for Jessica who was pushed in the buggy by Mummy. We managed to run for most of it. Ben kept complaining his hip was hurting at times. At the end the Mayor gave everyone a medal and goody bag. Jess was well pleased with her medal. After the race we went for a picnic by the river.<\/p><img src='images\/years\/2010\/2010_03_21-SportReliefNewspaper.jpg' class='diaryImage' alt='Gravesend Messenger - Newspaper' \/><p class='diaryImageCaption'>Gravesend Messenger - Newspaper<\/p>","images":false},"title":{"value":"Sport Relief Mile"},"version":1},{"date":{"d":20,"m":3,"y":2010},"datev":20100320,"images":1,"info":{"content":"<p>In the morning Ben went over to stay at Ma Ma and Pop Pop's, along with Joey and Uncle Peter.<\/p><p>Meanwhile Uncle Michael and Lily came over for a spot of lunch and a play. In the afternoon we all went over to the Aquadrome. Katie loved the slides and Jessica the rapid river and elephant slide.<\/p><img src='images\/years\/2010\/2010_03_20-01-LilyVisit.jpg' class='diaryImage' alt='The ladies' \/><p class='diaryImageCaption'>The ladies<\/p>","images":false},"title":{"value":"Ben to Ma Ma's, Swimming with the Elders"},"version":1},{"date":{"d":14,"m":3,"y":2010},"datev":20100314,"images":3,"info":{"content":"<p>Both Katie and Ben have been making such a big thing of Mother's Day this year. We have been making pictures and sticking them all around Mummy's bedroom. We have also made lots of cards.<\/p><img src='images\/years\/2010\/2010_03_14-00-MothersDay' class='diaryImage' alt='Mothers Day parafanalia' \/><p class='diaryImageCaption'>Mothers Day parafanalia<\/p><p>Ben got up at 6:15, and asked to make breakfast in bed for mummy. Daddy did, and we opened the presents up in bed. After a double church service, we drove up to London. It was a sunny day. First we went up the Monument. We enjoyed going up and down the stairs more than experiencing the views!<\/p><p>We then went for a little walk along the Thames with our scooters. We had a whale of a time terrorizing the peadestrians.<\/p><img src='images\/years\/2010\/2010_03_14-46-Monument.jpg' class='diaryImage' alt='Katie Scootering' \/><p class='diaryImageCaption'>Katie Scootering<\/p><img src='images\/years\/2010\/2010_03_14-50-Monument.jpg' class='diaryImage' alt='Ben Scootering' \/><p class='diaryImageCaption'>Ben Scootering<\/p>","images":false},"title":{"value":"Mothers Day - Monument"},"version":1},{"date":{"d":13,"m":3,"y":2010},"datev":20100313,"info":{"content":"<p>In the morning Daddy and Jessica quickly went around to the Fars to borrow their computer. Ours has broken... for good. It was a little battle weary.<\/p><p>We were then pretty much dragged out of the house by Mummy and Daddy to Sunningdale.... and thank goodness they did. We went to the best playground ever. We also played Pooh sticks and went for a little walk. Ben was testing us all as went close to the edge of the stream bank. He was surely not going to fall in again! No.<\/p><p>After a quick lunch Mummy took Ben to Cross Farm school for Alice's birthday, whilst us girls went with Daddy to watch Chertsey play football. Here is Katie's account in list form:<\/p><ul><li>Went with Daddy to Chertsey (had to be corrected as I kept calling them Chelsea!)<\/li><li>Sneaked up on Farfar<\/li><li>Had some crisps!<\/li><li>Walked around pitch<\/li><li>Getting thirsty. Wanted water<\/li><li>Half time. Had water and cake and chocolate<\/li><li>Walked around ground<\/li><li>Stopped with Farfar<\/li><li>Got home<\/li><\/ul><p>In the evening Daddy cooked some dinner as the Wests came over. A nice evening.<\/p>","images":false},"title":{"value":"Sunningdale, Chertsey, Alice 5th Birthday, Wests Over"},"version":1},{"date":{"d":7,"m":3,"y":2010},"datev":20100307,"images":2,"info":{"content":"<p>After church we over to the Fars for a Danish Sunday lunch. Mummy and Jessica left half way through to go to Natasha Birthday in Kenley.<\/p><p>Katie wrote what she did, so that Mummy could get a full report. Here is what she said:<\/p><ul><li>Making a spaceship from paper<\/li><li>Played Coppit (and won)<\/li><li>Played Bingo (and won)<\/li><li>Attack Daddy<\/li><li>Gave a play<\/li><\/ul><img src='images\/years\/2010\/2010_03_07-03-FarsSundayLunch.jpg' class='diaryImage' alt='Coppit' \/><p class='diaryImageCaption'>Coppit<\/p><img src='images\/years\/2010\/2010_03_07-07-FarsSundayLunch.jpg' class='diaryImage' alt='Perfoming a play for their adoring fans' \/><p class='diaryImageCaption'>Perfoming a play for their adoring fans<\/p>","images":false},"title":{"value":"Fars Sunday Lunch, Natasha's 2nd Birthday Party"},"version":1},{"date":{"d":6,"m":3,"y":2010},"datev":20100306,"images":1,"info":{"content":"<p>Daddy and Jessie went shopping first up, getting some bits for the latest DIY.<\/p><p>We had am early lunch then set off for Bedfont Lakes, somewhere recommended by a friend. It was a country park which meant a nice long walk, with a spot of playground action. It was pretty cold, but we had fun.<\/p><img src='images\/years\/2010\/2010_03_06-31-BedfontLakes.jpg' class='diaryImage' alt='The family - loving Ben in the glasses' \/><p class='diaryImageCaption'>The family - loving Ben in the glasses<\/p><p>Later in the afternoon, Mummy went with Caroline and Sarah to Nirvana Spa, where she had a chance to relax and forget about it all. Daddy loved the opportunity to bath, read, play games and put us all to bed. Mummy couldn't help herself and even though mobile phones are banned she couldn't help phoning from the toilets like a naughty school girl!<\/p><p>This week we learnt how to play Cluedo and beat Daddy twice. We got how to play it and don't need any help. We all love it.<\/p><p>Also this week Mummy and Daddy went to parents evening at Cross Farm. Katie's report was that she was a little quiet, socialable, good at story writing and reading. The handwriting and maths were average, but could do with a little more care and to slow down.<\/p><p>Katie's spellings this week included: Doubtless, Expressionless, Effortless, Breathless, Homeless, Fearless. Katie could spell them by the end of the week which was pretty impressive we think. However, it is a struggle to get Katie to do her homework, especially the Maths. Saying that, she does get quite a bit and we find it difficult to fit it in during the evening.<\/p><p>Ben, also had a glowing report. He was reported to be very good at Maths, very helpful in the classroom. He is eager to learn. A very bright button in deed. He's quite happy to do his homework, and finds reading quite easy.<\/p>","images":false},"title":{"value":"Bedfont Lakes, Nirvana Spa"},"version":1},{"date":{"d":28,"m":2,"y":2010},"datev":20100228,"images":4,"info":{"content":"<p>Today we were luck enough to have two birthday parties. The first was over in rainy, windy, Dartford. Fortunaltey it was an indoor event at a small playgroup and softplay place. It was really quite quaint the setup. There were 12 children in total which was just about right. We all had a good laugh, especially when Daddy caught Mummy in the eye with one of the play pit balls! Katie and Ben won the musical bumps and Ben won an addtional prize for his dancing skills. A unique style which is hard to describe. It involves looking quite serious and moving the shoulders up and down.<\/p><p>After the party we popped over to Istead Rise and had a cup of tea at Ma Ma and Pop Pop's before directly going to Joey's party at the Country Market. It was a joint do with Isabella which is becoming tradition now. This year there was 'Jester Giggles' keeping the children entertained. The children of course enjoyed themselves.<\/p><img src='images\/years\/2010\/2010_02_28-19-JoeyBday.jpg' class='diaryImage' alt='Katie Gay' \/><p class='diaryImageCaption'>Katie Gay<\/p><img src='images\/years\/2010\/2010_02_28-29-JoeyBday.jpg' class='diaryImage' alt='Let 'em eat cake' \/><p class='diaryImageCaption'>Let 'em eat cake<\/p><img src='images\/years\/2010\/2010_02_28-37-JoeyBday.jpg' class='diaryImage' alt='Ben's dancing' \/><p class='diaryImageCaption'>Ben's dancing<\/p><img src='images\/years\/2010\/2010_02_28-04-JoeyBday.jpg' class='diaryImage' alt='Jessica and Uncle Michael sharing a laugh' \/><p class='diaryImageCaption'>Jessica and Uncle Michael sharing a laugh<\/p>","images":false},"title":{"value":"Alice Teale's 3rd, Joey Elder's 5th Birthday Parties"},"version":1},{"date":{"d":27,"m":2,"y":2010},"datev":20100227,"info":{"content":"<p>In the morning Daddy went for a 10km jog, first in a long, long time. After some lego action, Uncle Steven came around for a traditional Gay Saturday lunch. 2 Poached egg on fresh bread, bacon, sausages, baked beans, mushroom, cup of tea. The business.<\/p><p>Steven and Daddy went Go Karting with some distant-ish friends in Frimley. Daddy of course came first in all three races. Ben's keeper of the trophy. Daddy enjoyed the circuit, probably the quickest indoor circuit he's been on.<\/p><p>Auntie Charlotte came over and in the evening Mummy and Daddy went out for the first of the 'Come Dine With Me' challenges over at the Sanders. It was all very posh. A bit of sparkly and canopies to begin with followed by pumpkin soup, lamb and the pièce de résistance, chocolate fondant, which was done perfectly. A really good evening had by all.<\/p><p>... Well almost all. Katie for the second time now hasn't taken too kindly to being left without mummy being at home. She only went to bed for half an hour, out of the 5 hours that Mummy and Daddy were out. The poor Fars. This means that next week, Daddy is going to miss out on going to Uncle Richard's 60th do.<\/p>","images":false},"title":{"value":"Karting, Come Dine With Me"},"version":1},{"date":{"d":20,"m":2,"y":2010},"datev":20100220,"info":{"content":"<p>Early doors, Katie had a hike with the Rainbow pack down at Frimley Lodge Park. It was cold and rainy, but Kaite enjoyed the hotdogs!<\/p><p>Later, we went to Heathrow to pickup Uncle Howard, Ma Ma, Pop Pop and Auntie Ellie from their Texan holiday.<\/p>","images":false},"title":{"value":"Rainbow Hike, Airport pickup"},"version":1},{"date":{"d":20,"m":2,"y":2010},"datev":20100220,"info":{"content":"<p>In the afternoon we joined the Elders, minus Aunir Ellie, in a trip to the playground over at Brooklands. All the children enjoy it as it has a race track for the bikes and scooters. Katie also went on the BMX jumps. We had a game of football. Ben still doesn't quite grasp it. He spent half the time falling over the comparitively massive ball! Daddy also got a rocket for Christmas which we all tried out. It shot miles up into the air.<\/p><p>We got back, played for a bit and the Elders stayed overnight<\/p>","images":false},"title":{"value":"Elders overnight stay and Brooklands"},"version":1},{"date":{"d":16,"m":2,"y":2010},"datev":20100216,"info":{"content":"<p>We all three children were to have spent last night at the Fars but Katie got a bit wobbly and went home late but returned first thing in the morning. Earlier, we made heart shaped coaster mats with plastic beads that Farmor set hard for us with an iron. We also played colour mixing on the CBBC website. Lots of story books were read both in the evening and this morning.<\/p><p>After turning the house upside down during most of the morning, we went out in the pouring rain to Tescos for lunch. We then got stuck in a big traffic jam on the way back and had to get Auntie Susan, on the phone, to call Pine Ridge near Heatherside to say we would be late. We were going there for Ten Pin Bowling. We got there a half hour late but we did not lose our booking.<\/p><p>Farfar won of course but Ben and Farmor had the same score with Katie only five points behind, a close match. Jessica did not join in but was happy to run around the centre smiling at everyone. We got back to the Fars in mid afternoon and were collected by mummy and daddy who were told that all three children behaved very well with, as usual, no upsets.<\/p><p>We think the Fars, by the time they had cleared up their house, had had enough of noisy active children but we knew that they were happy to have shared twenty-four hours together.<\/p>","images":false},"title":{"value":"Sleep over at Fars"},"version":1},{"date":{"d":15,"m":2,"y":2010},"datev":20100215,"images":2,"info":{"content":"<p>It is half term Daddy had some time off. It is still bitterly cold outside, however we decided to go up to Woburn Safari Park. I think there is more roadwork motorway mileage than clear stretches of road! Well we had some fun in the car going around to see the animals. There is Katie who worringly is getting increasingly more and more nervous around things. She was scared of the animals as we went round. 'Come on Dad we've seen this now', 'I'm bored of this animal', 'Stop opening the windows'. The last one is a reference to Daddy's attempt of humour and purposely winding her up.<\/p><p>Jessica on the other hand was absolutely loving it. I think because she has seen the animals in her books, she got a lot out of it, seeing them in real life. A special mention to the lion area. Fantastic. There must have been over a dozen lions all moving about, at one point there was a stand off and I bit of semi-serious fighting. We heard some small 'RRROOAARRRS' as well.<\/p><p>We of course got monkeys on our car, which Ben and Jessica loved and screamed in excitement. We had Katie on the other hand getting hysterical and pleading for us to move on. Oh you can imagine the atmosphere in the car!<\/p><p>We parked up and walked around the Walabies. Mummy tried this Australian accent, which sounded nothing like an Australian, but Katie was getting most annoyed. Daddy said he was starving hungry, and cheeky Katie replied 'Daddy you are not starving. You may be hungry, but you are not starving'. Cheeky little madam! There was an outdoor adventure play area, as well as a good indoor softplay. Jessica loved the sack slide. Daddy loved the vertical drop slide, and Mummy chickened out of the junior big slide!<\/p><p>We visited the Lemurs which made a horrendous racket, went into the petting zoo. Jessica is pretty confident with the animals around her. We finally ended up seeing the Penguins and Sea Lions. By this point snow was coming across horizontally, so we decided to head back.<\/p><p>The children went off to the Fars for an overnight stay, whilst Mummy and Daddy went for a late Valentine's Meal in Camberley. We got a phone call a little later. Katie was upset and homesick, so she came home for the night.<\/p><img src='images\/years\/2010\/2010_02_16-29-WoburnSafariPark.jpg' class='diaryImage' alt='A family of monkeys!' \/><p class='diaryImageCaption'>A family of monkeys!<\/p><img src='images\/years\/2010\/2010_02_16-12-WoburnSafariPark.jpg' class='diaryImage' alt='Competing Lions' \/><p class='diaryImageCaption'>Competing Lions<\/p>","images":false},"title":{"value":"Woburn Safari Park"},"version":1},{"date":{"d":14,"m":2,"y":2010},"datev":20100214,"info":{"content":"<p>We picked Katie up from Leah's, and today we had Church Parade. In the afternoon we picked Charlotte up from her Brazil holiday. She came around for a bit.<\/p>","images":false},"title":{"value":"Pick Charlotte up from Heathrow"},"version":1},{"date":{"d":13,"m":2,"y":2010},"datev":20100213,"images":2,"info":{"content":"<p>Daddy went with Farfar on a very long train trip up to Whitley Bay to see Chertsey play in the FA Vase 5th round replay. Poor Farfar was feeling a little sick. We got there with plenty of time to spare. There was a huge crowd, 1080 supporting Whitley, about 20 supporting Chertsey! It was a really close, entertaining, chances at either end match. Unfortunately we lost 2-1.<\/p><img src='images\/years\/2010\/2010_02_13-01-WaterlooBridgeLookingEast.jpg' class='diaryImage' alt='Quick snap from Waterloo Bridge as we cross on a bus' \/><p class='diaryImageCaption'>Quick snap from Waterloo Bridge as we cross on a bus<\/p><img src='images\/years\/2010\/2010_02_13-04-WhitleyBayChertsey.jpg' class='diaryImage' alt='Just look at the crowd' \/><p class='diaryImageCaption'>Just look at the crowd<\/p><p>Katie was very excited about the prospect of sleeping over at Leah's house. She is her best friend, and the first time she's slept over. There were four bags of stuff, most of them toys to take over. Anyway they stayed up till 11pm!<\/p>","images":false},"title":{"value":"Katie sleepover at Leah's, Daddy at Whitley Bay"},"version":1},{"date":{"d":7,"m":2,"y":2010},"datev":20100207,"info":{"content":"<p>Daddy had to go work whilst we played at home all day.<\/p>","images":false},"title":{"value":"Daddy at work"},"version":1},{"date":{"d":6,"m":2,"y":2010},"datev":20100206,"images":2,"info":{"content":"<p>Whilst Ben went to Elisha's disco birthday party at the school with Mummy, the rest of us went over to the Fars for a spot of playtime and lunch.<\/p><p>In the afternoon, Mummy, Kaite and Ben went with Ellie and Lily to the cinema to watch Princess and the Frog. The other halves went to watch the mighty Chertsey play Whitley Bay in the 5th round of the FA Vase, which ended up 1-1 after extra time. It was good to see some old faces amongst the 617 crowd. Joey and Jessica didn't think too much of it though.<\/p><p>In the evening we played a 'Friends' TV show game.<\/p><img src='images\/years\/2010\/2010_02_06-11-CheryseyWhitleyBay.jpg' class='diaryImage' alt='Chertsey under lights...' \/><p class='diaryImageCaption'>Chertsey under lights...<\/p><img src='images\/years\/2010\/2010_02_06-98-CheryseyWhitleyBay.jpg' class='diaryImage' alt='Chertsey under lights...' \/><p class='diaryImageCaption'>Chertsey under lights...<\/p>","images":false},"title":{"value":"Chertsey T V Whitley Bay, Cinema"},"version":1},{"date":{"d":31,"m":1,"y":2010},"datev":20100131,"images":1,"info":{"content":"<p>In the morning the boys watched Andy Murray in the Final of the Austrlian Open and went for a bike ride, whilst the girls went to pick up Lily and Katie. Ben's has only just learnt to ride without stablizers on his new bike he got for Christmas. Unfortunately it is a bit big for him, and he can't touch the floor without falling over. His cycle helmet was proving a little bit of a hindrance as well. As it is a little large it was falling over his face. He was sometimes riding blind, proved by the fact he went straight into a concrete bollard, and sometimes used the gaps in the top of the helmet to see out of! He provided plenty of comedy.<\/p><p>Daddy cooked a lamb styled gyros with Chocolate Torte for Auntie Susan and Graham who came over for lunch. We all played Lego in the afternoon. Graham made a good spaceship, whilst Jessica and Susan were having a whale of a time.<\/p><p>In the early evening we went to the church fair where we played games and quizzes. Great Grandma, Grandad and Uncle Peter were all there too.<\/p><img src='images\/years\/2010\/2010_01_31-01-TremearsElders.jpg' class='diaryImage' alt='Action Packed Day' \/><p class='diaryImageCaption'>Action Packed Day<\/p>","images":false},"title":{"value":"Tremears Sunday Lunch, Church Party"},"version":1},{"date":{"d":30,"m":1,"y":2010},"datev":20100130,"images":1,"info":{"content":"<p>In the morning we went over to Woking swimming pool and met up with Ma Ma, Pop Pop and the Elder clan. I think it was Jessica's first go on the flumes and she loved it. Of course Ben wanted to live in the flumes, Katie of course won't go near them.<\/p><p>We had to quickly rush off to Freya's 5th birthday party at the Arena leisure centre. There was a huge inflatable assault course, party games and customary party meal.<\/p><img src='images\/years\/2010\/2010_01_30-21-FreyaBirthday.jpg' class='diaryImage' alt='Freya blowing the candles out' \/><p class='diaryImageCaption'>Freya blowing the candles out<\/p><p>Meanwhile, we left Katie with Ma Ma and Pop Pop who were having a girls day back in Istead Rise along with Lily.<\/p><p>\u000a        In the afternoon Daddy went to watch Chertsey put in a good performance over in Cove. Highlights\u000a        <a href=\"http:\/\/www.youtube.com\/watch?v=1MAdpC_ofvQ\">\u000a          here\u000a        <\/a>\u000a        .\u000a      <\/p><p>Michael, Ellie and Joey popped over for some tea and playtime and stayed the night.<\/p>","images":false},"title":{"value":"Swimming, Freya's 5th Birthday, Katie over at Ma Ma's, Elders over to stay"},"version":1},{"date":{"d":24,"m":1,"y":2010},"datev":20100124,"images":1,"info":{"content":"<p>After church, we headed over to the Fars and played lego for a bit.<\/p><p>In the afternoon we went to the Devil's Punchbowl near Hindhead, just for a walk, something that Ben wasn't really looking forward to. He just wanted to go back to Brooklands to the stunt track. Anyway we took the scooters and went for a nice, muddy walk. The views were good. We lasted just over an hour. Ben commented it's just 'full of nature' in his exuberant manner. All the children loved it, we could feel the cobwebs blowing off us. A thoroughly good walk.<\/p><img src='images\/years\/2010\/2010_01_24-03-DevilsPunchbowl.jpg' class='diaryImage' alt='Little devils' \/><p class='diaryImageCaption'>Little devils<\/p>","images":false},"title":{"value":"Devils Punchbowl"},"version":1},{"date":{"d":23,"m":1,"y":2010},"datev":20100123,"info":{"content":"<p>Ma Ma and Pop Pop came over for a bit of lunch and a play.<\/p><p>Daddy went over to watch Chertsey play in the FA Vase 4th round. A crowd of over 300 saw Chertsey knock 6 past Plymouth Parkway.<\/p>","images":false},"title":{"value":"Ma Ma and Pop Pop Over, Chertsey win 6-0 in the cup"},"version":1},{"date":{"d":17,"m":1,"y":2010},"datev":20100117,"info":{"content":"<p>Arrived at Ikea, Wembley with a doctor on blue lights, great start. It was final day of sales so it was packed. Half way around, there was some shouting and shoving going on. Turns out one bloke had puched another. Quality!<\/p><p>The only surprising thing is that we didn't get stressed at all and sailed around having fun! Even had a hot dog and an ice cream.<\/p>","images":false},"title":{"value":"Ikea"},"version":1},{"date":{"d":16,"m":1,"y":2010},"datev":20100116,"info":{"content":"<p>The snow is rapidly melting. We can't really remember what it normally looks like around here. We can now see grass! Today Katie had two parties. First her best friend, Leah Somner's at Wizzy World. It was manic inside and out. There was an 1.5 hour queue just to get back to the B and Q roundaout! Daddy and us three went in a played. We had a great time.<\/p><p>We then rushed to Leah Rushforth's house for her fairy party. A different party where they did art and craft stuff.<\/p>","images":false},"title":{"value":"The two Leah's parties"},"version":1},{"date":{"d":10,"m":1,"y":2010},"datev":20100110,"info":{"content":"<p>Only eight made it to church today due to the weather. Mummy had fun driving in the ice after dropping Daddy off at the Fars. Never again she vowed!<\/p><p>In the afternoon Daddy and Katie went to Cross Farm to help clear the paths to give school a chance of starting up again tomorrow.<\/p><p>Mummy started to build an igloo, which was quite impressive.<\/p>","images":false},"title":{"value":"Igloo"},"version":1},{"date":{"d":9,"m":1,"y":2010},"datev":20100109,"images":3,"info":{"content":"<p>We have not seen as much snow as we've got now. It started falling on Tuesday and with the sub-zero temperatures it has remained ever since. Daddy worked from home on Wednesday. We have been off school since then as well.<\/p><p>During the week we have ventured out, although we've not lasted more than an hour, before one of us gets too cold and upset. We've done a bit of sledging which we have all enjoyed, we've also camped out in the three igloos that have been built around the estate. Daddy has also built a large snowman in the front garden.<\/p><p>Today, Katie's party she was going to attend was cancelled, so in the afternoon we went over to vist Auntie Susan and Graham. We took the sledges and went down the hill in the park at the back of their house. The Fars came to and also hurtled down the slope. Mummy spent most of the time slipping over on the ground!<\/p><p>After a cup of tea, we continued our journey to the swimming pool in Wokingham. Again good time was had by all even though Mummy and Daddy thought the water was a little cold!<\/p><p>On our way home we popped into the supermarket to do some shopping for Great Grandma and Grandad. It's too slippery for them to safely go out of the house.<\/p><img src='images\/years\/2010\/2010_01_09-14-Sledging.jpg' class='diaryImage' alt='Auntie Susan V Ben and Farmor' \/><p class='diaryImageCaption'>Auntie Susan V Ben and Farmor<\/p><img src='images\/years\/2010\/2010_01_09-31a-Sledging.jpg' class='diaryImage' alt='Ben and Farfar' \/><p class='diaryImageCaption'>Ben and Farfar<\/p><img src='images\/years\/2010\/2010_01_06-15-SnowedAtHome.jpg' class='diaryImage' alt='Ben and Farfar' \/><p class='diaryImageCaption'>Ben and Farfar<\/p>","images":false},"title":{"value":"Snow, Snow, Snow"},"version":1}],"version":-1139158906}