{"entries":[{"date":{"d":31,"m":12,"y":2011},"datev":20111231,"images":1,"info":{"content":"<p>In the evening we went over to the Sanders household to see New Years in. Again Katie stayed up with us. We played some games and had some wraps.<\/p><img src='images\/years\/2011\/2011_12_31-36-NewYearsEve.jpg' class='diaryImage' alt='Get on down to the table football' \/><p class='diaryImageCaption'>Get on down to the table football<\/p>","images":false},"title":{"value":"New Years Eve"},"version":1},{"date":{"d":30,"m":12,"y":2011},"datev":20111230,"images":1,"info":{"content":"<p>We went over to Dartford to see Craig Revel Horwood and Anne Widdecombe star in Snow White. Craig was the star of the show.<\/p><img src='images\/years\/2011\/2011_12_30-DartfordPanto.jpg' class='diaryImage' alt='Snow White' \/><p class='diaryImageCaption'>Snow White<\/p>","images":false},"title":{"value":"Snow White Panto - Dartford"},"version":1},{"date":{"d":29,"m":12,"y":2011},"datev":20111229,"images":1,"info":{"content":"<p>Peter hosted a post Christmas gathering at his house where most of the Barnett family turned up. There were 29 in total!! Katie and Jessica performed a play written by Katie in front of the adults. Lovely.<\/p><img src='images\/years\/2011\/2011_12_29-39-UnclePetesParty.jpg' class='diaryImage' alt='Katie performing her play' \/><p class='diaryImageCaption'>Katie performing her play<\/p>","images":false},"title":{"value":"Uncle Peters Party"},"version":1},{"date":{"d":28,"m":12,"y":2011},"datev":20111228,"info":{"content":"<p>We were invited over to the Wests in the afternoon. We saw their new extension which makes the house even bigger. We exchanged presents. Ben shot Daddy in the eye with his new gun. It hurt!<\/p>","images":false},"title":{"value":"Christmas Presents at the Wests"},"version":1},{"date":{"d":27,"m":12,"y":2011},"datev":20111227,"images":1,"info":{"content":"<p>We spent a day in playing with all our toys and games from Christmas. Meanwhile the Fars came over to pick Daddy up and took him Kayaking. The trip up to London for the next leg was a little too far, so decided to attack the western side of the Thames. Perhaps Daddy's challenge can be extended from Reading to Gravesend now. A few miles east of Reading is the picturesque village of Sonning. Daddy set off from here downstream. It was very peaceful and the weather quite mild. Daddy just wore a pair of shorts! The Fars went for a cross country drive around the surrounding area and met up at Shiplake Lock where they met up and had a cup of coffee. Next step was to navigate around the lock without the lock keeper noticing as Daddy does not have a license to paddle on the Thames. First attempt was met by a home owner who shoed Daddy off as he was trespassing. Instead, he went across the other side of the river, dragged his boat across the mini island which the lock keeper's house was on and got back on the water. A final mile stretch to Shiplake (just south of Henley) ended this peaceful and enjoyable trip. There are some right posh drums backing on to the river in this neck of the woods.<\/p><img src='images\/years\/2011\/2011_12_27-01-SonningKayak.jpg' class='diaryImage' alt='Sonning Bridge' \/><p class='diaryImageCaption'>Sonning Bridge<\/p>","images":false},"title":{"value":"Kayaking: Sonning to Shiplake"},"version":1},{"date":{"d":26,"m":12,"y":2011},"datev":20111226,"images":1,"info":{"content":"<p>We awoke in our various bedroom with Lily giving us a lovely, switch the lights on and saying \"Time To Get Up\"! Fortunately it was not too early. We played some more of our games and tried to tidy a little before leaving Ma Ma's and returning through the traffic back home!<\/p><p>Later in the afternoon we travelled to Alton for the Elders Boxing Day Bash with the Barnett side of the family. A traditional event now with the familiar format of games, auction, buffet and having a laugh. This year Katie was allowed to stay up with the adults and join in with the games.<\/p><p>Ben and Joey got on very well again. They're good little mates.<\/p><img src='images\/years\/2011\/2011_12_26-43-BoxingDayElders.jpg' class='diaryImage' alt='Katie playing Give Us A Clue' \/><p class='diaryImageCaption'>Katie playing Give Us A Clue<\/p>","images":false},"title":{"value":"Boxing Day at the Elders"},"version":1},{"date":{"d":25,"m":12,"y":2011},"datev":20111225,"images":1,"info":{"content":"<p>We awoke at 5:45am, having had a poor nights sleep as we saw that Father Christmas had arrived sometime during the night and was to excited to sleep properly. Mummy and Daddy capitulated to the pressure and got up and started opening presents at 6am! First into Jessica and Ben's room where each of us had between 15 and 17 presents to open from the Red Man. Highlight presents:<\/p><p>Ben's Presents<\/p><ul><li>An Imaginex Rocket<\/li><li>Lego<\/li><li>Man United Scooter<\/li><li>Beast Quest annual<\/li><\/ul><p>Katie's Presents:<\/p><ul><li>Barbie House<\/li><li>MP3 player<\/li><li>Reading Light<\/li><li>Cool Kards<\/li><li>Repunzal Barbie Doll<\/li><\/ul><p>Jessica's Presents:<\/p><ul><li>Scooter<\/li><li>Kitchen<\/li><li>Horrid Henry Annual<\/li><\/ul><p>Katie was the most excited and happy with her haul, followed closely by Ben. Jessica reacted similar to the others at the age of 4, a little grumpy and overwhelmed by it all we think and hope. Still she will get out of that stage next Christmas I hope. She did not get a dolly with a dummy, which she was upset about, although she owns about a million dollies and dummies!<\/p><p>We moved into Mummy and Daddy's bedroom and they opened their presents. Mummy got: Kath Kitson Welly Boots, Next Jeans, 1881 perfume. Daddy got: Two Adidas T-Shirts, Bobby Robson auto biography and a smart grey shirt.<\/p><p>To the third tranche, the present from friends under the tree. The Sanders were embarrassingly generous again. Jessica got a V-Tech computer, Katie a lovely boots and jumper, Ben a Star Wars lego set. A good haul.<\/p><p>We popped over to the Fars for a danish breakfast and to finish off opening some more presents, whilst Mummy went to church. We saw Auntie Susan who came over for the guinea fowl Christmas Lunch. We moved onto Ma Ma and Pop Pop's around midday.<\/p><p>A tinkering in the format this year again a little more. Basically all the kids stuff will be done first, then after the children have gone to bed it was time for the adults to eat their meal and open presents.<\/p><img src='images\/years\/2011\/2011_12_25-00-ChristmasDayWestons.jpg' class='diaryImage' alt='Christmas at Ma Ma and Pop Pop's' \/><p class='diaryImageCaption'>Christmas at Ma Ma and Pop Pop's<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2011},"datev":20111224,"images":1,"info":{"content":"<p>We had Joey and Lily to stay overnight so we played with them in the morning until Auntie Ellie came to pick them up and take them home. We had to do jobs during the day including getting the motorbike and computer fixed! For the first time in ages Daddy didn't have to go to work on Christmas Eve so we were able to go over to the Fars a little earlier than usual, 3pm. We started playing games wanting to make a mess! Auntie Susan and Graham came over as well. We tucked in to the traditional Roast Pork, although we stuck to the usual sausages. We're not got into the Danish Chrsitmas food yet. It was scrummy. Farfar won the risemange prize!<\/p><p>We then played the dice game which is similar to the chinese auction other than you have to roll a 6, rather than get your card called out.<\/p><p>6:15 and it was 'present time'. The first lot for this Christmas. It seems to be getting more and more liberal each year now. Rather than open one present at a time, there is a lot going on. Katie got a hooded top, Ben got Domino Rally and Jessica got a hat and glove set. It was nice the children are a year older therefore we adults could enjoy ourselves a little more without having to worry about high chairs, nappies and feeding the children. It was really nice to see Katie chatting away to Auntie Susan and Ben boring the pants off Graham about Star Wars. That boy must have been going on for about 30 minutes without much pause for breath!<\/p><img src='images\/years\/2011\/2011_12_24-23-ChristmasEve.jpg' class='diaryImage' alt='Present time at the Fars' \/><p class='diaryImageCaption'>Present time at the Fars<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":17,"m":12,"y":2011},"datev":20111217,"images":1,"info":{"content":"<p>This year we had a couple of additions to the lineup this year. Barrie and Laura joined Jon, Rachel, Ellie, Michael, Helen, Nigel, Karen and Richard and an assortment of kids who by and large kept themselves to themselves. A total of 17 in the Gay household. We had the usual array of games plus a few new ones. The Mr and Mrs proved a bit personal in bits and embarrassing for some! The usual cheating in Titles, Michael surpassed his reputation with a guess  the year music quiz. Game of the year has got to go the marble game. Very simple, similar to musical chairs, however, a marble and the last person to grab a marble gets taken away after each round. It got competitive!! In between the games Daddy did his customary BBQ'ed pork! Good fun had by all, even Nigel who was supposed to go out with his mates.<\/p><img src='images\/years\/2011\/2011_12_17-08-ChristmasParty.jpg' class='diaryImage' alt='E'ster thinking \"What Am I Doing Here\"' \/><p class='diaryImageCaption'>E'ster thinking \"What Am I Doing Here\"<\/p>","images":false},"title":{"value":"Christmas Party"},"version":1},{"date":{"d":16,"m":12,"y":2011},"datev":20111216,"images":1,"info":{"content":"<p>It was the playschool's Nativity play. The last we'll see here. We've seen the previous 6! Jessica was selected to be Mary the lead girl's role. Well she only had one line, \"This is Jesus, the son of God.\" It was very sweet to see. Karen and Evie came along to watch as well.<\/p><p>Later Daddy went with Steven to Costco and acquired £200 worth of food and stuff for the party tomorrow.<\/p><img src='images\/years\/2011\/2011_12_16-13-JessicaNativityAsMary.jpg' class='diaryImage' alt='Jessica 'Mary' Gay' \/><p class='diaryImageCaption'>Jessica 'Mary' Gay<\/p>","images":false},"title":{"value":"Jessica's Nativity starring as Mary"},"version":1},{"date":{"d":4,"m":12,"y":2011},"datev":20111204,"info":{"content":"<p>Relatively quiet day today. Daddy was again working. The rest of us went to church and Sunday school. We also picked up Daddy's motorbike which is always a terrifying experience as Daddy gets told off for the dangerous state of the bike. The main mechanic said that he had never seen a tyre in a worst condition than that. Beading going, 10psi of pressure and tread below legal standards. Also the chain was extremely slack! The other terrifying thing was the price. £267! Ouch.<\/p><p>In the afternoon the Fars came across for a little playtime.<\/p>","images":false},"title":{"value":"Fars Over"},"version":1},{"date":{"d":3,"m":12,"y":2011},"datev":20111203,"images":1,"info":{"content":"<p>We had Katie parents evening during the week with Mrs Farage, a young, enthusiastic teacher. Anyway she reported that Katie was popular in class, behaves well and her work is getting much better. She is in top set for Maths, reading group and swimming. Just literacy she is in the second stream. However, she was very positive about Katie. We also were positive about the teacher. Never tries to get out of school or anything like that and we've noticed she got much better from last year. Just shows how much a teacher plays in the development of a child.<\/p><p>To cap a good week for her, she was awarded 'Star Of The Week' for smiling and cheering the teacher up in the mornings. Well done Katie.<\/p><p>Daddy went out with his old Formscape chums in Guildford. So nice to catch up after a year! Didn't get in until gone 1am!!!<\/p><p>Whilst Mummy, Katie and Ben cycled down to the Frimley C of E Christmas fair and helped run a stall, Daddy took Jessica to the 'Apects of Dance' bi-annual production. Jessica has been in rehersals for the past month. Anyway they went to a college in Farnborough where there was a proper stage and about 400 people in the audience. In the 2.5 show, with a mixture of different types of dances and age groups, Jessica was on stage for about 5 minutes. It was hard to pick her out amongst the 15 other youngsters on stage. She enjoyed herself and was in reflective mood on the way home. She had to do it all again in the evening with Mummy watching this time. She did ever so well. She was pretty proud that she went to bed later than Katie and Ben!!<\/p><p>We had the playgroup teddy to look after the weekend which Jessica was particularly protective over. We had to get photos.<\/p><img src='images\/years\/2011\/2011_12_03-05-BalletJessica.jpg' class='diaryImage' alt='Jessica half in her soilder outfit' \/><p class='diaryImageCaption'>Jessica half in her soilder outfit<\/p>","images":false},"title":{"value":"Ben Football, Xmas Fair, Jessica Ballet Performance, Katie 'Star Of The Week'"},"version":1},{"date":{"d":1,"m":12,"y":2011},"datev":20111201,"images":1,"info":{"content":"<p>Ben was the star turn in the school Nativity play. In his 4th and final performance both Mummy and Daddy were sat proud to see Ben walk down the centre aisle with his arm around Mary, taking care of his pregnant wife. He had 8 lines to deliver. Very clear, no fluffs. He did ever so well. Good work Ben. Later he said he was a little scared, but he's now sad that he's not carrying it on.<\/p><img src='images\/years\/2011\/2011_12_01-01-BenNativityAsJoseph.jpg' class='diaryImage' alt='Mary and Joseph' \/><p class='diaryImageCaption'>Mary and Joseph<\/p><p>Karen and Evie popped in later in the afternoon for a cup of tea. It's been a while since we saw her last.<\/p>","images":false},"title":{"value":"Ben's Nativity As Joseph"},"version":1},{"date":{"d":27,"m":11,"y":2011},"datev":20111127,"images":1,"info":{"content":"<p>We went to church in the morning whilst Daddy worked at home. In the afternoon we had a three way split. Ben went to Thomas's birthday at Tomlinscote, Jessica had a marathon 3 hour rehersal of the Aspects Of Dance production that she is performing for real next week. Mummy, Daddy and Katie went to the Pine Ridge Open Day where Katie had her hair braided, a visit to Father Christmas, although Katie said it was one of his helpers and not the real one! Daddy had a go at the putting competition and failed!<\/p><img src='images\/years\/2011\/2011_11_27-03-PineRidgeOpenDay.jpg' class='diaryImage' alt='Daddy and Katie just before visiting FC' \/><p class='diaryImageCaption'>Daddy and Katie just before visiting FC<\/p>","images":false},"title":{"value":"Church, Work, Thomas Birthday, Pine Ridge Open Day, Ballet Rehersals"},"version":1},{"date":{"d":26,"m":11,"y":2011},"datev":20111126,"images":1,"info":{"content":"<p>We had Leah Sumner stay over last night which was nice for Katie. Those two played Nintendo DS all the time! They watched Mama Mia last night as well downstairs. We could hear them singing to all the songs!<\/p><p>Jessica is in the final throws of rehersals for her show next week. Mummy took her here, whilst the rest of us went to Marconi's for a home game against Churt. Ben again only got about half a game and touched the ball twice. Daddy changed tactics and tried being a bit more vocal and help him get in the right position and gee him up to get stuck in. Predictably Ben didn't take too kindly to this and got a bit upset so Daddy toned it down. At the end of the day he's there because he enjoys it, so Daddy's not going to push him. Daddy's just trying to help.<\/p><img src='images\/years\/2011\/2011_11_26-03-FrimleyGreenVChurt.jpg' class='diaryImage' alt='Ben celebrating win' \/><p class='diaryImageCaption'>Ben celebrating win<\/p><p>Daddy and Ben then had Liam's birthday to go to down at Jakes in Bagshot.<\/p><p>In the afternoon Mummy went off with Auntie Charlotte to watch the Vampire film at Bracknell Cinema. The rest of us went on a bike ride down through the woods and through to a swing park near Richard and Sue's. We had some good games. It was a long way back up the massive hill! We watched 'Home Alone 2' and 'Strictly' off course.<\/p>","images":false},"title":{"value":"Ballet, Football, Liam's Birthday, Bike Ride, Leah Sleepover"},"version":1},{"date":{"d":20,"m":11,"y":2011},"datev":20111120,"images":1,"info":{"content":"<p>We went along with Mummy to church as normal whilst Daddy got everything ready for his next leg of the Thames tour by kayak.<\/p><p>Ben had Joey Harris's birthday party down at Runabout. He loved going down in Joey Dad's van with the rest of the boys.<\/p><p>Katie was well up for going with Daddy on probably the most exciting leg of his Kayaking tour, the Central London bit. We parked up and Katie helped Daddy carry the kayak up the road which was full of traffic. One person unwound their window and asked what we were doing. He was most impressed. We eventually found a place in which to cast off. The tide was on it's way down which meant there was a lot of rubbish lying on the river bed in which we could see. Katie saw an old shoe and there was plenty of broken glass.<\/p><p>We set off and fortunately Daddy had got the tide times right so it wasn't too much effort to glide past the bridges. We went passed one lot of Kayak from a club, but we were free to go where we liked and at what pace. It was really to see some really modern flats along with some derilicted buildings. In the early stages we were counting the bridges that we went under. Eventually we got as far Westminster and cruised past Big Ben and saw the London Eye. By now we had to contend with the various tourist boats from the Duck to speed boats and the big crusiers whizzing down the river. It was becomming rather choppy and we were on wet bottom alert. Katie was helping a bit on the paddling but to be honest we didn't need to work very hard. It was nice to see the sights from a different angle on seemingly on our own.<\/p><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/TC8wSZ5cpK4&amp;hl=en_GB&amp;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/TC8wSZ5cpK4&amp;hl=en_GB&amp;fs=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><p>Katie's stomach was telling us that it was time for lunch and rather head towards the river bank we decided to moor up against a tug, climbed up aboard and started our sunday lunch, well it was a picnic really. We managed to attract quite a bit of attention from Waterloo bridge with a dozen or so people taking pictures of us for some reason. Katie was running up and down and letting her imagine run away with her. Still it was time to move on so we continued eastwards. Unknowningly we got blasted on the horn from one of the big boats, 30 seconds later the captain of the boat got on the megaphone and told us and London it seemed for us to move out of the way!! We also got shouted at by a worker to not go down one of the arches under Southwark bridge.<\/p><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/x2J1kqUtpJw&amp;hl=en_GB&amp;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/x2J1kqUtpJw&amp;hl=en_GB&amp;fs=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><p>We went right down the centre of Tower Bridge which was the initial aim. Katie was begining to get cold due to the wet bottom so we pulled in at the next available spot which was just past St. Katherine's Dock. As we were getting out a lot of wash came our way and absolutely soaked us. We locked up the kayak and walked through the posh bit of the dock, and splodged our way to the Tower Of London and caught a bus to Trafalgar Square where we waited ages. We got talking to a lady at the bus stop who told us the best way back to the car. She even walked us to the bus stop! It took ages for us to get back. Having got to the car we had to drive across London to St Katherine's Dock to pick up the kayak and then drive home. This last big of logistics took 5 hours! A great adventure.<\/p><img src='images\/years\/2011\/2011_11_20-00-CentralLondonKayak.jpg' class='diaryImage' alt='Kayaking Central London' \/><p class='diaryImageCaption'>Kayaking Central London<\/p>","images":false},"title":{"value":"Battersea To St Katherines Dock Kayak, Joey H's birthday"},"version":1},{"date":{"d":19,"m":11,"y":2011},"datev":20111119,"info":{"content":"<p>We had the usual round of ballet in the morning, with Daddy, Ben and Katie going off to Watchetts to for the local derby, Frimley Green v Camberley. Ben got just half a game again this week. He said that he was the worst player on the team. We could have cried for him. Still the team drew 1-1. Still Ben does enjoy the social side of the team.<\/p><p>In the afternoon we done some homework and other jobs around the house. Daddy cooked a nice spaghetti bolognese. We got ready for tonight's Strictly Come Dancing. Mummy went out for her Vampire film night and didn't get home till gone 1am!<\/p><p>A list of the clubs currently<\/p><ul><li><i>Katie<\/i>Brownies\u000a        <\/li><li><i>Katie<\/i>Trampolining\u000a        <\/li><li><i>Ben<\/i>Swimming\u000a        <\/li><li><i>Ben<\/i>Football\u000a        <\/li><li><i>Ben<\/i>Beavers\u000a        <\/li><li><i>Jessica<\/i>Ballet\u000a        <\/li><\/ul>","images":false},"title":{"value":"Football and Ballet, Lots of homework"},"version":1},{"date":{"d":13,"m":11,"y":2011},"datev":20111113,"images":1,"info":{"content":"<p>We awoke at the Fars and snuck into their bed. Mummy collected us for church parade. Katie had Megan's birthday party immediately afterwards at Tomlinscote. Daddy worked and went for a 4.5 mile jog.<\/p><p>In the afternoon we went for a bike ride down to Heatherside swings. We saw the Bandoz crew and someone Daddy knew from football. We of course played crocodiles which the Bandoz's loved as well as a super high push on the basket!<\/p><img src='images\/years\/2011\/2011_11_13-03-HeathersideSwings.jpg' class='diaryImage' alt='Swing high sweet Katie' \/><p class='diaryImageCaption'>Swing high sweet Katie<\/p>","images":false},"title":{"value":"Swings, Megan's Birthday"},"version":1},{"date":{"d":12,"m":11,"y":2011},"datev":20111112,"info":{"content":"<p>Mummy and Jessica went for a an extended ballet session in preparation for the upcoming show. Meanwhile the rest of us went over to Grayshott for the next installment of Frimley Green Cheetahs. The Elders came for support and of course to play on the swings. Unfortunately Ben started off as substitute and he waited patiently for his chance. He got on just before half time and had a couple of chances to score himself. He played in midfield and kind of goes into a trance and chases 2 yards away from the ball. He does try hard. The team played very well and won their first match 5-2.<\/p><p>Later in the afternoon we got dropped off at the Fars where we made camps and christmas presents. Katie went to the Rushforths for a couple of hours where she made a lovely Christmas Advent Calander which she can hang from her bed. We all had late nights. Jessica and Ben slept downstairs in their den!<\/p><p>Meanwhile Daddy and Mummy went over to the Surrey Cricketers for Pop Pop and Auntie Sue's 60th birthday celebration. We saw many of the Allen family.<\/p>","images":false},"title":{"value":"Football, Ballet, Rushforths, Fars Overnight Stay"},"version":1},{"date":{"d":6,"m":11,"y":2011},"datev":20111106,"images":2,"info":{"content":"<p>After church the girls stayed at home to do lots of homework, then went out in the afternoon to a birthday party at Jakes.<\/p><p>Meanwhile the boys joined the Fars, Pop Pop, Auntie Susan and Graham, Uncle Howard and Susan and Uncle Pete at the annual Firecracker Banger racing event in Essex. Again the mildish and dry weather meant it was not hard to watch.<\/p><p>There were about 9 races with a mixture of 'normal' cars and Reliant Robin races. Ben had been looking forward to this for ages after last year’s experience. We got there for the first race which after 2 minutes stopped with the ambulance coming out!<\/p><p>Our favourites where the Robins which provided a lot of entertainment with some big impacts, taking into account their fibre glass shell. It was so funny to see the cars wobbling their way back onto their three wheels once they had been toppled onto their side.<\/p><p>We made a few excursions into the pits to see the cars. There were loads of Jags, some 1970s American cars, limos, hearses and even a Rolls Royce. On the Robin side there was a stretch limo robin; brilliant! Ben sat in a couple of the cars which was bit of an experience for him.<\/p><p>The final two destruction derby's supplied the best action with cars going in all directions. The track was on fire at one point which was funny to see. The final last DD had 48 cars competing. The stretched limo blocked one end of the track.<\/p><p>Ben loved it and wants to go again soon. He also wants the DVD.<\/p><img src='images\/years\/2011\/2011_11_06-00a-FirecrackerBangerRacing.jpg' class='diaryImage' alt='Ben in the hot seat' \/><p class='diaryImageCaption'>Ben in the hot seat<\/p><img src='images\/years\/2011\/2011_11_06-00b-FirecrackerBangerRacing.jpg' class='diaryImage' alt='Banger action' \/><p class='diaryImageCaption'>Banger action<\/p>","images":false},"title":{"value":"Banger Racing, Jakes Birthday Party"},"version":1},{"date":{"d":5,"m":11,"y":2011},"datev":20111105,"images":3,"info":{"content":"<p>In the morning the Girls walked to Ballet in Frimley Green, whilst the boys biked to football at Marconi's. This week Ben played the full match and Daddy turned up in his Frimley Panthers kit! Ben did really well in midfield continously running. He had one good chance that he carved himself out, however, he dragged his shot just wide. Otherwise the team did suffer from a lack of options and a goalkeeper who walked off after it went 2-0. From a scoreline of 0-0 at half time we capitulated to a 5-0 defeat.<\/p><img src='images\/years\/2011\/2011_11_05-02-FrimleyVMychettFootball.jpg' class='diaryImage' alt='Commanding Midfielder' \/><p class='diaryImageCaption'>Commanding Midfielder<\/p><p>In the afternoon we took Great Grandma out to the garden centre in Badshot Lea where we met up with the Elders and Pete. We perused around the shop, minding the china and immitating the parrot. We had a nice cup of tea in the cafe and a little much about in the playground. We bumped into Auntie Lindey surprisingly as well.<\/p><img src='images\/years\/2011\/2011_11_05-02-GardenCenterElders.jpg' class='diaryImage' alt='Jessica in playground' \/><p class='diaryImageCaption'>Jessica in playground<\/p><p>In the evening we went down to Grove school for their bonfire and firework display. The Fars joined us right at the front, which meant we felt the heat from the fire. The fireworks went off well. No crying or being scared and it was very mild no moaning about being cold. This fact needs recording because it'll be the first time ever!!<\/p><p>We popped home afterwards for our traditional baked potato, tomato soup and sparklers.<\/p><img src='images\/years\/2011\/2011_11_05-16-GardenCenterElders.jpg' class='diaryImage' alt='Katie the sparkler' \/><p class='diaryImageCaption'>Katie the sparkler<\/p>","images":false},"title":{"value":"Football, Ballet, Grandma's 86th Birthday, Fireworks"},"version":1},{"date":{"d":2,"m":11,"y":2011},"datev":20111102,"info":{"content":"<p>In the evening, after work, Mummy and Daddy went to an Italian restuarant in Gravesend town centre.<\/p><woops woopstitle=\"Laura crashes car into Daddy's motorbike\" rating=\"7\"><p>Laura was following Martin who was on his motorbike to Pop Pop's 65th birthday meal. It was dark and raining. In Ripley, Martin stopped at a T-Junction a car was coming so waited. However, Laura had other ideas. She pounced and hadn't realized Martin was still waiting at the junction. She went straight into the back of the motorbike, hitting the exhaust quite hard. Fortunately Martin was only pushed into the side of the road and not into the oncoming car. The exhaust stayed firm. The car's body work did not. The exhaust went straight through where the fog lights go. As they parked 10 yards up the road, the car was making an almighty sound. It was the sound of the plastic housing for the fog light scraping along the road under the car. The wheel arch inners was also rubbing against the front wheel. Martin didn't even shout at Laura, instead had to fix the problems. After a bit of jiggery pokery they were off on their merry way again.<\/p><\/woops><p>We rarely see the Weston half of the family so it was nice to see everyone, and on top form as well. We saw Young and the boyfriends of Jo and Hannah.<\/p>","images":false},"title":{"value":"Pop Pop's 65th Birthday Meal"},"version":1},{"date":{"d":31,"m":10,"y":2011},"datev":20111031,"info":{"content":"<p>We got loads of sweet having travelled around to the Far's, the Kelley's, Grandma's and Uncle Howard's house. In the evening whilst Katie was at Brownies, Ben was answering the door to Trick or Treaters.<\/p>","images":false},"title":{"value":"Halloween"},"version":1},{"date":{"d":30,"m":10,"y":2011},"datev":20111030,"images":1,"info":{"content":"<p>Katie had loads of homework to do over the half term, much of it done today. There was a project an ancient Egypt, geomtry, spellings and reading.<\/p><p>In the afternoon Daddy took Ben and Jessica for a long bike ride around the army estate. When Katie finally finished her work, we all went over to the Queen Elizabeth park in Farnborough, a swing park we've not been to before. We had a nice walk through the woods.<\/p><img src='images\/years\/2011\/2011_10_30-18-QEPark.jpg' class='diaryImage' alt='The Boys' \/><p class='diaryImageCaption'>The Boys<\/p><p>Last week was half term. We had stuff on everyday. We went over to see the Burrows', the Teale's where Katie stayed over the night and Ma Ma and Pop Pop's where we stayed another night. On Friday we had a halloween party with Natasha, Grace and Nina.<\/p>","images":false},"title":{"value":"Homework - Queen Elizabth Park"},"version":1},{"date":{"d":29,"m":10,"y":2011},"datev":20111029,"first":{"name":"benjamin","value":"Played competitive football match"},"images":3,"info":{"content":"<p>Ben had his first competitive match for Frimley. He was really looking forward to it. For some reason he'd been left out of the loop for the first part of the season. It took Daddy to have a word with the manager so he could join in. He donned his Chertsey Town'esque strip which meant you could barely see his legs. So sweet. The Elders came along for support. We lost 4-1 with Ben putting a lot of effort on chasing after the ball. Ben was well chuffed at winning the man of the match trophy for the week. Well done Ben.<\/p><img src='images\/years\/2011\/2011_10_29-03-BenFirstFootball.jpg' class='diaryImage' alt='Ben with his Man Of The Match Trophy' \/><p class='diaryImageCaption'>Ben with his Man Of The Match Trophy<\/p><p>In the afternoon we went to Frimley Lodge Park to do some pumpkin carving. However they had run out of pumpkins so just played for a bit there.<\/p><p>Daddy went up with Steven and two friends from work to Liverpool last night in preparation for the Everton v Manchester United match. Things did not start well when Jason's car was clamped at Michael's house. £125 for the 30 minute priviledge!<\/p><woops woopstitle=\"Spinout at 75mph\" rating=\"5\"><p>Things did not get better when on the M4. We heard a car with a rythmic thumping noise overtake us in the fast lane. The rythmic thump was due to the puncture that the car had incurred but which the occupants did not have full knowledge of. Just as they passed, the car swerved violently in front of us, one way then the other, eventually ending up facing the wrong way on the hard shoulder. Goodness knows how they didn't hit anyone or even damage the car. Oh how we laughed.<\/p><\/woops><p>Five and a half hours later we arrived in Liverpool via the Wirral. After a bit of fun with no GPS signal, we parked at the hotel in the centre of town, decamped, everyone laughing at Katie's Mickey Mouse suitcase. I was sharing a room with Steve.<\/p><p>We headed back out for some drinking. Within 5 minutes of being on the streets I was offered to buy some cocaine!! Where have we come to? We respectively declined, then hit a number of bars and clubs - the chaps admiring my skills on the dance floor!! It was a 4:30am finish time!<\/p><img src='images\/years\/2011\/2011_10_29-01-EvertonTrip.jpg' class='diaryImage' alt='Daddy giving it some on the dance floor' \/><p class='diaryImageCaption'>Daddy giving it some on the dance floor<\/p><p>We woke in the morning with two hours to spare; a bit of a rush to Goodison Park. The weather was slightly chilly, dull but dry. With such an early kick off the atmosphere was a little muted, not much chanting at all. Michael had got great tickets, front row, allbeit in the Everton end.<\/p><p>Manchester United had scored in the 19th minute, after which they pretty much sat back an invited Everton on to them. Fortunately they did not find a route through. A draw would have been a fair result. It was good to see the likes of Rooney close up. He was a class apart. He seemed to have so much time on the ball and played cultured little chips here and there. I was quite surprised how much bickering there was between players. Vidic was the instigator of most of that.<\/p><img src='images\/years\/2011\/2011_10_29-05-EvertonTrip.jpg' class='diaryImage' alt='Wayne Rooney at Goodison' \/><p class='diaryImageCaption'>Wayne Rooney at Goodison<\/p><p>Once the game finished we made the four hour journey back home.... without incident.<\/p>","images":false},"title":{"value":"Ben's first football match - Daddy at Everton v Manchester United"},"version":1},{"date":{"d":23,"m":10,"y":2011},"datev":20111023,"images":1,"info":{"content":"<p>In the afternoon we went over to church for the Baptism Party. After a short service we made printed aprons.<\/p><img src='images\/years\/2011\/2011_10_23-01-BaptismParty.jpg' class='diaryImage' alt='Making aprons' \/><p class='diaryImageCaption'>Making aprons<\/p>","images":false},"title":{"value":"Baptism Party"},"version":1},{"date":{"d":16,"m":10,"y":2011},"datev":20111016,"images":3,"info":{"content":"<p>After church we headed for another of our London's walks. Today we started at the Tower Of London where we picniced. Ben was quite interested in it. Mummy and Daddy vowed to go in there with us one day when they were a bit richer! There were lots of tourists milling about. Anyway the sergeant major ordered the troops along a well troden path. Well troden as we've done some of this route before. Cannon Street station to the Guildhall, then on to London Wall and finally ending up at the 70's architecture of the Barbican. We had a right old laugh playing games along the way with Daddy. He would eat us if we trod on the cracks. Later, if we laughed then also this would result in tickles to the ribs. Jessica meanwhile hitched a lift on Mummy's shoulders. We caught the number 100 bus back to Tower Hill and drove home for Sunday lunch.<\/p><img src='images\/years\/2011\/2011_10_16-11-LondonRomanWalk.jpg' class='diaryImage' alt='Tower Of London Escapees' \/><p class='diaryImageCaption'>Tower Of London Escapees<\/p><img src='images\/years\/2011\/2011_10_16-22-LondonRomanWalk.jpg' class='diaryImage' alt='Crazzzzyy Kids' \/><p class='diaryImageCaption'>Crazzzzyy Kids<\/p><img src='images\/years\/2011\/2011_10_16-39-LondonRomanWalk.jpg' class='diaryImage' alt='Targetted' \/><p class='diaryImageCaption'>Targetted<\/p>","images":false},"title":{"value":"Walk 24: Roman London Walk"},"version":1},{"date":{"d":15,"m":10,"y":2011},"datev":20111015,"images":1,"info":{"content":"<p>In the morning we went over to the Fars who we haven't seen for such a long time. We stopped there for an hour or so, just enough time to get the railway track, the  farm, and the tea trolley out, as well as raid the Cream Cracker tin! We then dropped Mummy off at Cross Farm school as she kindly volunteered to help do work around the place, like sweep leaves.<\/p><p>Meanwhile, Daddy took us over to Hatch Warren Community Centre for Fraser and Felicity's birthday party. Joey and Lily also came. There was a magic man who we absolutely loved. Lily won a prize at the limbo and Jessica for best girl dancer.<\/p><p>In the afternoon we made ice cream whilst Daddy went to see Chertsey lose 5-2 at Uxbridge. Strictly Come Mayhem in the evening!<\/p><img src='images\/years\/2011\/2011_10_15-19-FelicityFraserbdayParty.jpg' class='diaryImage' alt='Party Animals' \/><p class='diaryImageCaption'>Party Animals<\/p>","images":false},"title":{"value":"Fars, Fraser and Felicity Birthday Party, School work day"},"version":1},{"date":{"d":9,"m":10,"y":2011},"datev":20111009,"info":{"content":"<p>It was Sophie and Oliver Strangles birthday parties today. Oddly enough they were held at the same venue allbeit at different times of the day.<\/p>","images":false},"title":{"value":"Frankie and Benny's Duo Birthdays"},"version":1},{"date":{"d":8,"m":10,"y":2011},"datev":20111008,"info":{"content":"<p>Daddy went up to Victoria Station to help with the BTP project all day. The rest of us just stayed home.<\/p>","images":false},"title":{"value":"Daddy to work"},"version":1},{"date":{"d":2,"m":10,"y":2011},"datev":20111002,"images":2,"info":{"content":"<p>After church we headed again up to London. We were told about a Disney Princess horse drawn parade through Hyde Park.... and we've got a walk for Hyde Park as well Mummy reminded us. We parked close to Queensway on what we thought was a valid parking spot. More of that later. It was a baking hot day, a barmy 28 degrees. We entered over by Kensington Gardens and wait a good long while for the 10 Disney princesses to parade through in their horse drawn carriages. Ben was not bothered at all but the girls loved it.<\/p><img src='images\/years\/2011\/2011_10_02-03-HydeParkWalk.jpg' class='diaryImage' alt='Jeesica and Princess Aerial' \/><p class='diaryImageCaption'>Jeesica and Princess Aerial<\/p><p>The procession didn't take too long and we started our circular walk down Flower Walk. We got a bit lost heading to the little pond, but found the Diana Memorial Fountain well enough. It was absolutely packed. It was a bit different and we had fun going around it.... twice. Of course we all got soaked! Us kiddies were on bikes for this one which helped with the pace. The Italian fountains were disapointingly fenced off and the Pirate Ship playground was full to capacity, so we headed back to the car, which unfortunately was not parked in a valid spot. We looked at the wrong sign. £65 marred the afternoon a little.<\/p><img src='images\/years\/2011\/2011_10_02-29-HydeParkWalk.jpg' class='diaryImage' alt='Princess Diana Memorial' \/><p class='diaryImageCaption'>Princess Diana Memorial<\/p>","images":false},"title":{"value":"Walk 23: Hyde Park Walk"},"version":1},{"date":{"d":1,"m":10,"y":2011},"datev":20111001,"images":1,"info":{"content":"<p>Muumy went to church to help clean the kitchen whilst the rest of us played at home. Daddy beat us at Stratego. After lunch we popped down to Farnborough Leisue centre for a swim. It wasn't too busy and Daddy threw us about and ate us in a game of sharks. We had our dive sticks with us. Katie swum the length of the pool, even though some of it was backstroke.<\/p><p>Later Daddy went for another of his Kayak trips. Setting off from Chiswick Bridge were he got annoyed with some pushy, women rowers and got disheartened with the tough tidal conditions. Although it was only a bit off high tide it took over 45 minutes just to do a mile. Having struggled all the way to Hammersmith bridge he stopped for some refreshments and a rest. Just two miles down in 2 hours! However, the tide changed and it was a far more restful paddling up past Fulham FC and the Michael Jackson statue. Kayaking under the trees by Bishop's Park watching the sun setting behind made the trip all the worth while. There was the hubub of the Putney pubs and various groups of people waving to Daddy. Past the intended stopping point Daddy was cooking on the tide scooting under Wandsworth Bridge. There were some posh looking flats now and a feeling of really hitting the edge of London. The light was drawing in fast and 8.75 miles down, Daddy decide to make his way into the side at Battersea Bridge. He dragged his boat up some steps, locked it up then needed to get back to the car back at Chiswick Bridge. A 2.5 hour round trip with a walk to Clapham Juncton, a train ride a bus trip and returning car journey. At 9pm in the evening Daddy was dragging the Kayak down Battersea Bridge Road to the car. Daddy finally got home 10:15pm.<\/p><img src='images\/years\/2011\/2011_10_01-06-PutneyKayak.jpg' class='diaryImage' alt='Battersea Bridge At Night' \/><p class='diaryImageCaption'>Battersea Bridge At Night<\/p>","images":false},"title":{"value":"Swimming - Chiswick to Battersea Kayak"},"version":1},{"date":{"d":25,"m":9,"y":2011},"datev":20110925,"images":1,"info":{"content":"<p>Daddy carefully balanced the bikes on the back of the car as we headed to outskirts of the capital. We began our bike ride following our walks book, doing the boat race route. Confused. We headed along the south bank, westwards, hitting a playground very early on. A millionaires playground. The parents of each child were well heeled, then there was us. Ben of course made us nervous cycling along hitting almost everybody it seemed! He certainly hit a rowing boat which was parked up along the side. We crossed Hammersmith bridge onto the north bank and stopped for our picnic, before continuing through Grove Park and to the turning point of Chiswick Bridge.<\/p><img src='images\/years\/2011\/2011_09_25-01-BoatRaceBikeRide.jpg' class='diaryImage' alt='Preparing for the Boat Race Bike Ride' \/><p class='diaryImageCaption'>Preparing for the Boat Race Bike Ride<\/p>","images":false},"title":{"value":"Boat Race Bike Ride"},"version":1},{"date":{"d":24,"m":9,"y":2011},"datev":20110924,"images":2,"info":{"content":"<p>We headed to Wimbledon and parked fro our tube journey upto King Cross. We headed south through the back streets down to Coram's Field, an area dedicated to children. We all had something nice their. Ben had a light sabre made for him out of a baloon, Jessica had a go on a fire hose, Katie went on the playground and Mummy saw a fireman she fancied!<\/p><img src='images\/years\/2011\/2011_09_24-31-CoramBoyLondonWalk.jpg' class='diaryImage' alt='Coram Boy walk' \/><p class='diaryImageCaption'>Coram Boy walk<\/p><p>After having a spot of lunch their we continued south and eventually hit the British Museum and made our way to the Mummies. Katie is currently doing a school project on the Egyptians so she was interested in this. It's the first time any of us had been in the museum. Daddy liked the architecture of the main area with its glass roof.<\/p><img src='images\/years\/2011\/2011_09_24-37-CoramBoyLondonWalk.jpg' class='diaryImage' alt='Mummies' \/><p class='diaryImageCaption'>Mummies<\/p><p>We hit the busy streets through Convent Garden where we stopped to watch a magic man. Well a magic boy. You could tell he was not very expereinced and we felt sorry for him a bit as his audience slowly lost interest and flittered away. He kept dropping the balls on the floor which were supposed to be hidden under the cups. A couple more playground stops down Drury Lane.<\/p><p>We bussed our way back to Waterloo and tubed it back to Wimbledon and then straight to Alton to have dinner at the Elders with the Glidewells. The Elders done a racklets dinner and Mummy got quite drunk!<\/p>","images":false},"title":{"value":"Walk 22: Coram Boy London Walk, British Museum - Elders for Dinner"},"version":1},{"date":{"d":18,"m":9,"y":2011},"datev":20110918,"info":{"content":"<p>After church Daddy went to the Basingstoke Canal centre where he met up with Gerry, Howard, Susan and the Elders where they planned a trip up to the Swan pub in Ash Vale. We all got a bit wet mainly due to the paddle splashing. Gerry almost fell in when disembarking from the Kayak which would have been funny. Both he and Michael sat at the pub with their trousers off! A little strange. Differernt crew on the return journey. Near the end it began to rain so we quickly packed up and came back home for a cup of tea.<\/p>","images":false},"title":{"value":"Basingstoke Canal Kayak"},"version":1},{"date":{"d":17,"m":9,"y":2011},"datev":20110917,"images":1,"info":{"content":"<p>The Dixons came over to visit for a spot of food and some playtime. The weather was not particularly kind for our walk to the swingpark. Yasmin and Reuben were on good form, Mr Dixon was doing his best to mess the house as much as the kiddies. He squeezed some toy frog which spurted out a load of yellow jelly which ended up all over the floor, sofa and wall. It was very funny to see David's reaction, the surprise on his face.<\/p><p>It was really nice to see Yasmin playing with everyone. Reuben was well pleased with a particularly noisey helicopter.<\/p><img src='images\/years\/2011\/2011_09_17-06-DixonsOver.jpg' class='diaryImage' alt='Reuben-ator' \/><p class='diaryImageCaption'>Reuben-ator<\/p>","images":false},"title":{"value":"Dixons Over"},"version":1},{"date":{"d":11,"m":9,"y":2011},"datev":20110911,"images":4,"info":{"content":"<p>We awoke early and Jessica opened some more presents from us lot. We left early for Paulton's Park. We needed to get there for when the gates opened so we could get a full day's worth of entertainment. We first headed off to Jessica's favourite, Peppa Pig world. She loved it in there and went on many rides. The older children enjoyed it, but were itching for something a little more thrill seeking. The queues were relatively short, something to do with the end of season and inclemtent weather. We met up with the Elders, Westons, Mr Peter Barnett and later the Fars.<\/p><p>We kept together as much as possible. Top rides for the older children were the Pirate Ship, The Edge (boat slide ride) and the Cobra rollercoaster. Auntie Sue and Richard also came along with Felicity and Fraser. We had another cake and another happy birthday for Jessica who really did enjoy her day. We stayed until 5:30 when the rides all shut. Expensive, but a good day had by all.<\/p><p>Jessica is 99.5cm in height. Which is a bit of luck as little-uns over a 1 metre have o pay £20!<\/p><img src='images\/years\/2011\/2011_09_11-16-PaultonsPark.jpg' class='diaryImage' alt='Oh Me hartys' \/><p class='diaryImageCaption'>Oh Me hartys<\/p><img src='images\/years\/2011\/2011_09_11-22-PaultonsPark.jpg' class='diaryImage' alt='Mikey and Benny on the boat' \/><p class='diaryImageCaption'>Mikey and Benny on the boat<\/p><img src='images\/years\/2011\/2011_09_11-32-PaultonsPark.jpg' class='diaryImage' alt='On the Jumping Jack' \/><p class='diaryImageCaption'>On the Jumping Jack<\/p><img src='images\/years\/2011\/2011_09_11-65-PaultonsPark.jpg' class='diaryImage' alt='Another cake' \/><p class='diaryImageCaption'>Another cake<\/p>","images":false},"title":{"value":"Jessica 4th Birthday - Paulton's Park"},"version":1},{"date":{"d":10,"m":9,"y":2011},"datev":20110910,"images":2,"info":{"content":"<p>Today saw Daddy and Ben leave early for the Thames in the next chapter of the Eastward journey along the Thames. It was a major logistical operation with Daddy only wanting to paddle one way. So here goes the complicated bits:<\/p><p>They drove to Kingston bridge, locked the Kayak up to a post, jumped in the car and drove to Mortlake and parked the car near the river. Walked to Mortlake railway station, caught the train to Hampton Wick, with paddles, seats, lunch, etc. Walked to the Kayak and set sail towards Teddington at 9:35. Only 8 more miles to go.<\/p><p>Daddy started at quite a leisurely pace thinking that 8 miles in 3 hours was quite achievable. I mean it was supposed to be enjoyable and leisurely. However, it turned into a bit of a challenge and a race against the tide and time.<\/p><p>Ben was most helpful. In fact he commented that Daddy wouldn't have made it if it wasn't for him. True he did provide paddling assistance, even though it might not always have propelled us forward. He did also pass the sandwiches back, he made the kayak lighter when we stopped for the toilet 3 times and dropped the map into the river twice! However, it is questionable whether playing Sudoku on the phone or dropping his paddle into the river was gaining us time. The sweetest thing was near the end when Daddy was exerting a lot of effort and grunting away, Ben just started chanting 'Come On Daddy, come on. Come on Daddy come on'. Daddy could have given him the biggest cuddle.<\/p><p>We had some lunch which we ate onboard. We saw some nice wildlife, birds with big beaks, some nice houses, not many boats and lots of rowers. Ben was following the written plan. Interested in the train timetable and following ourselves on the map along the river. I think it did go on quite a time for the both of them. Ben wouldn't admit he was bored and always gave a positive outlook, however, Daddy suspects he would have been happy to stop after a couple of hours.<\/p><p>We eventually pulled the kayak out at 1:30pm and rushed home just about in time for Jessica's birthday.<\/p><img src='images\/years\/2011\/2011_09_10-03-KingstonMortlakeKayak.jpg' class='diaryImage' alt='Ben kayaking' \/><p class='diaryImageCaption'>Ben kayaking<\/p><p>This year Jessica's birthday party was going to be held at Tomlinscote School's sport hall, with inflatables, mats, toys, etc. Jessica has been so excited about her party. We think a 4 year old is probably the best age for this. For the past month Jeissca asks 'is it my party tomorrow?'<\/p><p>We had a mix of family, playschool friends and other friends coming along, which was really nice to see. Jessica was connected by an invisible magnetic force to her best friend Amy Huggits. They are so sweet together giving each other cuddles and generally looking out for each other.<\/p><p>After an hour of playtime we had party food around the back and a nice hedgehog cake. I think everyone enjoyed themselves, we certainly did.<\/p><img src='images\/years\/2011\/2011_09_10-26-Jessicas4thBirthdayParty.jpg' class='diaryImage' alt='Jessa's birthday' \/><p class='diaryImageCaption'>Jessa's birthday<\/p><p>We returned home with the Elders. Before we could sit around and watch Jessica open her presents she had naughtily opened them!! Anyway she got so many nice presents.<\/p><p>In the evening we watched the first episode of Strictly Come Dancing before going to bed.<\/p>","images":false},"title":{"value":"Jessicas 4th Birthday Party - Kayak Kingston to Mortlake - Joey and Lily stay over"},"version":1},{"date":{"d":4,"m":9,"y":2011},"datev":20110904,"images":2,"info":{"content":"<p>Mummy and Daddy joined Ellie, Steven and Howard at Go Ape in Alice Holt. The Fars came along with Michael and Joyce to watch and look after us lot.<\/p><p>Mummy was very good and completed the whole course. We enjoyed very much.<\/p><img src='images\/years\/2011\/2011_09_04-19-GoApe.jpg' class='diaryImage' alt='Mummy sliding down' \/><p class='diaryImageCaption'>Mummy sliding down<\/p><img src='images\/years\/2011\/2011_09_04-56-GoApe.jpg' class='diaryImage' alt='Daddy Sliding down' \/><p class='diaryImageCaption'>Daddy Sliding down<\/p>","images":false},"title":{"value":"Go Ape - Alice Holt"},"version":1},{"date":{"d":3,"m":9,"y":2011},"datev":20110903,"images":1,"info":{"content":"<p>In the morning the Sanders came over for breakfast and play on the train set. We even caught Uncle Richard playing on his own for about 5 minutes before Auntie Karen asked what was going on.<\/p><p>Paula was at a wedding today, so we looked after Natasha and decided we would try and go for one of our walks in Richmond. However, the rugby was on which we got caught in the Twickenham traffic for over an hour. We decided to turn back and go to Staines and our old stomping ground, Lammas Park. We playground'ed, scootered in the skate park and got wet in the sprayground. In the evening we watched Ma Mia and stayed up late together. Natasha slept in Katie's bed.<\/p><img src='images\/years\/2011\/2011_09_03-04-StainesLammas.jpg' class='diaryImage' alt='Ben skater dude' \/><p class='diaryImageCaption'>Ben skater dude<\/p>","images":false},"title":{"value":"Sanders, Looking after Natasha, Staines Lammas Park"},"version":1},{"date":{"d":2,"m":9,"y":2011},"datev":20110902,"info":{"content":"<p>We came back from our week's camping at West Wittering today. Mummy and Daddy didn't do anything special for their wedding aniversary this year. Not even a special meal at home!<\/p>","images":false},"title":{"value":"11th Wedding Aniversary"},"version":1},{"date":{"d":30,"m":8,"y":2011},"datev":20110830,"info":{"content":"<p>Finally Daddy had his work review. The salary increase promised 3 years ago was finally agreed to go ahead with the backpay. That coupled with the inheritance money from Aunt Olive, a distant relative, means things are a little easier in the good ship Gay.<\/p>","images":false},"title":{"value":"Daddy's Work Annual Review"},"version":1},{"date":{"d":28,"m":8,"y":2011},"datev":20110828,"images":2,"info":{"content":"<p>We had a change of venue this morning for church. For the whole of last week we went to church club at Frimley C of E and enjoyed ourselves. Highlight was the daily play which evolved into a thriller. To end, we had a special service at Frimley Baptist church.<\/p><p>We then headed over to the Barnett's at Spencers Wood and hooked up with little Eva and parents for an afternoon at Wellington Country Park. Unfortunately the weather was not the kindest, still the picnic prepared by Steve and Joyce made up for that disapointment. Eva was certainly a hungry lady and was quite happy with the attention that Jessica was giving her. We had a go on the playground and another playground and then a jolly train driver took us around the Wellington loop.<\/p><p>We visited the farm where your courage was tested. Who dared feed the animals? Ben was straight in there followed by Katie, Jessica and Steven. I'm sure that's a first for Jessica. Another trip in the playground and zip slide before the weather won and we aborted. Thanks to Steve, Joyce and Eva for a lovely afternoon.<\/p><img src='images\/years\/2011\/2011_08_28-01-WellingtonCountryPark.jpg' class='diaryImage' alt='Picnic'ers' \/><p class='diaryImageCaption'>Picnic'ers<\/p><img src='images\/years\/2011\/2011_08_28-10-WellingtonCountryPark.jpg' class='diaryImage' alt='Feed the goat' \/><p class='diaryImageCaption'>Feed the goat<\/p><p>In the evening we packed for our camping holiday next week.<\/p>","images":false},"title":{"value":"Wellington Country Park"},"version":1},{"date":{"d":27,"m":8,"y":2011},"datev":20110827,"images":1,"info":{"content":"<p>Another of our walks in London today took us around the perimeter of Hampstead Heath. We caught the overground train from Gunnersbury and alighted at Gospel Oak and began our circular walk. The weather was changable, but only once did we have to decamp to the trees. We were a little surprised as we were expecting Parliament Hill and not a lot else. However our 3 mile walk took in some great trees to climb, some woods, a stately home and some views which would make you think you were in the countryside, especially towards Highgate. We topped Parliament Hill pointing out all the landmarks. Great views.<\/p><p>We did briefly go in Kenwood House, but the end of walk highlight was a go in one of the best playgrounds around and eventually the paddling pool. We were planning to go in the impressive Lido but it was a little cold and we were running out of time. However, it looked quite inviting so we'll have to come back another day.<\/p><img src='images\/years\/2011\/2011_08_27-00-HampsteadHeath.jpg' class='diaryImage' alt='Hampstead Heath' \/><p class='diaryImageCaption'>Hampstead Heath<\/p><p>We got back late afternoon and dropped Katie off at Leah's for a sleepover. She went down the pub and stayed up until 12:30am!!!!<\/p>","images":false},"title":{"value":"Walk 21: Hampstead Heath Walk, Leah Sleepover"},"version":1},{"date":{"d":21,"m":8,"y":2011},"datev":20110821,"images":1,"info":{"content":"<p>Tomorrow is Farfar's birthday, however, today was the day we went to the Watercress line with the Tremears as well. We set off from Alton on a steam train, stopped off at Ropley for lunch and a play. Farfar mentioned it was 50 years today that he started on the railway at Woking station. We went to Alresford and back on a dirty diesel, before exploring the engine shed and had a go on the playground back at Ropley. Farfar received odd socks from us and of course our lovely cards and a nice wristwatch from his children. We trundled into Alton station with the adults reminissing the old rolling stock, the slidey windows and old style seating arrangements. You can't beat the smell of a steam train. Happy 65th Birthday Farfar.<\/p><img src='images\/years\/2011\/2011_08_21-05-Watercress.jpg' class='diaryImage' alt='Farfar explaining to Ben about steam engines' \/><p class='diaryImageCaption'>Farfar explaining to Ben about steam engines<\/p>","images":false},"title":{"value":"Farfar's 65th Birthday, Watercress Line"},"version":1},{"date":{"d":20,"m":8,"y":2011},"datev":20110820,"info":{"content":"<p>We left by 8am and headed home. We stopped off at Swindon Outlet centre to get Katie some shoes for school. We eventually got home by about 1pm. It then started the rain. We were pretty lucky with the weather all week. I think the boys wore shorts all week.<\/p><p>Later in the afternoon Steve, Joyce and Eva all popped over for a cuppa and to give Ben his birthday present which was very nice.<\/p>","images":false},"title":{"value":"Wales Holiday - Swindon, Barnett Visitors"},"version":1},{"date":{"d":19,"m":8,"y":2011},"datev":20110819,"images":3,"info":{"content":"<p>We got to Swansea Leisure Centre for the 9am start, thinking we can take advantage of a quiet pool. It boasts being the biggest leisure pool in the Britain. We were not too sure about that. However, there weren't many there to start off so Daddy, Katie and Ben all made hay on the flumes. First up the one where you need an inflatable. We went down.... and then up in some parts. Brilliant. We all loved it. There were two other slides as well which were very good. Jessica had plenty of things to play in as well. There was this board surfer thing as well. A seperate area to simulate a surf where gushing water was poured through and you had to balance your self on a body board. I guess you can use it to practice surfing.<\/p><p>We done our 2 hours and sped north out of the city, up through the valleys and stopped off somewhere very countrified for a nice little picnic. We then continued our journey to the Welsh National Show Caves or Dan Yr Ogof as the locals would say. Well we spent £50 on what amounted to a 2.5 hour stay. Not value for money. Saying that, we went in some good caves. A year ago Katie was quite scared, but she'd overcome that fear over the past year. Jessica however was a little more aware and took the 'scaredy cat' baton. Still it was all very pretty inside and Daddy mucked about with his camera settings to get a few firey looking shots.<\/p><img src='images\/years\/2011\/2011_08_19-03-WalesHoliday-WalesNationalShowCaves.jpg' class='diaryImage' alt='Picnic' \/><p class='diaryImageCaption'>Picnic<\/p><p>Not only were there caves, but the largest collection of Dinosaurs in the world, all life sized in the woods. Ben liked this and climbed on a few. However, on one near the entrance he climbed in the mouth, posed for a photo and then lost his balance, caught the dinosaurs tooth in his mouth, piercing the inside of his mouth, a making a small hole on the outside. Yuk. Poor chap. We all felt sorry for him.<\/p><img src='images\/years\/2011\/2011_08_19-15-WalesHoliday-WalesNationalShowCaves.jpg' class='diaryImage' alt='Captain Cavemen' \/><p class='diaryImageCaption'>Captain Cavemen<\/p><img src='images\/years\/2011\/2011_08_19-21-WalesHoliday-WalesNationalShowCaves.jpg' class='diaryImage' alt='Eaten by a dinosaur' \/><p class='diaryImageCaption'>Eaten by a dinosaur<\/p><p>Uncle Barrie and Laura gave Ben £10 for his birthday. That money has been burning a hole in his pocket all holiday. Everyday he's wanted to spend it. He's finally spent the final £2 on some gems. This cheered him up no end. We visited the farm, the shire horses et al, before we have had enough and ventured our way to Cardiff with a mixture of the second of the Famous Five books and Test Match Special!<\/p><p>We stopped at a pub about a mile from the city centre and had a relaxing meal and pint. Mummy played board games with the kiddies whilst Daddy was in seventh heaven watching the England Test Match on a big tele.<\/p><p>We quickly went past Cardiff Castle before taking our city centre hotel location. Daddy continued with his tightness on the parking front and parked out a bit. We've not had to pay for any parking on the whole holiday. It did mean we had to leave by 8am next morning! Daddy went out in the city centre for a wonder and saw the Millenium Stadium. It was all dark and locked up unfortunately. Overnight there was trouble in the room next to us. They were having trouble evicting the party and eventually called the police. Anyway we didn't have the best night's sleep.<\/p>","images":false},"title":{"value":"Wales Holiday - Swansea Swim, National Show Caves, Cardiff"},"version":1},{"date":{"d":18,"m":8,"y":2011},"datev":20110818,"images":2,"info":{"content":"<p>Today was Mummy nostalgia day. The Gower was Mummy's childhood holiday destination. For about 10 years the Weston took the caravan down the Gower for their annual beach holiday. Mummy and Daddy went here over 10 years ago, but it's nice to come back to show the children around. As we left the rather disapointing Pembroke Dock, a local told us to visit a local waterfall and walk, so we did. It was called Penllergaer Valley Woods. We had a great time building a dam in the stream, although it was freezing cold.  Only Daddy saw the waterfall as the rest of us were getting peckish and went back to the car. We love a valley walk with a stream. Oh the excitement.<\/p><p>Finally the Gower and Llanmadoc. The tide was out and there must have been a miles worth of walking to the actually sea from the start of the beach. Anyway the beach was gorgeous, so clean, spacious and sandy. Other families were building dams on contributories to the sea. So we continued the trend and built one which was the first that was successful. Well for about 20 minutes anyway. Once the dam broke all the other downstream dams had to cope with a relative torrent! We did walk the mile to the sea where Katie and Jessica were doing some kind of sand dancing. That Jessica has got a screw lose I swear. We hooked up with a couple of families whilst there. One from Brighton who helped maintain the dams and another local who had a real broad Wlesh accent. We love it. She thought Folly Farm was expensive, when we thought it was good value. She didn't have much money, so it's all relative I supose.<\/p><img src='images\/years\/2011\/2011_08_18-00-WalesHoliday-TheGower.jpg' class='diaryImage' alt='Tai Chi Jessa' \/><p class='diaryImageCaption'>Tai Chi Jessa<\/p><p>Anyway we then drove what seemed to be an eternity looking for other beaches that Mummy frequented. We went to Oxwich Bay, which wasn't the beach we were looking for. We then went to Southgate, got out for a short walk, but still not the beach we were looking for. The final Beach was Caswell Bay, which Mummy pretended to be the beach we were looking for as she was too afraid to admit it was the wrong one. We spent all afternoon driving from one cove to another. Anyway, we stopped as the beautiful Caswell Bay, played a bit of cricket, climbed some rocks, Katie went in the sea which was a brave feat seeing it was pretty cold. We had a nice time there, although Daddy's childhood cricket bat got stolen!<\/p><p>We travelled to the Mumbles, but time was marching on and we had to get to our hotel in the centre of Swansea as well as find a pizzeria for dinner. We eventually got to the hotel very late after driving around Swansea a bit. The hotel was right in the centre of the city and we were 5 floors up, along with a load of A-Level students. We were expecting a noisey night. To the students credit, we didn't hear a peak and we all slept soundly.<\/p><img src='images\/years\/2011\/2011_08_18-38-WalesHoliday-TheGower.jpg' class='diaryImage' alt='Rock Climbers' \/><p class='diaryImageCaption'>Rock Climbers<\/p>","images":false},"title":{"value":"Wales Holiday - The Gower"},"version":1},{"date":{"d":17,"m":8,"y":2011},"datev":20110817,"images":5,"info":{"content":"<p>We woke latish and got our picnic supplies for the day, before exiting the slightly disapointing Pembroke Dock and arriving at Folly Farm. The weather was fine and the kiddies were on fire with excitement. First up was a mobbing of the Peppa Pig characters. I think it was Jessica's dream moment to give Peppa a kiss! There was so much to do in the park. I think 'Farm' understated what actually was on offer. There were plenty of adventure playgrounds and ride on tractors. I think that alone could have consumed our day. We went in the indoor barn where Katie and Ben had a go at milking a goat. Katie said it was like Ben's winky!<\/p><img src='images\/years\/2011\/2011_08_17-34-WalesHoliday-FollyFarmTenby.jpg' class='diaryImage' alt='George Pig with Jessica Pig' \/><p class='diaryImageCaption'>George Pig with Jessica Pig<\/p><p>Next up was the tractor ride which took us around fields of pigs, horses, donkies, lamas, deer and goats. It was quite loud and plenty of laughter, although I am not sure why. We then went to the giraffes. Mummy was fascinated at the obvious courtship between two of them. We saw zebras, red river boars, a monkey, reindeer, tortoise, osterich and a bongo. We went into the animal magic show.<\/p><img src='images\/years\/2011\/2011_08_17-24-WalesHoliday-FollyFarmTenby.jpg' class='diaryImage' alt='Daddy Pig' \/><p class='diaryImageCaption'>Daddy Pig<\/p><p>Last up was the soft play, again they could spend a fair few hours on that alone, and the old time fairground which was fantastic. We had goes on the helter scelter and the waltzer. We could have spent two days there I reckon, but we had an agenda to stick to so had to leave in the late afternoon.<\/p><img src='images\/years\/2011\/2011_08_17-42-WalesHoliday-FollyFarmTenby.jpg' class='diaryImage' alt='Waltzer' \/><p class='diaryImageCaption'>Waltzer<\/p><p>Tenby was not far away and we had rave reviews from everyone we spoke to about it and it didn't disapoint. We dumped the car and walked down to the harbour. The tide was on the turn and coming in fast. This time Mummy said she would brave the sea and Daddy was on tide and Jessica watch. True to form Ben exited early complaing of the cold, Katie stayed right out there for a bit with the roly polying Mummy!<\/p><img src='images\/years\/2011\/2011_08_17-50-WalesHoliday-FollyFarmTenby.jpg' class='diaryImage' alt='The Tenby Team' \/><p class='diaryImageCaption'>The Tenby Team<\/p><img src='images\/years\/2011\/2011_08_17-00-WalesHoliday-FollyFarmTenby.jpg' class='diaryImage' alt='The Tenby Threesome' \/><p class='diaryImageCaption'>The Tenby Threesome<\/p><p>There was a huge rock in the middle of the beach that daddy decided to climb. He got half way up before a lifeguard came across and to go no higher as someone fell down it last week. Tenby town was very nice and certainly had the atmosphere of a hot holiday seaside town. Not tacky or over commercialized, but full of nice cafes and boutiques. We stepped in one of the cafes which was offering free childrens food. Mummy and Daddy had lasagne, whilst Jessica and Ben had meatballs and pasta. Finally a day without chips. The weather had been fine all day. In fact we've had very little rain all holiday.<\/p><p>It was now 8pm and we still had an hours journey to our Travelodge near Swansea! The kiddies favourite day on the holiday so far. Folly Farm got a big thumbs up from the Gay jury.<\/p>","images":false},"title":{"value":"Wales Holiday - Folly Farm, Tenby"},"version":1},{"date":{"d":16,"m":8,"y":2011},"datev":20110816,"images":3,"info":{"content":"<p>It rained quite a bit overnight and into this morning. We had our cereal in our room and made a hasty exit to get to Llanbaris station by 9am. We have a suitcase and about 10 small bags to transport between car and hotel room so it's always a bit of a mission to get out in the morning. Daddy stupidly left Mummy in charge of booking the train tcikets. She bought the expensive tickets so cost us £69! It was only a 5 mile journey. Daddy said it was far too long for us to walk back and said that's why the plan said a return ticket! Anyway the evocitive smell of steam trains made Daddy forget about the expense and fall in love with steam again. It was a quaint station, red paint everywhere. We got into compartment B and we were steadily pushed up the mountain by a dirty diesel. We saw a gushing river beside us which turned into a spectacular waterfall a little higher up. There were sheep grazing in the most dangerous of places. At the edge of cliff faces it seemed. One false move and it was 'baaaah splat'. We shared seats with a daddy and a 5 year old who very kindly shared his sweets. We got chatting and the children played. I don't they were particularly interested after 10 minutes of the hour long climb, especially as the visibility was so poor and misty.<\/p><p>We eventually reached the end stop. We spent 15 minutes eating some food in the cafe and deliberating whether to take the train down. Experienced climbers cme to us and basically laughed at the fact that we were going to attempt to walk down the mountain. A couple of blokes said our passage down would be extremely windy, coupled with the rain it would be a miserable descent. What swung it for Daddy was the fact that those who had climbed the mountain were soaked through even though they wore all the best gear. Daddy was still reluctant as it had cost close to £70 to get up and the thought of a total spend of £140 was killing him. Even though he was only wearing shorts he was prepared to walk down to save money. The station master took pity and only charged us half price for the five of us to go down.<\/p><p>Having sorted all that out we ventured out, climbed the steps to the top, saw nothing but mist, cold rain and wind before swivelling 180 degrees to return to the cafe and the train.<\/p><p>It was an expensive disapointment due to the poor weather. One day we will be back to do it properly.<\/p><img src='images\/years\/2011\/2011_08_16-09-WalesHoliday-SnowdinAberwyswyth.jpg' class='diaryImage' alt='Llanberis Station' \/><p class='diaryImageCaption'>Llanberis Station<\/p><img src='images\/years\/2011\/2011_08_16-00-WalesHoliday-SnowdinAberwyswyth.jpg' class='diaryImage' alt='Snowdownia' \/><p class='diaryImageCaption'>Snowdownia<\/p><p>Midday arrived so decided to hot foot it east past Snowdon and the picturesque pass before heading south west. Pembroke Dock our overnight stay. We drove quite a bit before stopping at Aberystwyth. We sat on the beach, had a cuppa, then did some rock-pooling. We caught a crab. Daddy is learning how to pick them up. He's still not sure on the best technique without being pinsered. The beach was quite shingley so was unable to make any sandcastles. Still we collected plenty of stones which ew of course now had to take on our travels.<\/p><img src='images\/years\/2011\/2011_08_16-26-WalesHoliday-SnowdinAberwyswyth.jpg' class='diaryImage' alt='Jessica at Aberystwyth' \/><p class='diaryImageCaption'>Jessica at Aberystwyth<\/p><p>All this driving meant that we finsihed our first Famous Five book and moved onto 'Five Meet Again'. We stopped off again at Cardigan. This was not such an impressive place as Aberystwyth. We played on the swings by the river bank, made a welsh friend, but didn;t stay too long before making the final leg down to Pembroke Dock. Arriving at about 5:30pm, the place was a bit of a has-been place. Past glories and all that. After checking in, we walked down the high street for food and the place was pretty deserted. We were after pizza, there was only Chinese or Fish and Chips. We bought chipies and took them to a park which overlooked the bay. We got in at about 8:30 for lights out.<\/p>","images":false},"title":{"value":"Wales Holiday - Snowdon, Aberystwyth, Cardigan, Pembroke Dock"},"version":1},{"date":{"d":15,"m":8,"y":2011},"datev":20110815,"images":3,"info":{"content":"<p>We have a nice cup of tea when we wake up. Jessica asked Ben if she could have one and Ben obliged and decided to get the kettle which had boiled and pour a tea for her. Unfortunately he missed the cup and poured the hot, scalding water over Jessica's hand. Oh how she wailed! No long lasting damage thank goodness.<\/p><p>Before setting off Daddy had noticed the lovely river Dee and nearby gardens close to where he had parked the car. Therefore he rallied the troop and set off for a walkabout Chester. First the amputheatre where Katie and Ben put on a little performance. Then we went passed the city walls, and old, old church, through the gardens and down to a suspension bridge spanning the Dee. We posed for some photos before walking along the lovely promenade back to the car. We had forgotten the pushchair in that unmentionable restaurant and funnily enough none of the staff could help us. So our pushchair was stolen! Brilliant!<\/p><img src='images\/years\/2011\/2011_08_15-26-WalesHoliday-RhosOnSeaGypsyWoodCaernarfon.jpg' class='diaryImage' alt='Ben walking by the River Dee' \/><p class='diaryImageCaption'>Ben walking by the River Dee<\/p><p>The promise of rain did not arrive, so we headed west to Colwyn Bay about an hour away. Mummy had read some more Famous Five, Adventure Island. Where we had parked up in Rhos On Sea, there was a little man made island to protect the beach. Ben was overjoyed. Let's swim across to our own adventure island! Katie a little more wise was a reluctant participant as she and Daddy could see how cold the water was going to be, and how rocky that man made island looked. We tip toed up to our chest before Ben could take it no more and returned to shore, leaving Daddy being encouraged by Katie to get in the water and swim across to the island. It was flipping cold but they both made it across. Katie was extremely sweet taking care of Daddy making sure he was OK. They reached the sumit of the rocks waved, played for a bit and then struggled against the current to get back on to the mainland!<\/p><p>Just across the road was a nice park with a paddling pool and swings so we went there for half an hour. Jessica being particularly cheeky with her bottom wiggles. That was fun.<\/p><p>We then had another hours journey west to Gypsy Wood. This place was hard to describe. It was in the same atmosphere as Black Gang Chine with its tacky ornaments spread through out the park. It was on a much smaller scale, and something a bit different for us to do. There was a model railway where you could control the speed and direction of the trains, a romany caravan which we loved playing in, plenty of small farm animals where Jessica actually stroked a goat and of course a play area. We went on the wetlands walk and finally saw the fairy godmother who painted a small tatoo on our arms. Mummy loved the place as much as we did. Again we stayed till closing time at 5pm.<\/p><img src='images\/years\/2011\/2011_08_15-58-WalesHoliday-RhosOnSeaGypsyWoodCaernarfon.jpg' class='diaryImage' alt='Meeting the Fairy Godfather' \/><p class='diaryImageCaption'>Meeting the Fairy Godfather<\/p><p>We headed 3 miles north to Caenarfon, dropped the bags off at the hotel and walked about the town. It was another lovely, walled town, with a huge castle next to the sea. Picture postcard. Lovely. Ben managed to trap his fingers under a heavy, massive dock ring. Ohh he cried. It started to rain so we decided to have our fish and chips in a restaurant. We tried to have an early night in preparation for tomorrows mountain expedition.<\/p><img src='images\/years\/2011\/2011_08_15-66-WalesHoliday-RhosOnSeaGypsyWoodCaernarfon.jpg' class='diaryImage' alt='Meeting the Fairy Godfather' \/><p class='diaryImageCaption'>Meeting the Fairy Godfather<\/p>","images":false},"title":{"value":"Wales Holiday - Chester, Rhos On Sea, Gypsy Wood, Caenarfon"},"version":1},{"date":{"d":14,"m":8,"y":2011},"datev":20110814,"images":3,"info":{"content":"<p>Mummy said that a holiday isn't a holiday without an early start. The alarm clock rang at 5:15am. It had just turned light outside. We left at 6:15 relatively calm and headed up north. Mummy liked these early starts so she could go to sleep 15 minutes into the journey. Well that's what Bracknell would do to me at 6:30 on a Sunday morning!<\/p><p>We made good progress and stopped just a couple of times and reached Chester zoo at 10:15. Believed to be the largest zoo in the country. We got stuck at the kiosk as the man said that the online tickets we had purchased were used the day before. He finally let us in and straight away we saw a family of 5 elephants. There were two real young'uns playing with each other up and down a slope. Another of the older elephants was demolishing a large branch of leaves. Fascinating seeing it snap and chomp at the wood. The weight of their excrement exceeds the weight of Daddy and Katie but together on a daily basis!<\/p><p>We next saw some amazing monkies which were swinging about, playing around, preening one another and generally very absorbing to watch. We all thought that Ben was most like a monkey. He agreed. We went anti-clockwise around the park, seeing all sorts of animals from rhinos to bats to fat old snakes. Katie was braver than mummy in going into the Bat'ery. We saw a pelican, a zebra, a lion which was roaring pretty loud later on, a beautiful jaguar, a cheetah, orangutans, baboons, serval and meerkats. The tigers were hidden which was a bit of a disapointment, but overall we rated the zoo highly and stayed till the end, 6pm.<\/p><img src='images\/years\/2011\/2011_08_14-67-WalesHoliday-ChesterZoo.jpg' class='diaryImage' alt='Spot the Gorilla' \/><p class='diaryImageCaption'>Spot the Gorilla<\/p><img src='images\/years\/2011\/2011_08_14-47-WalesHoliday-ChesterZoo.jpg' class='diaryImage' alt='Mummy and Daddy' \/><p class='diaryImageCaption'>Mummy and Daddy<\/p><p>Our hotel was a short drive away and overlooked the amputheatre in Chester city centre. We parked up by the cathedral and had the unmentionable, with happy meal before retiring.<\/p><img src='images\/years\/2011\/2011_08_14-80-WalesHoliday-ChesterZoo.jpg' class='diaryImage' alt='Katie's Tea Shop' \/><p class='diaryImageCaption'>Katie's Tea Shop<\/p>","images":false},"title":{"value":"Wales Holiday - Chester Zoo"},"version":1},{"date":{"d":13,"m":8,"y":2011},"datev":20110813,"images":1,"info":{"content":"<p>Early in the morning Farfar popped over to say hello and drop off some goodies for our holiday tomorrow. Daddy had his works do at the exotic Frimley Lodge Park. Thankfully the weather held out and we were able to cycle down. A bit nerve racking, will the children behave themselves in front of the CEO and family. We started off playing with Dane and his family before embarking on a full on game of rounders. Ben was very keen to play and endeered everyone with his enthusasm. Katie was a little shy, and although wanted to participate in her heart, her head said no. Mummy also joined in. After being thrashed, we started a game of football. Ben again very enthusiastic. Meanwhile, Lena, the CEO's wife, took Katie and Jessica and made up some jewelery bags which was very kind of her. BBQ up next then a hard fought match of tug of war. Boys only. That was a lot of fun. We said our goodbyes mid-afternoon, went over to the playground for a bit before cycling home and having an early night for our adventure tomorrow.<\/p><img src='images\/years\/2011\/2011_08_13-15-CNLBBQ.jpg' class='diaryImage' alt='Tug Of War' \/><p class='diaryImageCaption'>Tug Of War<\/p>","images":false},"title":{"value":"CNL Fun Day"},"version":1},{"date":{"d":9,"m":8,"y":2011},"datev":20110809,"info":{"content":"<p>We went with Auntie Ellie, Joey, Lily and Auntie Charlotte camping over at the Basingstoke Canal Centre. Thankfully the weather was good.<\/p>","images":false},"title":{"value":"Camping - Basingstoke Canal Centre"},"version":1},{"date":{"d":7,"m":8,"y":2011},"datev":20110807,"images":2,"info":{"content":"<p>Continuing with our London walks book we drove and parked by Notting Hill Gate to begin our 4 mile adventure. First up was a detour to Hyde Park and a go on the Pirate Ship playground and a picnic.<\/p><p>We then walked down the very impressive Kensington Palace Gardens, a little gem of a street. It mostly houses embasses. We tried to spot all the different countries and their flags. We then cut across Hyde Park to the Albert memorial which we always think looks pretty impressive.<\/p><p>Next the Royal Albert Hall and a cut through to the Science Museum. There were some pretty heavy showers around so decided to spend half an hour in the basement playing in the kids zone.<\/p><p>We continued south past the impressive Michelen building on the Fulham Road before missing the James Bond's residence behind the Kings Road. We ended up at Sloane Square where our walk ended and our bus trip back to Notting Hill began. We love our walks. So nice to see all the different architecture and posh places.<\/p><p>Daddy dropped the car off for its MOT before jogging home through the woods. It passed, costing only £130. Auntie Charlotte has come to stay for a few days.<\/p><img src='images\/years\/2011\/2011_08_07-03-LondonSpiesWalk.jpg' class='diaryImage' alt='Beauts at Hyde Park' \/><p class='diaryImageCaption'>Beauts at Hyde Park<\/p><img src='images\/years\/2011\/2011_08_07-21-LondonSpiesWalk.jpg' class='diaryImage' alt='Barclays Bikes' \/><p class='diaryImageCaption'>Barclays Bikes<\/p>","images":false},"title":{"value":"Walk 20: London Spies Walk"},"version":1},{"date":{"d":6,"m":8,"y":2011},"datev":20110806,"info":{"content":"<p>In the morning we were rushed. Daddy actually bought a mobile phone which cost him a whole £30. £25 more than he's ever spent on a phone before.<\/p><p>We split in two teams: Mummy, Ben and Jessica went to Bushy park to play on the swings whilst Daddy decided to kayak on the next leg of the Thames journey. Armed with an extra seat and some new gloves they set off down the Thames stopping off at Hampton for a spot of lunch. Katie had a few goes at paddling and now has got the hang of it and quite proficient.<\/p><p>We waited so long at both locks that Daddy found an alternative at Molesey. We slid down some rollers especially made for small craft like ours. The last 3 miles of our 8 mile journey was a bit of a rush as we needed to meet Mummy by 2pm. Finally we met at Kingston bridge.<\/p><p>Later in the afternoon we had the Kelley's over for a BBQ and play. Daddy had got some meat from the butchers. Mmmm.<\/p>","images":false},"title":{"value":"Bushey Park - Kayak Walton to Kingston - Kelley's for BBQ"},"version":1},{"date":{"d":5,"m":8,"y":2011},"datev":20110805,"images":3,"info":{"content":"<p>We camped in Mummy and Daddy's room for a spot of present opening. He got countless Lego sets, a wallet which he was most pleased about, some Star Wars socks, a huggle buddy, dive sticks, sun glasses, a transformer, Beast Quest books, t-shirts, a watch and a Bin Wevil subscription.. Ben was so sweet inviting Katie and Jessica to open a present eacg for him.<\/p><p>Fortunately the weather was good and Mummy had arranged a Beast Quest (an adventure book) party for Ben between 11 and 1 o'clock. Auntie Ellie came over to help us play Pass The Bomb, the corner game, <\/p><p>We had Michael Cox, Joey Harris and his cousin, Oliver, Charlie Borg, Amy Tyas, Joey and Lily . Quite a few, not many he plays with regularly outside of school unfortunately. Mummy had made a semi-disaterous volcano cake which somehow she got away with. All the mummy's then came to pick their children up.<\/p><p>After Daddy got home for work we all went over to the Arena for a swim and a play with Ben's new sticks.<\/p><img src='images\/years\/2011\/2011_08_05-08-Ben6thBirthday.jpg' class='diaryImage' alt='The Birthday Beast Quest Guests' \/><p class='diaryImageCaption'>The Birthday Beast Quest Guests<\/p><img src='images\/years\/2011\/2011_08_05-17-Ben6thBirthday.jpg' class='diaryImage' alt='Cake time' \/><p class='diaryImageCaption'>Cake time<\/p><img src='images\/years\/2011\/2011_08_05-20-Ben6thBirthday.jpg' class='diaryImage' alt='Beautiful Party Organizer' \/><p class='diaryImageCaption'>Beautiful Party Organizer<\/p>","images":false},"title":{"value":"Ben's 6th Birthday Party"},"version":1},{"date":{"d":31,"m":7,"y":2011},"datev":20110731,"first":{"value":null},"images":1,"info":{"content":"<p>We went to church as normal. It was a special service celebrating 100 years of the church. As such both Katie and Ben had short paragraphs to read to the congregation about the history of the curch. They both did very well.<\/p><woops woopstitle=\"Work lockout\" rating=\"5\"><p>Daddy had to go to work as his machine had locked up. Having to show his security card he forgot to put it back in his wallet. Anyway after an hour or so he went to the toilet taking his wallet so he could get back in, so he thought. Oh dear. He was locked out of his office. Daddy could see his security card and motorbike keys through the window. There was nothing he could do other than jog the 7 miles home. Well jogging the whole way was a bit optimistic with jeans on in this heat. 5 miles down the line he began to feel pins and needles in his head and legs. Anyway thankfully he made it home just in time to go to Evie's birthday party.<\/p><img src='images\\years\\2011\\2011_07_31-01-CNLWorkLockout.JPG' class='diaryImage' alt='CNL House Lockout' \/><p class='diaryImageCaption'>CNL House Lockout<\/p><\/woops><p>However, mummy thought it was a bit Crookham village hall, sorry guessed it was there. Noone there. Noone at Church Crookham Village hall either, or at the local church. We almost gave up. Fortunately we saw Barrie at the Tesco's borrowed his phone and contacted Rich to find out it was at Crondall!<\/p><p>The weather was perfect and the village hall was in such a perfect setting. Crondall is lovely in the summer. Situated right next to the village cricket pitch. There were lots of people there include Helen who we haven't seen for a long while. The children were playing by the toilets. Unfortunately they were trying to open the door whilst Ben was sitting on the toilet. Anyway, there were a lot of tears and poo trodden into the floor. Yuk. We were not pleased with Katie fir sticking up for Ben. Anyway, we had to return so that Daddy could lock up his work.<\/p>","images":false},"title":{"value":"Evie 2nd Birthday Party, Work Nightmare"},"version":1},{"date":{"d":30,"m":7,"y":2011},"datev":20110730,"info":{"content":"<p>In the morning we went Skate Jamming down at Tomlinscote School and met up with Nina. In the afternoon Ben went to the Camberley Gym for one of his classmates birthday's. The rest of us went into Camberley to spend Katie's birhtday money on some more Barbies.<\/p><woops woopstitle=\"A 10 minute bike ride, so many disasters\" rating=\"7\"><p>Daddy had planned to take us out on a bike ride down by the Canal at Frimley Lodge Park, cycle to the Mytchett Centre, go on the swings then return. What possibly could go wrong?<\/p><p>Enter, Laura Joy Gay, aka Mummy. As we were about to set off Mummy comes running out in her pyjamas saying she wants to come as well. We can't fit her bike onto the car so Daddy said he'd ride her bike down there, whilst Mummy drives down with all the other bikes on the rack. Daddy impressed on Mummy to be really careful because the bikes on the rack only just fit on, and Ben's bike is basically balancing preariously.<\/p><p>Daddy last 2 yards down the road when he fell off because Mummy had forgot to mention that her handle bars were loose, so that it did not affect the direction you travelled in. It was funny to see Daddy on the fllor. Anyway Daddy managed to tighten up the steering column and off he went. We soon caught up with him on Deepcut road. First speed hump approached, Mummy did not heed Daddy's warnings (apparently she forgot!) and the bikes all jumped in the air, how Ben's did not fall off I do not know! A lucky escape. Daddy couldn not believe his eyes.<\/p><p>When Daddy trundelled into Frimley Lodge park he saw a pile of bikes on the floor in the middle of the road leading into the car park. Mummy hadn't 'appreciated' the 2 metre height limit and the bike came crashing down! Fortunately there was not much other traffic about and not too many scratches. However, Katie's front wheel wouldn't go around anymore! Daddy re-attached the brakes and we were all good again.<\/p><p>We started heading towards Mytchett, Jessica was on the baby seat on the back of Daddy's bike and they followed Ben down some mountain bike trails as Ben called them. However, he stopped seemingly for no reason down a cutting leading daddy to stop abruptly, loosing his balance, causing Jessica to fall sideways into a prickle bush. With all those spots on her face anyway you could almost see the comic value of it all. She howled, Daddy unpricked all the prickles from her hands.<\/p><p>Stress levels also rose when ever we passed a dog off it's lead. Hysterics from Katie and Jessica, as Ben blindly went on up the Canal path, quite close the edge at times! We eventually got to Mytchett only to find the swivel bridge over to the playground had been turned so you couldn't cross. Instead we decided to head back to Frimley Lodge Park and go on their swings. This surprisingly went withough incident.<\/p><p>It was getting late and because of the rack capacity issue, Mummy was going to cycle home. Katie and Ben both also wanted to cycle back with her. Katie didn't want Ben cycling for some reason so tantrums ensued. Daddy and Jessica drove him and got talking to next door. Un be known to them, Katie's peddle had now fallen off her bike causing her to fall off, tears, the lot. Katie, Ben and Mummy walked to Grandma's and phoned for Daddy to pick them up. Daddy was fixing next door's strimmer at this point. It was going past 8pm now. Eventually Daddy got the call to come and collect us! What a trauma.<\/p><\/woops>","images":false},"title":{"value":"Skate Jam, Birthday party, Bike Ride Disaster"},"version":1},{"date":{"d":29,"m":7,"y":2011},"datev":20110729,"info":{"content":"<p>Karen and Richard kindly spoilt Katie with a night out down at Pizza Express and a sleepover. Katie stunned everyone by ordering the biggest size pizza they did. No one else knows she is just an eating machine. She even took what she didn't eat home in a doggy bag! Thanks Karen and Richard.<\/p>","images":false},"title":{"value":"Katie over to Sanders for Sleepover"},"version":1},{"date":{"d":29,"m":7,"y":2011},"datev":20110729,"info":{"content":"<p>During the week we stayed at home a lot. We baby sat Freya and Harrison on Tuesday and Wednesday. We also went on a number of bike rides. Katie is well pleased with her a new bike. Maybe a 'tinsy' bit big. 'Tinsy is Jessica's word of the moment. Ben had also been dressing in girls clothes again and putting on make up!<\/p><woops woopstitle=\"Roof bar dumped on M25\" rating=\"4\"><p>On the way home from Kent one day, getting on the M25 at Swanley, mummy heard a clunk and something fly off the back of the car. She thought it was the car aerial. It was infact one of the roof bars! How that has not killed someone or caused an accident I don't know.<\/p><\/woops>","images":false},"title":{"value":"First Week of school hols"},"version":1},{"date":{"d":25,"m":7,"y":2011},"datev":20110725,"first":{"name":"jessica","value":"Jessica's Chicken Pox"},"images":1,"info":{"content":"<p>I think she was developing spots yesterday, but she certainly had them today. Over the next 3 or 4 nights she had disturbed sleeps poor little girl. She took it all very well, proud she had them, called them tickles rather than itches and even had them in her mough. 'I've got a tickle in my mouth daddy'.  By the end of the week she looked like she had slept on a bed of nails.<\/p><img src='images\/years\/2011\/2011_07_27-01-JessicaChickenPox.jpg' class='diaryImage' alt='Jessica's Tickles' \/><p class='diaryImageCaption'>Jessica's Tickles<\/p>","images":false},"title":{"value":"Jessica gets Chicken Pox"},"version":1},{"date":{"d":24,"m":7,"y":2011},"datev":20110724,"images":3,"info":{"content":"<p>We brought the presents into Mummy and Daddy's room and Katie sensibly went through them in a nice manner. She had a great haul. From Mummy and Daddy she got a brand new 20 inch bike, lots of clothing, barbies.<\/p><p>We didn't hang around too long and ventured to Kettering where we were going to a small theme park and playground area called Wicksteed Park. We parked up at Uncle Philips house who was unfortunately out, but saved us paying £6 car parking fee! It boasted the largest \/ best playground in Europe. I wouldn't have said that, quite big, but I would say Longleat and Druscilla's had better. After a go on the aforementioned playground, Katie and Mummy went on the pirate ship. Daddy said it looked liked it went very high, Katie came off the ride saying it didn't go high enough! We meandered through the park taking it in turns to have a go on rides. Daddy and Ben went on the dodgems, Jessica on the tug boat ride. We were limited in the number of rides we could go on, and it was a little more restrictive than Pleasure Island in Cleethorpes. i.e. Many rides had to be accompanied by an adult.<\/p><p>Wicksteed Park has lots of park land. Plenty enough for us to sit down have a picnic overseeing the rest of the park that we hadn't been to yet. We headed over to the umbrella ride. We calculated that we did not have enough to go on the log flume and racing cars. It was getting quite hot, and we all caught the sun abit.<\/p><p>We headed over to the far end of the park where Daddy had a go on the flying log which is hard to describe and nothing like it at anything park. Basically you are but in a one man toboggan, on rails, raised about 25 feet, then let go, racing down the rails, with a mini ski slope bit at the end meaning you jump in the air and land in a lake of water. Wicked!<\/p><p>Katie kindly treeted us children to an ice cream each with her own birthday money which was very kind of her. We went on boat ride from 1923, the car ride from the 60's and finally on the train around the park. We were all getting quite tired by now. We had another sneaky go on the playground before walking back the mile long course to the car. Uncle Philip was busy wit a photo shoot, so returned home via some bad M1 traffic and a chip shop. 3.5 hour return journey!<\/p><img src='images\/years\/2011\/2011_07_24-30-Katie8thBirthdayWicksteedPark.jpg' class='diaryImage' alt='Our 8 year old' \/><p class='diaryImageCaption'>Our 8 year old<\/p><img src='images\/years\/2011\/2011_07_24-13-Katie8thBirthdayWicksteedPark.jpg' class='diaryImage' alt='Mummy and Jessica ladybirding it up' \/><p class='diaryImageCaption'>Mummy and Jessica ladybirding it up<\/p><img src='images\/years\/2011\/2011_07_24-23-Katie8thBirthdayWicksteedPark.jpg' class='diaryImage' alt='Mummy and Jessica ladybirding it up' \/><p class='diaryImageCaption'>Mummy and Jessica ladybirding it up<\/p>","images":false},"title":{"value":"Katie's 8th Birthday - Wicksteed Park"},"version":1},{"date":{"d":23,"m":7,"y":2011},"datev":20110723,"info":{"content":"<p>The Wests came over in the afternoon. Freya wanted to clean a lot, don't know what that says about the state of our house, and Harrison played Barbie's with Katie and Jessica!<\/p>","images":false},"title":{"value":"Wests Over"},"version":1},{"date":{"d":22,"m":7,"y":2011},"datev":20110722,"images":2,"info":{"content":"<p>School finished today and we organised a Hula Girl party for Katie. She had a dozen or so friends invited around to our house which was a bit manic and Mummy was in charge of party games, Daddy was on BBQ duty. We also had the paddling pool out, the weather just about allowed us this luxury. The wearther has been pretty bad over the past week, so grateful for anything that allows us outside. It was good to see Leah Sumner who we haven't seen much of as well as the Teale's who had to battle through Friday M25 glory!<\/p><p>Anyway we played the corner game, pass the hot coconut (like pass the bomb), pass the parcel with forefeits, hula girl bingo, limbo, the paddling pool ball game and who stole hula from the hula girl. Mummy dad ever so well controlling lots of excitable girls. The party ended with birthday cake and party bags, which this year included a hula hoop.<\/p><img src='images\/years\/2011\/2011_07_22-00-Katies8thBirthdayParty.jpg' class='diaryImage' alt='Invitation' \/><p class='diaryImageCaption'>Invitation<\/p><img src='images\/years\/2011\/2011_07_22-06-Katies8thBirthdayParty.jpg' class='diaryImage' alt='The party go-ers' \/><p class='diaryImageCaption'>The party go-ers<\/p>","images":false},"title":{"value":"Katie's Birthday Party"},"version":1},{"date":{"d":18,"m":7,"y":2011},"datev":20110718,"info":{"content":"<p>Ben told us today that they all had to sing a song in assembly. When finished he put his hand up and told the headmistress that he knew a different version, one from church. He was asked if he'd like to sing it, so stood up at the front of the assembly and sang the church version to the school. How sweet.<\/p>","images":false},"title":{"value":"Ben Sings In Front Of Assembly"},"version":1},{"date":{"d":16,"m":7,"y":2011},"datev":20110716,"info":{"content":"<p>It was Emma Tyas's birthday and her party was over in Bracknell and was a snow tubing party. It was great fun. Meanwhile Daddy worked in the morning and couldn't come with us.<\/p><p>The weather was appalling so in the afternoon we did a mixture of playing inside and out. We had a great game of football. Daddy and Jessica 7 v 8 Ben and Katie. Rain then stopped play!<\/p>","images":false},"title":{"value":"Snow tubing"},"version":1},{"date":{"d":15,"m":7,"y":2011},"datev":20110715,"info":{"content":"<p>\u000a        We received the school reports back from both Ben and Katie today. Katie's looks very average on the face of it. All marks are middle of the road. Could do with some improvement on writing, but a very good girl in class and popular.\u000a        <a href=\"images\/years\/2011\/2011_07_15-KatieSchoolReport.pdf\/2011_07_15-KatieSchoolReport.pdf\">\u000a          Katie's School Report\u000a        <\/a><\/p><p>\u000a        Ben's was a good report. We know he excels in maths, but also doing very well at reading. Ben needs to slow down and keeping things neat, but nothing we are worried about. To be honest we couldn't have asked for a better report.\u000a        <a href=\"images\/years\/2011\/2011_07_15-BenSchoolReport.pdf\">\u000a          Ben's School Report\u000a        <\/a><\/p>","images":false},"title":{"value":"School Reports - Sanders BBQ"},"version":1},{"date":{"d":14,"m":7,"y":2011},"datev":20110714,"images":1,"info":{"content":"<p>Daddy went up to the Oval to watch Surrey lose to Kent in a 20-20 game<\/p><img src='images\/years\/2011\/2011_07_14-02-OvalCricket.jpg' class='diaryImage' alt='Oval' \/><p class='diaryImageCaption'>Oval<\/p>","images":false},"title":{"value":"T20 Cricket - Surrey v Kent"},"version":1},{"date":{"d":11,"m":7,"y":2011},"datev":20110711,"images":1,"info":{"content":"<p>Katie had been very excited about being involved in the play albeit a member of the choir. Phil Rowe's nephew was in a starring role and did very well. Katie also did very well in the 90 minute production of Camelot.<\/p><img src='images\/years\/2011\/2011_07_11-01-KatieChoirSchoolPlay.jpg' class='diaryImage' alt='Choir Girl Katie' \/><p class='diaryImageCaption'>Choir Girl Katie<\/p>","images":false},"title":{"value":"Katie's School Play"},"version":1},{"date":{"d":10,"m":7,"y":2011},"datev":20110710,"images":2,"info":{"content":"<p>Woo Hoo, Daddy is 36 today! We started in the traditional way by opening presents in mummy and daddy's bed. Daddy got some chocolate, a patio light set, bike lights, crisps, bike pump, bike gloves, a piece of rainbow trout, a belt and Asda vouchers.<\/p><p>The Fars came around early to give some more presents and stayed for a quick cup of tea. Mummy and the rest of us went down to 'the Green' to help setup the stall for the playschool. Meanwhile Daddy took Katie and Ben off to Frimley Lodge Park where we mainly played on the zipwire. Because it is new it did indeed zip along. Luckily mummy wasn't there as Daddy was fizzing us down, sending us upside down when we hit the end. We loved it.<\/p><p>We then had the ridiculous wait of 2 hours between the time we got on our floats to the time we actually set off. It is Jessica's first year on a float. She dressed up as a dalmation for the themed 101 Dalmations. Mummy was on the stall and Daddy couldn't really go on with her as he was dressed in the wrong outfit. Still she sat next to Aimee Huggitts, her best friend. She had a mixture of a serious face and a laughing outlook.  We wondered what is going on in that mind of hers when she has a serious face on. I think she was surveying the situation. Something was werring away in that brain of hers. Ben's float was themed with Alice and Wonderland, Ben going as the King of Hearts.<\/p><img src='images\/years\/2011\/2011_07_10-09-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Jessica the Dalmation with best friend Aimee' \/><p class='diaryImageCaption'>Jessica the Dalmation with best friend Aimee<\/p><img src='images\/years\/2011\/2011_07_10-03-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Ben and Oliver' \/><p class='diaryImageCaption'>Ben and Oliver<\/p><p>2pm arrived and we all set off from the playschool and moved slowly down to Frimley Green. Farmor, Ma Ma, Pop Pop, Uncle Peter and the Sanders saw us go past. We threw sweets out to the people watching.<\/p><p>It took about an hour to reach the finish at Lakeside Country Club. We headed back to the Green to get a much needed ice cream and cup of tea, served by Katie who was working towards her 'Hostess' badge for Brownies.<\/p><p>Time was marching on so we had to dip out of Steve's BBQ which was a shame. Instead we went home, Daddy cooked a spag boul and a much needed early night.<\/p>","images":false},"title":{"value":"Daddy's 36th Birthday - Frimley Green Carnival"},"version":1},{"date":{"d":9,"m":7,"y":2011},"datev":20110709,"images":3,"info":{"content":"<p>We picked Katie from a sleep over at Natasha Kelley's house. She had stayed up past midnight and got up early to play the Wii. Today we have a long walk planned so looking forward to Katie's mood later on!<\/p><p>We drove to South Wimbledon tube and got the Northern line up to Bank where we Mummy decided we would try and do the walk backwards! It didn't work too well, so we started at Canon Street station and took in the sites of the church where Dick Whittington is buried, the Guildhall, Mansion House, the Bank Of England, the Royal Exchange, Ledenhall Market, the Gurkin, the Lloyds building and Tower 42. There were some quaint, narrow olde worldy type streets which we enjoyed discovering. There is just so much to London that we never see. Mummy and Daddy enjoyed it, us children were just going along. At Bank we stopped for a bit to marval at the buildings. There happened to be a piano there which we played and entertained people with. Quite quirky really.<\/p><img src='images\/years\/2011\/2011_07_09-02-DickWhittington.jpg' class='diaryImage' alt='Inside Out' \/><p class='diaryImageCaption'>Inside Out<\/p><img src='images\/years\/2011\/2011_07_09-28-DickWhittington.jpg' class='diaryImage' alt='Bank' \/><p class='diaryImageCaption'>Bank<\/p><img src='images\/years\/2011\/2011_07_09-29-DickWhittington.jpg' class='diaryImage' alt='Leadenhall Market' \/><p class='diaryImageCaption'>Leadenhall Market<\/p><p>Going from one of the richest and nicest parts of London to other end of the spectrum and Hoxton, where the Gay family lived 150 years ago. Daddy really wanted to go to a pie and mash shop. Well it wasn't for the tourists that is for sure, the lady running the place was proper east end, the cafe had sawdust all over the floor, the tables had salt all over them, we think just because they hadn't been cleaned. There were quite a few locals and they all seemed authentic east london. Only Daddy, Ben and Mummy were brave enough to sample the pie and mash. The mash scraped onto the edge of the plate, the pie nothing special. A bit disapointing really.<\/p><p>After leaving we got Jess and Katie their lunch and walked up Hoxton high street which had a low-end market running. We headed east towards Victoria Park, another haunt Daddy wanted to visit, just because again alot of old addresses were from that area. Walking there we saw a lot of boarded up flats. Seemed quite a poor area. An old black gentleman sitting on a bench high fived us all as we walked passed. The children were not scared, which we expected. Members of our party were begining to flag. We walked up Broadway Market which was a pocket of class in an otherwise impoverished area. A recommendation to the Fars for this place. We went slighlty out of our way as we hit London Fields. Patience was running thin. We eventually made it to Victora Park only to find the playground was shut for maintenance!<\/p><p>Ben decided he needed another wee didn't hide to well when tiddling up a tree. That boy! We continued walking to Bethnal Green tube where there was the biggest police presense we've ever seen. There must have been 20+ police vans and seemingly 100's of officers all surrounding the pub. Apparently they were there to prevent some gang fight. A lot of poilce!<\/p><p>A welcome relief to be off our feet we returned on the tube back to South Wimbledon. Mummy and Ben stopped at Stockwell as Benny needed the toilet again!<\/p><p>The Elders came around later in the evening for some din dins with us.<\/p>","images":false},"title":{"value":"Walk 19: Dick Whittington Walk, Elders for dinner"},"version":1},{"date":{"d":7,"m":7,"y":2011},"datev":20110707,"info":{"content":"<p>On a couple of occassions Jessica has gone into a fit where she's gone unconcious for a period of a minute or two. Today we finally found that there is nothing to worry about, this can happen to children and she will probably grow out of it. Anyway she was such a star. She had an ECG stuck onto her. She took it all in her stride. Good girl Jessica.<\/p>","images":false},"title":{"value":"Jessica Hospital Check Up"},"version":1},{"date":{"d":3,"m":7,"y":2011},"datev":20110703,"images":1,"info":{"content":"<p>Daddy worked in the morning in his new office, aka Katie's bedroom, whilst the rest of us went to church.<\/p><p>At lunchtime we went over to the Fars for the now annual Danish Buffet. Ben had worked out that if we had children, that a half of a quatre was an eigth! He also said he wasn't going to have breakfast so he could leave more room for frikidellar!<\/p><p>Auntie Susan and Graham came as well as Uncle Ron who we have not seen for five years perhaps. So it was good to see him. He was in good spirits and it was nice to see him comfortable in the surroundings. Ah, the surroundings grew ever more boisterous after we drew and outline of ourselves and painted. Aimee and Emma, George and Georgia came over to play, so 7 kiddies in all. It became somehow a little manic. We seem to attract 'manicness'.<\/p><p>We of course had an excellent lunch all of Danish related foods, well perhaps except the sausages. We had a egg cake, fish cake, herrings, frikidellar, pickled cucumber, danish salami, the lot. We were all stuffed.<\/p><p>We played lots of games, first up football with Graham and Daddy. It was great first passing and then Katie and Ben trying to get the ball of Graham and Daddy. Farfar had made a 'Where's Wally' game, where we had to find the characters in the back garden, amongst the phonies and folliage! Later Mummy made loads of games for us to play.<\/p><p>A good time had by all, luckily the weather was good.<\/p><img src='images\/years\/2011\/2011_07_03-14-FarsDanishBuffet.jpg' class='diaryImage' alt='Prizes for the Where's Wally handed out' \/><p class='diaryImageCaption'>Prizes for the Where's Wally handed out<\/p>","images":false},"title":{"value":"Fars Danish Buffet"},"version":1},{"date":{"d":2,"m":7,"y":2011},"datev":20110702,"images":2,"info":{"content":"<p>A bright, sunny day and we headed off early up to Greenwich for the next installment of the Gay's walking bonanza. Today's guest appearance was Pop Pop. Daddy parked the car in Blackheath and joined us by the Cutt Sark. Well I'd call it a boarded up town. Everywhere it seemed was preparing for the olympic games.<\/p><p>Our shortish walk took in the Painted Hall, the college chapel, the statue of Nelson at the Trafalgar public house, the swings in the park, the Queen's house, the maritime museum where we saw the bullet hole in Nelson's outfit, the observatory, 0 degrees longitude, the deer park, Greenwich market and the tunnel under to Island Gardens.<\/p><img src='images\/years\/2011\/2011_07_02-17-Greenwich.jpg' class='diaryImage' alt='Maritime College' \/><p class='diaryImageCaption'>Maritime College<\/p><img src='images\/years\/2011\/2011_07_02-43-Greenwich.jpg' class='diaryImage' alt='Greenwich Tunnel' \/><p class='diaryImageCaption'>Greenwich Tunnel<\/p><p>We certainly packed a lot in and were exhausted by the time we got home. Daddy then went over to Reading to watch the Haye v Klitschco fight. A late night!<\/p>","images":false},"title":{"value":"Walk 18: Greenwich"},"version":1},{"date":{"d":26,"m":6,"y":2011},"datev":20110626,"info":{"content":"<p>Mummy, Ben and Jessica went off to church leaving Daddy and Katie going on the next leg down the Thames. Farfar kindly gave us a lift to Chertsey bridge and pushed us off and waved us goodbye. It was the hottest day of the year, a scorcher. We headed east up past Shepperton to Walton. Katie had a good few go's at paddling along... and well we saw some nature close up. To be fair Katie paddled the final 250 metres no problem. Tempted to get paddles that befit her size.<\/p><p>We ended at the Anglers pub where Katie had a screwball from the ice cream van. We went home where Daddy, Uncle Michael, and Daddy's other friend Michael were all supposed to go karting. There was a cock up in the bookings which meant they ddin't go in the end. Instead they all came back to the house for some more mayhem in the back garden. We had the paddling pool out and there was plenty of water being chucked about. Pop Pop popped in for 10 minutes as well.<\/p>","images":false},"title":{"value":"Thames Kayaking, Elders over"},"version":1},{"date":{"d":25,"m":6,"y":2011},"datev":20110625,"images":2,"info":{"content":"<p>We awoke early with Daddy helping Katie put banners she made all around the house. The banners were a mixture of 'Your 35 today' to song lyrics she made up. It was a very sweet gesture.<\/p><p>Anyway we all landed in Mummy and Daddy's bed helping Mummy open her cards and presents. Her favuorite was the sequel to the walks book around London that we have. This time the Walks book were all in London; good choice Jessica.<\/p><p>Katie gave a big hot chocolate mug and spoon that she picked up at the church fair, whilst Ben got Mummy a big Galaxy bar, which I think he got just so Mummy could share it with him. Daddy got her a pair of nice Jeans and some brown casual trousers. Other presents included a notepad set from Ma Ma and Pop Pop, a black dress from Charlotte, some shoes from Ellie, a vase from Fi, some smellies from the Fars and Susan.<\/p><p>Farmor popped in and gave her present. After a trip to the supermarket we briefly went to the excellent Cross Farm Fete where we went on the bouncey castle, the teddy tombola, the pick a bag of sweet stall, beat the goalie and Katie and Jessica got there hair sprayed pink and black! We caught up with Ma Ma and Pop Pop for a bit there as well.<\/p><p>After lunch our guests arrived: The Elders, Auntie Charlotte, The Burrows and Fi's sister and husband, Jo and Bert. Auntie Susan popped in for a bit to drop off a present for the birthday girl.<\/p><p>We went over to the army show which is one of our favourite shows of the year, right slap bang on our door step. All the usuals were there. Ben was well into his guns.<\/p><p>We returned for some BBQ action and finished up with a water fight on the field opposite. A great day with our friends<\/p><img src='images\/years\/2011\/2011_06_25-00-Lau35thBirthday-ArmyShow.jpg' class='diaryImage' alt='The guys' \/><p class='diaryImageCaption'>The guys<\/p><img src='images\/years\/2011\/2011_06_25-76-Lau35thBirthday-ArmyShow.jpg' class='diaryImage' alt='The guys' \/><p class='diaryImageCaption'>The guys<\/p>","images":false},"title":{"value":"Mummy's 35th Birthday - School Fete - Army Show - BBQ"},"version":1},{"date":{"d":19,"m":6,"y":2011},"datev":20110619,"images":2,"info":{"content":"<p>We woke early and gave Daddy his presents in bed. Katie help build a bird box, Ben gave a screwdriver set because apparently Daddy has to do a lot of DIY, and Jessica got Daddy a fruit compote which he really likes. Daddy also got 5 cards in total, made from school and Sunday school.<\/p><p>Daddy then went off to give Farfar his Fathers' day treat, which was a day on the Kayak doing a circular tour along the Abbey River in Chertsey, upto Penton Lock and back down the Thames to Chertsey Bridge. Abbey River was quite overgrown in places with reeds and lily pads. At one point a tree trunk had fallen across the river and both Daddy and Farfar were balanced on the trunk lifting the kayak over. Daddy lost his balance and fell in! Soaked up to the waist.<\/p><p>Anyway they stopped a couple of times and met up with Farmor for some food. I think Farfar sort of enjoyed it even though it was not the most comfortable ride he's ever had.<\/p><p>Later in the afternoon Ma Ma and Pop Pop came over for some tea and cake.<\/p><img src='images\/years\/2011\/2011_06_19-07-FathersDayKayak.jpg' class='diaryImage' alt='Abbey River' \/><p class='diaryImageCaption'>Abbey River<\/p><img src='images\/years\/2011\/2011_06_19-20-FathersDayKayak.jpg' class='diaryImage' alt='Waiting at Chertsey Lock' \/><p class='diaryImageCaption'>Waiting at Chertsey Lock<\/p>","images":false},"title":{"value":"Fathers' Day - Kayaking"},"version":1},{"date":{"d":18,"m":6,"y":2011},"datev":20110618,"images":1,"info":{"content":"<p>Katie was selected to play for Surrey Heath's B Team in the Surrey Youth Games at Surrey University. Fantastic. She has been having lessons at the local tennis club and was selected to play.<\/p><p>We arrived at the university sports campus at 9am and headed straight for the tennis courts. There were a dozen or so boroughs been represented in sports from Netball, Football, Badminton, Hockey, Squash, Tennis and even Boxing.<\/p><p>Katie played a couple of doubles matches and a couple of singles. Unfortunately the scoring didn't quite go her way, however, she really enjoyed playing and it was good to see her part of a team. She wants to continue with more tennis lessons and will drop the horse riding for it.<\/p><img src='images\/years\/2011\/2011_06_18-40-SurreyYouthGames.jpg' class='diaryImage' alt='Katie smashes a two handed back and forehanded shot down the line.' \/><p class='diaryImageCaption'>Katie smashes a two handed back and forehanded shot down the line.<\/p>","images":false},"title":{"value":"Surrey Youth Games"},"version":1},{"date":{"d":17,"m":6,"y":2011},"datev":20110617,"info":{"content":"<p>Two bookings for Daddy today. First Daddy took us to school in a big round trip which started and ended at playschool. A 3 hour session at Frimley Green Pre School was first up. No other dad's in, and not many in during the whole of 'Fathers Week'. Still Jessica was very pleased to have a shadow. First up was some drawing and colouring. Very soon we had attracted a whole table of drawerers all very eager to show off their talents to Daddy. Daddy ended up going around helping all the children on the table and telling them what to draw.<\/p><p>Jessica had a very good friend in Ammie Huggarts, well thats what Jessica calls her. She is quiet, but very nice. She joined us on all our travels around the differnt activities. We played inside and out, we counted on the abacus, played on the computer, spun the hula hoop, played with the blocks. There was story time, snack time and excercise time. Jessica is certainly a little timid, being one of the younger ones, well behaved and such a cutie. She makes Daddy laugh constantly and he is very proud of her.<\/p><p>Daddy quickly dropped Jessica off to Mummy who had a lovely morning off, before returning back into Frimley Green for an afternoon of Cross Farm. This was far better attended by the Dads. Ben was in Miss Sollers class, who was quite strict with the children.... and she was fairly young. There was a lot of sitting on the mat and listening and answering question. It was first about recycling which involved some art work. Daddy and Ben had to fill in the recycle symbol with various materials that can be recycled: fabric, newspaper and foil. It involved gluing and scisor work. Some more mat sessions before it was hometime.<\/p><p>A lovely day for Daddy to spend some time with the children in their schools.<\/p>","images":false},"title":{"value":"Daddy At School Day"},"version":1},{"date":{"d":11,"m":6,"y":2011},"datev":20110611,"images":4,"info":{"content":"<p>Early in the morning Daddy and Ben made a rock CD. Songs chosen, by the free minded Ben, with a little encouragement from Daddy. On went Queen, Kaiser Chiefs, White Stripes and his now favourite The Prodigy, Omen.<\/p><p>We headed upto Herfordshire to visit the Dixons for the first time at their new abode. We arrived a bit too early, but before you could say hello, Yasmin, Ben and Katie were hand in hand skipping down the road. No getting used to each other, they were straight in there. It was lovely to see.<\/p><p>On the way over we were trying to work out how the Dixons were related to us, simply put our Great Grandfather and Yasmin's and Reuben's Great Grandmother were brother and sister. Pretty distant in one respect, but they are one of the closest relative's we have on Daddy's side of the family.<\/p><p>We needn't have worried about the weather, it was nice and sunny which allowed us to go in the long back garden which was great for the kiddies. There were plenty of things to play with. David stoked up the BBQ and we had a nice cup of tea. It was treat time as David had been down the butchers to select our feast!!<\/p><p>The children played very nicely with one another. The dressing up box got raided, thankfully Ben stayed away from this, he favoured playing with the train track. We were treated to some dancing from our Pop Princess'.<\/p><img src='images\/years\/2011\/2011_06_11-04-DixonsApsley.jpg' class='diaryImage' alt='Pop Princess'' \/><p class='diaryImageCaption'>Pop Princess'<\/p><p>We headed out to the 70's playground just over the railway bridge and of course played crocodiles, a game introduced to younf Yasmin. After the adults all ate us we went 'Super High' on the swings and happily pushed people down the big mound. The weather closed in so we quickly scootered back for another cuppa before setting our sights on home.<\/p><img src='images\/years\/2011\/2011_06_11-15-DixonsApsley.jpg' class='diaryImage' alt='Slide Away' \/><p class='diaryImageCaption'>Slide Away<\/p><img src='images\/years\/2011\/2011_06_11-17-DixonsApsley.jpg' class='diaryImage' alt='Reuben flying high' \/><p class='diaryImageCaption'>Reuben flying high<\/p><img src='images\/years\/2011\/2011_06_11-20-DixonsApsley.jpg' class='diaryImage' alt='Reuben flying high' \/><p class='diaryImageCaption'>Reuben flying high<\/p><p>A lovely day out with the Dixons had by all. The return leg to be held later in the summer.<\/p>","images":false},"title":{"value":"Over to the Dixons"},"version":1},{"date":{"d":5,"m":6,"y":2011},"datev":20110605,"images":3,"info":{"content":"<p>They were all awoken early on Sunday morning by a load of French tourists. They were not best pleased. Martin Cherry also had to contend with the wildlife noises in his room known as Uncle Peter and Pop Pop. Daddy and Auntie Ellie were not going to get back to sleep again so Daddy suggested that they should go for a run, not thinking that Ellie would reply positively. Anyway the 5km jog saw them go back into Minstead and return up all the hills. It nearly killed poor Daddy.<\/p><p>They met up and went into the adjoining Little Chef for breakfast. They were all surprised at the menu changes. Less cooked breakfasts, more options. Daddy had tea cakes! They then set off towards Burley for the start point of our off road adventure. The weather was just about holding out, a lot cooler and there were a few spots in the air, not enough to put us off though. Susan, the only sensible one, decided to stay in Burley and have a mooch about.<\/p><img src='images\/years\/2011\/2011_06_05-03-NewForestBikeRideBurley.jpg' class='diaryImage' alt='Uncle Michael's wheely good' \/><p class='diaryImageCaption'>Uncle Michael's wheely good<\/p><p>They headed north into the woods of the New Forest. Daddy loved going down the hills super fast and pulling skids so everyone else had to go through the dust created! Uncle Howard was getting rather tired of all the up hills. They eventually ended up at the top of a big hill at Bolderwood. They passed some really scenic woodland and the ride down Ornamental drive was fantastic. They stopped off to see a youngling New Forest pony sprint around in circles, no other horses seemed to batter an eyelid and join in.<\/p><img src='images\/years\/2011\/2011_06_05-20-NewForestBikeRideBurley.jpg' class='diaryImage' alt='The biking crew' \/><p class='diaryImageCaption'>The biking crew<\/p><p>They cruised back into Burley, stopped off at the pub in the middle of the village for a spot of lunch before parting our ways and returning home. Everyone enjoyed themselves, some foolish enough to suggest they should do it again next year.<\/p><img src='images\/years\/2011\/2011_06_05-00-NewForestBikeRideBurley.jpg' class='diaryImage' alt='Today's route' \/><p class='diaryImageCaption'>Today's route<\/p><p>Thanks to everyone for a great weekend, especially Pop Pop for driving and the Elders for organising the route and letting me stay in their room.<\/p><p>Whilst Daddy was off cruising about, we awoke to a mad house, with Ma Ma, Joey and Lily in attendance. They returned back home in the morning, whilst us lot went to Joshua's christening. Mummy is Godmother to cutie Joshua. We were back in the same church as Evie's christening on Elvetham Heath. At the reception afterwards we played nicely with Evie.<\/p>","images":false},"title":{"value":"Joshua's Christening, New Forest Bike Ride - Burley Circular"},"version":1},{"date":{"d":4,"m":6,"y":2011},"datev":20110604,"images":5,"info":{"content":"<p>Last night Summer came over to stay the night. Katie and Ben played so well with Summer. Out of all her friends, Summer has a great imagination and brings out the best in the kiddies, pretend this and pretend that. Fantastico.<\/p><p>In the morning Daddy left early for a bike ride with the Weston's \/ Elder's crew. There were 8 of them in total partaking in a two day cycling bonanza! There was to be some serious, hard riding.<\/p><p>They reached Stockley car park, pumped up our tyres ready for the off, Daddy waiting like a coiled spring, but Uncle Peter had a problem. The valve had snapped on his wheel! After a replacement inner tube they headed west along the road to Brokenhurst.<\/p><p>They stopped periodically so they all bunched up again and took on refreshments. Uncle Peter went one step further and retrieve a can of beer from his water bottle holder! Uncle Michael would then spend half an hour tippy tapping on his computer to find out they need to turn left at the next junction.<\/p><img src='images\/years\/2011\/2011_06_04-10-NewForestBikeRideBucklersHard.jpg' class='diaryImage' alt='Pete takes on performance enhancing fluids' \/><p class='diaryImageCaption'>Pete takes on performance enhancing fluids<\/p><p>To brighten everyones day, Daddy played some nice little innocent tricks, by rubbing his tyres against Uncle Michael's. How they all laughed and Uncle Michael took it in good humour. Well that's what Daddy thought. Five minutes later, naughty Uncle Michael soaked Daddy with his water bottle, then later in the middle of a busy Lymington quayside, pulled Daddy's shorts down. Some uncles take things too far! Auntie Ellie reckons Daddy had lots of holes in his pants and vows to get him some for his birthday! Still it's better than a pebble dashed shower curtain.<\/p><img src='images\/years\/2011\/2011_06_04-08-NewForestBikeRideBucklersHard.jpg' class='diaryImage' alt='What a load of pony, riding up another hill' \/><p class='diaryImageCaption'>What a load of pony, riding up another hill<\/p><p>At the quaint town of Lymington they also stopped for a small bite to eat and bask in the sunshine. Uncle Peter had a sleep. They continued east, past a 'Costa' which almost gave Pop Pop the shakes, and into the wilderness. It was nice to ride along roads which did not have much traffic on.<\/p><img src='images\/years\/2011\/2011_06_04-47-NewForestBikeRideBucklersHard.jpg' class='diaryImage' alt='Sitting down at Lymington before someone pulls my shorts down' \/><p class='diaryImageCaption'>Sitting down at Lymington before someone pulls my shorts down<\/p><p>They headed to Bucklers Hard. With five miles to go, both Daddy and Auntie Ellie decided to try and complete this in the quickest time they could. Auntie Ellie was in training for a triathlon in a months time. Anyway it was tiring, but Daddy completed it in a touch over 20 minutes. Ellie did well and peddled in a couple of minute later. They were exhausted but found the energy to find the pub. The Yauchstman overlooked a tributary to the Solent. It was beautiful with old, red brick, worker cottages lining the grass driveway. Everyone piled in behind and took a BBQ lunch, except for Daddy who made his own sandwiches!<\/p><p>Time was pressing, so reluctantly they decided to part ways with Bucklers Hard and shift north along the country roads. For the last mile of the journey back to the carpark, Daddy and Uncle Michael raced. It was a close run affair.<\/p><p>Still mid afternoon, some of us wanted to continue cycling and some were quite happy to flake out and recover on a blanket in the wilderness. Uncle Michael found a couple of Geo-Caches that they could find, so headed off road into the woods. They eventually navigated our way to the first geo-cache in a spooky wood, Auntie Ellie signed her name in the book, then moved off towards Hatchet Pond where they stopped off for an ice cream. They were quite expensive, some costing £10! Unfortunately another chap was also geo-caching so gave the second spot away a bit. Still as they say in the geo-caching game; 'a geo-cache is a geo-cache. Doesn't matter how you get them'. Well that's what I imagine them saying.<\/p><p>They returned back to the van, went to the hotel where they freshened up, watched England perform abismally against Switzerland and then had the saga of getting to a pub for the evening's entertainments and food. Some bright spark thought that if the youngsters cycle it would mean one less car driver on the road. They picked a pub just a few miles away only to find it was shut for renovation! They asked a local for the next nearest pub, but was unable to find an interpreter to convert the New Forest accent to Estuary English! Michael tippy tapped again and the computer said the New Forest Inn, Emery Down. They ordered food, decided that Uncle Howard wasn't keen on pear cider, Martin got an insight to his Asian friend and Uncle Peter was defending the vegetarian sausage!<\/p><p>Hometime, and it was pitch black which was a bit of a problem when you don't have lights for your bike and you are travelling down country lanes! Fortunately Uncle Michael tippy tapped again and managed to get the light on his computer to work. Hooray. Auntie Ellie described that 3 mile journey as scarey. Daddy slept in with the Elders.<\/p><img src='images\/years\/2011\/2011_06_04-49-NewForestBikeRideBucklersHard.jpg' class='diaryImage' alt='Knight Rider' \/><p class='diaryImageCaption'>Knight Rider<\/p><img src='images\/years\/2011\/2011_06_04-01-NewForestBikeRideBucklersHard.jpg' class='diaryImage' alt='Today's route' \/><p class='diaryImageCaption'>Today's route<\/p>","images":false},"title":{"value":"Elder Sleep Over - New Forest Bike Ride"},"version":1},{"date":{"d":1,"m":6,"y":2011},"datev":20110601,"images":1,"info":{"content":"<p>During this half term week we had booked ourselves up to the max. Today we went over to Swanley Park on this boiling hot day and met up with Fi, Thomas and Natasha. We had a great time playing the water park bit. Ben managed to scrape his nose, so had a big scab there for a week! Ben had a go on the go-karts, Jessica on the bouncey castle, and Katie had a huge, double 99 ice cream!<\/p><img src='images\/years\/2011\/2011_06_01-02-SwanleyPark.jpg' class='diaryImage' alt='Thomas and Ben' \/><p class='diaryImageCaption'>Thomas and Ben<\/p><p>We stayed at Ma Ma and Pop Pop's for the next 2 nights.<\/p>","images":false},"title":{"value":"Meet with the Burrows, Stay at Ma Ma and Pop Pops"},"version":1},{"date":{"d":30,"m":5,"y":2011},"datev":20110530,"images":4,"info":{"content":"<p>Our first walk as only a four as Ben was enjoying himself over at Ma Ma and Pop Pop's. We went up to Hertfordshire for a countryside walk in a small village called Ayot St. Lawerence.<\/p><p>There was a beautiful pub and even more beautiful poppy field as our opening 100 metres.<\/p><img src='images\/years\/2011\/2011_05_30-01-AyotStLawerence.jpg' class='diaryImage' alt='Poppy field' \/><p class='diaryImageCaption'>Poppy field<\/p><p>We stopped off to have a picnic overseeing some lovely Hertfordshire countryside. We played by the stream halfway through our walk.<\/p><img src='images\/years\/2011\/2011_05_30-09a-AyotStLawerence.jpg' class='diaryImage' alt='Poppy field' \/><p class='diaryImageCaption'>Poppy field<\/p><p>We had to cross a field soon after which had a horse in it. The crew got predictably nervous. Daddy's advice was to stick together, not to run or shout else it might startle the horse. Daddy and Katie headed calmly towards to horse in a straight line. Mummy for some reason headed in an arc direction sort of away from the horse at a fast, nervous pace which quickened when the horse set it's eyes on them and started to walk towards them. Laura then ran, which made the horse run, which inturn made Jessica scream. Real panic set in. The horse slowed to a walk as it got closer to Mummy and Jessica. Daddy and Katie who were behind just calmly walked past the horse to the otherside of the field. The horse did give some heavy snorts as if he was not pleased that we crossed his field.<\/p><p>At the other end of the field there was a stream with a bridge, so we played Pooh sticks. I think we must play Pooh sticks more than anyone else as it is a game we play everytime we cross a stream! Mummy spotted some watercress growing in the middle of the stream and remarked how that was on this weeks shopping list. Daddy smelt a potential saving of some money so rolled up his trouser legs and waded in and picked a healthy bunch!<\/p><p>Nearing the end of our walk we saw the new church.....<\/p><img src='images\/years\/2011\/2011_05_30-30-AyotStLawerence.jpg' class='diaryImage' alt='Poppy field' \/><p class='diaryImageCaption'>Poppy field<\/p><p>.. and the old church!<\/p><img src='images\/years\/2011\/2011_05_30-32-AyotStLawerence.jpg' class='diaryImage' alt='Poppy field' \/><p class='diaryImageCaption'>Poppy field<\/p><p>Account from Auntie Ellie:<\/p><p>First stop of the day was to Toys r Us as Ma Ma said we could pick a toy. We scoured the whole Toys R Us - amazing fun - we could have stayed all day. Finally we both decided on some Star Wars Lego. We popped into Asda to get a picnic then set off to Rainham Marshes for the day. We had great fun. Naturally first thing we did was have a coffee and a muffin - just juice for Joey and I. Then we went into the marshes which according to Mummy is 'totally free and you won't spend a penny', however cost Pop Pop £12.50. Joey and I played for ages in the adventure playground with our lego men. After our picnic I very very very relunctantly with a  big scowl on my face went pond dipping. It was actually quite fun in the end and we caught lots of tiny fishes and weird bugs.<\/p><p>At about 4 we headed home to play in the garden. Pop Pops and Auntie Ellie went for a bike ride but we just wanted to play. We had yummy burgers for tea and then went to bed. We had a lovely time and so did Auntie Ellie.<\/p>","images":false},"title":{"value":"Walk 17: George Bernard Shaw - Ayot. St Lawerence, Ben to Rainham Marshes"},"version":1},{"date":{"d":29,"m":5,"y":2011},"datev":20110529,"info":{"content":"<p>Daddy went with Farfar to the golf over at Wentworth. Now all the top players seem to be European, it was good to see what felt like a top golf event.<\/p><p>They decided to try a different set of holes this year, well to start with anyway. They walked the driving range, the first tee where they saw the likes of Colin Montgomerie tee off, and followed some of the midfield up to the 3rd hole.<\/p><p>The scoring was not fantastic, probably due to the gusty conditions. Rory McIlroy had a big following, the Fisher - Yang partnership were so slow. We couldn't understand why so much time had to be taken between shots, we were both getting a bit impatient.<\/p><p>We decided to follow the Dane Anders Anderson who wasn't playing particularly well. He partnered a Scotsman called Whiteford. We were amazed to see him smoking as he walked down the fairway. Cheeky. On our way round we were stopped by someone who Farfar knew from football of course. He's been coming to watch for years for free by walking over some woods onto the course. Music to Daddy's ears. We'll have to try that one in a future year.<\/p><p>They ended on the popular 14th hole, seeing Anders par another hole. Both getting a bit tired (poor them), they decided to head back home. A nice day at the golf finalizing a good few weeks of top sport for Daddy.<\/p><p>In the evening Auntie Ellie took Joey and Ben over to Ma Ma and Pop Pops for a sleepover. Ben insisted on watching the rugby highlights from the day before and was reported to be a bit of a know it all at a quiz that they played! Is he turning into a bit of a big head? He stayed the night.<\/p><p>Account from Auntie Ellie:<\/p><p>I met Auntie Ellie at the Farnham roundabout and travelled to Ma Ma's in her car with Joey. We listened to Horrid Henry all the way as Auntie Ellie does not like to talk when on the motorway! When we got to Ma Ma and Pop Pops it was about 7 so we played some games with Ma Ma and watched a bit of Garfield but I didn't like it. At about 8, Auntie Ellie supposedly went home so we all said our goodbyes. Just before bed, Ma Ma read some Where's Wally with us - big mistake: when Pop Pops lifted Joey in the night for a wee poor Joey got upset and said he was having nightmares about Wheres Wally. Ma Ma did some of her special Ma Ma magic and managed to make Auntie Ellie appear from upstairs. Joey was very happy and snuggled up with his Mummy. The next day it was decided Auntie Ellie could join Joey and Me on our boys trip to the Grandparents.<\/p>","images":false},"title":{"value":"PGA European Golf Championships, Ben over to Ma Ma and Pop Pops"},"version":1},{"date":{"d":28,"m":5,"y":2011},"datev":20110528,"images":1,"info":{"content":"<p>Last night we had Natasha Kelly stay over for a sleepover.<\/p><p>In the morning we had to drop the motorbike off for its MOT, this was followed by Mummy helping out at Cross Farm School and the rest of us going to Farfars to play with his new train set.<\/p><p>Daddy managed to get some free tickets for the Rugby Premiership final at Twickenham. So Daddy and Ben trooped off and parked up in Whitton and walked with the rest of the crowds to the stadium. I don't know what Ben was expecting. He'd been to Reading 18 months ago, but he was alot older and could appreciate the event a little more, plus there were over 80,000 people in attendance.<\/p><p>We arrived and there were tents with freebies and rugby related activities. We even managed to get on the TV in the background whilst Martin Johnson was being interviewed on ESPN.<\/p><p>We showed our tickets and headed for a pitchside photo. Ben was getting quite excited to see how big the stadium was on the inside.<\/p><img src='images\/years\/2011\/2011_05_28-06-RugbyPremiershipFinal.jpg' class='diaryImage' alt='Twickers' \/><p class='diaryImageCaption'>Twickers<\/p><p>We then climbed to the top of the North Stand up by the roof and looked over Twickenham. We loved the views.<\/p><p>To the game, we sat next to Daddy's boss and his wife who were rugby fans. They were rooting for Leicester Tigers, we went for Saracens. Ben was getting into it, especially the scoring. He cottoned onto the points awarded for tries, conversions and penalties. He got off his seat and cheered when Saracens did well, and we put the thumbs down when they did not.<\/p><p>The game ended on a fantastic ruck and maul climax. Saracens fotunately held out and won the game. We left soon after the final whistle and marched back to the car. Ben was asking loads of questions and commenting on the game. He loved it and even at one point said he prefered rugby to football!<\/p><p>All the girls stayed at home, Katie deciding that she wanted to swap bedrooms with Jessica. So now Katie sleeps on her own in the front bedroom, leaving Ben on the top bunk and Jessica on the bottom bunk in the back bedroom.<\/p><p>In the evening Daddy rushed off to Reading to watch a disappointing Champions League final with Steve and Phil.<\/p>","images":false},"title":{"value":"Rugby Premiership Final"},"version":1},{"date":{"d":22,"m":5,"y":2011},"datev":20110522,"images":2,"info":{"content":"<p>Daddy worked in the morning and the rest of us went off to church. We helped ring the bells which was good fun. Mummy was on sidesmans duty.<\/p><p>After Sunday lunch we went off to the other side of Oxford to a little place called Wolvercote which was on the Thames. This was the Alice In Wonderland walk as some of the story was based on the setting here.<\/p><img src='images\/years\/2011\/2011_05_22-37-WolvercoteWalk.jpg' class='diaryImage' alt='Walkers' \/><p class='diaryImageCaption'>Walkers<\/p><p>We started the 3.5 mile walk and headed south along the east side of the river. It was open meadow land. Katie and Ben were playing 'reindeers'. We saw a number of geese and duck families with their very young. A mile and a half down the river we crossed a bridge where we saw some teenage girls jumping into the cold river. They were mad.<\/p><p>Our return leg saw Daddy get a bit of a hypo. This time he felt pins and needles all over both legs. Still he was alright to make a fool of himself on an old, dead tree trunk which went in to the river. We wished for him to lose his balance and fall... well all except from Katie who of course was very concerned. Alas he managed to keep his balance.<\/p><img src='images\/years\/2011\/2011_05_22-77-WolvercoteWalk.jpg' class='diaryImage' alt='We all begging that he'd fall in' \/><p class='diaryImageCaption'>We all begging that he'd fall in<\/p><p>We finally made it back to the car, and made our return journey home.<\/p>","images":false},"title":{"value":"Walk 16: Alice In Wonderland Walk"},"version":1},{"date":{"d":21,"m":5,"y":2011},"datev":20110521,"images":1,"info":{"content":"<p>We headed for the curch fair, mid morning. We were running the tombola and as a group managed to raise over a thousand pounds. The main objective for us children was to spend our modest allocated money. Jessica spent it on some second hand toys. Ben bought himself, Daddy and Farfar steam train books, whilst Katie bought both Mummy and Daddy a present ready for their birthday's. We've got lovely generous children.<\/p><img src='images\/years\/2011\/2011_05_21-02-ChurchFair.jpg' class='diaryImage' alt='Jessica face painted and roaring to go' \/><p class='diaryImageCaption'>Jessica face painted and roaring to go<\/p><p>In the afternoon we went off to Uncle Peter's who was hosting a BBQ as a substitute to Peter and Norma's cancelled wedding aniversary party. Todd and Olly made it over and joined the Weston's, Matt's family, the Elders, Jude and Charlotte. We had a great time. Ben made ice cream from his new ice cream maker. We also all played football in the field behind Peter's house. A mention to Joey who was an expert at Hula Hooping!<\/p>","images":false},"title":{"value":"Church Fair, Peter's BBQ"},"version":1},{"date":{"d":14,"m":5,"y":2011},"datev":20110514,"images":2,"info":{"content":"<p>The Elders stayed the night and Uncle Michael came over in the morning to pick us up. Before they returned to Alton we first went to the Heatherside to the new swing park and had a great time on the swing. After was the annual fete and maypole skip! Ben did not disapoint. He still reckoned he could skip easy. Ermm. Well he can't!<\/p><img src='images\/years\/2011\/2011_05_14-01-Maypole.jpg' class='diaryImage' alt='Maypole Skip' \/><p class='diaryImageCaption'>Maypole Skip<\/p><p>After the skipping Katie went to Frimley Lodge Park for a Brownie day. She was amongst all other Brownies in the Surrey Heath area. Meanwhile Mummy, Ben and Jessica ran the teddy tombola at the fete after the maypole. It was a great success, if a little manic.<\/p><p>Daddy went off with Farfar to Wembley for the FA Cup final. This year they were supporting the underdogs, Stoke City against Manchester City. There was a corking atmosphere, much noisier than last year. Not sure if this is because we turned up a little later, or becaues it was teams who hadn't been to the FA Cup final for 30 years or so.<\/p><p>We had seats in the corner in the Stoke end. The game wasn't up too much really, but enjoyed it more than last year. The game ended with a 1-0 victory to Man City.<\/p><img src='images\/years\/2011\/2011_05_14-09-FACupFinal.jpg' class='diaryImage' alt='Wembley - FA Cup Final' \/><p class='diaryImageCaption'>Wembley - FA Cup Final<\/p><p>In the evening Leah came for a sleepover. We barely see her nowadays since she has moved schools. Fortunately they went to bed the right side of midnight!<\/p>","images":false},"title":{"value":"Maypole Dancing, Brownies Sports Day, FA Cup Final, Leah Sleepover"},"version":1},{"date":{"d":8,"m":5,"y":2011},"datev":20110508,"info":{"content":"<p>Daddy worked in the morning, whilst we went off to church where we also had church parade.<\/p><p>In the afternoon Jessica and mummy went to Mia's birthday party which was brilliant. Lots of games and a BBQ.<\/p><p>Meanwhile the rest of us went over to Watchet's park, layed tennis for a bit, then made up a game in the playground. It was 'crocodiles' where if we were on an aparatus we were safe, otherwise Daddy would dump us outside the play area for about 5 minutes. It got interesting later on when Daddy fired a football at us. Fortunately he was such a bad shot he never hit us! Daddy did have a bit of a hypo which slowed him down a bit. We had a great time.<\/p>","images":false},"title":{"value":"Birthday Party and Park"},"version":1},{"date":{"d":7,"m":5,"y":2011},"datev":20110507,"images":1,"info":{"content":"<p>We had some vouchers for Skate Jam at Tomslinscote so we went there for the first time in a long while. Whilst Katie and Ben rollerskated, Jessica played in the new toddler area. She's got a wicked laugh.<\/p><p>Charolotte turned 25 today and as such invited the Weston's, Elder's, Steve Barnett and family, and the Greathead's to a BBQ at her house in Cheltenham. We got there for 1 o'clock and there was plenty of lovely food. It's the first time we saw the Greathead's. Old friends of Ma Ma and Pop Pop.<\/p><p>Later in the afternoon we got the sprinkler out, stripped off and ran up and down the garden getting completely soaked. It's amazing how such a simple, cheap thing provides so much fun.<\/p><p>Us kids had a whale of a time playing on Luke's wheelchairs. We were wheeling about all over the house and garden.<\/p><img src='images\/years\/2011\/2011_05_07-22-Charlottes25thBirthday.jpg' class='diaryImage' alt='Sprinkles' \/><p class='diaryImageCaption'>Sprinkles<\/p>","images":false},"title":{"value":"Skate Jam, Charlotte's Birthday BBQ"},"version":1},{"date":{"d":2,"m":5,"y":2011},"datev":20110502,"images":4,"info":{"content":"<p>Another walk from the book this time over in Oxfordshire. We were planning on doing this one a few weeks back, but dead bodies were found in a farmers field so we didn't fancy it then.<\/p><p>We trekked over to the Ridgeway, a national trail lasting over 80 miles. We tackled just 5 miles (2.5 miles each way). We were retracing steps relating to George and the Dragon. We parked on top of a hill in the middle of no where and headed east along The Ridgeway. It was nice easy path for the pushchair and the weather was glorious if a little windy.<\/p><p>First landmark was Wayland's Smithy, a burial site from 3000 years ago. There were a couple of small rooms that we could play in. We didn't grasp the historical significance of what 3000 years ago meant really. Anyway we continued eastwards and climbed the path and hit Uffington Castle. Laura was most disapointed that there was nothing to show for the castle other than a ditch surrounding the site. Still the views were amazing on this clear day. It was exceptionally windy up there and we loved running down and climbing up the banks of the ditches. We stopped here for our picnic.<\/p><p>We continued steeply down the hill towards Dragon Hill and past what we think was the White Horse. It wasn't much of one. There were some wierd pagen type people performing some ritual on top of Dragon Hill. They left quickly and again we had nice views of the surrounding area. The kiddies loved it as they could climb, run off, roll, whatever. We had reached the halfway point. The only disapointing thing about this walk was the fact we had to retrace our steps back to the car. We prefer circular walks where we can see different scenery. Anyway Katie and Daddy took a slightly differnt route back and beat the rest of us back to the otherside of the castle.<\/p><p>We also found a secret, wooded pathway which ran parallel to the main track which made the return journey a little more interesting. We wanted to go back into Wayland's Smithy again, this time we played a few games of 'forty forty'. We had a great time.<\/p><p>We eventually got back to the car and drove home exhausted. Another good walk.<\/p><img src='images\/years\/2011\/2011_05_02-03-TheRidgewayWalk.jpg' class='diaryImage' alt='The Gay's' \/><p class='diaryImageCaption'>The Gay's<\/p><img src='images\/years\/2011\/2011_05_02-34-TheRidgewayWalk.jpg' class='diaryImage' alt='Dragon Hill' \/><p class='diaryImageCaption'>Dragon Hill<\/p><img src='images\/years\/2011\/2011_05_02-56-TheRidgewayWalk.jpg' class='diaryImage' alt='Ben lost in a rapeseed field' \/><p class='diaryImageCaption'>Ben lost in a rapeseed field<\/p><img src='images\/years\/2011\/2011_05_02-77-TheRidgewayWalk.jpg' class='diaryImage' alt='Tree Climbers' \/><p class='diaryImageCaption'>Tree Climbers<\/p>","images":false},"title":{"value":"Walk 15: The Ridgeway Walk"},"version":1},{"date":{"d":1,"m":5,"y":2011},"datev":20110501,"images":1,"info":{"content":"<p>Daddy embarked on cooking a Sunday lunch for us and the Fars. He tried the Beef Roast pot, with a lemon surprise pudding. It went ok.<\/p><p>Later in the afternoon finally Katie's new 'friend' came over to play, a relief for us all, as all she has been going on about is for Michael to come and play. They played nicely for 4 hours. A very nice boy.<\/p><img src='images\/years\/2011\/2011_05_01-01-SundayLunch.jpg' class='diaryImage' alt='Beefy Meal' \/><p class='diaryImageCaption'>Beefy Meal<\/p>","images":false},"title":{"value":"Fars over for Sunday lunch"},"version":1},{"date":{"d":30,"m":4,"y":2011},"datev":20110430,"images":3,"info":{"content":"<p>In the morning Katie went horse riding. This week she was back in the sand pit and looked very competent going around the arena and doing a narrow path maneuver.<\/p><p>After her lesson we rushed home for a spot of lunch before heading out again to the Surrey Heath show. Mummy had a 2 hour stint on the playgroup stall selling toys. We brought Grandma down with us and sat and enjoyed the sunshine.<\/p><p>We had a nice time and went on some of the fair rides, decorated some cakes, and played the golf game and trap the rat.<\/p><img src='images\/years\/2011\/2011_04_30-01-SandPitSurreyHeathShow.jpg' class='diaryImage' alt='Katie showing off her horse riding skills' \/><p class='diaryImageCaption'>Katie showing off her horse riding skills<\/p><img src='images\/years\/2011\/2011_04_30-14-SandPitSurreyHeathShow.jpg' class='diaryImage' alt='Jessica loves the fairground rides' \/><p class='diaryImageCaption'>Jessica loves the fairground rides<\/p><img src='images\/years\/2011\/2011_04_30-25-SandPitSurreyHeathShow.jpg' class='diaryImage' alt='Jessica WWII Jeep Driver' \/><p class='diaryImageCaption'>Jessica WWII Jeep Driver<\/p>","images":false},"title":{"value":"Horse Riding, Surrey Heath Show"},"version":1},{"date":{"d":29,"m":4,"y":2011},"datev":20110429,"images":1,"info":{"content":"<p>There was alot of expectation and good will towards the wedding of Kate Middleton and Prince William. We settled down to watch the coverage a little after 8am. Great Grandma came over as well so we could all share it together. Katie was well into the fashion, the dresses and who was who. Ben and Jessica were not interested at all and were climbing all over Mummy, Daddy and the furniture. Not the most relaxing of atmospheres to enjoy the occassion.<\/p><p>Still it all went very well and it put a smile on our faces. We did think for a bit whether we should have gone up to London, but thought better of it, and glad we decided to stay at home.<\/p><p>The wedding finished a little after midday, and our neighbours behind us had kindly organised a mini street party. Bring your own meat and you can stick it on their BBQ's.<\/p><p>It was good to see many people you only said hi to in the mornings. A successful event.<\/p><img src='images\/years\/2011\/2011_04_29-01-KateWilliamStreetParty.jpg' class='diaryImage' alt='Swordsmans Road Street Party' \/><p class='diaryImageCaption'>Swordsmans Road Street Party<\/p><p>Katie and Ben made a couple of friends. The boys who live behind us. Katie was rather smitten by one of the boys, and has since longed for him to come and play. Again since then, she's being putting on make up and turning into a teenager! Daddy does not like this! Is this what the next 15 years are going to be about? When Muumy returned to the house at 6pm, there were 7 children in the house all playing. There was a lot of tidying up to be done.<\/p><p>Whilst Mummy was enjoying the Lebanonese Rose Wine, Daddy went out with his friend Micheal to go Kayaking for the next leg down the Thames. This was going to be the first time with two adults paddling. Were we going to turbo? Well no. In fact they both got back aches sitting at the front, until they finally moved the back rest forwards. Other than that they enjoyed paddling from just east on Penton Lock up to the Sprayground in Staines and back again.<\/p><p>On the way back they had to operate the locks themselves, which was quite ammusing to see them try and work it out. A good two or three hour trip.<\/p>","images":false},"title":{"value":"Royal Wedding: Kate and William. Thames Kayaking: Staines - Laleham"},"version":1},{"date":{"d":28,"m":4,"y":2011},"datev":20110428,"images":1,"info":{"content":"<p>At school there we had to dress as wedding guests. We looked stunning!<\/p><img src='images\/years\/2011\/2011_04_28-08-KateWilliamWedding.jpg' class='diaryImage' alt='Quite the couple' \/><p class='diaryImageCaption'>Quite the couple<\/p>","images":false},"title":{"value":"Royal Wedding Dress Up Day"},"version":1},{"date":{"d":25,"m":4,"y":2011},"datev":20110425,"images":2,"info":{"content":"<p>Another glorious day awaited outside. In the morning we popped into Camberley for a spot of shopping.<\/p><p>It was nice for the five of us to have an afternoon together just ourselves. I think for the past 5 or 6 years we've gone off to a National Trust place to do the Easter Egg trail. This year we continued the tradition and went to The Vyne just outside Basingstoke.<\/p><p>Ben has a tendency to wait to the very last moment before he realises he needs the toilet... and normally when we are out and about we have to find the nearest bush so he can releve himself. Embarrassingly there was urgency at one point and Ben sprinkled the bush right by the first clue. That meant everyone doing the Easter Egg trail would be right by Ben's wee.<\/p><p>Anyway we circled the lake, toured the house and got our face painted.<\/p><img src='images\/years\/2011\/2011_04_25-05-TheVyne.jpg' class='diaryImage' alt='Butterflies at The Vyne' \/><p class='diaryImageCaption'>Butterflies at The Vyne<\/p><img src='images\/years\/2011\/2011_04_25-33-TheVyne.jpg' class='diaryImage' alt='2 Rabbits, 1 chicken' \/><p class='diaryImageCaption'>2 Rabbits, 1 chicken<\/p>","images":false},"title":{"value":"The Vyne"},"version":1},{"date":{"d":24,"m":4,"y":2011},"datev":20110424,"images":2,"info":{"content":"<p>Mummy went to get Jessica and Ben early so we could decorate our eggs which we then didn't eat!<\/p><p>We'd invited the Weston and Elder family for an Easter lunch. A lovely beef meal prepared by Mummy. The weather was glorious which allowed us to eat out in the back garden. The Easter eggs steadily came in.<\/p><img src='images\/years\/2011\/2011_04_24-07-EasterDay.jpg' class='diaryImage' alt='Easter lunch' \/><p class='diaryImageCaption'>Easter lunch<\/p><p>In the afternoon we went over to Uncle Peter's where the rest of the Barnett family were congregating. It was not long before water pistols turned into a paddling pool, which turned into Ben controlling check point Charlie with a hose pipe. Ben revelled in this power. It was not long before Jessica and Katie got involved and eveyone got a smattering of water, including Great Grandma!<\/p><p>On one occassion Auntie Sue thought she'd made it through as Ben was not looking. Pop Pop gave Ben the hint, Ben immediately swooshed around with the hose pipe and splashed his poor victim. In retaliation, Auntie Sue chased Pop Pop around the garden and through a glass of white wine over him. It was very funny.<\/p><img src='images\/years\/2011\/2011_04_24-32-EasterDay.jpg' class='diaryImage' alt='Easter lunch' \/><p class='diaryImageCaption'>Easter lunch<\/p>","images":false},"title":{"value":"Easter Lunch and Peter's in the Afternoon"},"version":1},{"date":{"d":23,"m":4,"y":2011},"datev":20110423,"info":{"content":"<p>Karen, Summer and Katie took a bike ride to the sweet shop in the morning, before handing Katie over to Ma Ma and Pop Pop. In the afternoon they went to Gravesend shopping, then had lunch in the back garden. Pop Pop bet Katie that she wouldn't last out on a long bike ride through some country lanes towards Cobham. Both Ma Ma and Pop Pop were impressed on how Katie managed to complete the 5 mile circuit of course stopping to wait for Ma Ma to get up the hills and a swift refuel at the Leather Bottle public house! In the evening they all watched Fantastic Mr Fox.<\/p><p>Daddy went to watch Cove V Chertsey in an important league game. Chertsey needed to win to have any hope of becoming champions. They drew in a disapointing game.<\/p><p>Mummy, Ben and Jessica went to the new swing park at Heatherside. We were quite impressed although a little sad to see the old one go.<\/p><p>In the evening Mummy and Daddy had a rare evening out together over at the West's for a BBQ. Ben and Jessica went to the Fars to stay the night. Unfortunately they both wet the bed.... Ben and Jess that is!<\/p>","images":false},"title":{"value":"Katie at Ma Ma's, Daddy watch Chertsey, Heatherside Swings, West BBQ, Ben and Jess and the Fars"},"version":1},{"date":{"d":22,"m":4,"y":2011},"datev":20110422,"info":{"content":"<p>Good Friday and Mummy, Katie and Ben went to church for the Easter workshop where we made various crafty bits and pieces, including an Easter card, some buscuits, hot cross buns, some egg nest thing, and an easter bunny mask.<\/p><p>Meanwhile Daddy and Jessica Kayaked up the Basingstoke Canal from Mytchett to Ash Vale and back again. We saw Duncan jogging which was a nice surprise. Jessica even had a go at paddling. The weather was glorious.<\/p><p>After lunch, We left Daddy at home whilst the rest of us went to meet up with Karen, Summer and Alice at Horton Country park. It was quite a stressful trip with a long walk in the hot weather as well as a broken down car to sort out.<\/p><p>Katie went back with Summer to stay the night. They played and played and Katie did not go to bed until 4:10am!!<\/p>","images":false},"title":{"value":"Easter Workshop, Kayaking, Horton Country Park, Katie Sleepover"},"version":1},{"date":{"d":21,"m":4,"y":2011},"datev":20110421,"info":{"content":"<p>Written by Ma Ma<\/p><p>Ma Ma and Great Grandma arrived at The Gay's house at about 10.00am and had a nice cup of coffee before setting off on our long journey. Ma Ma had a SAT Nav so we typed in the postcode and set off. Katie and Jess were travelling in Mama 's car and Ben in Laura's. The weather was scorching and we very quickly had the windows wide open. Mama's only clue to the day was that the place we were going to was in Essex. Unfortunately the two cars soon got parted and when the SAT NAV told Mama to turn off at the Swanley Junction she didn't dare for fear that Laura would not know what to do once she reached the Dartford Tunnel! Katie and Jess were fantastic and did not whinge or whine once - even though it was hot and boring in the traffic jam. In fact Jessie slept nearly all the way with her little head tipping upwards. Anyway eventually the two cars met again and after a short discussion it was decided that they would find the first available place for a picnic. Apparantently they should have been heading for the Ada Cole Hourse Sanctuary. A few hundred yards up the road they came to Rainham Marshes. What an amazing place. After a luscious picnic prepared by the most wonderful girl in the world (except for Ellie and Charlotte should they be reading this) we decided to go pond dipping. Unfortunately it was rather a long walk and poor Grandma's legs got a bit achey, but it was worth it. Ben even caught a fish it his net!<\/p><p>After a play on the super swings and an ice cream we set off for home. Lucky old Mama was nearly there but the rest set off for Surrey tired but happy and Ma Ma would like to say a huge THANK YOU to her darling family who make life so wonderful for her!<\/p>","images":false},"title":{"value":"Rainham Marshes"},"version":1},{"date":{"d":17,"m":4,"y":2011},"datev":20110417,"images":1,"info":{"content":"<p>We left mid morning to go up to London again, parking at Clapham South and tubing and DLR'ing it up to Canary Wharf. There were massive crowds again and we got there early enough such that we got a front row position and watched the men's leaders go by. They ran at a high pace. I think quicker than mummy and daddy could sprint! As we were watching the leaders go by, there were not many fancy dressers, which was the bit we were interested in. However, there was so much admiration for the runners who went past, and the support was phenominal.<\/p><p>We stayed at Canary Wharf for an hour or so, the 20 mile marker, before moving on south to Crossharbour where we had a bit more space and watched some of the fancy dressers and backmarkers. By now half the participants were walking and half slow jogging. We saw rhinos, Elvises, a rubiks cube, a policeman, superheros, children's cartoon characters and our favourite a london bus!<\/p><p>We were on the look out for Katie's headmaster, Mr Peace, and Steve Laidlaw. However, unfortunately we did not see either.<\/p><img src='images\/years\/2011\/2011_04_17-11-LondonMarathon.jpg' class='diaryImage' alt='Canary runners' \/><p class='diaryImageCaption'>Canary runners<\/p>","images":false},"title":{"value":"London Marathon"},"version":1},{"date":{"d":16,"m":4,"y":2011},"datev":20110416,"images":2,"info":{"content":"<p>We all went off to watch Katie do her 3rd lesson today. All three of us helped groom Bess at the start. Katie was trusted to not be led, this may have been a mistake as the horse wouldn't do what Katie wanted and naughty Bess cantered off down the track and felled poor Katie. Thankfully Katie was not hurt and still wants to carry on.<\/p><img src='images\/years\/2011\/2011_04_16-02-HorseKayak.jpg' class='diaryImage' alt='Bess Being Groomed' \/><p class='diaryImageCaption'>Bess Being Groomed<\/p><p>In the afternoon we went off to Datchet to drop Daddy off who Kayaked down to the Sprayground, 4 miles away. He really needs to sort out some back support. It was nice to see all the posh houses backing on to the Thames. Meanwhile the rest of drove to the Sprayground and played. Ben managed to tred in the hugest dogs muck ever with just his sandals on!<\/p><img src='images\/years\/2011\/2011_04_16-07-HorseKayak.jpg' class='diaryImage' alt='Ben sunbathing on the Gay cruise liner' \/><p class='diaryImageCaption'>Ben sunbathing on the Gay cruise liner<\/p>","images":false},"title":{"value":"Horse Riding, Thames Kayaking"},"version":1},{"date":{"d":15,"m":4,"y":2011},"datev":20110415,"info":{"content":"<p>We started the day packing for home. Before leaving we had another cheeky hours worth in the swimming pool and adventure playground. Our long journey home was split up with a stop in a housing estate in Peterborough where there was a nice swing park. We stopped there for lunch also. We eventually made it home via the Friday rushhour (the M1 was shut). Luckily mummy had ordered the shopping online before we left. For once we can say good thinking mummy.<\/p><p>Overall we had a lovely time. The children really enjoyed themselves and it was nice to go somewhere differnt.<\/p>","images":false},"title":{"value":"Lincolnshire Holiday: Homeward Bound"},"version":1},{"date":{"d":14,"m":4,"y":2011},"datev":20110414,"images":2,"info":{"content":"<p>In the morning Daddy took all three of us swimming in a packed pool. We played a good game of sharks where Daddy was only allowed to catch us on the knee and had to drag us half way down the pool. He never managed it!<\/p><p>Mummy overruled Daddy on the destination of today. Today we headed off to Tattershall Castle. We went the scenic route through the Licolnshire contryside. We passed just one car in 30 minutes of driving. We eventually got there only to find it shut. If only we kept to the original itinary which had checked this out. We stayed in the grounds for a spot of lunch. Mummy had a nice pear!<\/p><img src='images\/years\/2011\/2011_04_14-08-LincolnshireHoliday-TatershallBollingwoodCastleSkegness.jpg' class='diaryImage' alt='Tatershall Castle' \/><p class='diaryImageCaption'>Tatershall Castle<\/p><p>We then headed east to Bolingwood castle, a former royal castle, however, now ruined we played a few games of 40\/40. We had a great laugh.<\/p><img src='images\/years\/2011\/2011_04_14-22-LincolnshireHoliday-TatershallBollingwoodCastleSkegness.jpg' class='diaryImage' alt='Katie Horsing Around' \/><p class='diaryImageCaption'>Katie Horsing Around<\/p><p>Whilst we were up here we had to go and see the ol' so embrassing Skegness. Our thoughts of another seaside town that was tacky, rundown and had seen better days. We were pleasantly surprised, as it was pretty popular, the town looked pretty respectable, the fairground bit had been given a fresh lick of paint and had some decent rides and it was quite tacky. Great Grandma had given each of us £3.30 spending money. Jessica spent it in the arcade on sit on rides and sweets, Ben bought a Bow and Arrow set, then asked 30 minutes later if we had the receipt to take it back, and Katie spent it on sweets and the arcades as well. There was a nice park next to the seafront which we went in, before returning back to the car via the pier and swings. Plenty for us to see there.<\/p><p>We hurried home and Daddy stoked up the BBQ before going over for the evening entertainments, Another show, a fancydress competition and a science show. Ben's dancing in the intervening breaks was something to witness. Had Mummy and Daddy in stitches. That boy!<\/p>","images":false},"title":{"value":"Lincolnshire Holiday: Castles and Skeggy"},"version":1},{"date":{"d":13,"m":4,"y":2011},"datev":20110413,"images":2,"info":{"content":"<p>We returned to Cleethorpes in search of an open theme park. We got there before the gates opened so there was a bit of a queue. Although it was sunny, and we even managed to catch the sun, the North Sea winds were cutting through the 10 degrees temperature. Entrance price of £66 was reasonably good value. It is hard to describe the position which Pleasure Island stands in the ladder of theme parks. It is not quite as well established as the southern efforts or Drayton Manor, however it had a lot more to offer than Paulton's Park or Alice In Wonderland. More importantly it had something to offer all of us, more than expected for Jessica. Not sure if it was because it was the first day of opening for the year or because of the cool temperature, but there weren't lots of people inside the park. We didn't have to queue more than 15 minutes for any of the rides. Jessica enjoyed the catapillar rollercoaster and big slide the best, Katie the Gravitron and Ben everything that was fast and G-Force intensive! We spent the whole day on rides. Daddy now feeling old as his yurning for thrill rides has been overtaken by the effects on his stomach! We had a really great family day, many of the rides we could all do together. There were rides which the bigger parks wouldn't be able to cope with due to the number of  people. e.g. Both Katie and Ben went on the water walkers. Brilliant. We stopped when the gates closed at 5pm. We returned back to the camp and went off to watch a Cinderella pantomime in the ballroom. Another full day.<\/p><img src='images\/years\/2011\/2011_04_13-31-LincolnshireHoliday-PleasureIsland.jpg' class='diaryImage' alt='Grit And Determination' \/><p class='diaryImageCaption'>Grit And Determination<\/p><img src='images\/years\/2011\/2011_04_13-48-LincolnshireHoliday-PleasureIsland.jpg' class='diaryImage' alt='Slide Race' \/><p class='diaryImageCaption'>Slide Race<\/p>","images":false},"title":{"value":"Lincolnshire Holiday: Pleasure Island"},"version":1},{"date":{"d":12,"m":4,"y":2011},"datev":20110412,"images":1,"info":{"content":"<p>Mummy decided that we should go Pleasure Island, a theme park 30 miles away up the coast towards Cleethorpes. We arrived to find it shut! After some phaffing around in shops and stuff, Daddy wanted to take the opportunity to go to Grimsby and see tbe fishing markets and docks. However, there was no market to speak of, but went around the dock area which was very interesting. Quite industrial and obviously it had seen better days, with half the units being empty. However what had survived was great. Walking around the back of the units you saw crates of fish heads. There was loads of rubbish. Anyway the other four were fast becoming bored so we had to leave and head back to camp. On the way home we stopped off for lunch in a playground at Grainthorpe.<\/p><p>We went to use the camp facilities in the afternoon. First the softplay, then adventure playground, the swimming pool and the crazy golf, before ending up in the ballroom for the Rory and the Dragon stage production. All the children enjoyed it, and now we feel Jessica is old enough to enjoy a pantomime. We quickly headed back to the static to have pizza (we got the gas cooker working), then Mummy, Katie and Ben returned to the ballroom to see a magic show. This show was slightly different in that they showed how to do the tricks. When we returned home to Daddy we tried some tricks on him. We got everyone wrong! Oh well. Daddy stayed back to listen to the Man Utd vs Chelsea game.<\/p><img src='images\/years\/2011\/2011_04_12-11-LincolnshireHoliday-MabelthorpeBeach.jpg' class='diaryImage' alt='Mablethorpe Beach' \/><p class='diaryImageCaption'>Mablethorpe Beach<\/p>","images":false},"title":{"value":"Lincolnshire Holiday: Pleasure Island Theme Park"},"version":1},{"date":{"d":11,"m":4,"y":2011},"datev":20110411,"images":2,"info":{"content":"<p>It must be experience, but we must have been the most prepared we've ever been on a 4 night stay away. It was all pretty calm on the morning of us leaving. We'd booked a holiday via the newspaper, supposidly being extremely cheap, but really still costing over £100 just in accommodation. Still it managed to win Mummy over and she'd selected Licolnshire as our destination, well known for it's good April climate! We popped over to the Fars to pick up the National Trust cards, then got on the M3 and was welcomed by the Monday morning London bound traffic! It wasn't too bad after a bit and we sailed our way up to Cambridgeshire, where we planned to do another of our walks from 'the book'. On the way we stopped to stretch our legs and have a go on the swing park at Papworth Everard.<\/p><img src='images\/years\/2011\/2011_04_11-06-LincolnshireHoliday-HemingfordWalk.jpg' class='diaryImage' alt='Playing at the swing park' \/><p class='diaryImageCaption'>Playing at the swing park<\/p><p>Our walk started at Hemingford Abbot, and we stopped by the river bank immediately for a picnic. It was all very picturesque and serene, well as much as it can be with us lot. The 3.5 mile walk took around the Great River Oose and some of it's contributies. We walked passed an old water mill, went over some bridges. Ben ran off to play on a tree which was ladened with stinging nettles. Well you know what is going to hapen next.... well a little boy did fall into the nettles but it wasn't Ben! Still we helped collect dock leaves for the boy who was screaming in pain. We then hit a field of cows which we had to walk through. Mummy's hackles were up and any little attempt of humour such as Moo or 'quick the cows are coming', Mummy got in a mood and quickened her step away from the animals. We all laughed at her. We completed the scenic walk, our best for a while.<\/p><img src='images\/years\/2011\/2011_04_11-10-LincolnshireHoliday-HemingfordWalk.jpg' class='diaryImage' alt='Picnicing around' \/><p class='diaryImageCaption'>Picnicing around<\/p><p>We jumped in the car headed north, past Peterborough and Boston. We eventually found our Haven park, Golden Sands, Maplethorpe, got our caravan and settled in. We could not however get the oven to work and we had bought pizzas for tea. In the end it was getting late and the kids wanted to go to the disco so Mummy took them hoping the pizzas would be cooked when we got back. However, they weren't so Daddy and Katie went to get Fish and Chips.<\/p>","images":false},"title":{"value":"Lincolnshire Holiday: Walk 14: Children Of Green Knowe walk, travel to Mablethorpe"},"version":1},{"date":{"d":10,"m":4,"y":2011},"datev":20110410,"images":1,"info":{"content":"<p>No Sunday school this week, Ben was the only dedicated disciple who wanted to join Mummy at church. In the afternoon we went over to the Fars for our previously postponed Sunday lunch. The weather was glorious so we were able to sit out in the back garden and enjoy our delicious roast Lamb. We had bits of a whole Lamb that Farmor bought. It has got to be the best lamb I've ever tasted. Mmmm. We made our customary mess in the back garden and played polo and please Mr. Crocodile.<\/p><p>We returned home in the late afternoon, and prepared for our Licolnshire holiday tomorrow.<\/p><img src='images\/years\/2011\/2011_04_10-09-FarsSundayLunch.jpg' class='diaryImage' alt='Sunday lunch at the fars' \/><p class='diaryImageCaption'>Sunday lunch at the fars<\/p>","images":false},"title":{"value":"Fars Sunday Lunch"},"version":1},{"date":{"d":9,"m":4,"y":2011},"datev":20110409,"images":1,"info":{"content":"<p>On this fine summery day we first cleaned the inside of the car, and boy it was grotty. Loads of crumbs and food in all nooks and crannies.<\/p><p>Daddy took Jessica on the back of his bike and joined Katie who cycled the scenic route to Frimley Green to pick up Daddy and Great Grandmas perscription. We delivered it to Great Grandma had a banana and fixed her hoover, before moving on back home, late!<\/p><p>Ben had a 5 a-side football tournament with his Saturday morning lot, all in aid of one of the committee members who died earlier in the year. He played four games, and is really starting to improve his enjoyment and contribution to the game. I think he likes the team aspect as well as being competitive and physical, more than the skills of the game. After 4 games he picked up his trophy for taking part and he and Daddy joined the rest at Paula's BBQ.<\/p><p>We felt honoured to be invited as the other guests all had known Paula and Simon for 15+ years it seemed. Daddy turned up to see Mummy sloshing the Rose back! Oh no this was only heading one way. The children all played very nicely with each other. Muumy and Daddy could relax! By the end Mummy managed to finish off a bottle of wine and even had room for a bottle of beer. Mummy asleep by 9pm. Kaaabooom.<\/p><img src='images\/years\/2011\/2011_04_09-27-BenFootballTournament.jpg' class='diaryImage' alt='Ben picking up his first football trophy' \/><p class='diaryImageCaption'>Ben picking up his first football trophy<\/p>","images":false},"title":{"value":"Ben's Football Tournament, Paula's BBQ"},"version":1},{"date":{"d":3,"m":4,"y":2011},"datev":20110403,"images":1,"info":{"content":"<p>We woke late and mummy got a cup of tea in bed and at least Ben's present, which was a load of chocolate, which were demolished within about 10 minutes.<\/p><p>Mummy went to church with Ben, whilst Daddy went to wish Farmor a happy mothers day.<\/p><p>In the afternoon we went to Frmiley Lodge Park and met up with the Fars, Ma Ma, Pop Pop, The Elders, Phil and Emma, Grandma and Peter. We played in the playground, went on the steam train, then went around the trim trail before ending up in the cafe grabbing an ice cream!<\/p><img src='images\/years\/2011\/2011_04_04-55-FrimleyLodgePark.jpg' class='diaryImage' alt='Hanging around' \/><p class='diaryImageCaption'>Hanging around<\/p>","images":false},"title":{"value":"Mother's Day - Frimley Lodge Park"},"version":1},{"date":{"d":2,"m":4,"y":2011},"datev":20110402,"images":1,"info":{"content":"<p>Daddy and Ben were first out of the house off to the last Saturday morning football training session. Ben was getting into it and loved it. It's going to switch to Wednesday evenings in May.<\/p><p>Meanwhile the gilrs went off to horse riding. This week Katie had Bess and went straight to the jumps. Little jumps, but jumps none the less. Ma Ma and Pop Pop took Katie and Jessica and went off. Ma Ma and Pop Pop went back to Kent and first bought Katie some jodpers, then went off to Satin's restuarant for some McGrease. They walked off their lunch down at Gravesend Prom, went to the swings then came home and played in the garden. At 4pm both Jessica and Katie went off to ride on Tiki. In the evening they snuggled up to watch the Little Mermaid, Jessica covered her eyes up with a cushoin for most of the performance as she was a little scared.<\/p><img src='images\/years\/2011\/2011_04_02-19-HorseRiding.jpg' class='diaryImage' alt='Horse Jump' \/><p class='diaryImageCaption'>Horse Jump<\/p><p>Mummy lost a game of Temptation so had to come on the Kayak trip with Daddy and Ben. We set off from Datchet and paddled upstream. When I say paddled, there was one paddler and two non paying passengers. One paddler, one non paying passenger, and Captain Herr Flick! After an hour or so we reached a lock which was quite exciting. We eventually reached Windsor and stopped off on the Eton side of the river and climbed a tree for half an hour. The return leg was twice as quick. A nice trip.<\/p><p>In the evening we sat down to watch E.T. Well we've never seen someone cry so much through a film as our Benny. Perhaps a little premature to introduce our most sensitive offspring.<\/p>","images":false},"title":{"value":"Football, Horse Riding, Kayaking, Ma Ma's, E.T"},"version":1},{"date":{"d":27,"m":3,"y":2011},"datev":20110327,"images":1,"info":{"content":"<p>Finally Daddy had an opportunity to go on his Kayak. After a lot of phaffing around hooking the kayak onto the car, the rest of us, plus Great Grandma arrived at church in style! Daddy then went onto the Canal centre in Mytchett and cracked a bottle of champaigne for the maiden voyage. Will not quite champaigne. Daddy was glad nobody was around as he struggled and wrestled the boat into the canal. It took just over half an hour to reach the big bridge at Deepcut where he turned around and came back again. He achieved his first voyage without drama and so can take passangers!<\/p><p>Next up after church was yet another birthday party for Jessica to attend. This time it was Isabella's 4th birthday party. She was very cute. The organiser announced the game of Sleeping Lions. Jessica said she was good at this, and immediately went into the coma position. However, all the other children didn't really want to play, so the organiser canceled the game. However, Jessica still lay on the floor. She was rewarded with a sweet for kind of winning the game.<\/p><p>Later in the afternoon, Daddy, Ben and Jessica all went over to Chertsey with the Fars to have a mini bonfire. The land at the back of the club had a lot of cut down brambled bushes and stuff which all needed disposing of. An ideal oppotunity to have a fire. We loved putting the bits of wood onto the fire.<\/p><img src='images\/years\/2011\/2011_03_27-08-Bonfire.jpg' class='diaryImage' alt='Super Hot ' \/><p class='diaryImageCaption'>Super Hot <\/p><p>Ben, since winning man of the match has been really enthusistic about playing football and made such a marked difference in playing the game. He's played against both Mummy and Daddy over the weekend. We played on the pitch with some mini goals. Ben won yet again 20 - 15. He was actually trying his skills and go around Daddy, rather than before where he'd just boot the ball whenever he got close to challenging someone. There is hope yet that he'll be a footballer.<\/p>","images":false},"title":{"value":"Kayaking, Jessica at birthday party, Bonfire"},"version":1},{"date":{"d":26,"m":3,"y":2011},"datev":20110326,"images":2,"info":{"content":"<p>The weather was glorious this morning. Ben was well up for football and played really well. He got stuck in and made some good tackles, always going to ground when making a tackle. He mudded himself up which would please mummy! Anyway he won Man Of The Match which really pleased him.<\/p><p>We then went off for another of our walks this time near Hatfield. The connection with children, well it was where Beatrix Potter spent some of her holidays. We started in the middle of nowhere in Wildhill and walked and walked and walked. We played over a stream. Ben was pronouncing his bravery as he walked the logs over the stream. Jessica even had a go. Mummy and Katie wimped out! Anyway we struggled to the end after about 4 hours.<\/p><img src='images\/years\/2011\/2011_03_26-15-WildhillWalk.jpg' class='diaryImage' alt='Wildhill Walk 1' \/><p class='diaryImageCaption'>Wildhill Walk 1<\/p><img src='images\/years\/2011\/2011_03_26-32-WildhillWalk.jpg' class='diaryImage' alt='Wildhill Walk 2' \/><p class='diaryImageCaption'>Wildhill Walk 2<\/p><p>In the early evening, Ma Ma, Pop Pop, Uncle Peter and Great Grandma came over very briefly before they moved onto a barn dance.<\/p>","images":false},"title":{"value":"Football, Walk 13: Wildhill Walk"},"version":1},{"date":{"d":20,"m":3,"y":2011},"datev":20110320,"info":{"content":"<p>Daddy wasn't feeling too well this morning and so yet again the plans for kayaking had to be put on hold again! The rest of us trooped off to church, picking Great Grandma up on the way.<\/p><p>In the afternoon Jessica had yet another birthday party to go to. This time at the High Cross church in Camberley. It was Jack's 4th birthday. Daddy and Jessica had a great time.<\/p>","images":false},"title":{"value":"Another party for Jessica"},"version":1},{"date":{"d":19,"m":3,"y":2011},"datev":20110319,"images":3,"info":{"content":"<p>Daddy went out with his old friends last night and didn't come home until 1:30am.<\/p><p>We had a busy morning, first up was Ben's football down at the park next to the hospital. Mummy and Jessica played in the playground. Meanwhile Daddy and Katie went over to the Fars house for a quick cup of tea before moving on to Katie's first horse riding lesson over in Pirbright. Kaite had gone to Poppy's horsey birthday party and really enjoyed riding. Ma Ma was very enthusiastic in giving Katie some additional riding experiences and so treated her to a lesson. We met with Poppy at the livery. We were assigned Ash who needed a good grooming. Katie rode off with two elder riders through the woods. Daddy stayed behind. Half an hour later, they returned, Katie trotting away on Ash. Very impressive to be trotting Daddy thought. Katie was a little quiet, but did seem to have enjoyed her morning. We've booked up again for 2 weeks time.<\/p><img src='images\/years\/2011\/2011_03_19-04-ChawtonWalk.jpg' class='diaryImage' alt='Katie mounting Ash' \/><p class='diaryImageCaption'>Katie mounting Ash<\/p><p>Mummy, Ben and Jessica walked home up the big hill and waited for Daddy and Katie to return so we could have lunch all together.<\/p><p>In the afternoon we popped over to Alton to pick Lily up. On our way to Chawton we saw a couple of escaped horses running up and down the main road which gave much ammusement to the children. Goodness knows what happened to them. We finally made it to Chawton where we met up with Auntie Ellie. This was the location for the start of another of our family walks. The Jane Austen walk. The first time we took pasangers, and definately we had the best conditions. No cold, no rain and no mud! Chawton is picturesque and Daddy got plenty of snaps of us. Ben and Lily played together alot and collected stones, and sticks for weapons. We reached Upper Farringdon where we stopped for a spot of food and a play on the swings. It was a lovely sunny day. Katie then decided she had a blister, which meant all change in terms of who went in the pushchair! We finally made it back and had another play on the swings.<\/p><img src='images\/years\/2011\/2011_03_19-11-ChawtonWalk.jpg' class='diaryImage' alt='Katie, Lily and Ben on the Chawton Walk' \/><p class='diaryImageCaption'>Katie, Lily and Ben on the Chawton Walk<\/p><img src='images\/years\/2011\/2011_03_19-48-ChawtonWalk.jpg' class='diaryImage' alt='The four hounds stumped' \/><p class='diaryImageCaption'>The four hounds stumped<\/p><p>We went back to the Elders house played, had dinner then went to bed. The grown ups had a lovely dinner themselves followed by Trivial Pursuit which the girls luckily won!<\/p>","images":false},"title":{"value":"Walk 12: Horse Riding, Chawton Walk, Elders Dinner"},"version":1},{"date":{"d":13,"m":3,"y":2011},"datev":20110313,"images":2,"info":{"content":"<p>We went to church in the morning. After a nice Sunday lunch, the Elders popped across and we went to St. Andrews to commemerate Great Grandad by scattering his ashes. Meanwhile Daddy took Jessica over to Purley for Natasha's 3rd birthday party. We had a great time playing hide and seek and bouncing on the castle. As ever with a Burrows birthday party there were lots of children.<\/p><img src='images\/years\/2011\/2011_03_13-09-Natasha3rdBirthday.jpg' class='diaryImage' alt='Natasha blowing the candles out on her cake' \/><p class='diaryImageCaption'>Natasha blowing the candles out on her cake<\/p><p>After bedtime Mummy and Daddy found Ben in Katie's bed, with Katie's clothes on. Oh dear. He had hairslides, earrings, rings, knickers, sunglasses and skinny jeans on.<\/p><img src='images\/years\/2011\/2011_03_13-01-BenTheGirl.jpg' class='diaryImage' alt='Oh dear Ben' \/><p class='diaryImageCaption'>Oh dear Ben<\/p>","images":false},"title":{"value":"Natasha's 3rd Birthday, Scatter Grandad's Ashes"},"version":1},{"date":{"d":12,"m":3,"y":2011},"datev":20110312,"images":3,"info":{"content":"<p>Ben went to football and Katie, Jessica and Mummy played at the swings and Daddy went for a jog. This week Katie had to do jobs for Bob A Job week at Brownies in aid of Red Nose day. So we decided to go to our friends and families houses in order to do jobs for a pound. We went to Auntie Sue's and Uncle Richard's house where Katie and Ben sorted out pens. After, Mummy went to the Meadows and dressed up in a funny outfit, rattling a collection tin for Marie Curie (cancer charity). She did look funny. The rest of us went to Auntie Susan's and Uncle Graham's house and cleaned their car. Katie was given a £10 note for this job. We played on their PlayStation which had an addon, a bit like XBox Connect, where we could wave in front of the TV which would affect what would happen on screen. We went to collect Mummy and spent our £1 on sweets and a ball.<\/p><img src='images\/years\/2011\/2011_03_12-03-BobAJob.jpg' class='diaryImage' alt='Mummy looking funny' \/><p class='diaryImageCaption'>Mummy looking funny<\/p><p>We then went over to the Sanders and saw new baby Joshua who was asleep when we arrived, but Mummy bulldozed her way in to pick him up straight away. Joshua started to cry! He was such a cutie and we all loved a cuddle. We cleared out  a couple of kitchen cupboards for Auntie Karen to earn our Red Nose money. We played for a little bit, then woke Evie up so Jessica was happy to gain her playmate. We took some family pictures and left the Sanders who had been unindated with visitors for 3 days.<\/p><img src='images\/years\/2011\/2011_03_12-11-BobAJob.jpg' class='diaryImage' alt='The all new Sanders Crew' \/><p class='diaryImageCaption'>The all new Sanders Crew<\/p><p>We then made our final trip over to Farmors where she had a spot of gardening for us to do. I think it is the first time ever that mummy did some gardening! In the evening as we couldn't find a baby sitter, so Mummy and Katie went out to the church quiz, whilst the boys stayed up late and watched the TV.<\/p><img src='images\/years\/2011\/2011_03_12-00-BobAJob.jpg' class='diaryImage' alt='All Katie's Bob A Jobs' \/><p class='diaryImageCaption'>All Katie's Bob A Jobs<\/p>","images":false},"title":{"value":"Bob A Job"},"version":1},{"date":{"d":6,"m":3,"y":2011},"datev":20110306,"info":{"content":"<p>Because Daddy was kind of on call for work we thought it better to stick around the house today. Just he and Katie stayed at home in the morning doing jobs and homework, whilst the rest of us went to church.<\/p><p>In the afternoon we played on a maths website recommended to us by Ben's school and went outside to play on our bikes and have a go on the swing. The weather was still bitterly cold so we didn't last too long.<\/p>","images":false},"title":{"value":"At Home Day"},"version":1},{"date":{"d":5,"m":3,"y":2011},"datev":20110305,"info":{"content":"<p>Daddy has had a pretty stressful week at work where some of the product was not working as it should, so had spent a couple of days at Victoria station. Everything was working fine when he'd left on Thursday night. Come Friday at 2pm, it was not working again, therefore Daddy had to go back up today as 4 months worth of work was going to be let off to the users on Monday morning for the first time. Anyway Daddy got it working in an area that he was not responsible for. Daddy also went over to see Barrie who was having a spot of bother.<\/p><p>Meanwhile after dropping Daddy off at the station, we went off to Ben's football. We lasted just 5 minutes, before everyone moaned at the bitter conditions. It was -1 degrees. Therefore we returned home and played.<\/p><p>In the afternoon we dropped Katie off at McDonalds in Camberley as it was Nina's party. We then went to watch Gnomeo and Julliet at the cinema.<\/p><p>We had some surprise visitors later in the afternoon: Ma Ma, Pop Pop, Uncle Peter and Grandma as well as Farfar came around for a cup of tea and a piece of cake.<\/p><p>We picked Daddy up from the station and snuggled down in the evening and we all watched Carrie's War, which Katie had recommended from her school work.<\/p>","images":false},"title":{"value":"Daddy To Work, Katie at party"},"version":1},{"date":{"d":27,"m":2,"y":2011},"datev":20110227,"info":{"content":"<p>We skipped church today and went off to Dartford for Alice's 4th birthday party held at the same place as last year. In the afternoon we went around to Grandma's to meet and greet Ma Ma and Pop Pop from their trip to Oregon.<\/p>","images":false},"title":{"value":"Alice's Party, Weston's back from Oregon"},"version":1},{"date":{"d":26,"m":2,"y":2011},"datev":20110226,"info":{"content":"<p>Katie and Summer said they didn't go to sleep until gone 1am last night. In the morning Daddy took Ben to a real muddy football practice. Farmor popped by and watched for 15 minutes or so.<\/p><p>The Teale's came over to pick up Summer who was a really good girl. A pleasure to have over. She played so nicely with Katie. Anyway the Elder clan also came over so we had a bumper lunch. After lunch Mummy and Jessica went over to Henry's birthday party at Heatherside community centre. We saw Lorraine there so it was nice to catch up.<\/p><p>Meanwhile the rest of us went to visit Great Grandma briefly then we went along with the Elders to Manor Park, Aldershot where we tried out a new skate park. Well new to us. There were plenty of roughians there which Daddy had to be wary of as one of the kids borrowed Ben's bike. We could also hear the crowd at the football club which was quite something for us to hear. Ben was very proud of the fact he was the only one stupid or brave enough to go down the ramp on his scooter.<\/p>","images":false},"title":{"value":"Football, Teale's, Elder's, Henry's Birthday Party"},"version":1},{"date":{"d":24,"m":2,"y":2011},"datev":20110224,"images":3,"info":{"content":"<p>We picked Katie up from a sleepover at Natashas's and headed off to Great Missenden for another of our walks, the Roald Dahl walk. First we headed into town and went to the Roald Dahl Museum, which seemed quite popular. We've read quite a few of his books and thought it would be fun to go in. There was stuff to do with the kiddies, dressing up as the characters, making stories up from fridge magnets, listening \/ acting out the stories and various other crafty stuff. It kept us going for an hour and a half.<\/p><img src='images\/years\/2011\/2011_02_24-02-Missenden.jpg' class='diaryImage' alt='Danny Champion Of The World petrol station in Gt. Missenden High Street' \/><p class='diaryImageCaption'>Danny Champion Of The World petrol station in Gt. Missenden High Street<\/p><p>The swings was the next stop along with some picnic activities. I swear Ben is the clumsiest boy that ever lived. His brain and body are not connected as one. He splilt half a pack of crisps just by walking along. Not sure how he done that. Anyway we headed next to the church and visited Roald's grave before moving onto Little Missenden to start our 4 mile trek! It was a mud fest. Ben slipped over in the mud at least 10 times, and Katie got stuck in a big puddle and then fell in it!... and didn't we know about it! The walk was pleasant enough, taking in Fantastic Mr Foxes farm. Mud and puddles were a bit of a problem. At first all very jovielle up until the point Katie got stuck in a muddy puddle, try to heave herself out and ended up getting a little wet. Anyone would have thought she was drowning. Mummy rushing over to save her! Goodness me what a performance. 'I want to go home' and all that. After a calming down period of apprximately 15 minutes, we continued through farmers fields, muddy paths and kissing gates. Someone always gets the bum deal and has to kiss Daddy, who gives out licks rather than kisses! Urrgghhh.<\/p><p>We saw some Red Kites, all large birds now are Red Kites because we can't tell the difference between them all. We saw a phesant in the middle of the path, which scurried off when we got near to him and the usual sheep, cows and horses.<\/p><img src='images\/years\/2011\/2011_02_24-30-Missenden.jpg' class='diaryImage' alt='Danny Champion Of The World petrol station in Gt. Missenden High Street' \/><p class='diaryImageCaption'>Danny Champion Of The World petrol station in Gt. Missenden High Street<\/p><img src='images\/years\/2011\/2011_02_24-65-Missenden.jpg' class='diaryImage' alt='Danny Champion Of The World petrol station in Gt. Missenden High Street' \/><p class='diaryImageCaption'>Danny Champion Of The World petrol station in Gt. Missenden High Street<\/p><p>Four miles was more than enough and after 3 or 4 hours we finally made it back to the car where we had to de-gown our muddy apparel.<\/p><p>We went straight over to the Fars where we spent the night.<\/p>","images":false},"title":{"value":"Walk 11: Roald Dahl Museum, Long Walk, Sleepovers"},"version":1},{"date":{"d":22,"m":2,"y":2011},"datev":20110222,"images":1,"info":{"content":"<p>Daddy joined the Fars on a day trip to Denmark. Yes a day trip to the mighty Billund airport which is smack bang in the middle of Jutland, the pinisula poking up from Germany.<\/p><p>We left at 4:05am and by the time we got to Red Road Farfar was bemoaning the slowness of the car infront! However, we made Standsted in good time and took our Ryanair flight without any issues. No stops to explain taking a syringe and needles!<\/p><p>We landed and walked out into a -5 centigrade wall of coldness. A full 10 degrees difference to home, plus some windchill factor as well. There was snow on the ground, but the Danes handle it very well. Even the cycle paths are gritted!<\/p><p>We collected our hire car and headed first to Grinsted for some 10 o'clock breakfast. A typical town, full of no traffic and no people it seemed. After Daddy recovered from a hypo, we found a cafe type place which was a little out of the ordinary. It happened to be a lady's 50th birthday so it was an open house. Free food. Result. Not only that, there was a great Danish meal time atmosphere and the food was absolutely what the doctor ordered at that time. Some lovely oat type breads, granary rolls, pastries and of course a flask of coffee. Daddy really enjoyed it there.<\/p><p>After swanning around the shop we had to quickly move on if we were to complete our missions today. Daddy took over the driving and Farfar the navigating. We headed to the west coast and a place translated to White Sands (Hvide Sande). It was quite literally 'white sands' as the snow covered the beach. We stopped half way up this spit of land and looked in a couple of fish shops, one with live lobsters in it. Can't take anything back unfortunately. Farmor treated us to a Fish buffet in a nice restaurant for lunch. We had everything from King Eel, Salmon, Prawns, Herring, Mackeral and some other fish which I don't know what they really were. It was interesting chatting to some locals who reacalled eating fish for breakfast 4 times a week when their family worked as fisherman.<\/p><p>Farmor and Daddy went for a walk on the beach which only lasted 10 minutes because it was so unbeliveably, bitterly cold. Daddy's ear almost frooze off!<\/p><p>Time was marching on and a realization that we were not going to do everything planned came upon us. So top priority was..... going to some charity shop over an hour away! So be it. We eventually got to Them, and as charity shops go, it was alright, not one Daddy would step into even if it was down Frimley high street. Still the Fars rated it, and for all our efforts and sacrifices, the only thing purchased was a pair of clogs for £3!<\/p><p>A trip with the Fars always includes a Ying and Yang match up between Farfar wanting to squeeze in another destination, usually at the cost of arriving on time at the final destination, against Farmor's arrive in plenty of time approach. As usual Farfar got his way and we stopped off in Ejstrupholm and had a bit of a comedy moment as Daddy and Farfar ran around a graveyard looking for Daddy's Great Grandparents headstone which had moved since the last time they were there. They only had 5 minutes to find it. The stopwatch chimed and they had to abort and rush to get diesel and return back to the airport.<\/p><p>We arrived back in England at 8pm and all that Mummy was interested in was what presents were bought for her, and of course the children!<\/p><p>A thoroughly enjoyable day with some nice food and a little taste of Denmark along with a splattering of humour with the Fars!<\/p><img src='images\/years\/2011\/2011_02_22-11-JutlandRoadMap.jpg' class='diaryImage' alt='Jutland 1 day Road trip' \/><p class='diaryImageCaption'>Jutland 1 day Road trip<\/p>","images":false},"title":{"value":"Daddy to Jutland, Denmark"},"version":1},{"date":{"d":21,"m":2,"y":2011},"datev":20110221,"images":1,"info":{"content":"<p>Daddy has the week off work and so is about to play with. Today Thomas, Natasha and of course Fiona came over to play. Thomas was straight on the attack with one of his lightsabres. Jessica hooked up with Natasha and played babies. After lunch Daddy made a treasure hunt which took us around the estate and finally ended up at the playground and we had a good run around on the green.<\/p><img src='images\/years\/2011\/2011_02_21-02-BurrowsTreasureHunt.jpg' class='diaryImage' alt='Found a clue' \/><p class='diaryImageCaption'>Found a clue<\/p>","images":false},"title":{"value":"Half Term - Burrows over"},"version":1},{"date":{"d":20,"m":2,"y":2011},"datev":20110220,"images":2,"info":{"content":"<p>We embarked on another of our walks after church, this time in Oxfordshire's Christmas Common. It was extrememly muddy as we trekked through the woods. We had a great time going through the puddles and mud and running all over. Most of the walk was done going up narrow lanes and tracks. We did wonder into the woods and across a couple of farmers fields. Of course we all got wet feet even though we had our wellies on. We did enjoy ourselves, but proably our least favourite outing.<\/p><img src='images\/years\/2011\/2011_02_20-16-ChristmasCommonWalk.jpg' class='diaryImage' alt='Leaving us!' \/><p class='diaryImageCaption'>Leaving us!<\/p><img src='images\/years\/2011\/2011_02_20-03-ChristmasCommonWalk.jpg' class='diaryImage' alt='Katie and Jess Horsing around' \/><p class='diaryImageCaption'>Katie and Jess Horsing around<\/p>","images":false},"title":{"value":"Walk 10: Christmas Common Walk"},"version":1},{"date":{"d":19,"m":2,"y":2011},"datev":20110219,"info":{"content":"<p>In the morning it was Daddy's turn to take Ben to football and boy it was muddy. Later in the afternoon Daddy had all three of us in the swimming pool at Farnborough. Ben is really coming on with his swimming, actually now being able to do a few strokes. Daddy was also coerced into playing Super Mario Bros on the DS!<\/p>","images":false},"title":{"value":"Swimming"},"version":1},{"date":{"d":18,"m":2,"y":2011},"datev":20110218,"first":{"name":"katie","value":"First game of Scrabble"},"info":{"content":"<p>Katie, Ben, Mummy and Daddy played our first game of scrabble. I think the children learnt the rules and managed some words by themselves.<\/p>","images":false},"title":{"value":"Katie plays Scrabble"},"version":1},{"date":{"d":16,"m":2,"y":2011},"datev":20110216,"info":{"content":"<p>Today Jessica had an injection at the top of each arm. She was so cute, she buried her head in Mummy's top and didn't speak and didn't cry during the first injection. However, she did cry during the second one. She was pretty pleased at getting two stickers for her troubles. Her 'Baby' now takes 'tend jections' (pretend injections).<\/p>","images":false},"title":{"value":"Jessica injections"},"version":1},{"date":{"d":13,"m":2,"y":2011},"datev":20110213,"images":1,"info":{"content":"<p>In the morning Daddy went to work and we went off to church. In the afternoon we split, Mummy and Katie went to Leah Rushforths baptism. It was slightly different as it was a Mormon baptism.<\/p><p>The rest of the crew headed over to Joey's birthday party in Alton. It was held at the Leisure Centre and consisted mainly of the boys in Joey's class.... and what a lot of naughty boys they were. Ellie and Michael did well to keep them under control. We had various games, including: Paper Aeroplane competition, British Bulldog, Stuck in the mud, corners and a hearty game of football.<\/p><p>We headed to the cafe for some food and to sing happy birthday to Joey. We headed back and had our bath at the Fars and waited for Mummy and Katie to pick us up.<\/p><img src='images\/years\/2011\/2011_02_13-11-Joey6thBirthday.jpg' class='diaryImage' alt='Joey blowing out his candles' \/><p class='diaryImageCaption'>Joey blowing out his candles<\/p>","images":false},"title":{"value":"Joey's 6th birthday, Leah R's Mormon Baptism"},"version":1},{"date":{"d":12,"m":2,"y":2011},"datev":20110212,"images":3,"info":{"content":"<p>Mummy and Ben went off to football and came back very muddy. Meanwhile Daddy monitored Katie doing her homework. As usual it was a bit of a battle for her to approach it in the right attitude so Daddy had to gently remind her how important it was to put all her effort into it, if nothing else it would mean she could go back on to her DS quicker!<\/p><p>This week's homework was in three parts:<\/p><ul><li><i>Maths<\/i>Katie had a list of about 30 numbers and had to round each to the nearest 100. She did well, but needed help when the number in question was in the 1000's.\u000a        <\/li><li><i>Spelling<\/i>This week's 10 words were: Properly, Eventually, Originally, Friendly, Lovely, Likely,\u000a        <\/li><li><i>Reading<\/i>Katie had read a chapter, about 5 - 10 minutes of her book. She tripped on a few words, but we believe she is quite proficient.\u000a        <\/li><\/ul><p>After an early lunch we headed to Leith Hill, Surrey's highest point for another of our walks. For once conditions were nice enough so that the children could not moan, it was sunny and not too cold, and we even managed a pushchair! The start of this 3 miler saw us climb up this big old hill, which made Mummy quite breathless. We put it to the state of her fitness, she put it down to her asthma.<\/p><p>Once we reached the cricket ground we took a wrong turning and from the time we realized Mummy was on a crazy mission to get us to the hallowed tower for 3pm, often leaving Katie and Ben in some tree or Daddy helping a very slow Jessica on foot. It all got a bit embarrassing at the tower with Mummy running around paniced and barking orders at Jessica and Daddy to hurry up as the tower was about to close. Anyway funnily enough we made it with plenty of time to spare and climbed to the top. The views were magnificent. We were able to see London to the north and a lot of countryside everywhere else!<\/p><p>We hung about at the tower for a while, eating some much needed supplies, Ben and Katie continuing the great tree climb fest! We headed back down the hill and for the next 2 miles we barely saw anyone else, the occasional dog walker and mountain biker. We all played World War II, daddy was the only one on the Germans side and so was attacked with sticks (guns) and even bigger sticks (aeroplanes).<\/p><p>We finally returned to the car not before jumping in puddles and getting completely soaked. We had a quick 15 minutes in a nearby playground before it got dark and home time.<\/p><img src='images\/years\/2011\/2011_02_12-00-LeithHill.jpg' class='diaryImage' alt='Collage of Leith Hill' \/><p class='diaryImageCaption'>Collage of Leith Hill<\/p><img src='images\/years\/2011\/2011_02_12-15a-LeithHill.jpg' class='diaryImage' alt='Group shot' \/><p class='diaryImageCaption'>Group shot<\/p><img src='images\/years\/2011\/2011_02_12-08-LeithHill.jpg' class='diaryImage' alt='Two monkies in a tree' \/><p class='diaryImageCaption'>Two monkies in a tree<\/p>","images":false},"title":{"value":"Walk 9: Leith Hill"},"version":1},{"date":{"d":6,"m":2,"y":2011},"datev":20110206,"images":2,"info":{"content":"<p>We said our goodbyes from Ma Ma and Pop Pop's, and hurried back to basecamp... for about 5 minutes. Mummy and Katie went to Poopy's birthday which was different. It was a horse riding party which Katie absolutely loved. It involved riding through the woods. Meanwhile Daddy biked across the woods with Ben and Jessica and ended up at the Fars. We played with the wooden railway before Ben was taken to Tomlinscote School for one of his friends birthday party.<\/p><p>Meanwhile Jessica was tucking well into her Sunday roast. First time for roast beef and brussel sprouts. We have now got conclusive proof that Jessie is a food eating dustbin. Not only does she adore porridge, but also a brussel sprout gobbler!<\/p><p>Later in the afternoon we met up with some of the Barnett's and Elders for the Church New Years party where we had a mixture of quizzes and children's games. We did particularly well with the prizes. A good time had by all.<\/p><img src='images\/years\/2011\/2011_02_06-33-ChurchNewYearParty.jpg' class='diaryImage' alt='Katie playing sleeping lions' \/><p class='diaryImageCaption'>Katie playing sleeping lions<\/p><img src='images\/years\/2011\/2011_02_06-36-ChurchNewYearParty.jpg' class='diaryImage' alt='The lions sleep tonight' \/><p class='diaryImageCaption'>The lions sleep tonight<\/p>","images":false},"title":{"value":"Two more birthdays, Fars, Church Party"},"version":1},{"date":{"d":5,"m":2,"y":2011},"datev":20110205,"images":1,"info":{"content":"<p>Mummy took Ben to football this morning. After which we swiftly left for another of our walks this time in Ashdown Forest, where the Winnie The Pooh stories are set. We pulled up into the car park and noticed another family with the same 'Walks' book as us! Spooky.<\/p><p>We had lunch in the car, not daring to go out in the not so perfect conditions, this time drizzley and very windy. No pushchair this time, so we had no choice but to go at Jessica's slow pace. We had mixed emotions around the 2 mile circuit. We had Katie absolutely besides herself when she couldn't see us when she decided to take a detour and Ben crying uncontrolably when he hit the mud with a thud when he slipped off a large rope swing.<\/p><p>However, we had triumphs when both Katie and Ben shinned across fallen trees across the stream. They got real confidence from doing this. Ben of course was particularly proud and thought he was real daring. We did struggle to keep the spirits up high on our journey so skipped the detours to the windmill and waterfall which was a shame. Yet again we mentioned how it would be lovely to come back in the summer when conditions would be more favourable.<\/p><p>Jessica did particularly well at the end when she climbed unaided, the never ending steep hill back to the top where 'Friends Clump' lay and the car.<\/p><p>We drove to Ma Ma and Pop Pop's and had a Spag Bol where we met up with the Elders.<\/p><p>In the evening we went over to Buckmore Park, where Daddy, Uncle Michael and Ryan from work did a 45 minute race on karts which can reach 60-70mph. Daddy had a blistering start and was only 0.007 seconds from pole position out of the 35 drivers. However, the heavens opened and he really struggled to keep the kart on the track spinning on so many occassions, some at high speed. He had quite a few battles with Uncle Michael, and bumped him off the road a number of times! he he. We of course were routing for Daddy and cheered when he passed Uncle Michael. Joey cheered when Michael passed Daddy! Helen, Nigel, Pop Pop and Auntie Ellie all came to watch as well.<\/p><p>Daddy clawed back a few positions when the weather dried up and ended 6th, 2 places behind Ryan in 4th, but 6 in front of Michael who finished in a respectable 12th.<\/p><p>\u000a        Here are the <a href=\"http:\/\/www.buckmore.co.uk\/content.php\/51420?cha_ref=202&amp;eve_ref=5852\">results<\/a>.\u000a      <\/p><img src='images\/years\/2011\/2011_02_05-01-Karting.jpg' class='diaryImage' alt='Buckmore Park' \/><p class='diaryImageCaption'>Buckmore Park<\/p><p>We stayed the night at Ma Ma and Pop Pops.<\/p>","images":false},"title":{"value":"Walk 8: Ashdown Forest Walk - Outdoor Karting"},"version":1},{"date":{"d":4,"m":2,"y":2011},"datev":20110204,"info":{"content":"<p>Us children were scattered around friends houses after school leaving Mummy and Daddy to attend Great Grandad's funeral. The service was held at 1:15pm at St. Andrew's church, Frimley Green and was very well attended. There must have been about 200 people, which was good considering a lot of his friends had passed away themselves. The coffin draped with an RAF flag, was marched in by his sons' and Pop Pop. Grandma presented a stiff upper lip but like the rest of us found it hard to keep emotions in.<\/p><p>A number of eulogies were presented by Uncle Richard, Uncle Peter Garratt, an RAF colleague and a friend who had Great Grandad as his best man. They all charted his life at various points. It centred around his travels and work with the RAF and all the various organisations he had either setup or actively participated in right up to the time he contracted cancer. Many were unaware how much work he had done for the community and charity, due to the modesty of Great Grandad. \"If the club did not exist, Alan would create one.\" - \"Alan always made me feel very welcome.\" were a couple of remarks that summed him up.<\/p><p>After the church service, family were invited to Aldershot crematorium to say our final goodbyes. The reverand held a small service. After we hundled in the cold and looked at the flowers and messages left by close family. The family had requested that if the general congregation wanted to make a donation to the RAF benevolent fund rather than give flowers.<\/p><p>We headed back to Mytchett bowls club for the wake, which was held in a well spirited atmosphere. Great Grandma was ever so strong and all our support goes to her.<\/p>","images":false},"title":{"value":"Great Grandad's Funeral"},"version":1},{"date":{"d":29,"m":1,"y":2011},"datev":20110129,"info":{"content":"<p>Leah Sumner came over last night for a sleep over. The two girls didn't go to sleep until past midnight! They played teachers and of course the Nintendo DS.<\/p><p>In the morning Daddy took Ben to football. Again he was very enthusiastic during the game! So much so he kicked the ball into his own goal from half a yard out! Meanwhile Daddy did his first bit of fitness for over 2 months! He struggled to run 2 miles.<\/p><p>Next Ben and Jessica went to Wizzy World for Amy's 3rd birthday. Ben suffered a hypoglycemic attack which is a little ironic. Either that or he's cunning at getting a chocolate muffin!<\/p><p>In the afternoon Katie and Leah went to Leah Rushforth's 8th birthday party, whilst Mummy, Daddy and Ben had a Champion of Champions game of Monopoly. The winner being.... Ben.<\/p><p>Katie went over to Leah's house to sleep the night.<\/p>","images":false},"title":{"value":"Football, Leah Over To Stay And Two More Birthdays"},"version":1},{"date":{"d":24,"m":1,"y":2011},"datev":20110124,"info":{"content":"<p>In the morning we picked Katie up from Leah's and went to church. Daddy and Jessica went over to the Fars. Daddy watched the tennis final whilst Jessica beautified Farfar!<\/p><p>We headed up to London for the sixth walk. We walked south from our start position of the Monument. Of course Ben first needed the toilet, and ther are not alot of places to go around there, so discretely made use of a disused carpark. Two minutes later Jessica wanted to go. Mummy in her infinite wisdom decided to tip her up by the side of the main road and make use of a drain. It was so embarassing as 5 seconds later a car wanted to turn into the narrow road that Mummy was standing. Therefore the driver had a lovely view of a child weeing all over the road. They hadn't even realized that a car was waiting!<\/p><p>We continued over London Bridge and hit Southwark Cathedral where we stopped for some food. Daddy had a bit of a hypo so went looking for food. We went into the Cathedral where the choir were singing away.<\/p><p>Borough market was closed so quickly moved onto the Golden Hind, then down the path to see the Clink prison. Katie was too scared to go down the steps to the entrance!<\/p><p>Daddy persuaded us to go into the Tate Modern. We saw the controversial sunflower seeds. We couldn't quite work out its artist merit, but that would probably go for 90% of the Tate Modern! Philistines!<\/p><p>We moved across the Millenium Bridge and stepped inside St Pauls cathedral. We took up Ben's suggestion and lit a candle and thought about Great Grandad up in the sky. We walked around inside a bit. It's pretty big in there,<\/p><p>We headed back to the car and took 2 hours plus to get home through the A3 traffic!<\/p>","images":false},"title":{"value":"Walk 7: Southwark and St Paul's walk"},"version":1},{"date":{"d":23,"m":1,"y":2011},"datev":20110123,"images":1,"info":{"content":"<img src='images\/years\/2011\/1960_XX_XX-AlanCarolRichardPeterHoward.jpg' class='diaryImage' alt='Dear Old Grandad' \/><p class='diaryImageCaption'>Dear Old Grandad<\/p><p>Today was an extermely sad day with great Grandad passing away. It started very early. The family had kind of said that there were to be 2 family members continually at Grandad's bedside to they could care for any of his needs immediately. Ma ma had done the night shift and Mummy and Ellie went in at 6am to relive her. Unfortunately Grandad's breathing became extremely lengthy, 20 seconds between in each breath. Mummy was holding his hand and talking to Ellie and Uncle Howard on previous events and what a lovely man he was. He passed away peacefully at about 8:30am. The rest of the family were informed and a message passed to the church so they could pray for him.<\/p><p>When Mummy and Auntie Ellie returned, we decided to get out of the house, have a runabout and get some fresh air. Daddy had another hypoglycemic attack, worse than yesterday's, this time he also got the sweats. Mummy rushed to the shops to get some sugars. That will teach us to take the sugar tablets everywhere with us and to have emergency provisions in the car just in case we forget in the future.<\/p><p>We told the children the news about great grandad and they seemed to take it well and surprisingly not too much of a reaction at first. Ben asked how the angels are going to get into the hospital. Katie later asked won't the nurses notice that grandad's body has gone [into heaven]. Joey and Lily were discussing whether heaven was in the clouds or in space.<\/p><p>The most profound remark came out of the blue from Ben later in the afternoon when he said, \"I've got a good idea. Why don't we light that candle [in mummy and daddy's room] every Sunday and think about Grandad\". What a sweet thought from a 5 year old. Mummy rolled the conversation on and spoke of some of her fond memories of Grandad. Ben recalled gleefully one of the last times he saw great grandad when they played draughts against each other.<\/p><p>The rest of the day flowed past in numbness. Daddy took Jessica to one of her playschool friend's 3rd birthday party at the biggest house you ever likely to go in. It was huge. An early night was had by all.<\/p>","images":false},"title":{"value":"Great Grandad Passes Away"},"version":1},{"date":{"d":22,"m":1,"y":2011},"datev":20110122,"images":2,"info":{"content":"<p>In the morning Ben went to football with the usual lack of enthusiasm beforehand, and then absolutely loving it when he's playing the match in the second half of the training session. He loves the social interaction and competition, rather than being any good at it. It was raining a little and very muddy. It made Daddy laugh when some of the boys whined when their hands got dirty!<\/p><p>After footer we headed off on another of our children's walk around London, the fifth one in 3 weeks! This time it was the Watership Down walk, and this time we thought the children were a little young to be introduced to the cartoon. The setting was 50 minutes away on the other side of Kingsclere. Of course the temperature was on freezing and it began to drizzle at the begining of the walk down the road. All in good spirits except of course Jessica. Ben was especially a live wire going up the steep banking, getting his trousers filthy within 10 seconds of setting off and jst loving every second of bein outdoors and being how a child should.<\/p><p>Mummy followed the map pretty well. We got to Watership Down hill itself and there were millions of rabbit holes. We saw just one rabbit scampering up the hill for about 5 seconds before it disapeared. Taking the pushchair was a bit if a mistake as it was pretty bumpy and constantly at an angle as we traversed the bottom of the hill. Ben was climbing the hill, worrying Mummy as it was quite slippery and steep. Casualty number two quickly came with Katie continually moaning that her feet were cold! So we stopped for a picnic as an attempt to revive the spirits. No joy there though. We climbed the hill and finally reached the top where the gallops were. Ben said that the view was 'excellent'. We had to agree with him. We treked through the mud and finally finished the 2 mile walk in good time. Definately a place to come back to in the summer as there were plenty of trees to climb and I am sure we'd love to do rolly polies down the hill!<\/p><img src='images\/years\/2011\/2011_01_22-05-WatershipDown.jpg' class='diaryImage' alt='Rambling down the hill' \/><p class='diaryImageCaption'>Rambling down the hill<\/p><img src='images\/years\/2011\/2011_01_22-32-WatershipDown.jpg' class='diaryImage' alt='Benny pointing out the views' \/><p class='diaryImageCaption'>Benny pointing out the views<\/p><p>We returned home and the Elders arrived soon after. The news from the hospital ragarding great grandad was not good. He was now unable to communicate and flailing around in bed. It was quite distressing for the family who surrounded him. Mummy decided to go and support Ma Ma and others up on the ward for a number of hours. When she returned she could not offer much other than there is a lot of love of support for great Grandad.<\/p><p>Meanwhile the children were all playing very well, oblivious to the seriousness of great grandad's condition which helped relieve the anxiety. We made a monster lasagne and pizza for dinner. Joey and Lily stayed in Katie and Ben's bed for a couple of hours before finding alternative sleeping arrangements.<\/p><p>Daddy's first couple of days of monitoring and administering have been a bit unsatisfactory in terms of results. The daily routine consists of taking a blood sample before a meal and two hours after a meal, as well as one just before bed. That is 7 blood tests. A blood test involves making a small pin prick on the side of a finger, enough to draw blood. The blood is then soaked on a small piece of special card. Depending on the time of day this rading should be between 4 and 9. Daddy's reading have all been between 11 and 15!... except for once, this evening when it fell below 4 and Daddy started to get the shakes. In other words had a mild hypoglycemic attack, even after a huge lasagne! Obviously it had a low GI count. Anyway after eating and drinking some sugary drinks he returned to normal and an hour later his glucose level had risen to 15! The attack came quite suddenly, e.g. One minute feeling fine, the next feeling quite not as himself. As well as the 7 blood tests, Daddy has to take 4 injections of insulin. This is adminstered with a needle and hopefully because he is inexperienced sometimes stings a bit. It is more of an inconvienience than anything else.<\/p>","images":false},"title":{"value":"Walk 6: Watership Down - Elders Over - Hypoglycemic"},"version":1},{"date":{"d":20,"m":1,"y":2011},"datev":20110120,"info":{"content":"<p>Hope you are sitting comfortably, this is a tale of woe:<\/p><p>First off Great Grandad collapsed out of bed and had blocked the doorway to his bedroom making it hard to attend to him. He was eventually taken to accident and emergency and is barely concious. Grandma and their children all went to visit him, but returned soon after as he was not very with it.<\/p><p>Second, Leah, Katie's best friend is leaving school. Therefore, Katie said her next best friend will be Poppy because they take the micky of her name as well. Katie was told that she would marry Poppy because she was Gay. She then clamed up when asked who and in what context. So this is the first time we know that Katie has had some micky taken from her peers about her surname.<\/p><p>Thirdly, Daddy has been really thirsty over the past month and over the past two days has gone for tests. The normal glucose level is 4 to 7 mol. Daddy had three readings 23, 20 and 19! So casually booked a doctors appointment for today. Once in the doctors Daddy had a blood and urine tests. The glucose level was at ++++ as were his ketones ++++. Apparently that was enough pluses for me to be refered to Casualty. So went home, told Mummy the news and told work that I was unlikely to be in for the rest of the day. I thought the doctors appointment would last long enough as my lunch break! Eventually got refered on to the Medical Assessment Unit where Barrie's mum was working.<\/p><p>Another blood test from the artery this time, which was the most painful, then a very unconfident student nurse came to put a cannula in which was a little unnerving. A doctor came to asses and confirm I had Type I diabetes. She said it is a bit of a life changer. Daddy was yet to be convinced. Daddy was then hooked up to some IV fluids for an hour and then another set which lasted two hours! Meanwhile Farmor had popped in to give some reading material as Daddy was bored out of his brain. Apparently most people with that high a blood glucose level would be feeling ill. Daddy had no ill-affects at all nd didn't feel tired, just very hungry. All that fasting. Two weetabix in the morning and that was it.<\/p><p>Whilst the drips were plugged in the Diabetic consultant came round and discussed the ins and outs, and becaues Daddy looked sensible (got that wrong!) she instructed him on how, when and quantities on injecting insulin.<\/p><p>Daddy's main concern was that he had read that it can reduce your life expectancy by 20 years. He was thinking that he would not be old enough so see any great grandchildren! Not sure how accurate the answer I got from the consultant. She made it more 5 years than 20!<\/p><p>Tomorrow he has another appointment to get more information.<\/p>","images":false},"title":{"value":"Worst Day Ever? Daddy diagnosed with Diabetes, Great Grandad ambulanced to hospital, Katie taken micky of for surname"},"version":1},{"date":{"d":16,"m":1,"y":2011},"datev":20110116,"images":2,"info":{"content":"<p>The weather was a bit shakey this morning. Daddy and Jessica went around to see Farfar, Farmor was coffee'ing at church. They did some maintenance work on the bikes before this afternoon's ride. Mummy took the rest of us to church and Sunday school.<\/p><p>We headed up to London after church and parked just opposite the Ritz. Now not sure if we are mad but all three of us had the bikes and were just about to embark on going on the busiest streets in the country. There was Katie who was OK on the bike, Ben who didn't look where he went, was quite unsteady and kept falling off and didn't have much street awareness, and there was Jessica who fell over a number of times.<\/p><p>Still we rode past the Ritz and Fortnam and Mason upto Picadilly Circus where we didn't stop long. It was hard hearding everyone together as we all travelled at different paces, especially trying to navigate ourselves around people and not into them! We kind of split into two groups and reassembled at Trafalgar Square. We haven't been here since it had been paedestrianized. We stopped for lunch on one of the benches and marvelled at the fountains.<\/p><img src='images\/years\/2011\/2011_01_16-14-LondonWalk.jpg' class='diaryImage' alt='Ben, a little soldier' \/><p class='diaryImageCaption'>Ben, a little soldier<\/p><img src='images\/years\/2011\/2011_01_16-23-LondonWalk.jpg' class='diaryImage' alt='Horse Gaurds Parade' \/><p class='diaryImageCaption'>Horse Gaurds Parade<\/p><p>Jessica's first big fall flat on her face happened as we were leaving Nelson's Column behind us and headed towards Whitehall. She cried loudly at first , but then setlled down quickly and continued to Horse Gaurds Parade. We stopped to stroke the big horses on the nose and have our picture taken next to the finely dressed guard.<\/p><p>We went through horse gaurds parade and headed down St. James' park and saw a pelican, a heron and lots of ducks and swans. We stopped at the playground, with the lake and Buckingham Palace as a lovely setting in the background.<\/p><p>We circled past Buckingham Palace where we lost Jessica for a split second. She bravely rode on ahead. We ran to catch her up and walked back up the Pall. The stopped off to see some more finely dressed guards before climbing the steps by the status of the 'Grand Old Duke Of York', up on to Pall Mall and back to Trafalgar Square.<\/p>","images":false},"title":{"value":"Walk 5: Central London Walk\/Bike Ride"},"version":1},{"date":{"d":9,"m":1,"y":2011},"datev":20110109,"info":{"content":"<p>Jessica has been invited two more parties today. First Amy's after church at Tomlinscote school, then over to Jake's for Lily's. She's out numbering Ben and Katie at the moment in the birthday party stakes. This time over at Jakes. We all went along and had a good time running about.<\/p>","images":false},"title":{"value":"Lily and Amy's Birthday Parties"},"version":1},{"date":{"d":8,"m":1,"y":2011},"datev":20110108,"images":2,"info":{"content":"<p>We had quite an active day today. First up, Mummy took Ben off to football. Again it was hard to convince Ben that he was going to enjoy himself, but once he was there and getting stuck in he loved it. It was pretty wet, but Ben enjoyed getting muddied!<\/p><p>Mummy, Ben and Katie then went to a packed Skate Jam down at Tomlinscote. Ben who really wasn't very confident on skates really excelled and by the end of the session was going around on his own without falling over. He's really improved. Katie on the other hand was being a bit of a madam and was moaning away, not sure if it was through tiredness (because she doesn't go to sleep in bed easily) or whether it was down to being hungry..... which is always the case. Over the last couple of months it feels at time as if Katie has turned into a teenager. Moody and talking about boys, constantly hungry and sometimes not speaking nicely to the grown ups. Other times she is really sweet, a caring sister and fun to be with. I expect we have more of that to come.<\/p><p>After SkateJam we went home and prepared for our walk. This is the third in our series. We were determined this wouldn't be disasterous like the previous two: the first we forgot coats, the second we got lost..... and this time, we left the picnic in the bag in the front room! A typical Gay day out!<\/p><p>No matter, we continued and arrived at a sunny Turville, the setting of Chitty Chitty Bang Bang. As preparation we watched the 2.5 hour film yesterday and we all loved it. Turville is a little village with a good pub, church, red telephone box, old cottages, and the windmill from the film up on top of the hill. You get the picture a quaint English village.<\/p><p>We started our 2.5 mile walk up a muddy path and ventured into lots of farmers fields and lots of hills. It had been raining pretty solidly for the past 2 days, so at times we had to drag the pushchair through the mud which was quite interesting. Talking of mud, yes, Ben did managed to find it. All over his clothes and somehow on his face as well. He rivals Daddy at his clumsyness!<\/p><img src='images\/years\/2011\/2011_01_08-07-TurvilleWalk.jpg' class='diaryImage' alt='Jessica walking to the gate' \/><p class='diaryImageCaption'>Jessica walking to the gate<\/p><p>Anyway it was a lovely sunny day and there was absolutely noone about. So we made as much noise as we liked. Katie and Ben played through out the 2.5 hour walk, constantly running off ahead or holding hands. It was so lovely to see.<\/p><p>The guide book suggested we might see some Red Kites, and suprisingly we saw quite a few. They were so elegant in the air swooping around quite low looking for prey. They had a large wingspan. No matter we pressed on despite Daddy being left behind marvelling at their gracefullness.<\/p><img src='images\/years\/2011\/2011_01_08-25-TurvilleWalk.jpg' class='diaryImage' alt='Red Kite' \/><p class='diaryImageCaption'>Red Kite<\/p><p>We arrived back at the village, this time everyone in high spirits. We popped into the pub for some much needed crisps and apple juice! Well worth recommending the walk.<\/p>","images":false},"title":{"value":"Walk 3: Turville - Chitty Chitty Bang Bang"},"version":1},{"date":{"d":7,"m":1,"y":2011},"datev":20110107,"info":{"content":"<p>Today, Ben was voted on to the school council as the boy representitive from his class. Apparently all the children were able to vote and out of the 4 candidates in Ben's class he got top votes. Politician Ben Gay said he would first try to press through his idea of extra school holidays! We're not entirely sure what the role will entail, still it shows he's a popular lad.<\/p>","images":false},"title":{"value":"Ben voted onto the school council"},"version":1},{"date":{"d":3,"m":1,"y":2011},"datev":20110103,"images":2,"info":{"content":"<p>Mummy and Daddy had a nice morning where they could get up leisurely and calmly, although Daddy still got up before 8am! They came around to pick us up from the Fars and we headed straight off to Epping Forest for the second of our walks out of our book.<\/p><p>This time we remembered coats and boots. Good job to, as the temperature was freezing. We first walked to the lost pond, which was completely frozen. We attempted to crack it by throwing stones and logs onto the ice. No luck though. We treked across the wood, but soon all three of us were moaning about cold feet. We stopped for a picnic of leftovers, of which only half was edable!<\/p><img src='images\/years\/2011\/2011_01_03-20-EppingForest.jpg' class='diaryImage' alt='Katie the Lake maiden' \/><p class='diaryImageCaption'>Katie the Lake maiden<\/p><p>We carried on the 1.8 mile walk, up and big hill where there was a settlement 2500 years ago! Mummy was the map reader as she thought she could manage this task. However, we ended our walk about a mile away from where we were supposed to be!<\/p><img src='images\/years\/2011\/2011_01_03-40-EppingForest.jpg' class='diaryImage' alt='Ben the tree monster' \/><p class='diaryImageCaption'>Ben the tree monster<\/p><p>Daddy, with his broken toe, had to navigate his way back to the car and gather up the stranded walkers who waited behind. Mummy and Daddy enjoyed the walk alot more than us lot.<\/p>","images":false},"title":{"value":"Walk 2: Epping Forest Walk"},"version":1},{"date":{"d":2,"m":1,"y":2011},"datev":20110102,"info":{"content":"<p>After church we popped Leah back home. In the afternoon we took down the Christmas decorations.<\/p><p>Daddy took Jessica to Charlotte's 4th birthday party in Tongham. There was an entertainer who had to work hard to get the 3 and 4 year olds to play the games. Still Jessica and Daddy danced well together and had a really good time.<\/p><p>In the evening the Fars took us and we stayed over for the night. We stayed up later than we should at the Fars, mainly because our game of our newly discovered board game of Ludo which went on for ever; Katie won. We might have spent the night  in a camp made under the dining table but sleeping downstairs was a little too scary so Jessica slept in the little bedroom by herself with Katie and Ben pushing the Fars out of their bed in the main bedroom.<\/p><p>With a snugly hot water bottle we read stories from our books then settled down, not to awake until almost nine o’clock next day with Jessie being the first, who then eventually woke the rest of us.<\/p><p>We watch a Tom &amp; Jerry film with out breakfast but Mum and dad came to collect us before it ended. We all enjoyed ourselves very much and once again, there were no upsets or problems so that we will all be welcomed back again another day for an overnight stay with the Fars.<\/p>","images":false},"title":{"value":"Charlotte 4th Birthday Party - Fars Sleepover"},"version":1},{"date":{"d":1,"m":1,"y":2011},"datev":20110101,"info":{"content":"<p>The Elders had stayed the night. We went to the skate park over at Mytchett again. This time we rolled Joey and Ben up and down the half pipes. Of course, Ben erached the top making the skateboard stick to the scaffold leaving Ben sliding down on his coat! He loved it. Jessica was also going up the half pipe on her stablizers!<\/p><p>We popped over to Grandmas and Gradads to see how they are. Grandad was OK, putting on a brave face.<\/p><p>Leah came over also with her Nintendo DS of course which consumed Katie for 24 hours! They made a camp in the front room, watched Grease and went to sleep very late!<\/p>","images":false},"title":{"value":"Elders and Leah Sleepover"},"version":1}],"version":-1139158906}