{"entries":[{"date":{"d":31,"m":12,"y":2012},"datev":20121231,"images":1,"info":{"content":"<p>We picked up the new car today from Maidenhead. After the traumas from the past few months with the old Almera we've decided to upgrade, well to an 8 year old car. Things wrong with the old car. Dirty, denty, no fog lights, no CD player, wheel housing ripped out, heater control broken, heater directors broken, engine light on constantly, electric windows that sometime work, electric windows which just fall down, I could go on. Anyway we've taken bets when Mummy is going to first trash it!<\/p><p>In the evening we went over to the Sanders household to see the new year in. Jessica went to bed with Lily whilst the rest of us stayed up. Ben and Joey were predominantly watching the DVD that Ben and Katie made. It had over 2 hours of photos and film. They watched the lot. For the adults there was some nice food and Michael had made an effort on making games.... although it was hard work with a mixture of 'Attention Deficit Delinquents' in tow, technical gremlins and the exciting guessing how much 6 eggs cost game! The Mr and Mrs game was solely for Karen and Rich.... question 3 was interesting!<\/p><p>Anyway we saw midnight in. Karen was dancing to early 90's dance music! Quite an atmosphere.<\/p><img src='images\/years\/2012\/2012_12_31-01-NewYearsEve.jpg' class='diaryImage' alt='The midnight crew' \/><p class='diaryImageCaption'>The midnight crew<\/p>","images":false},"title":{"value":"New Car, New Year Eve at Sanders"},"version":1},{"date":{"d":30,"m":12,"y":2012},"datev":20121230,"images":1,"info":{"content":"<p>To blow a few cobwebs from ourselves we went off to first collect some Turkey soup from Pop Pop at the Fleet Services and then went on to Dogmersfield where we had a lovely walk along country roads, along a tranquil Basingstoke Canal, a lake, some farm animals and lots of mud. Most moaned how they didn't want to do the walk, but Daddy loved it and I think everyone needed some outdoor time. Of course Ben was told to be careful in the puddles and such like. Of course he found a very deep hole filled with water, which filled his boots!! Typical Ben.<\/p><img src='images\/years\/2012\/2012_12_30-03-DogmersfieldWalk.jpg' class='diaryImage' alt='Dogmersfield Blow The Cobwebs' \/><p class='diaryImageCaption'>Dogmersfield Blow The Cobwebs<\/p>","images":false},"title":{"value":"Walk 40: Basingstoke Canal, Dogmersfield"},"version":1},{"date":{"d":29,"m":12,"y":2012},"datev":20121229,"images":2,"info":{"content":"<p>We went over to Pete's in the late afternoon for some fun and games at Pete's house.<\/p><img src='images\/years\/2012\/2012_12_29-127-PetersXmasParty.jpg' class='diaryImage' alt='Model Jessica' \/><p class='diaryImageCaption'>Model Jessica<\/p><img src='images\/years\/2012\/2012_12_29-128-PetersXmasParty.jpg' class='diaryImage' alt='Ben in Denmark top' \/><p class='diaryImageCaption'>Ben in Denmark top<\/p>","images":false},"title":{"value":"Pete's Christmas Party"},"version":1},{"date":{"d":28,"m":12,"y":2012},"datev":20121228,"images":1,"info":{"content":"<p>We made our annual family Panto trip to see Dick Whittington at Woking which starred some performing dog that won Britain's Got Talent. It was good and Ben and Joey especially enjoyed it and participated in all the gags.<\/p><img src='images\/years\/2012\/2012_12_28-02-DickWhittington.jpg' class='diaryImage' alt='Dick Whittington Cast' \/><p class='diaryImageCaption'>Dick Whittington Cast<\/p>","images":false},"title":{"value":"Pantomime - Dick Whittington"},"version":1},{"date":{"d":26,"m":12,"y":2012},"datev":20121226,"images":2,"info":{"content":"<p>We left for home in the morning spending a few hours to tidy up the house a bit before venturing out again to the Elders Boxing day party where we saw the Barnett family.<\/p><img src='images\/years\/2012\/2012_12_26-18-Boxing Day.jpg' class='diaryImage' alt='Ladies' \/><p class='diaryImageCaption'>Ladies<\/p><img src='images\/years\/2012\/2012_12_26-25-Boxing Day.jpg' class='diaryImage' alt='How very dare you' \/><p class='diaryImageCaption'>How very dare you<\/p>","images":false},"title":{"value":"Boxing Day - Elders"},"version":1},{"date":{"d":25,"m":12,"y":2012},"datev":20121225,"images":3,"info":{"content":"<p>Katie found it hard to get a good nights sleep she didn't go to sleep initially until the early hours of the morning and constantly awoke which made it difficult for Father Christmas to pick his time to visit. Katie was getting stressed a bit knowing that she had to be asleep for him to visit. She was afraid he wouldn't come at all if she stayed awake.<\/p><p>The children reported they got up at 3:37 which sounds like Ben to me. Mummy and Daddy were woken at 5:45 at present opening began at 6am! Well Father Christmas didn't deliver exactly what we wanted. Close enough and we were happy enough. For Katie he delivered a Barbie Wardrobe, fashion glasses, makeup set, a Christmas outfit with shoes, Build a Bear clothes, pyjamas, gloves, a Barbie annual, sweets and bubble bath. Ben, a PSP, Build A Bear Clothes, Moshi Monster sticker album, war book, mouthwash, nuts, Lego sticker book, Lego watch and a red hoody. Jessica, Christmas outfit with shoes, chocolate lolly marker, Moshi Monster scooter, Build A Bear Clothes, lip balms, sweets, Sabrina Teenage Witch annual, hand gel, bubble bath, mp3 player and hoody.<\/p><p>Next was Mummy and Daddy who both didn't go overboard this year. We then moved down to the presents under the tree which has come from friends. We then went over to the Fars for Christmas Breakfast. We lay on the sofa and watched a film whilst the others opened presents. Mummy had gone to church.<\/p><p>We had the longest journey ever over to Gravesend. Two accidents, meant two long traffic jams, the last of which was right by the last junction, the Gravesend turn off on the A2. We were so close, Mummy, Katie and Ben decided they would get out and walk to Ma Ma's! They made the 0.75 mile trek along the stationary A2, past the police, down the sliproad and on to Wrotham Road. By this time Daddy and Jessica were moving again and were able to pick us up. At least we were able to stretch our legs and see the scenic A2 by foot.<\/p><p>The Elders arrived a few minutes before us and so the bedlem began. The children had their Christmas lunch which was over in a flash. Not many deserved the 'Finish Me' medal! We then went for a walk down to the rec then it was present opening time. There was great enthusiasm to be Father Christmas and distribute the presents from the tree. Each child had their pile and began opening. Wow what a lot of presents.<\/p><p>After a bit of play time and dinner it was soon bed time for us all, leaving the adults to tackle their monster sized Christmas Dinner and for them to open their presents. Last knockings was to try some of the new board games they got: Would I Lie To You was one of them. For the first time Ellie and Michael went home leaving the rest of us to fight for beds.<\/p><img src='images\/years\/2012\/2012_12_25-18-ChristmasDay.jpg' class='diaryImage' alt='Friends Present Opening' \/><p class='diaryImageCaption'>Friends Present Opening<\/p><img src='images\/years\/2012\/2012_12_25-41-ChristmasDay.jpg' class='diaryImage' alt='Christmas Breakfast' \/><p class='diaryImageCaption'>Christmas Breakfast<\/p><img src='images\/years\/2012\/2012_12_25-44-ChristmasDay.jpg' class='diaryImage' alt='Our Christmas Lunch' \/><p class='diaryImageCaption'>Our Christmas Lunch<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2012},"datev":20121224,"images":3,"info":{"content":"<p>For once Daddy had Christmas Eve off work so we could all relax before the big evening. Everyone was excited. If I had to rank the whole Christmas spirit and excitingness it would definitely have to be Katie first who has been very sweet and busy making and obtaining presents for everyone. She made Mummy and Daddy some quizzes, pictures, stories, all sorts. Uncle Graham got a Rangers tea mat which were made from Hana Beads, Farfar got a diary. She seemed to get as much pleasure from giving as receiving the gifts. Katie showed the most amount of Christmas spirit possible. Ben was hoping for a Bat Cave. Jessica was mad as ever and I think was looking forward to the sweets and chocolate.<\/p><p>Just after lunch we headed over to the Kelley's for some pre-Christmas drinks which was nice. There were plenty of children to play with. James and Ben got on like a house on fire, and Amy Huggets was there so Jessica was happy and exuberant as ever.<\/p><p>We left mid afternoon and entered the Danish Christmas zone. By this stage we were tracking where Father Christmas was in the world, Afghanistan. The children were cranked to the max in excitement, but first we had the Christmas meal. The roast pork was excellent, which Daddy and Jessica ventured into. It seemed Daddy hadn't eaten for a week! Mummy, Katie and Ben had sausages instead. It was nice that the children were more grown up and could fend for themselves a bit more.<\/p><p>Daddy won the Risalamande challenge and got a Chocolate Orange for his troubles. Finally after a game of Coppit we were allowed to light the candles on the tree and start opening presents. Not quite like how the Fars like it, Katie and Ben were dealing all the presents out quickly and lots were being opened. Farfar got the family book which Daddy had spent many, many hours on. Farmor got lots of 'heart' related presents.<\/p><p>We spent 45 minutes opening presents and ended with a nice cup of coffee and Katie and Ben had produced a lovely 12 page programme of a carol concert and readings. It was so lovely for us all to join them in singing some Christmas carols. I think the Danish traditions were upheld for another year.<\/p><p>We got home for about 9pm, then Mummy had 2 hours of midnight mass. Daddy collapsed into bed.<\/p><img src='images\/years\/2012\/2012_12_24-01-ChristmasEve.jpg' class='diaryImage' alt='Danish Christmas Dinner' \/><p class='diaryImageCaption'>Danish Christmas Dinner<\/p><img src='images\/years\/2012\/2012_12_24-35-ChristmasEve.jpg' class='diaryImage' alt='Carol Concert' \/><p class='diaryImageCaption'>Carol Concert<\/p><img src='images\/years\/2012\/2012_12_25-44-ChristmasDay.jpg' class='diaryImage' alt='Carol Concert' \/><p class='diaryImageCaption'>Carol Concert<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":22,"m":12,"y":2012},"datev":20121222,"images":2,"info":{"content":"<p>It's been raining pretty non-stop for days now. Mummy left at 7am for shopping at the Meadows... and it was packed. She even had to queue up to get into the car park. Anyway the rest of us played games with Daddy. Daddy invented a new game up using the video camera on the phone. Katie and Ben made each there own Treasure Hunt type games.<\/p><p>Ma Ma and Pop Pop popped around and then we then did our own popping around to the Fars house for a cuppa. Ben went mad on the printer!<\/p><p>Last year we went as a family to Frankie and Bennies in Guildford, so we thought we'd keep this pre Christmas treat going and this time went to Camberley. The girls got all dolled up and we ate for England. A lovely, jolly atmosphere.<\/p><img src='images\/years\/2012\/2012_12_22-10-FrankieAndBennys.jpg' class='diaryImage' alt='Daddy Doughnut' \/><p class='diaryImageCaption'>Daddy Doughnut<\/p><img src='images\/years\/2012\/2012_12_22-13-FrankieAndBennys.jpg' class='diaryImage' alt='Frankie, Benny and family' \/><p class='diaryImageCaption'>Frankie, Benny and family<\/p>","images":false},"title":{"value":"Frankie And Bennies"},"version":1},{"date":{"d":21,"m":12,"y":2012},"datev":20121221,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica was a narrator at her first Sandringham School Play. It was held at the baptist church where there was a large audience. She looked completely underwhelmed by the whole thing which made Mummy and Daddy laugh. Such a performer at home, and seemingly couldn't careless here. Still she read her two lines very well into the microphone. Well done Jessica.<\/p><p>In the evening Katie went out with her youth group to Camberley for a bite to eat and a go in the bowling complex. She has a far bigger social life than the rest of us put together I think. Ahhh saying that, Ben went to Jasper's Lego party today also..... a theme inspired by Ben's effort I am told.<\/p><img src='images\/years\/2012\/2012_12_21-06-JessicaNativityPlay.jpg' class='diaryImage' alt='The star narrator' \/><p class='diaryImageCaption'>The star narrator<\/p>","images":false},"title":{"value":"Jessica's Nativity Play"},"version":3},{"date":{"d":20,"m":12,"y":2012},"datev":20121220,"first":{"value":null},"info":{"content":"<p>Well I was hoping to report for Mummy to go out for her meal with Karen Teale and her mum and for Daddy to have a good time at his unofficial Christmas Party. However, the Almera Tino got caught in traffic on the M25 and the driver reported that the engine was revving too high. It reached the 7,000 mark. Obviously something was amiss so pulled over to the hard shoulder by the M25 \/ M23 interchange and called the breakdown service.<\/p><p>Anyway the breakdown man only had to come from Clackett Lane a mere 10 miles away, tops. He went past us twice, each time going on to the M23 and having to do a massive motorway double U turn! 2.5 hours later and some very upset and hungry children in the car the recovery man came. He didn't want to attend to it there so recovered back to Clacket Lane where he deemed the car broke beyond repair. A tow home and almost an argument as they said recovery was for 10 miles only! We managed to sort that. Over 7 hours in a car \/ truck later the ordeal was over and we were home. As soon as the recovery man left us, Daddy tried the car out and it drove normally. No problems. This has however prompted Daddy to get us a new car.<\/p>","images":false},"title":{"value":"Car Breakdown Nightmare"},"version":3},{"date":{"d":14,"m":12,"y":2012},"datev":20121214,"first":{"value":null},"info":{"content":"<ul><li>Daddy: 176cm<\/li><li>Katie: 134cm<\/li><li>Ben: 120cm<\/li><li>Jessica: 107cm<\/li><\/ul>","images":false},"title":{"value":"Height"},"version":2},{"date":{"d":9,"m":12,"y":2012},"datev":20121209,"images":2,"info":{"content":"<p>Auntie Charlotte was a little sick this morning which was a little worrying having eaten the party food the night before. Fortunately noone else went down with anything it seemed. We went off to church whilst Daddy went around to the Fars to do a few jobs.<\/p><p>After lunch we went off to a garden centre in Addlestone with the Sanders to visit Father Christmas in his chalet. It was quite pretty with the mature nordic trees lining the route. Ben managed to destroy the reindeer display by being a bit exuberant with the reigns. It was like watching domino rally as each reindeer fell to the ground. Daddy was not happy!<\/p><p>We saw Father Christmas in his chalet and crowded his cosy room. Each of us were asked what we wanted for Christmas. Katie mentioned Sylvanian Families and Barbe dolls, Ben, Imaginex and Jessica said a baby! Katie then fell back off her stool and into the Christmas Tree. Oh man. It was funny. What a calamatus family.<\/p><img src='images\/years\/2012\/2012_12_09-07-FatherChristmas.jpg' class='diaryImage' alt='The full Sanders and Gay Crew' \/><p class='diaryImageCaption'>The full Sanders and Gay Crew<\/p><img src='images\/years\/2012\/2012_12_09-30-FatherChristmas.jpg' class='diaryImage' alt='It's Father Christmas' \/><p class='diaryImageCaption'>It's Father Christmas<\/p><p>We all headed back to our house for a cup of tea and some apple pie and a bit of a play. Joshua is certainly a smiler.<\/p>","images":false},"title":{"value":"Sanders and Father Christmas"},"version":1},{"date":{"d":8,"m":12,"y":2012},"datev":20121208,"images":1,"info":{"content":"<p>In the early afternoon Ben went to Aldershot Ski Slope for Oscar's birthday party where he doughnutted down the slope. He had a great time and mummy even had a go.<\/p><p>The annual Gay Christmas Party was down in numbers this year, but there was still as much fun. We had the Elders, Wests and Morleys over as well as Auntie Charlotte. Boys v Girls in a host of games, quizzes and tasks. The most notable was the \"blindfolded snow ball\" game which led to some unlawful physicality between couples! Girls were being dragged by their legs into the kitchen at one point. Charlotte complained of carpet burns!<\/p><img src='images\/years\/2012\/2012_12_08-13-ChristmasParty.jpg' class='diaryImage' alt='What are the Morleys Doing?' \/><p class='diaryImageCaption'>What are the Morleys Doing?<\/p><p>The 'Spoons' game also managed to draw blood from Mrs West's hand. It was fiercely competed with Ellie winning out in the end. Special mention to Baz's speed of moving the cards round. Plum!<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"http:\/\/www.youtube.com\/embed\/NVX8odvKZ-I\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><p>Daddy had done a roast pork and gammon on the BBQ which turned out well. There was plenty eaten. A good night had by all.<\/p>","images":false},"title":{"value":"The Christmas Party, Ben Doughnutting Party"},"version":1},{"date":{"d":2,"m":12,"y":2012},"datev":20121202,"images":2,"info":{"content":"<p>In the morning Daddy went around to the Fars to put a temporary solution up for the fence which had blown down during the recent bad weather we've had. Tarpaulin stretched the width of the back garden. Farfar would have done it, but is not fit enough to do so yet. It was decided that once he is better the two boys would work together to put a more permanent solution up.<\/p><p>In the afternoon we went around to the Elders for a housewarming stroke Lily's birthday celebrations. Katie and Jessica put on talent show where they danced, sang and did gymnastics.<\/p><img src='images\/years\/2012\/2012_12_01-07-ElderHouseWarming.jpg' class='diaryImage' alt='Sing It Loud, Sing It Proud' \/><p class='diaryImageCaption'>Sing It Loud, Sing It Proud<\/p><img src='images\/years\/2012\/2012_12_01-08-ElderHouseWarming.jpg' class='diaryImage' alt='Jessica Soloist' \/><p class='diaryImageCaption'>Jessica Soloist<\/p>","images":false},"title":{"value":"Fence Fix Up, Elders House Warming"},"version":1},{"date":{"d":1,"m":12,"y":2012},"datev":20121201,"info":{"content":"<p>In the morning the Fars came over. First time Farfar has been over since his operation. He got a dose of Katie, Ben and Jessica mayhem. He last an hour or so before he needed to recuperate for the rest of the day.<\/p><p>We then went to the C of E Christmas fair. Mummy and Daddy ran the lucky dip whilst us lot had a bit of money to spend on some of the stalls. Of course we got the usual array of sweets and teddy's and managed also to get a few Christmas Presents in.<\/p><p>Katie went over to her best friend at school, Caitlin's 10th birthday party which was held at Coral Reef. She claims to have gone down the fastest flume there. We'll have to see next time. She was there for 4 hours and had a great time. She is in a little gang of her, Caitlin and Liam. Katie is getting grown up and is so sweet. She kept coming out with these little laughs at the end of sentences when she spoke about the party. It so nice to see her so happy and excited.<\/p><p>After the Christmas Fair, the rest of us went over to the Elders for Lily's 6th birthday party. We dropped Jessica there where she stayed for a sleepover. She loved it.<\/p>","images":false},"title":{"value":"Fars Over, Lily 6th Birthday, Jessica Sleepover, Caitlin's Birthday. C of E Christmas Fair"},"version":1},{"date":{"d":25,"m":11,"y":2012},"datev":20121125,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy for some reason decided to ride up to London on his bike. It was a lovely sunny day. He made it up to the Chelsea area in about two hours which was pretty good going. Then as he was undertaking a van along the Kings Road he hit a van's mirror. 99% sure it wasn't damaged, but Daddy hid in the next side street anyway just in case the man wanted to make a point about it!! Anyway some meandering around London's sites was done. Whilst riding over Westminster Bridge, Daddy almost ran over a tourist who stepped out into the road. Big skid!<\/p><p>The return journey was a lot longer as Daddy's lack of fitness began to shine through. He struggled to Addlestone where it was beginning to get dark and rainy and he was quite hungry and tired. Still he managed to solider on and made it home mid afternoon. Good to have done. A sense of achievement.<\/p><img src='images\/years\/2012\/2012_11_25-01-LondonBikeRide.jpg' class='diaryImage' alt='London and back route' \/><p class='diaryImageCaption'>London and back route<\/p>","images":false},"title":{"value":"Bike Ride To London and Back"},"version":5},{"date":{"d":24,"m":11,"y":2012},"datev":20121124,"images":1,"info":{"content":"<p>In the morning we went over to the Sanders household and met Jon and Rachel's new addition to the family, little Emily. She was great only being a few weeks old. We each had a cuddle then made our way down to the garden centre to watch Father Christmas arrive in his sleigh. We waited and waited, then realized that he had come in via a different route so pretty much missed him! Quite a laugh.<\/p><img src='images\/years\/2012\/2012_11_24-01-LucyGlidewelll.jpg' class='diaryImage' alt='Welcome Emily Glidewell' \/><p class='diaryImageCaption'>Welcome Emily Glidewell<\/p><p>We then rushed over to the Sandringham Christmas Fair which was quite manic. Daddy was all prepared as a goalkeeper in the 'Beat The Goalie' stall. However, because the weather was not great, that stall was canned and daddy worked on the raffle table instead. Mummy on the other hand was helping out on the 'decorate a biscuit' table who we shared with our neighbours, the Deach's.<\/p><p>Us children spent loads of money on various nick naks.<\/p>","images":false},"title":{"value":"Santa at Redfields, Meeting Emily Glidewell, Sandringham Christmas Fair"},"version":1},{"date":{"d":18,"m":11,"y":2012},"datev":20121118,"images":1,"info":{"content":"<p>Katie was dropped off at Ma Ma's and met up with the Elders and went horse riding on Tiki.<\/p><p>The rest of us went for a bike ride past Daddy's old house when he was our age and then went to the swings.<\/p><img src='images\/years\/2012\/2012_11_18-01-LocalBikeRide.jpg' class='diaryImage' alt='Bike Ride' \/><p class='diaryImageCaption'>Bike Ride<\/p>","images":false},"title":{"value":"Horse Ride, Bike Ride"},"version":1},{"date":{"d":17,"m":11,"y":2012},"datev":20121117,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Karen, Summer and Alice came over for the day and played. Ben and Daddy were stuck on Civ most of the morning.<\/p><p>Later, they went over to see the Fars quickly, before moving off to Farnborough to pick up Dad's work friend, Michael for the Reading v Everton game. They parked up and made the long walk across the J11 M4 roundabout and onto McDonalds where they had some restaurant food and met up with 'Fat Phil' and his brother in law.<\/p><p>They had tickets in the top corner of the stadium, a pretty good viewing position. Everton dominated the first half and went one - null up, which pleased Michael, the Everton fan. Different story in the second half, Reading recorded their first victory of the season, winning 2-1. Ben loved the game and certainly celebrated when Everton scored.<\/p><p>After rushing home Daddy went over to Uncle Michael's for a poker night.<\/p><p>Katie went over to the Teales and slept the night and also didn't go to bed until 3am in the morning<\/p><img src='images\/years\/2012\/2012_11_17-01-Reading.jpg' class='diaryImage' alt='Ben at the Madjeski' \/><p class='diaryImageCaption'>Ben at the Madjeski<\/p>","images":false},"title":{"value":"Reading v Everton, Teale Sleepover"},"version":3},{"date":{"d":11,"m":11,"y":2012},"datev":20121111,"images":1,"info":{"content":"<p>In the morning we had a double church session. Katie went in her Brownie uniform and Ben in his Beaver's donning Great Granddad's World War II medal, and another Great Grandfather's World War I medals! We were there with Great Grandma.<\/p><p>In the afternoon we went to see the fars who had their friend John Waghorn around. Of course there was a lot of life in the children which was so nice to sit back and see them all in full flow.<\/p><img src='images\/years\/2012\/2012_11_11-07-Rememberance.jpg' class='diaryImage' alt='Medal Of Honour' \/><p class='diaryImageCaption'>Medal Of Honour<\/p>","images":false},"title":{"value":"Remembrance Parade, Fars"},"version":1},{"date":{"d":10,"m":11,"y":2012},"datev":20121110,"images":1,"info":{"content":"<p>After mummy failed to secure some Christmas presents in Camberley it was up to Daddy to get them on his bike ride to Guildford and back. Another 20+ miles under the belt.<\/p><p>Auntie Charlotte had stayed the night and returned back home as she and Luke were off to a ball in Birmingham.<\/p><p>We hadn't been swimming for a long while as a family and Jessica's only exposure is when we as a family go. The usual cocktail of crocodiles, throwing, teasing and general mucking about was served up. We had gone to the baths at Farnborough.<\/p><p>In the evening we joined Farmor and Auntie Susan for Ravenscotes firework night. It was possibly the longest firework display we had ever seen. It was very good and we were packed with a flask of soup. We preceeded this with a session with some sparklers.<\/p><img src='images\/years\/2012\/2012_11_10-13-Fireworks.jpg' class='diaryImage' alt='Sparklers' \/><p class='diaryImageCaption'>Sparklers<\/p>","images":false},"title":{"value":"Guildford Bike Ride, Swimming, Fireworks"},"version":1},{"date":{"d":4,"m":11,"y":2012},"datev":20121104,"images":1,"info":{"content":"<p>The day did not start well. It rained heavily which flooded the underside of Frimley Green railway bridge. Other cars passed the bridge successfully, but because of previous damage to the car the guard which protects the engine from the wheels had been removed. Therefore when Mummy drove through the deep puddle, the water covered the engine to such an extent it killed the engine and were not able to start the car again..... for 3 days! The girls were able to walk to church. In the afternoon Simon came out with a mate to push the car into Frimley Lodge Park.<\/p><p>Meanwhile the boys joined Howard, Susan and Pop Pop and went banger car racing at Arena Raceway, Essex. We arrived nice and early. As it had been raining hard the ground was extremely slippery and muddy. There were plenty of casualties, no one came back mud-free. That coupled with the lack of dustbins made for a very untidy environment. Still you'd expect nothing more.<\/p><p>To the racing. The usual mixture of big American cars, limos, hearses and of course the Robins. The ambulance didn't make an appearance which was out of the norm. There were some great smashes. We visited the muddy pits once which was excellent as we could see the cars up close. Ben enjoyed himself and wants to go again next year.<\/p><img src='images\/years\/2012\/2012_11_04-02-FirecrackerXXI.jpg' class='diaryImage' alt='Banger Roller Ben' \/><p class='diaryImageCaption'>Banger Roller Ben<\/p>","images":false},"title":{"value":"Car Engine Flooded - Firecracker XXI"},"version":1},{"date":{"d":3,"m":11,"y":2012},"datev":20121103,"images":2,"info":{"content":"<p>Yesterday, we finally went over to see Charlotte's new flat that she is renting in the heart of Gloucester. It's a lovely converted warehouse with wooden beams and lovely setting right by the docks. We arrived late afternoon, and after some fun with lost car keys we trundled to the shops for a spot of Christmas shopping and to get some food in. We all snuggled in the evening and watched the film 'Homeward Bound'.<\/p><img src='images\/years\/2012\/2012_11_03-02-GloucesterCharlotte.jpg' class='diaryImage' alt='The Old Warehouse Where Charlotte Lives' \/><p class='diaryImageCaption'>The Old Warehouse Where Charlotte Lives<\/p><p>We awoke quite late for us and went out to see the market and shops in the city centre for yet for present shopping. It was quite a chilly day but managed to meet up with Luke and Duke in Gloucester Park for some fun on the playground.<\/p><img src='images\/years\/2012\/2012_11_03-12-GloucesterCharlotte.jpg' class='diaryImage' alt='Dockers' \/><p class='diaryImageCaption'>Dockers<\/p>","images":false},"title":{"value":"Visiting Charlottes New Flat"},"version":1},{"date":{"d":31,"m":10,"y":2012},"datev":20121031,"images":2,"info":{"content":"<p>Oliver was picked up in the morning and Katie returned from her sleepover at Natasha's. Paula and Claire Huggets came over for coffee and a play then the Elders came over for our traditional trek around friends and family for trick or treating. All the 'treaters' were Paula, The Fars, Great Grandma, Uncle Howard, The Strangles, Uncle Richard, Uncle Peter and the neighbours opposite us. Joey and Lily stayed the night.<\/p><img src='images\/years\/2012\/2012_10_31-07-Halloween.jpg' class='diaryImage' alt='The Scary bunch' \/><p class='diaryImageCaption'>The Scary bunch<\/p><img src='images\/years\/2012\/2012_10_31-27-Halloween.jpg' class='diaryImage' alt='Jessie and Peter' \/><p class='diaryImageCaption'>Jessie and Peter<\/p>","images":false},"title":{"value":"Halloween With The Elders"},"version":1},{"date":{"d":30,"m":10,"y":2012},"datev":20121030,"info":{"content":"<p>We left Ma Ma and Pop Pop and went over to the Burrows residence for a play. Daddy meanwhile went to Ikea and other shops to get Mummy some Christmas presents. Helen I think was pleased not to have children after seeing the chaos caused by all the children!<\/p><p>When we returned home, Daddy immediately went up to St. Georges with Farmor to collect Farfar from hospital. He was deemed well enough to leave. Although it may seem quite early and Farfar requiring a lot of help and attention it's all stuff that can be done at home. Also research suggests that recovery is quicker at home. There is a mountain of drugs, so we colour coded them all and drew up a chart to say what was to be taken at what time of day.<\/p><p>Farfar is feeling OK generally. He has a large scar up his left leg from ankle to groin and one from his neck to stomach. Quite a sight. Sometimes he gets quite a bit of pain which can be controlled with paracetamol.<\/p><p>In the later afternoon Katie was dropped off at the Kelley household for a sleepover.<\/p>","images":false},"title":{"value":"Farfar Out Of Hospital, Meet Fi and Helen"},"version":1},{"date":{"d":29,"m":10,"y":2012},"datev":20121029,"images":2,"info":{"content":"<p>We went over to Kent to Braditch Farm with Ma Ma. An increasingly popular Halloween event occurs annually where there are a number of scary activities for the children. It wasn't cheap mind. We first went on the corn-blaster, then on the maze. Ma Ma took us in to the very scary Haunted House. There were rooms which were pitch black and silent. Then all of a sudden a loud banging noise came all around us. It was too much for Katie and she cried her eyes out. Next up was the adventurous tractor ride with various props posted all along the route.<\/p><p>In the evening Daddy and Pop Pop went to visit Farfar in hospital.<\/p><img src='images\/years\/2012\/2012_10_29-01-BroadditchFarm.jpg' class='diaryImage' alt='The Corn Blaster' \/><p class='diaryImageCaption'>The Corn Blaster<\/p><img src='images\/years\/2012\/2012_10_29-16-BroadditchFarm.jpg' class='diaryImage' alt='Katie Enjoying The Tractor Ride' \/><p class='diaryImageCaption'>Katie Enjoying The Tractor Ride<\/p>","images":false},"title":{"value":"Braditch Farm"},"version":1},{"date":{"d":27,"m":10,"y":2012},"datev":20121027,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Mummy and Daddy, due to their health issues, went down for a flu jab down at the doctors. Daddy didn't feel a thing. Mummy almost cried like a baby and almost crushed poor Ben's hand.<\/p><p>Later we dropped Jessica off for a Halloween Party at the Baptist church in Frimley Green. She is mad. She had a great time. After, Daddy and Jessica took Farmor to the railway station so she could visit Farfar in hospital.<\/p><p>In the evening we had the usual Strictly mayhem. Ben in a dress! Mummy went out for a house warming party and came back drunk.<\/p><img src='images\/years\/2012\/2012_10_27-21-StrictlyComeDancing.jpg' class='diaryImage' alt='Dead People Dance' \/><p class='diaryImageCaption'>Dead People Dance<\/p>","images":false},"title":{"value":"Jessica Halloween Party - Flu Jab"},"version":2},{"date":{"d":23,"m":10,"y":2012},"datev":20121023,"info":{"content":"<p>Farfar went yesterday to St. Georges hospital in preparation for today's operation. It was a 4 hour morning affair. He went through as well as can be expected and is recovering. He first complained to the doctors of chest pains in January or February. It is good he has something done about it now.<\/p>","images":false},"title":{"value":"Farfar Triple bypass"},"version":1},{"date":{"d":20,"m":10,"y":2012},"datev":20121020,"images":1,"info":{"content":"<p>We went along with Mummy and helped at the church fair. We ran the Teddy Tombola and sold out quickly which was rather good. We also had £3 each to spend on what we liked.<\/p><p>Meanwhile Daddy went over to Godalming and parked up next to a fast-ish flowing River Wey. A unauthordoxed entry by Bridge Street and a slop through the park in the town. Very quickly the railway bridge is reached where the river flows very fast. Almost enough for Daddy not to get through. This was to set the tone as the journey through the rapids was not totally under control. All Daddy thought of was, Is My Kit Going To Get Wet Today? Next 100 yards and a wier. Surveying the situation Daddy decided to decamp and drag the kayak 50 yards past. He then meandered upstream to Eashing passing some difficult bits on the way. There was plenty of logs, debris, bushes and over hanging branches all in there to make a challenge. Once Eashing was reached, a quick bite to eat and the downhill ride back! This was the most difficult as it was hard to control the kayak downstream, slaleming through the obstacles. The final bit were those rapids back in Godalming. Daddy even dumped his bag of goodies just in case he was going to turn the craft over again. However, it was not as bad as he thought and navigated through successfully. A good test.<\/p><p>In the evening we had a very well behaved Georgia over to play and stay the night. Daddy finally had to go down at midnight and ask the girls to go to sleep. Of course in their den downstairs. They played Barbie, Barbie, Barbie!<\/p><img src='images\/years\/2012\/2012_10_20-03-GodalmingKayak.jpg' class='diaryImage' alt='Cross country kayaking' \/><p class='diaryImageCaption'>Cross country kayaking<\/p><locations><location>3<\/location><location>24<\/location><\/locations>","images":false},"title":{"value":"Church Fair, Kayaking the Wey, Georgia Sleepover"},"version":1},{"date":{"d":14,"m":10,"y":2012},"datev":20121014,"first":{"value":null},"info":{"content":"<p>Nothing too eventful today other than when Daddy went through Ben's homework with him. Mummy had already given up. Anyway Ben had to produce a dictionary of terms to do with shapes that he is currently learning. He was adament in including a square based pyramid and a hexagonol prism! Now daddy got the square based pyramid, but failed on the prism. Not only did he initially draw the shape incorrectly, no need for Google when you have Ben at your side. When it came to listing the number of faces, edges, vertices, Ben was on the button without even looking at the shape. Daddy got it wrong even looking at the shape. We checked Google and of course clever cloggs Ben got it right. Daddy relagated, Ben promoted.<\/p>","images":false},"title":{"value":"Ben beats Daddy at his maths homework!"},"version":4},{"date":{"d":13,"m":10,"y":2012},"datev":20121013,"info":{"content":"<p>Katie still away on Brownie Camp. We sort of had a quiet day planned. Steve and Eva popped in which was a nice surprise to give Jessica a belated birthday present. It was £15 in cold, hard cash. Just how Jessica likes it. She has already spent it on 'build-a-bear' stuff! Steve was contemplating sending Eva to private school. I think we left him confused enough for him to be even more undecided.<\/p><p>After lunch we went over to the Tremears to drop off Graham's 35th birthday present and have a cup of tea. Auntie Susan had only just come in from a bike ride. Jessica was well into playing with the cats.<\/p><p>Later in the afternoon Peter, Ma Ma, Pop Pop and the Elders came over and experienced an attempt on æbleskiver from Daddy.They didn't turn out quite right, however they were edible.<\/p>","images":false},"title":{"value":"Visiting and Visitors: Steven, Eva, Peter Barnett, Mr and Mrs Weston, Joey, Lily and Ellie Elder and Mr and Mrs Tremear"},"version":1},{"date":{"d":12,"m":10,"y":2012},"datev":20121012,"images":2,"info":{"content":"<p>Katie joined her friends for a pamper Brownie Camp, whatever one of those is! Anyway she took clothes for a fashion show, was going to be doing grass sledging and loads of other things. She really looked forward to it.<\/p><p>Meanwhile the rest of us joined in a surprise party for Duncan. He's 40. It was good to catch up, and nice to see Ben getting into the rock mood. First wearing the Jon Bon Jovi wig, then treating us to some air guitar on stage. Good to see Stu again.<\/p><img src='images\/years\/2012\/2012_10_12-05-Duncans40th.jpg' class='diaryImage' alt='Ben Jovi' \/><p class='diaryImageCaption'>Ben Jovi<\/p><img src='images\/years\/2012\/2012_10_12-07-Duncans40th.jpg' class='diaryImage' alt='Let's Rock' \/><p class='diaryImageCaption'>Let's Rock<\/p>","images":false},"title":{"value":"Katie at Brownie Camp, Duncan's 40th Birthday"},"version":1},{"date":{"d":7,"m":10,"y":2012},"datev":20121007,"info":{"content":"<p>Ben's best friend Oliver Stroud (aka Strangle) had his birthday treat today and Ben was the only friend invited to accompany his family to Legoland. I think we must be theme parked out after this summer! Anyway Ben shared every ride with Oliver and they really are close, good friends. It was a bit embarrassing as Ben had not managed to make the toilet on one occassion.<\/p><p>Meanwhile the girls after church went to Jessica's friend's birthday party, Oliver over at the softplay in the centre of Camberley. They of course had a good time there, especially as they had to cycle and catch a bus to get there.<\/p><p>The reason for the transport issues is that due to a re-schedule of Daddy's bike ride, which needn't have been re-scheduled in the end. Still never mind. Daddy joined his friend Nick on a 30 mile bike ride around through country lanes around Phoenix Green, Basing and Upton Grey.<\/p>","images":false},"title":{"value":"Two Olivers Birthday's, 30 mile bike ride"},"version":1},{"date":{"d":6,"m":10,"y":2012},"datev":20121006,"images":1,"info":{"content":"<p>We headed to Gunnersbury and caught the tube to Aldgate East where our Markets walk began. We meandered through some old London streets with buildings which seemed to have survived the bombing during the war. Trying to imagine if that is the type of housing our ancestors who were from the area lived in.<\/p><p>We ate lunch early on outside Spitalfields Market which had a lot of retro furniture and clothing. Somewhere Auntie Charlotte would like as she is into all that at the moment. After looking at the market, which Mummy was not too impressed with, we continued to Brick Lane and all it's restaurants. Ben was on top toilet form. On the way back on the tube he first needed the toilet whilst we waited at Mansion House, so Daddy took him back up the station whilst the girls made their way back. After finding somewhere (I am not mentioning where as it is too embarrassing, needless to say he was hopping) the boys followed in the tube behind the girls. Then at Gloucester station we had to get off again as Ben needed a second widdle!! Burger King to the rescue. If that was not enough 10 minutes later as we exited Gunnersbury the Benny Wee Wee Dance manifested and again the side of an office block got a sprinfling. 3 times in half an hour!! He's a doughnut.<\/p><p>In the evening Mummy went off to Rachel's babyshower over at Karen's house. Katie meanwhile went to Grace's house for a sleepover in Darby Green.<\/p><img src='images\/years\/2012\/2012_10_06-09-SpitalfieldsMarket.jpg' class='diaryImage' alt='Katie at Spitalfields Market' \/><p class='diaryImageCaption'>Katie at Spitalfields Market<\/p>","images":false},"title":{"value":"Walk 39: London Markets, Katie sleepover"},"version":1},{"date":{"d":30,"m":9,"y":2012},"datev":20120930,"images":2,"info":{"content":"<p>We awoke and Ma Ma and Pop Pop's at a sensible hour and ventured over to the Isle Of Sheppey for another of the entries in our walks book. Seeing it was a 6 mile plus walk we decided to take our bikes. Of course Jess being on hers this was going to be a test. Although the weather was not too bad, it was pretty windy across the flat marshes at Elmley, a RSPB place. We took a wrong turning on our way and ended up near the new bridge at a dead end where some gypsys were based, complete with caravans, white vans, lots of kids, and a dawg! The man wasn't very friendly when asking for directions.<\/p><p>We trooped along the path, just to the north of the River Swale. We didn't do much bird watching, but when we were in one of the hides we did hear a flock of birds (I wish I could be more specific but I'm no good at spotting the type) squawking their way across the sky. The trek for the children was about survival on the bikes and who was fastest. After a mile and a half Jessica was first to succumb to giving up, and hopped onto Daddy's bike who gave her a crossbar trip for the rest of the afternoon. Meanwhile Ben fell off his bike countless times, that goes without saying.<\/p><img src='images\/years\/2012\/2012_09_30-51-ElmleyMarshes.jpg' class='diaryImage' alt='Survivors Photo' \/><p class='diaryImageCaption'>Survivors Photo<\/p><img src='images\/years\/2012\/2012_09_30-40-ElmleyMarshes.jpg' class='diaryImage' alt='Ma Ma Pedaling' \/><p class='diaryImageCaption'>Ma Ma Pedaling<\/p><p>Not all completed the course, but everyone made a good effort. It was nice to get out and blow the cobwebs away and breathe some fresh air.<\/p>","images":false},"title":{"value":"Walk 38: Elmley Marshes (Isle Of Sheppey) Ride"},"version":1},{"date":{"d":29,"m":9,"y":2012},"datev":20120929,"images":2,"info":{"content":"<p>For Mummy's wedding anniversary present she received Family Stand tickets for Charlton v Blackburn, something she was very excited about. Only Ben has been to a big match before so it was new to us girls. We parked up at Slade Green and caught the train in. We stopped in the expensive club shop and walked by the main entrance to soak in some of the atmosphere. 17,000 others were there and the noise really kicked in at kick off. There were drums and not much in the way of bad language either which was pleasing and a bit of a concern before hand.<\/p><p>The game started relatively slowly with not much to report in terms of goalmouth incident. Us children flipped in bouts of concentration in the match but generally enjoyed themselves. The game ended 1-1 with some exciting bits. Katie has asked if she can go again. Ben still prefers to watch Reading.<\/p><p>After we got the busy train back and ended up at Ma Ma and Pop Pops and had fish and chips.... well without the fish, but you know what I mean.<\/p><img src='images\/years\/2012\/2012_09_29-02-CharltonVBlackburn.jpg' class='diaryImage' alt='At the Valley' \/><p class='diaryImageCaption'>At the Valley<\/p><img src='images\/years\/2012\/2012_09_29-11-CharltonVBlackburn.jpg' class='diaryImage' alt='In the Valley' \/><p class='diaryImageCaption'>In the Valley<\/p>","images":false},"title":{"value":"Charlton V Blackburn"},"version":1},{"date":{"d":23,"m":9,"y":2012},"datev":20120923,"info":{"content":"<p>The weather was awful today. It was rainy and blustery which put pay to our trip to London much to the childrens' delight. We had a jobs and clearing up day, but we did manage to play some games. The 'puzzle' challenge was won by Ben and Mummy who beat Daddy and Katie 3-0. We did three puzzles and timed how long each one took.<\/p><p>Daddy looked at the budget, specifically at the monthly expenses:<\/p><ul><li>Mortgage:          £455<\/li><li>Laura Expenses:    £600<\/li><li>Martin Expenses:   £260<\/li><li>Council Tax:       £155<\/li><li>Estate Mgt:        £ 25<\/li><li>Electric, Gas:     £ 92<\/li><li>Phone:             £ 34<\/li><li>Life Insurance:    £ 15<\/li><li>House Insurance:   £ 15<\/li><li>Water:             £ 19<\/li><li>TV License         £ 10<\/li><li>Car, Mbike Tax:    £ 22<\/li><li>Car Insurance:     £ 21<\/li><li>Motorbike Ins:     £ 14<\/li><li>Car, Mbike Service:£ 40<\/li><li>Scouts:            £  6<\/li><li>Brownies:          £  6<\/li><li>Trampoline:        £ 16<\/li><li>Judo:              £ 11<\/li><li>RNIB:              £  3<\/li><li>=======================<\/li><li>TOTAL:            £1819<\/li><\/ul>","images":false},"title":{"value":"At home"},"version":1},{"date":{"d":22,"m":9,"y":2012},"datev":20120922,"info":{"content":"<p>We split today, the girls getting free tickets with the Kelley's to Paultons Park. There were not that many people in, so queues were low and we had loads of go's on things.<\/p><p>Meanwhile the boys went on a bike ride to the library, then on to the Fars for lunch. In the afternoon they joined the Fars on a trip to Chertsey. Before the football match, Daddy and Ben went in the swimming pool in Chertsey. Ben managed 5 lengths back stroke and did well on his front as well. Most impressive. We also sampled the delights of the jacuzzi and the sauna. The first time in both. We then moved on to watch the football at Alwyns Lane and we even spent a while playing around the back ourselves. They then went on a mystery tour led by Ben on the bikes back home from Richmond Close.<\/p><p>During the week Ben has had a spate of weeing incidents at night. He's kept the bed dry, but mummy's leg and the landing have not escaped!<\/p>","images":false},"title":{"value":"Paultons Park, Chertsey Football and Swim"},"version":1},{"date":{"d":16,"m":9,"y":2012},"datev":20120916,"info":{"content":"<p>We went to the Moscow State Circus with the Fars, leaving Mummy and Daddy to cycle to Farnborough for a spot of shopping and a trip to the coffee shop. Ahhh relazing.<\/p>","images":false},"title":{"value":"Moscow State Circus"},"version":1},{"date":{"d":15,"m":9,"y":2012},"datev":20120915,"images":2,"info":{"content":"<p>We went to Legoland with Ellie, Lily, Joey, Ma Ma and Pop Pop and had a great time<\/p><img src='images\/years\/2012\/2012_09_15-29-Legoland.jpg' class='diaryImage' alt='On the pirate ship' \/><p class='diaryImageCaption'>On the pirate ship<\/p><img src='images\/years\/2012\/2012_09_15-37-Legoland.jpg' class='diaryImage' alt='In front of the castle' \/><p class='diaryImageCaption'>In front of the castle<\/p>","images":false},"title":{"value":"Legoland"},"version":1},{"date":{"d":10,"m":9,"y":2012},"datev":20120910,"first":{"value":null},"info":{"content":"<p>Mummy started her first day at work as a preschool teachers assistant. It was an afternoon session lasting 3 hours. She enjoyed herself and fortunately there were only 3 children and 4 teachers! Luckily the mix up on references finally sorted themselves out.<\/p><p>Both Jessica and Ben were taken out for their birthday treats to Build A Bear which is definately flavour of the month. They got some bears and accessories. Thanks Auntie Charlotte.<\/p>","images":false},"title":{"value":"Mummy's First Day At Work - Build A Bear"},"version":3},{"date":{"d":9,"m":9,"y":2012},"datev":20120909,"images":1,"info":{"content":"<p>Jessica decided she wanted a butterfly birthday party, much in the style of Ben's lego party. We had 10 friends of hers who came for the midday start. They included a mixture of old playschool friends who are now at different schools, Natasha Burrows and Lily Elder.<\/p><p>Fortunately the weather was good so we were able to host it mainly in the back garden. We started with hunt the butterflies in the garden, followed by various simple butterfly related games. Food time and a fatal mistake was made. Melted chocolate with choice of dips. Unfortunately there were many pretty dresses which were dipped in the chocolate. Oops.<\/p><p>Fiona and the Elders stayed on to see Jessica open her presents which were a range from moon sand, dollies, dolly clothing and jacket. She had a good time.<\/p><img src='images\/years\/2012\/2012_09_09-05-JessicaBirthdayParty.jpg' class='diaryImage' alt='Party in the back garden' \/><p class='diaryImageCaption'>Party in the back garden<\/p><p>Meanwhile Katie was taken for a belated birthday treat to Thorpe Park. She had a wicked time. She came back soaked. The queues were long. Almost would try all rides. Auntie Charlotte stayed over the night.<\/p>","images":false},"title":{"value":"Jessica's 5th Birthday Party - Katie to Thorpe Park"},"version":1},{"date":{"d":8,"m":9,"y":2012},"datev":20120908,"first":{"value":null},"images":2,"info":{"content":"<p>Katie was dropped off at Grandma's where she was scooped up by Ma Ma and Pop Pop to go over to Gloucester to spend a weekend with Auntie Charlotte. They went shopping and then had fish and chips in the evening and slept in Auntie Charlottes new flat.<\/p><p>Meanwhile the rest of us dropped off Daddy who met up with Nick for their epic, 85 mile bike ride from Kempton Park to Southampton. It was quite a hot day for September, near the mid 20's celsius. Nick had all the gear and the idea, whilst Daddy went on his mountain bike and although he has trained he's not even done half that distance in his practice runs.<\/p><p>Anyway the ride started off well and they stopped after 35 miles where the Fars had a supply of raspberries and cold milk! They followed them for a while, of course attempting to take photos but failing miserably. Soon Michael joined in at Farnham and then Tino at Binstead where we stopped and all met up for a spot of lunch. Then there were hills. Alot of hills, all up of course.<\/p><img src='images\/years\/2012\/2012_09_11-00-LondonToSouthamptonBikeRide.jpg' class='diaryImage' alt='The vital stats and route' \/><p class='diaryImageCaption'>The vital stats and route<\/p><p>There was some lovely countryside. The last 5 miles or so we were getting into the suburbs of Southampton where the four split up. Nick racing ahead and Daddy getting lost and getting cramp.<\/p><p>Daddy found his way again and partnered Tino over the Itchen bridge and rolled into Hoglands Park. It was not quite Brighton, but there were a few clapping us in. Mummy was there to take the boys back to Alton. A nice ride.<\/p><img src='images\/years\/2012\/2012_09_11-01-LondonToSouthamptonBikeRide.jpg' class='diaryImage' alt='The boys after they finished 80 miles' \/><p class='diaryImageCaption'>The boys after they finished 80 miles<\/p><wesaws><wesaw>105<\/wesaw><wesaw>106<\/wesaw><wesaw>107<\/wesaw><wesaw>108<\/wesaw><wesaw>109<\/wesaw><wesaw>302<\/wesaw><wesaw>306<\/wesaw><\/wesaws>","images":false},"title":{"value":"London To Southampton Bike Ride, Katie to Auntie Charlotte's"},"version":4},{"date":{"d":5,"m":9,"y":2012},"datev":20120905,"first":{"name":"jessica","value":"First day at school"},"images":1,"info":{"content":"<p>All three of us had our first day at school today. Jessica was to start at Sandringham in her green uniform, Ben moves up to Frimley C of E. The prospect of going to school didn't really excite the two eldest, and Jessica just took it all in her stride, a little nervous, but I think the lure of being seen to be a big girl and learn like her two older siblings negated any bad thoughts.<\/p><p>Both Mummy and Daddy took us all to school. Jessica joined other older children for a three hour session. She was led to her classroom where she played for the first day. Mummy cried a little. End of another era.<\/p><p>Come hometime it was hard to get anything out of any of the children. After we cycled home, we explored what was put in the school bags. Jessica had her first book. No words, just following a story in pictures. She also had four keywords to learn to read: A, And, Is, Dad.<\/p><p>She was keen to start learning them. Mummy will ensure this will be practiced every day just like with Katie and Ben. Jessica came out quite tired we think or overwhelmed. She was pretty quiet.<\/p><p>Katie and Ben had good first days. Ben has already been told not to keep putting his hand up to answer the questions the teacher poses.<\/p><img src='images\/years\/2012\/2012_09_05-05-FirstDayAtSchool.jpg' class='diaryImage' alt='Back to school' \/><p class='diaryImageCaption'>Back to school<\/p>","images":false},"title":{"value":"Back to school"},"version":1},{"date":{"d":2,"m":9,"y":2012},"datev":20120902,"info":{"content":"<p>We had a Danish lunch over at the Fars. Plenty of fish and cold meat. Other than Daddy, we didn't go too close to that of course. Auntie Susan and Graham were also there. Farfar prepared a good treasure hunt for us where we found lots of sweets and money. Oh it was also Mummy and Daddy's 12th wedding aniversary.<\/p>","images":false},"title":{"value":"Fars Lunch"},"version":1},{"date":{"d":1,"m":9,"y":2012},"datev":20120901,"images":1,"info":{"content":"<p>We had the Dixons come over for our annual meet and accompanying BBQ. We went for a walk over to the Army swings which looked untidy as ever. Ma Ma and Grandma also popped by. Yasmin played well with everyone, whilst Reuben was hot for the train tracks.<\/p><img src='images\/years\/2012\/2012_09_01-10-Dixons.jpg' class='diaryImage' alt='Playing with Dixons in the playground' \/><p class='diaryImageCaption'>Playing with Dixons in the playground<\/p>","images":false},"title":{"value":"Dixons Over"},"version":1},{"date":{"d":27,"m":8,"y":2012},"datev":20120827,"info":{"content":"<p>Today was home day. Mixed emotions as we'd enjoyed our holiday, but wanted to sleep in our own beds. We decided to go to Clare Castle Country park which was way out in the sticks. Mummy and Daddy had their first argument, which overall can be classed as a successful holiday. Holiday's success are now measured in number of arguments, and one in 7 days isn't bad going. Anyway hopefully mummy won't keep brushing against hedges at 40mph now!<\/p><p>The town of Clare was very quaint, olde worlde and a place to show off to a tourist. We went to the close by country park for a short walk, a visit to it's ruined castle and off course more time trialing in the playground. A feature born from this holiday I think.<\/p><p>We got back home by about 3pm, decamped from the car and got into sorting stuff out mode. The holiday was over. Another goody, and again would look to Travelodge around an area for our next holiday. It suits what we like in our holidays.<\/p>","images":false},"title":{"value":"Eastern Holiday: Clare Castle Country Park"},"version":1},{"date":{"d":26,"m":8,"y":2012},"datev":20120826,"images":4,"info":{"content":"<p>We travelled north past Diss and on to Bressingham Steam. Farfar was envious as he stated there were 6 different gauges (track width) of railway there. The enthusiasm didn't really spread to the girls. We travelled through the woods on a number of the steam trains which was very nice. Each trip lasting 10 or 15 minutes.<\/p><p>There were some nice gardens there, which is not our cup of tea generally, but it was a pictureque landscape. One of the best bits of the place was the exhibition centre where there were shops set in the 40's and the Dad's Army museum.<\/p><p>After leaving we spent a bit of a wild goose chase looking for the Horse Sanctuary which looked really good.... if it was open. Instead we shifted down to Thetford Forest and went to it's excellent park.<\/p><p>We almost didn't go in as it was quite expensive for parking. However, when we did go in it was packed and the charges were justified as there was excellent play equipment for the kids hidden in the forest. One section had loads of musical apparatus. It was on a par with Bewilderwood but £60 cheaper! We spent two hours playing there. It had play equipment that we've not seen before. I think we've become experts in this now. It's what the children like doing best.<\/p><p>Time was marching on so we made it down to Mildenhall for our hotel and trip into Little Chef.<\/p><img src='images\/years\/2012\/2012_08_26-23-EasternHoliday-Day7-BressinghamSteam.jpg' class='diaryImage' alt='Ben driving St Christopher' \/><p class='diaryImageCaption'>Ben driving St Christopher<\/p><img src='images\/years\/2012\/2012_08_26-33-EasternHoliday-Day7-BressinghamSteam.jpg' class='diaryImage' alt='Kids Army' \/><p class='diaryImageCaption'>Kids Army<\/p><img src='images\/years\/2012\/2012_08_26-41-EasternHoliday-Day7-BressinghamSteam.jpg' class='diaryImage' alt='Daddy and Eldest Daughter in the gardens' \/><p class='diaryImageCaption'>Daddy and Eldest Daughter in the gardens<\/p><img src='images\/years\/2012\/2012_08_26-12-EasternHoliday-Day7-BressinghamSteam.jpg' class='diaryImage' alt='Forest' \/><p class='diaryImageCaption'>Forest<\/p>","images":false},"title":{"value":"Eastern Holiday: Bressingham Steam, Thetford Forest Park"},"version":1},{"date":{"d":25,"m":8,"y":2012},"datev":20120825,"images":1,"info":{"content":"<p>We headed south and today's destination was a new one, a zoo we've not visited before at Banham. The weather was a bit iffy, however, we felt that there was not many people there, especially for a Saturday during the summer holidays. I hope the zoo is doing alright. Another £60 or so pounds worth of entrance fees. It's expensive stuff kids and going out eh?<\/p><p>We wandered about looking at the animals. The best bits were the talks and shows we went to. The birds of prey talks and demos were fantastic, made twice as good by the presenters. We saw the Harris Hawk and Falcon, Eagle, and even 7 vulchers. They were agressive. The presenter said we should be sympathic with the animals and that they unfairly get a bad press. We all eat dead meat.<\/p><p>We then saw another animal show and both Mummy and Daddy now love the armadillo. The ran across the stage a couple of times. He had diddy legs and he was suprisingly fast. We saw the tiger very close up, monkies, giraffes, the usual zoo fair.<\/p><p>We made it to our hotel in the evening, then went out to Needham Market and ate fish and chips by the lake and playground. Very nice sunset before returning back and another epic game of Binweevil Top Trumps. Ben is the champion at this, and knows most of the card values off by heart.<\/p><img src='images\/years\/2012\/2012_08_25-09-EasternHoliday-Day6-BanhamZoo.jpg' class='diaryImage' alt='Wind your neck in' \/><p class='diaryImageCaption'>Wind your neck in<\/p>","images":false},"title":{"value":"Eastern Holiday: Banham Zoo, Needham Market"},"version":1},{"date":{"d":24,"m":8,"y":2012},"datev":20120824,"images":3,"info":{"content":"<p>Bewilderwood was a reasonably new attraction set in the woods near Wroxham. It's basically a suped-up playground with slides, 3 man swings, zip wires, climbing frames that scale up in to the trees. We started with a little boat ride through the marsh to reach the main bits. The kiddies loved the slides the most. They were made from plastic, with low friction, which meant high speeds. You could see they were a little scared going down on the first few gos. Again Jessica was well in there going on with the big boys.<\/p><p>We had lots of competitions going on the apparatus, mainly time trials. Of course Ben fell off a few times which caused a some tears. He also got grumpy with himself when he didn't win. He gets quite compeititve ensuring fair play. Later in the afternoon there was an area in the woods where you could build your own den out of sticks that were scattered around. A challenge for Daddy and us kiddies. Mummy had a little sleep. So king bodge and his collection of sticks. A camp was made but you had to be careful that you didn't sneeze too close. It was strudy enough for us to play in at least for a bit. We got our photos and then trashed it before others did, as those scavengers wanted our sticks.<\/p><img src='images\/years\/2012\/2012_08_24-62-EasternHoliday-Day5-Bewilderwood.jpg' class='diaryImage' alt='Slipery Slope' \/><p class='diaryImageCaption'>Slipery Slope<\/p><img src='images\/years\/2012\/2012_08_24-84-EasternHoliday-Day5-Bewilderwood.jpg' class='diaryImage' alt='Our Den' \/><p class='diaryImageCaption'>Our Den<\/p><p>We finished up late afternoon and returned to our base in Norwich before walking into the city centre to get some food. The trouble is that we have been eating out every evening and it normally involved chips and grease. So we all agreed on an Italian. Daddy refused Pizza Hut, snob! Well yes, the experience from 4 days ago has put him off with screaming kids, dirty toilets and worries of quality and hygine. Other than that it's fine. Instead we went to an Italian Restaurant at the top of town. At first we were the only customers which was nice as we didn't have to worry about the awful table manners of the children.<\/p><p>Daddy, Ben and Katie were thinking about going to the evening Banger Car Racing in Swaffham, however they ran out of time. Instead we all leisurely made our way back to our hot hotel room for bath and bed.<\/p><img src='images\/years\/2012\/2012_08_24-11-EasternHoliday-Day5-Bewilderwood.jpg' class='diaryImage' alt='Norwich City Centre' \/><p class='diaryImageCaption'>Norwich City Centre<\/p>","images":false},"title":{"value":"Eastern Holiday: Bewilderwood"},"version":1},{"date":{"d":23,"m":8,"y":2012},"datev":20120823,"images":3,"info":{"content":"<p>We had a short trip down to Lowestoft for our next Theme Park of Pleasurewood Hills. Thinking about it, we've done quite a few theme parks in our time. Of course all the popular ones around our way, but quite a few out of the area. Some of the not so well known ones. This is one of those. There was a smattering of rollercoasters and other fairground type rides. There was plenty to fill a day and even better Jessica could join in quite a bithaving reached over 1 metre in height. In fact Katie is 1.32m, Ben is 1.22m and Jessica 1.03m.<\/p><p>Jessica's favourite ride was the traditional Pirate Ship where she kept her hands off the rails when it was at its highest! She along with mummy also enjoyed the Grass In The Snake rollercoaster. We also loved the 'Flying Like Superman Ride' which is one we not seen before. Your caged in lying down on your tummy and then the ride spins around, going up and down. The other favourite was the dinghy down a massive slide ride.<\/p><p>The most stand out features of today however were the sideshows. The one in the morning was the seal show with all the normal tricks like balancing and juggling balls, splashing the kids and all that. It was presented in a very good way. The show in the afternoon was performed in a theatre and was absolutely excellent. Sean Alexander has performed on Britain's Got Talent, he was an illustionist and performed these fantastic tricks. We were left thinking, 'how did he do that?'. It was very professional, I can see him making the Tele one day.<\/p><p>Overall you can never go wrong with a theme park we all had a good day. We stopped off in Oulton Broad for some din dins, then ventured into Norwich City Centre for our night's stay. Dadddy didn't get much sleep as he had a really bad back.<\/p><img src='images\/years\/2012\/2012_08_23-02-EasternHoliday-Day4-PleasurewoodHills.jpg' class='diaryImage' alt='This Rollercoaster is no match for Katie' \/><p class='diaryImageCaption'>This Rollercoaster is no match for Katie<\/p><img src='images\/years\/2012\/2012_08_23-22-EasternHoliday-Day4-PleasurewoodHills.jpg' class='diaryImage' alt='Seal show' \/><p class='diaryImageCaption'>Seal show<\/p><img src='images\/years\/2012\/2012_08_23-25-EasternHoliday-Day4-PleasurewoodHills.jpg' class='diaryImage' alt='Let's fly' \/><p class='diaryImageCaption'>Let's fly<\/p>","images":false},"title":{"value":"Eastern Holiday: Pleasurewood Hills"},"version":1},{"date":{"d":22,"m":8,"y":2012},"datev":20120822,"images":4,"info":{"content":"<p>We were up and about early and managed to make our first destination, Flatford by 9am. We were on the Dedham Vale walk which takes in Constable's country, the scene of the Haymaker. Mummy is losing confidence on our excellent walks book. With the phone now we can track the length of the walk and compare it to what it says. We always seem to walk further by about 20%.<\/p><p>We started in the picturesque setting with cottages and ponds and countryside. We soon made off along the path into the wilderness. We entered fields of sheep and cows on our figure of eight walk. We followed the River Stour to Dedham where we stopped to marvel at the church and marvel even more at the sweets we were allowed to buy.<\/p><p>Along the whole journey Katie and Ben were 'Just pretending...'. It was so lovely to see not only them getting on so well which took their minds off the unpopular walk, but they were being quite imaginitive in making a story which they were part of. Of course it followed along the lines of Star Wars - Power Rangers. They were leaders who could teach their young on how to fight. The 'gem' would make them able to teach better, whilst the 'power' would give them extra fighting skills. They debated whether the 'Boss' was the leader of everything or just the boss of the elite fighters! There was a lot of discussion over hierarchy.<\/p><p>We were a mile over the quoted 4 mile walk confirming mummy's suspicions. We came back to a full car park and scooted off north to leg 2 of the holiday, Norfolk. Burgh Castle was over an hour away. The weather was still pretty good, warm and sunny. The castle or fort dates back to Roman times and looked pretty impressive in terms of it's size. 4 metre walls going on for 100 metres or so. We played some more games whilst mummy and daddy were admiring the views.<\/p><p>We dumped our stuff at the hotel and then went out into Great Yarmouth for the evening. We ate at a restaurant called Fatso's. It was like heaven for the kiddies. Chips and ice cream!<\/p><p>We felt quite uneasy then walking to the beach, plenty of druggy looking people all very hectics and shouting and poor looking people. Anyway it was dusk at the beach where we mucked around a bit, played in the arcades and watched the Heart Radio traveling show. A band was on singing covers. Quite a few there. We didn't stay for the fireworks instead returning to the hotel for the nights sleep. We had brought our inflatable matress to fit us all into the room. Children getting too big to share a bed now. So although we'd officially only booked in two children we had to sneak the third in.<\/p><img src='images\/years\/2012\/2012_08_22-09-EasternHoliday-Day3-DedhamBurghCastle.jpg' class='diaryImage' alt='Where Constable painted something famous' \/><p class='diaryImageCaption'>Where Constable painted something famous<\/p><img src='images\/years\/2012\/2012_08_22-29-EasternHoliday-Day3-DedhamBurghCastle.jpg' class='diaryImage' alt='Up in the hills' \/><p class='diaryImageCaption'>Up in the hills<\/p><img src='images\/years\/2012\/2012_08_22-64-EasternHoliday-Day3-DedhamBurghCastle.jpg' class='diaryImage' alt='Burgh Castle' \/><p class='diaryImageCaption'>Burgh Castle<\/p><img src='images\/years\/2012\/2012_08_22-90-EasternHoliday-Day3-DedhamBurghCastle.jpg' class='diaryImage' alt='Hammer Time in Great Yarmouth' \/><p class='diaryImageCaption'>Hammer Time in Great Yarmouth<\/p>","images":false},"title":{"value":"Eastern Holiday: Walk 37: Dedham Vale, Burgh Castle, Great Yarmouth"},"version":1},{"date":{"d":21,"m":8,"y":2012},"datev":20120821,"images":3,"info":{"content":"<p>Having missed Clacton last night, we decided to wander down to the pier in the morning to expirience the delights of Clacton pre 9am! Well needless to say nothing had started up but we did manage to get on to the pier which was filled with fairground attractions. It was pretty big. Anyway we went to the top and back and we also went out on one of the groyns which led out to sea. Jessica of course slipped over on the seawwed and needed rescuing! There was a boy who was doing back flips onto the sandy beach. Very impressive.<\/p><p>Daddy was adament in going up to Walton on the Naze for two boring reasons. 1) Jamie at work went there for all his childhood holidays and 2) It's one of the locations mentioned on the shipping forecast. Curiousity got the better of Daddy and had to see what the place was like. Well Walton had a big pier and a very nice sandy beach. Somewhere to come back to when we have more time. We had to get to Mersea which wasn't far as the crow flies, but we had to go back into Colchester in order to get back out to Mersea.<\/p><p>We headed to the less popular East Mersea and Cudmore Grove Country Park. Here we explored around the coast to see the World War II costal defences. We played in the clay and got very black legs and in the pill boxes.<\/p><p>A change of scenery back into Colchester to the fun-filled Rollerworld. We all had skates and circled around the purpose build rollerskating rink. All the children improved as the session progressed. Jessica at first seemed she was on 3 bottles of vodka a day and almost mastered balancing by herself at the end. Ben was able to get around without falling over and Katie was quickest out of us all, including the adults. We had time trials as well as challenges set by the dj. We managed to make a train of 4 which was the highest out of everybody. Medals please.<\/p><p>We then went to find Highwood Country Park and had time trials on the assault course that was there. We could race against each other. We stopped off for fish and chips and headed to our hotel room in Feering.<\/p><img src='images\/years\/2012\/2012_08_21-05-EasternHoliday-Day2-MerseaRollerworld.jpg' class='diaryImage' alt='Clacton Sea Pier' \/><p class='diaryImageCaption'>Clacton Sea Pier<\/p><img src='images\/years\/2012\/2012_08_21-26-EasternHoliday-Day2-MerseaRollerworld.jpg' class='diaryImage' alt='Playing in the Mersea' \/><p class='diaryImageCaption'>Playing in the Mersea<\/p><img src='images\/years\/2012\/2012_08_21-35-EasternHoliday-Day2-MerseaRollerworld.jpg' class='diaryImage' alt='Wheely good Ben' \/><p class='diaryImageCaption'>Wheely good Ben<\/p>","images":false},"title":{"value":"Eastern Holiday: Clacton On Sea, Walton on the Naze, Rollerworld, Walk 36: Mersea"},"version":1},{"date":{"d":20,"m":8,"y":2012},"datev":20120820,"images":1,"info":{"content":"<p>Day one of our summer holiday. This year we wanted a break from going west and decided to go erm... east. The popular jet-setters destination of Essex, Suffolk and Norfolk! We trooped onto the M25, got stuck in a traffic jam at Dartford Tunnel. Went below where Daddy capsized a month before and arrived at Benfleet. Of course our parents were not prepared to pay for parking and after a lot of searching Daddy eventually dumped the car in a leisure centre in Canvey Island! Interesting. So we had 6 more walks to complete from the original book. All of which are in hard to get to locations.<\/p><p>We began at Benfleet station at about midday, when the sun was at it's highest and seemingly hottest. All but Mummy had removed their tops as we headed east towards Leigh On Sea. Mummy found it difficult to follow the map and a couple of times got a bit stressed as we went along the wrong route.<\/p><p>Daddy enjoyed this route as we followed a railway line and the contribrituary to the Thames and the English Channel. We were at the spot of where the Thames ends and the sea starts. We passed through farmers fields of corn, cows and ponds. On top of the hill was the location of the Mountain Biking in the Olympics. We could see the fencing around the perimeter but not alot else. We climbed a big hill and found the ruins of Hadleigh Castle. The views were fantastic over the Thames estuary and the weather gorgeous. Us kiddies decided to climb the ruins which made flutters in Daddy and Mummy's hearts as they weren't designed for adventurers.<\/p><p>After a short stop up here we descended to Leigh On Sea for a much needed cold, icey drink and explore of the local fish stalls and shops.<\/p><p>There was a real small beach and luckily we brought our swim stuff so went out for a paddle and swim. The tide was in so there wasn't too much beach. Daddy was stressing over getting sand over and into everything. Yeah Dad whatever! We found a concrete causeway underwater which allowed us to walk further out into sea. The current was quite strong so it was important we kept our feet and stayed on the concrete. There was another young girl of about 6 years old about 10 metres away doing the same thing. However, the current swept her off the ledge of the concrete gang way. She started to struggle to keep afloat and began to scream for help. She was panicing to stay above water. Daddy was close by and was able to grab her and keep her afloat. The current was still strong and goodness knows what would have happened to her. Daddy picked her out and carried her over to an understandably anxious mum who was watching her every move, but didn't realize that there was a concrete path effectively keeping us all a foot or two higher than the seabed. It shocked Katie quite a bit. She commented she didn't like the sea anymore. After a bit she returned to the water as did the other girl after she had calmed down.<\/p><p>We got changed and walked back to the railway station and caught a train back to Benfleet where Daddy went along way to retrieve the car. We then meandered our way north to reach our night's stop in Clacton On Sea via Pizza Hut. It was a very warm night and Daddy snuck out to watch the second  half of the Manchester United's opening game of the season against Everton. We lost 1-0!<\/p><img src='images\/years\/2012\/2012_08_20-08-EasternHoliday-Day1-Hadleigh.jpg' class='diaryImage' alt='Hadleigh Castle in the background' \/><p class='diaryImageCaption'>Hadleigh Castle in the background<\/p>","images":false},"title":{"value":"Eastern Holiday: Daddy Saves Little Girls Life, Walk 35: Hadleigh Castle"},"version":1},{"date":{"d":19,"m":8,"y":2012},"datev":20120819,"images":2,"info":{"content":"<p>We had a two hour trip into the Cotswolds where Mummy's childhood friend was getting married in a Humanists wedding. It was a beautiful setting on a farm in the middle of the countryside, 5 miles outside Tetbury. Elizabeth had moved to New York over 10 years ago so her life was very much based over there which was reflected in Joel's nationality and many of the congregations. It was a scorching day, too hot for suits, but the weather did allow us to have the marriage be performed outside on the lawns. When I say a farm, it was very much geared to large gatherings with a very plush interior and facilities for food and drink. Not a cow shed where we had to slaughter our own food and milk a cow for fluids!<\/p><p>It was interesting speaking to some of the American guests they were all very friendly and it was good to see they were mixing in well with the natives. The ceremony itself was conducted by a lady who told us things about the couple, how they met and their feelings for one another. Almost how a marriage should be without all the stuffy religious garnish! No hymms as well.<\/p><p>The wedding breakfast was lovely and we didn't have to pay for a drink all evening. The happy couple had chosen to have a wedding cheese cake which was very cool for the likes of daddy and served as the source of food later in the evening.<\/p><p>Katie, Ben, Jessica, Joey and Lily had teamed up with a couple of other similarly aged children and practiced for about an hour on putting on a performance. We were not too sure what was in the production. After some disputes and change in direction, I don't the children knew quite exactly what was going to be included. However, the children were very eager to get as many people down to show off their efforts. There was a mixture of rolly-polies, headstands and the curious, allbeit popular, discus throwing. There were plenty of us to shout and cheer the children on and they were lapping up the applause at the end.<\/p><p>Although Ben wanted to dance 'all night long', as we participated in the disco dancing time was marching on and we had to leave as early as possible tomorrow for a trip east. We arrived at home at 1am in the morning. Thanks and congratulations to the happy couple. It was a great wedding.<\/p><img src='images\/years\/2012\/2012_08_19-39-ElizabethJoelWedding.jpg' class='diaryImage' alt='Vows' \/><p class='diaryImageCaption'>Vows<\/p><img src='images\/years\/2012\/2012_08_19-83-ElizabethJoelWedding.jpg' class='diaryImage' alt='The Show' \/><p class='diaryImageCaption'>The Show<\/p>","images":false},"title":{"value":"Elizabeth and Joel's Wedding"},"version":1},{"date":{"d":18,"m":8,"y":2012},"datev":20120818,"info":{"content":"<p>It was a very hot day. Daddy and the two young ladies decided to bike down along the canal to Frimley Lodge Park where the CNL BBQ was being held again. Jessica did ever so well biking all that way and didn't get tired. Anyway we had the BBQ and the usual assortment of games: Rounders, football and the tug of war.<\/p><p>Ben had Charlies birthday party to attend at Tomlinscote school. It was a pirates and princesses party and luckily Ben chose to go as a pirate. They then joined the rest of the crew down at the park.<\/p>","images":false},"title":{"value":"CNL BBQ, Charlies Birthday Party"},"version":1},{"date":{"d":11,"m":8,"y":2012},"datev":20120811,"images":1,"info":{"content":"<p>In the morning Auntie Ellie and Uncle Michael came around to pick up their offspring and have a cup of tea.<\/p><p>For lunch we were to meet with Steven, Joyce and Eva at Wellington Country Park where we had a lovely big picnic. The weather was gorgeous and hot allowing us children to go off and play. First we went on the bouncy mat, then onto the slides. We played piggy in the middle with Daddy and Steven and the sticky bat and ball game with mummy. Daddy and Ben also made up a game of golf. Instead of hitting a golf ball with a club, we kicked a ball with our feet. We had obstacles to go through then a tree to hit. It was good fun.<\/p><p>Daddy unfortunately had to go to work up in London to help support the security system the British Transport Police were using for the Olympics. They have over 45,000 camera patroling stations all over the country. Still he had nothing to do really as it all worked ok and got paid £400 for his troubles!<\/p><p>Meanwhile us children went on the train, then over to the water play. Luckily Mummy had brought our swimming stuff and we stayed until gone 6pm! We want to come back here again!<\/p><img src='images\/years\/2012\/' class='diaryImage' alt='Wellington Country Park' \/><p class='diaryImageCaption'>Wellington Country Park<\/p><locations><location>1010<\/location><\/locations>","images":false},"title":{"value":"Barnett's - Wellington Country Park"},"version":1},{"date":{"d":10,"m":8,"y":2012},"datev":20120810,"images":4,"info":{"content":"<p>Ben was really excited about the pending day up in London to watch the Olympics with Daddy. Ben's ticket cost £6 which he thought was very reasonable. The boys caught the train from Brookwood stright up to Waterloo where much to Ben's delight they were handing out free ice lollies. We took a bus trip to Bank on which we saw loads of the London landmarks. We wondered to get some lunch and then onto the DLR to Mansion House and the Excel centre. We had tickets for the 1pm showing of the 55kg and 75kg heats, well all the rounds upto and including the semi finals. We sat in the holding area for a bit to eat our lunch, watch the camera crew go around and soak in some of the atmosphere. There were quite a few foreigners in today, mainly from the nation who are competing which comprise mainly of the countries to the south of Russia as well as the North American contingent.<\/p><p>Once the wrestlers came out the action was fast paced, especially as there were three bouts being fought simultaneously. For each fight closest to us we each picked the person who we wanted to win. Each bout lasted about 15 minutes. The North Arena 2 was close to it's 10,000 capacity although we managed to sneak forward to get better seat half way through the sitting. I think it just about held Ben's interest although he was very fidgety. We were always routing for the Western countries. He was getting well into it. After about 3 hours the session ended and we were ready to go home. On the way home we say this funny man from Thailand who was clothed in national dress and had a mask which surrounded his head that made he appear to have 4 faces. Spooky.<\/p><p>Greeting us at Brookword station was Mummy, Jessica, Katie, Joey and Lily. How we all fit in the car I don't know. They stayed the night as their mummy and daddy had a wedding to go to.<\/p><img src='images\/years\/2012\/2012_08_10-06-OlympicsWrestling.jpg' class='diaryImage' alt='Opening Gambit - An Ice Lolly' \/><p class='diaryImageCaption'>Opening Gambit - An Ice Lolly<\/p><img src='images\/years\/2012\/2012_08_10-21-OlympicsWrestling.jpg' class='diaryImage' alt='More Takewnado than wrestling. Never mind.' \/><p class='diaryImageCaption'>More Takewnado than wrestling. Never mind.<\/p><img src='images\/years\/2012\/2012_08_10-36-OlympicsWrestling.jpg' class='diaryImage' alt='Some wrestling action' \/><p class='diaryImageCaption'>Some wrestling action<\/p><img src='images\/years\/2012\/2012_08_10-31-OlympicsWrestling.jpg' class='diaryImage' alt='All three mats in use' \/><p class='diaryImageCaption'>All three mats in use<\/p><locations><location>2402<\/location><\/locations>","images":false},"title":{"value":"Olympics: Wrestling - Joey and Lily Sleepover"},"version":1},{"date":{"d":9,"m":8,"y":2012},"datev":20120809,"first":{"value":null},"images":7,"info":{"content":"<p>Kind old Uncle Steven had a spare ticket for the Womens Diving. Almost more importantly the Aquatics Centre was located inside the Olympics Park. So again Daddy had another half day and raced up to London to meet up with Steve. They headed straight to Stratford and expereinced the Park! Again loads and loads of people milling around. And again the staff and helpers on the park were very welcoming, asking how you were, getting you to sing, do high fives, etc. There were another set who were the Coco Cola entertainers who did all the above but in an organised way. Daddy and Steve walked around the whole park as they had 4.5 hours to kill before their event began. They took in the Coco Cola Beat Box which is a little hard to describe its purpose. Essentially you put your hand on or near various surfaces and music would play or change in pitch. They swirled around the outside of the building. It didn't quite work. Anyway once they reached the top they got a nice picture with the Olympic Torch. Inside the tower was loads of mirrors and then some lanterns which changed colours and opened and shut. I know I am not making much sense here, it is a little hard to describe. Once they descended back to the bottom of the building on the inside you got your free coke and some of the entertainers dancing.<\/p><p>Back into the blistering heat of the Olympic park. They finally reached the opposite end where the Hockey stadium was and rested watching the big screens in the park. They saw Nicola Adams get her gold medal. They took in some sustenance in the form of fish and chips before hot stepping it over to the Aquatics Centre. The tickets were £50 each and for that you got a seat at the top of the stadium. They were higher than the main roof! Still they had a good unobstructed view. There were 12 girls each having 5 dives. The chinese lady won it by loads. The two boys were sort of able to predict the scores, mainly based on the amount of splash made. The session lasted a couple of hours, getting out just in time to see the 200m final. They watched it in the Panasonic 3d Home Cinema centre, which for daddy didn't give anymore experience than a normal tv. Anyway they saw Usain Bolt cruise home for another gold medal. The chaps still eager for more headed to the park with the big screens again, sat back and enjoyed a beer and the atmosphere as the sun set. Almost romantic eh? It was chucking out time at the stadium and both made it home at gone 1am in the morning! Thanks Steve for the ticket and a great day out.<\/p><img src='images\/years\/2012\/2012_08_09-21-OlympicParkDiving.jpg' class='diaryImage' alt='The Orbit' \/><p class='diaryImageCaption'>The Orbit<\/p><img src='images\/years\/2012\/2012_08_09-26-OlympicParkDiving.jpg' class='diaryImage' alt='The Park overlooking the Riverbank (Hockey Stadium)' \/><p class='diaryImageCaption'>The Park overlooking the Riverbank (Hockey Stadium)<\/p><img src='images\/years\/2012\/2012_08_09-45-OlympicParkDiving.jpg' class='diaryImage' alt='Stadium at night' \/><p class='diaryImageCaption'>Stadium at night<\/p><img src='images\/years\/2012\/2012_08_09-53-OlympicParkDiving.jpg' class='diaryImage' alt='Inside the Coco Cola Beat Box' \/><p class='diaryImageCaption'>Inside the Coco Cola Beat Box<\/p><img src='images\/years\/2012\/2012_08_09-71-OlympicParkDiving.jpg' class='diaryImage' alt='Giving The Dawg A Walk In The Park' \/><p class='diaryImageCaption'>Giving The Dawg A Walk In The Park<\/p><img src='images\/years\/2012\/2012_08_09-88-OlympicParkDiving.jpg' class='diaryImage' alt='Me and Steve In Front Of The Rings and the Aquatics Center' \/><p class='diaryImageCaption'>Me and Steve In Front Of The Rings and the Aquatics Center<\/p><img src='images\/years\/2012\/2012_08_09-131-OlympicParkDiving.jpg' class='diaryImage' alt='Got the moves like Jagger' \/><p class='diaryImageCaption'>Got the moves like Jagger<\/p><locations><location>1120<\/location><location>2401<\/location><\/locations>","images":false},"title":{"value":"Olympics: Olympic Park and Womens Diving Final"},"version":5},{"date":{"d":7,"m":8,"y":2012},"datev":20120807,"first":{"value":null},"images":2,"info":{"content":"<p>Kind old Uncle Richard Sanders had a spare ticket for the Men's Football semi final at Wembley and decided to invite Daddy along. It was the Mighty Mexico against the Jubilant Japanese. They both took a half day at work and caught the train to Waterloo and decided to see what Horse Gaurds Parade was all about. Of course they could not get near it because it was also the location where the Triathlon past through not more than 2 hours previous. Still it was all very grand and got us in the olympics spirit.<\/p><p>They tubed it to Wembley Park where they were met with a mass of people.... not supporters as such which made for a strange atmosphere at a football match. There was no menace or electricity in the air. There was a little chanting from a group of Mexican supporters but 99% were groups of people who just wanted to see an event. A capcity crowd of 83,000 shared the experience. The seats were high up reasonably close to the Royal Box. The match itself was akin to a training session. A lot of keep-ball with a smattering of tackles. Some of the goals were good. Japan sat back and folded as soon as they went 1-0 up. They tried to sit on the lead and as soon as Mexico scored Japan could not find the quality to strike back. Mexico ran out a deservid 3-1 winners and face the strong Brazil in the Final. Most memorable thing: The amount of people lining Wembley Way.<\/p><img src='images\/years\/2012\/2012_08_07-03-OlympicFootball.jpg' class='diaryImage' alt='83,000 crowd lining Wembley Way' \/><p class='diaryImageCaption'>83,000 crowd lining Wembley Way<\/p><img src='images\/years\/2012\/2012_08_07-11-OlympicFootball.jpg' class='diaryImage' alt='Mexico on the attack again' \/><p class='diaryImageCaption'>Mexico on the attack again<\/p><locations><location>113<\/location><\/locations>","images":false},"title":{"value":"Olympics: Mens Football Semi Final"},"version":5},{"date":{"d":5,"m":8,"y":2012},"datev":20120805,"images":2,"info":{"content":"<p>In the morning Ben opened lots of presents. They were mainly themed around Stars Wars lego. After some congratulationary phone calls Ben and Mummy built the Battle Of Naboo lego set. At midday Ben's party started and unfortunately because of the weather we had to hold it inside. This didn't dampen the spirits as we played: Throw The Lego In The Tin, Lego Treasure Hunt, Pass The Lego Bomb, Lego Corners, Dancing Lego Names, Blindfolded Lego Pickup and Pass The Parcel. We were split into two teams and the final result was very close. Antendees were: Oliver and Phoebe Stroud, Yuraj, Joe Hamilton Cowel, Freya, Michael from around the corner and Jasper.<\/p><p>Later in the afternoon Uncle Howard came over as well as Auntie Susan bearing gifts. Ben had a great day.<\/p><img src='images\/years\/2012\/2012_08_05-03-BensBirthday.jpg' class='diaryImage' alt='Present opening' \/><p class='diaryImageCaption'>Present opening<\/p><img src='images\/years\/2012\/2012_08_05-40-BensBirthday.jpg' class='diaryImage' alt='Party' \/><p class='diaryImageCaption'>Party<\/p>","images":false},"title":{"value":"Ben's 7th Birthday"},"version":1},{"date":{"d":4,"m":8,"y":2012},"datev":20120804,"info":{"content":"<p>As part of Ben's birthday treat we went over to the Guildford Spectrum for a swim and muck about on the slides. We had a great time. At the end we went over to the diving boards and had a go off the 1 metre springboard. Katie and Mummy embarrassingly went onto the 3m, however they chickened out! <\/p><p>We went to Burger King after for a spot of lunch before returning home.<\/p><p>Daddy and Katie bravely cycled home the 13 miles trek home. It them over 2 hours.<\/p>","images":false},"title":{"value":"Spectrum and Riding Home From Guildford"},"version":1},{"date":{"d":3,"m":8,"y":2012},"datev":20120803,"first":{"value":null},"images":3,"info":{"content":"<p>Daddy applied for and got a ticket for the Women's Volleyball at Earls Court. It was still in the group qualifying stage. However, it just so happened that the first game was number 2 in the world against number 3. aka Brazil v China. Brazil's performance todate in the competition wasn't good and they needed to win today to remain in the olympics.<\/p><p>Motorbiking was the easiest and quickest option. Daddy was struck quite quickly how nice and friendly all the helpers were. When waiting with a crowd to cross the road the helpers were geeing us up with a sing song and some cheering. Gets everyone in a good, friendly mood. Daddy's tickets were the cheapest you could get and this was reflected in the seating position. Right at the top, back, corner. Still the atmosphere generated by the near capacity 15,000 spectators was good. There was a warm up person who asked quiz questions, filled us in with the laws of the game, etc. Some pumping music and we were all up for some volleyball action.<\/p><p>It was a very tight, evenly fought contest. Not more than 5 points from each other through out the evening. Daddy got some pictures of course.... about 200 of them!! It was good to get into the game and study the tactics. The main one being, get it to a lady who would try and smash it from the edge of the court near the net. There were alot of high fives and hugging and shouts of encouragement. The game went to the deciding set where Brazil just edged it and won the match after a good couple of hours.<\/p><p>Daddy was surprised to see that there was another match on the card. He tried various points at getting a better seat. Eventually one of the inspectors turned their back for 10 seconds allowing Daddy to get a good vantage point at the other end of the stadium for the Russia vs Japan game. Was this to be the tallest nation against the smallest. The Japanese number 7 libero player could not have been any taller than Farmor!!<\/p><p>Japan started off well and put up great resistance. However, the mighty Russia with their 6foot 7.5 inch number 11 were too strong for the gutsy Japanese. An enjoyable and long day at Earls Court.<\/p><img src='images\/years\/2012\/2012_08_03-16-OlympicsVolleyball.jpg' class='diaryImage' alt='Volleyball-tastic' \/><p class='diaryImageCaption'>Volleyball-tastic<\/p><img src='images\/years\/2012\/2012_08_03-35-OlympicsVolleyball.jpg' class='diaryImage' alt='Brazzzzil' \/><p class='diaryImageCaption'>Brazzzzil<\/p><img src='images\/years\/2012\/2012_08_03-76-OlympicsVolleyball.jpg' class='diaryImage' alt='Final throws of the Japan v Russia game' \/><p class='diaryImageCaption'>Final throws of the Japan v Russia game<\/p><locations><location>1115<\/location><\/locations>","images":false},"title":{"value":"Olympics: Womens Volleyball"},"version":5},{"date":{"d":1,"m":8,"y":2012},"datev":20120801,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy had the week off work to predominently watch the olympics. He cycled all the way to Eton Dorney to capture the atmosphere at the rowing.<\/p><p>Later he went up to Hampton Court and watch both the Womens and the Mens time trial which Bradley Wiggins won.<\/p><img src='images\/years\/2012\/2012_08_01-31-OlympicTimeTrialWiggo.jpg' class='diaryImage' alt='Chris Frome - Bronze Medalist' \/><p class='diaryImageCaption'>Chris Frome - Bronze Medalist<\/p>","images":false},"title":{"value":"Olympics: Cycling Time Trials"},"version":5},{"date":{"d":30,"m":7,"y":2012},"datev":20120730,"first":{"value":null},"images":1,"info":{"content":"<p>We know Jessica can do this, so we tried out the back where the garages are and got Jessica to attempt the start off and ride herself. She struggled at first to master getting the pedal at the top and push off from that. However, after about 10 minutes we had lift off and the balance was reasonably good. After about half an hour we were getting there and Daddy didn't need to be in a catching position. We eventually went over the road to the community centre car park where we were doing big circles and the confidence and enthusiam was growing. Well done Jess we can get rid of the stibilizers (I know the spelling is incorrect but that is how Jessica pronounces stabilizers).<\/p><img src='images\/years\/2012\/2012_07_30-07-JessicaFirstBikeRide.jpg' class='diaryImage' alt='Jessica's first ride' \/><p class='diaryImageCaption'>Jessica's first ride<\/p>","images":false},"title":{"value":"Jessica rides without stabilizers"},"version":4},{"date":{"d":28,"m":7,"y":2012},"datev":20120728,"images":1,"info":{"content":"<p>It was a lovely sunny day and the Olympics Opening Ceremony had finished in the early hours. Daddy organised a trip to just outside Ripley where we were to see the Great Britain road cycling team in action. We had two superstars in the recent Tour De France winner Bradley Wiggins and the favourite for the race Mark Cavendish. We setup at the road side and there were loads of others watching and creating a great atmosphere. From about 20 minutes before the leaders went past there must have been about 30 police motorbikes racing past, waving at us. Eventually the leaders rushed by. There were 10 or so of them which had about a 5 minute lead over the peleton and the Brits. The Great Britain train did come past and we hooped and roared at them. They had great support. We were confident in gold as the British were seemingly controling the race.<\/p><p>We raced home to watch the end of the race. By this stage with an hour to go it was looking very unlikely of a good result. This fear became a reality. However, we had a great time and we can now say we've watched the olympics live.<\/p><img src='images\/years\/2012\/2012_07_28-19-OlympicRoadRace.jpg' class='diaryImage' alt='British Team leading the Peleton' \/><p class='diaryImageCaption'>British Team leading the Peleton<\/p><p>Daddy went off with Uncle Michael to play Airsoft until 3am in the morning! Meanwhile we had the Elders including the noisey Dilly to stay the night.<\/p>","images":false},"title":{"value":"Olympic Road Cycle Race, Airsoft, Elders stay the night"},"version":1},{"date":{"d":24,"m":7,"y":2012},"datev":20120724,"images":1,"info":{"content":"<p>Nine years old. It's starting to make Daddy feel old. Anyway Katie was very excited. Ben and Jessica were also pleased for her. This must be the first time when we are all appearing happy at an early morning present opening session. Katie received: Heelys from Mummy and Daddy, a set of rollerblades, £80, lots of clothes, a stolen bracelet and some reading books. We the cash Katie bought a trampoline for the back garden which is a big hit.<\/p><p>In the evening, The Fars came over to give their presents. Then the five of us went to Camberley cinema to watch Ice Age 4 in 3D. We had a great time, although Daddy was exaperated with the cost of the tickets. £46!<\/p><img src='images\/years\/2012\/2012_07_24-15-Katie9thBirthday.jpg' class='diaryImage' alt='Present Opening Time' \/><p class='diaryImageCaption'>Present Opening Time<\/p>","images":false},"title":{"value":"Katie's 9th Birthday"},"version":1},{"date":{"d":22,"m":7,"y":2012},"datev":20120722,"images":1,"info":{"content":"<p>Along with her fellow playschool teachers, Mummy had signed up for the Race For Life fun run in aid of another Laura, a friend of the playschool's. We drove across to Prospect Park, Reading. It was another gloriously sunny day. Katie and Ben wanted to join in with the runners. Mummy wanted to post a good time and attempt to run the 5km course. Out of the group of ten or so runner, Mummy did come in first place with a respectable time of 35 minutes. Daddy was very impressed especially as she had done zero training. Oh sorry, apparently she had done some power walking. As I say she had done no training!<\/p><p>We returned home and for the first time this summer we played in the back garden enjoying the sunshine and the warm temperatures. We sort of filled the paddling pool up and got the hammock out. Chill Winston.<\/p><img src='images\/years\/2012\/2012_07_22-19-RaceForLife.jpg' class='diaryImage' alt='The Team' \/><p class='diaryImageCaption'>The Team<\/p><p>In the late afternoon the Fars came over for a cup of tea and a chat.<\/p>","images":false},"title":{"value":"Race For Life"},"version":1},{"date":{"d":21,"m":7,"y":2012},"datev":20120721,"images":2,"info":{"content":"<p>Ben had his first football tournament since leaving Frimley Green Cheetahs. He was well excited and donned the blue kit of the Wind In The Willows pack, a name which strikes fear into the opposition. It was five-a-side mini league against a team from Camberley and two from Lightwater.<\/p><p>Well they didn't do too well initially losing each of the league games and scoring no goals. Cheekily they quialified for the third, fourth playoff and Benjamin only went and scored the winning goal with seconds remaining.<\/p><p>We were all watching and so happy for him. He actually scored a goal. Even in training he failed to convert. He was even happier when he received a trophy.<\/p><img src='images\/years\/2012\/2012_07_21-11-BeaverFootball.jpg' class='diaryImage' alt='Beaver Medal Winnners' \/><p class='diaryImageCaption'>Beaver Medal Winnners<\/p><p>In the afternoon we went over to TriLakes for Harrisons 5th birhtday party. There was a Jakes softplay. It was a boiling hot day, so the children got quite sweaty. Anyway they all played nicely and had a good time. Harrison is well into his Lego, so we got him some dinosaur lego.<\/p><img src='images\/years\/2012\/2012_07_21-17-Harrisons5thBirthdayParty.jpg' class='diaryImage' alt='A Hot Ben' \/><p class='diaryImageCaption'>A Hot Ben<\/p><p>In the late afternoon Ma Ma and Pop Pop brought over Great Grandma for a cup of tea and a chat.<\/p>","images":false},"title":{"value":"Beaver Football Tournament, Harrisons 5th Birthday Party"},"version":1},{"date":{"d":20,"m":7,"y":2012},"datev":20120720,"info":{"content":"<p>Katie shared her birthday party with Natasha who was also turning 9 years old. Katie had been excited since Daddy's birthday, counting down the days to this event. Between the two of them they had invited 8 others to join them at a Build A Bear party. For those uneducated, these parties allow the children to choose a bear, stuff it, clothe it and buy accessories. This all takes place in a shop in Basingstoke. They also played games like Find the teddy bear.<\/p><p>After, the girls took their new buddies to Pizza Hut and had some food.<\/p>","images":false},"title":{"value":"Katie's Build A Bear Party"},"version":1},{"date":{"d":15,"m":7,"y":2012},"datev":20120715,"images":2,"info":{"content":"<p>Daddy left his senses behind and took Dilly out for an early morning walk over at the Rec in Istead Rise. Dilly did some business which a fellow dog walker saw. He was offered a poo bag. Errr. Daddy never found the poo and had to pretend to pick the poo up. They both then ran off quickly before the lady offering the bag found out.<\/p><p>Jessica was going to spend the next couple of days with the Elders as we needed a babysitter for Mummy's third day of work. She had a great time going for a walk.<\/p><p>Meanwhile the rest of the family went off to Rainham Marshes for another walk. This overlooked the site of yesterday's fun and games. The walk predominantly was located in the RSPB compound. We didn't see that many birds really. I think we needed binoculars.<\/p><img src='images\/years\/2012\/2012_07_15-50-RainhamMarshes.jpg' class='diaryImage' alt='Big Boys' \/><p class='diaryImageCaption'>Big Boys<\/p><img src='images\/years\/2012\/2012_07_15-55-RainhamMarshes.jpg' class='diaryImage' alt='Runner' \/><p class='diaryImageCaption'>Runner<\/p>","images":false},"title":{"value":"Walk 34: Rainham Marshes"},"version":1},{"date":{"d":14,"m":7,"y":2012},"datev":20120714,"images":6,"info":{"content":"<woops rating=\"7\" woopstitle=\"Capsized Kayak at QE2 bridge\"><p>Daddy woke early and was excited about the pending kayaking trip along the Thames. He'd rang the London Port Authority to check and report his plans and monitored when high tide was due and whether it was going to be too windy. It was close to 11am when we pushed Daddy off at the Woolwich Ferry terminal. He'd just received a smart phone from Auntie Susan which meant he could now track where he was and record his progress. Woo Hoo.<\/p><p>The weather was appalling but Daddy didn't mind too much in his new rain jacket and had everything else in waterproof bags. Progress was leisurely to begin with with the odd boat passing by. The water was quite choppy, especially when the container ships passed. The wash was bouncing off the stationary barges which made for a bumpy ride.<\/p><img src='images\/years\/2012\/2012_07_14-06-KayakWoolwich.jpg' class='diaryImage' alt='Setting off from Woolwich' \/><p class='diaryImageCaption'>Setting off from Woolwich<\/p><p>Daddy stayed mostly to the south side of the river which was a bit of luck as he quickly found that the back end of the boat was sinking which meant he had to get to shore quickly before he rolled the Kayak over. The nose of the kayak was riding quite high making balance difficult especially with the choppy conditions. However, the nearest bank was infact mud or silt at Thamemede just by the Crossness Sewage Treatment Works! Daddy managed to land the boat on the mud and got out, knee deep in mud, which as a side note was strangely warm and quite a nice feeling.<\/p><p>Having got out of the boat Daddy tried to empty the boat of water and lifted the pillow which weighed a tonne. Naughtily Daddy had to dump the pillow as he thought that was the reason for the sinking. By this point there were 6 or 7 people watching me struggle around in the mud. The water and pillow was out. A frantic amount of paddling was required to be set free from the bank. However, no change, the nose pointed right up and again Daddy almost rolled the boat. So a hasty return to the bank was made. One of the kids watching asked if I was OK and suggested to move the seat to the middle of the vessel. Good idea!<\/p><p>It took a while to unstrap everything as again Daddy sank into the mud up to his knees. Seat finally moved to the middle, rain still lashing down. Another ungainly entry to the boat which seemed real uncomfortable without the pillow and Daddy was off again successfully. This time balance was returned.<\/p><p>Daddy powered on but had strayed into the middle of the river. Soon the London Port Authority boat had spotted this and rounded on Daddy and basically told him to move to paddling near to the bank. It took quite an effort to get over that far and the manouvre was made under the watchfull eye of the LPA boat!<\/p><p>Soon the Dartford Crossing was upon Daddy. He decided to report into HQ, i.e. Mummy. Coasting on the south side of the river, whilst putting the phone back in the bag, Daddy took the oppotunity to keep his sugar levels up by taking a few Fruit Pastills. He was slowly being sucked into the wooden structs of a pier but didn't make too much effort on attempting to get away, thinking he'll just bounce off it.<\/p><p>Then as quick as anything the Kayak flipped over on its side turning the contents of the boat into the Thames. A wally, two bags and the paddle. Fortunately Daddy raised to the surface quickly and grabbed the kayak, bag and paddle. He saw the bag with phones and wallet and went under water to grab them. However he missed and that was the last we saw of that. Daddy was annoyed and took a few seconds to compose himself as the current was taking him towards the bridge where there would be increased danger with the swells of water. How easy was it going to be to attempt to flip the kayak over and get back in with all the equipment? A meak failed first attempt let Daddy know that it was at least possible. Unknown to Daddy the Kayak was filling with water. More of that in a moment.<\/p><img src='images\/years\/2012\/2012_07_14-08-QE2Bridge.jpg' class='diaryImage' alt='Where the incident happened' \/><p class='diaryImageCaption'>Where the incident happened<\/p><p>A successful roll of the Kayak meant Daddy could clamber back in and set himself to pass under the bridge safely. His goal of getting to Gravesend was now over even though he strangely felt stronger than ever. However, with the weather and having being soaked he knew it was important to quickly get back to shore. The London Port Authority boat mentioned there was a causeway at Greenhithe to get out. This was a 15 minute paddle from the incident.<\/p><p>Land at last. The weather was worse than ever, but it didn't mean too much as Daddy was soaked anyway. He tried to pull the Kayak out of the water as he would normally, but found it difficult. He thought he must have sapped alot of energy up with the previous 10 miles of adventure! After a short rest he tried again and found it pretty difficult to move. He managed to get it clear of water. The tide was lowering so was not too worried about it being swept away whilst he went to look for help.<\/p><img src='images\/years\/2012\/2012_07_14-07-Greenhithe.jpg' class='diaryImage' alt='Greenhithe Pier' \/><p class='diaryImageCaption'>Greenhithe Pier<\/p><img src='images\/years\/2012\/2012_07_14-09-Route.jpg' class='diaryImage' alt='The Route' \/><p class='diaryImageCaption'>The Route<\/p><p>No phone, no money and not many people about in the rain. Daddy wasn't really sure where he was. Fortunately there was a near by pub which Daddy tentatively went into dripping wet. He asked if he could borrow someones phone. He rang his Mum who was able to relay an SOS message to Mummy, who had only just got to Auntie Karens. The people in the pub even got Daddy a coffee.<\/p><p>Laura arrived within half an hour or so. When returning to the Kayak we found the reason for the earlier problems of the nose rising out of the water and the problems of dragging it out of the water. The plug at the back of the boat had fallen out which meant the kayak was steadily filling up with water. Just think of a container floating in the bath. Now fill that container with water, see what happens.<\/p><p>Daddy got a telling off from Mummy and a bigger telling off from his Dad.<\/p><\/woops><p>In the evening we joined up with Ma Ma, Pop Pop and the Elders at Mummy's cousin, Hannahs, wedding. She seemed quite a miserable bride, something had upset her. She was also over 8 months pregnant which cannot have been easy.<\/p><p>The children played really nicely all evening.<\/p><img src='images\/years\/2012\/2012_07_14-04-HanahWedding.jpg' class='diaryImage' alt='Newly Weds' \/><p class='diaryImageCaption'>Newly Weds<\/p><img src='images\/years\/2012\/2012_07_14-87-HanahWedding.jpg' class='diaryImage' alt='The girls hitting the dance floor' \/><p class='diaryImageCaption'>The girls hitting the dance floor<\/p>","images":false},"title":{"value":"Kayaking Disaster, Hannah's Wedding Party"},"version":1},{"date":{"d":13,"m":7,"y":2012},"datev":20120713,"first":{"value":null},"images":1,"info":{"content":"<p>Each year there is a leavers assembly at Cross Farm school. This year Ben was actually leaving and amongst the songs that the school sang, Ben had to read out a poem which he had written. Of couse Mummy was in tears at the end.<\/p><img src='images\/years\/2012\/2012_07_13-02-BenLeaversAssembly.jpg' class='diaryImage' alt='Ben in full song' \/><p class='diaryImageCaption'>Ben in full song<\/p>","images":false},"title":{"value":"Ben's Leavers Assembly"},"version":5},{"date":{"d":12,"m":7,"y":2012},"datev":20120712,"first":{"value":null},"info":{"content":"<p>Mummy had landed a job as a Welfare Officer at Cove Secondary school. Over the next 2 weeks she has 5 days of shadowing the lady who she replaces. The job entails looking after the health of the pupils. Essentially if they are unwell or need jabs then Mummy is the person to administer and look after the children. She has her own little office and requires to keep communication over a walkie-talkie. An ideal and well paid job given this description.<\/p><p>However, the headmistress is a bit of a control freak and bully, and can be unreasonable. This is an account from not just one member of staff, but every member that Mummy has come into contact with. She's been asked if she really needs this job and that'll she'll be eaten alive!! Great. When Daddy picked Mummy up she was not happy at all and does not like the atmosphere and general attitude and morale of the staff. Still she has another 4 days to make her mind up. Meanwhile she is looking at the job available at Frimey Green Pre School as a teacher. half the salary though. But hapiness overides money on this one.<\/p><p>As Mummy was at work, Daddy did the school runs and took Jessica to her second practice lesson at Sandringham School. She enjoyed herself and can't wait to start big school.<\/p>","images":false},"title":{"value":"Mummy's First Day As A School Welfare Officer, Jessica at Sandringham School"},"version":3},{"date":{"d":10,"m":7,"y":2012},"datev":20120710,"images":1,"info":{"content":"<p>Present opening in the morning on this momentous occassion. From Mummy, Daddy got a new jacket slash raincoat, from Katie a big packet of crisps, Ben a cycling magazine and Jessica some drinks flasks. Other presents included a nice food parcel, a waterproof bag and plugs for the kayak, a tee-shirt, a breadmaker, some boxer shorts and an Amazon gift vouchers and a thermos flask.<\/p><img src='images\/years\/2012\/2012_07_10-02-MartinBday.jpg' class='diaryImage' alt='Cake Time' \/><p class='diaryImageCaption'>Cake Time<\/p>","images":false},"title":{"value":"Daddy's 37th Birthday"},"version":1},{"date":{"d":8,"m":7,"y":2012},"datev":20120708,"images":3,"info":{"content":"<p>We went off to church leaving Daddy help dress the Frimley Green Pre School float, in the rain! This year we were each in a different part of the procession. Jessica with the pre school, Ben in Cross Farm and Katie with the Brownies.<\/p><p>We had all four Grandparents come to watch along with Uncle Peter. It absolutely tipped down during the procession. However, we all enjoyed ourselves. Later we met on the green had candy floss, ice cream and sweets as well as more teddies for the teddy tombola.<\/p><p>Later in the afternoon Ben had a game of football on the green with his Beavers group and had the enviable task of picking up litter after the event.<\/p><img src='images\/years\/2012\/2012_07_07-08-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Jessica as  a queen' \/><p class='diaryImageCaption'>Jessica as  a queen<\/p><img src='images\/years\/2012\/2012_07_07-17-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Katie as a teddy bear' \/><p class='diaryImageCaption'>Katie as a teddy bear<\/p><img src='images\/years\/2012\/2012_07_07-29-FrimleyGreenCarnival.jpg' class='diaryImage' alt='Ben in beaver football action' \/><p class='diaryImageCaption'>Ben in beaver football action<\/p>","images":false},"title":{"value":"Frimley Green Carnival"},"version":1},{"date":{"d":7,"m":7,"y":2012},"datev":20120707,"info":{"content":"<p>Jessica had ballet in the morning which she loves. We then were going for a walk up in London. However, the M4 was shut, so we were going to go the A3 but Guildford was backed up onto the Hoggs Back, so went all the way back to Camberley and found the M3 backed up from Bagshot. We gave up!<\/p><p>Instead we had a bit of at home day. Daddy made Coronation chicken and sorted the garden out, the girls went shopping and Ben initiated his Bin Weevil Tycoon account.<\/p>","images":false},"title":{"value":"Coronation Chicken"},"version":1},{"date":{"d":5,"m":7,"y":2012},"datev":20120705,"first":{"value":null},"images":1,"info":{"content":"<p>Ben got his SAT results today and got top marks across the board. We are very proud, especially as he is not even 7 yet!<\/p><img src='images\/years\/2012\/2012_07_05-01-BenSatsResults.jpg' class='diaryImage' alt='Top Marks!' \/><p class='diaryImageCaption'>Top Marks!<\/p>","images":false},"title":{"value":"Ben's Sats Result"},"version":5},{"date":{"d":1,"m":7,"y":2012},"datev":20120701,"info":{"content":"<p>Straight after church, Daddy, Ben and Katie biked up the Basigstoke Canal to Woking Swimming Pool. About 9 miles in under 3 hours in the showery conditions. They did ever so well, especially as Ben is on his diddy bike.<\/p><p>We met with Ma Ma and Pop Pop and went in the Monkey Pool. It's always a hit. Afterwards we were treated to burger and chips in the cafe upstairs.<\/p><p>On the way home we popped into Grandma's to celebrate Ellie and Mummy's birthday with some cake.<\/p>","images":false},"title":{"value":"Bike to Woking for a Swim with Ma Ma and Pop Pop"},"version":1},{"date":{"d":30,"m":6,"y":2012},"datev":20120630,"first":{"value":null},"images":4,"info":{"content":"<p>In the morning after ballet and baby sitting the Bandoz children, which incidently saw Oliver beat Daddy in a game of chess, we went off to Katie's school fair. Mummy volunteered to run a few stalls which allowed us children to go around and spend the five pounds we were each given. Ben hauled 8 teddy bears, one of them we had given in the first place! Jessica had her hair dyed pink and Katie bought some small stones in a plastic box!!! They saw her coming.<\/p><p>We dashed back home and went across to the RLC Army Show which is a must for us. This year we met up with school friends and the Fars. All the old favourites were there including the water tight rope, the inflatable assault course and fairground. We had a go in the paintball and grenade throwing practice!! Of course there was tug of war and parachutists. We had a good time and lasted till they packed up.<\/p><img src='images\\years\\2012\\2012_06_30-02-RLCArmyDay.jpg' class='diaryImage' alt='Walking over to the RLC Show' \/><p class='diaryImageCaption'>Walking over to the RLC Show<\/p><img src='images\\years\\2012\\2012_06_30-19-RLCArmyDay.jpg' class='diaryImage' alt='Bouncing about' \/><p class='diaryImageCaption'>Bouncing about<\/p><img src='images\\years\\2012\\2012_06_30-34-RLCArmyDay.jpg' class='diaryImage' alt='Head and shoulders above' \/><p class='diaryImageCaption'>Head and shoulders above<\/p><img src='images\\years\\2012\\2012_06_30-47-RLCArmyDay.jpg' class='diaryImage' alt='Machine gunner' \/><p class='diaryImageCaption'>Machine gunner<\/p>","images":false},"title":{"value":"C of E Fair and RLC Army Show"},"version":3},{"date":{"d":25,"m":6,"y":2012},"datev":20120625,"info":{"content":"<p>Mummy's been egging out her birthday now for this second day. We started with the customary present opening in bed at a ridiculously early time. Daddy did a marvelous job of wrapping up the presents in...... newspaper.<\/p><p>Daddy didn't do a good job in providing a haircut and a pair of canvas shoes. Jessica bought some sandels, Katie a cup she decorated at Brownies and a packet of Liquorice Allsorts and Ben did have a flower which died 3 days previous, but made a good recovery by giving a white vest top.<\/p><p>Mummy got makeup from Auntie Charlotte, perfume from Ma Ma and Pop Pop and a peg bag from the Fars!<\/p><p>The birthday girl spent the morning at Joshua's special needs school watching their sports day. Jessica was allowed to join in and she was awarded a medal which she was very pleased and proud about.<\/p>","images":false},"title":{"value":"Mummy's Birthday"},"version":1},{"date":{"d":24,"m":6,"y":2012},"datev":20120624,"images":3,"info":{"content":"<p>For her birthday treat Mummy wanted for us to do the Hampstead Heath walk. So after church we drove to Gunnersbury and caught the overground train to Hampstead Heath. Two problems: One, the walk started in Hampstead which was a mile away up a hill. Second it was persistently raining. So we dived into the local greasy spoon which is quite to find in Hampstead and sat down for some grease and chips!<\/p><p>Thankfully the rain stopped and we were all filled and prepared for the so called 3 mile walk. We went past some interesting landmarks including the real Goldfinger's house, the person who inspired the James Bond villan and Keates residence. After a playground stop we entered Hampstead Heath where Katie and Mummy decided to go swimming in one of the ponds.<\/p><p>It was a really nice atmosphere. The pay machine failed to work so the lifegaurd let us in for nothing. It was real back to nature stuff. Open air changing rooms and an unheated pond! Katie braved it first and got in. When mummy got in she said it was so cold it took her breath away. The lifegaurd kept a close watch over Katie as it was quite deep. They played and swum around for about 20 minutes before coming back out into the rain.<\/p><p>The walk meandered through the heath, stopping off to play on trees, some upright some not! With all the hills and stops and extensions, time was marching on and spirits were flagging with some of the troops, not helped when we were directed a mile in the wrong direction!<\/p><p>We finally returned to Hampstead village where there was a large street market, mini fair rides and a band playing. The sun was out. It was a lovely way to spend a Sunday afternoon. We all slept well that night.<\/p><img src='images\/years\/2012\/2012_06_24-17-HamsteadHeathWalk.jpg' class='diaryImage' alt='The tiddlers' \/><p class='diaryImageCaption'>The tiddlers<\/p><img src='images\/years\/2012\/2012_06_24-59-HamsteadHeathWalk.jpg' class='diaryImage' alt='Da Famille' \/><p class='diaryImageCaption'>Da Famille<\/p><img src='images\/years\/2012\/2012_06_24-62-HamsteadHeathWalk.jpg' class='diaryImage' alt='A fallen tree provides a good playground' \/><p class='diaryImageCaption'>A fallen tree provides a good playground<\/p>","images":false},"title":{"value":"Walk 33: Mummy's Birthday Walk"},"version":1},{"date":{"d":23,"m":6,"y":2012},"datev":20120623,"images":1,"info":{"content":"<p>Ma Ma was soon to be 60 years old. To celebrate the family were invited to Llamas Park in Staines, a great venue for the children. However, sayinf that because of the hosepipe ban, the sprayground was shut for the year! Still we had plenty of other things to occupy us. First, in true Weston style we tucked into our picnic.<\/p><p>We had a game of cricket then Daddy took each of the children in pairs for a ride on the kayak up and down the Thames. Poor old Fraser came a cropper when he walked into the river, slipped forcing Uncle Michael to go in and fetch him.<\/p><p>Todd and Ollie were over in England to clear Uncle John Garratt's house as they were selling it. It's always so nice to speak with them. Such nice people. Happy birthday Ma Ma.<\/p><img src='images\/years\/2012\/2012_06_23-11-Carol60th.jpg' class='diaryImage' alt='The 60 year old' \/><p class='diaryImageCaption'>The 60 year old<\/p>","images":false},"title":{"value":"Ma Ma's 60th Birthday Picnic"},"version":1},{"date":{"d":17,"m":6,"y":2012},"datev":20120617,"first":{"value":null},"images":1,"info":{"content":"<p>CNL Software were doing the famous London to Brighton bike ride. Daddy kind of had done some training beforehand. It was an early start leaving Knaphill at 6:30. Ben and Mummy waved him off.<\/p><p>Daddy was larking about before the start of the race and managed to make Jamie crash in to him, tumbling poor Jamie to the floor which meant he sported a nice big bruise for the 54 mile encounter.<\/p><p>8:00am arrived and the 12 strong team set off. They stayed 12 for about 20 seconds before everyone sped off at their own pace. Most kept in groups. However, Daddy wanted to push himself and see what sort of time he'd come out with.<\/p><p>For the first 10 miles or so, through London, it was very much a case of stop and start through the traffic lights and fighting his way past busses and traffic. There were some in fancy dress, some even had music blaring out of their bike somehow.<\/p><p>Daddy was on his own, battling up the hills overtaking alot of people on far better bikes than his. He was on his 10 year old mountain bike with chunky mountain bike tyres. He stopped after about 20 miles for a quick drink and snack. Within a minute, Ryan went past on his £5k racer.<\/p><p>Both competitive people they said they'd ride together, however, it became quickly apparent they weren't going to wait for each other. It was a race for the final 34 miles!! Daddy did well up the hills, where as Ryan made up the time on the flat and downhill sections. It was nipp and tuck all the way.<\/p><p>They then came to the mighty Ditchling Beacon, where they were told you'd be lucky to only get half way up before having to walk. Apparently only 7% of riders make it! Prior to this point Ryan must have been leading by 5 or 10 minutes. However, he had got off and started to walk the hill. To Daddy's surprise he saw Ryan ahead of him, not having seen him for the previous 7 or 8 miles.<\/p><p>Daddy made it and didn't stop for a rest at the top for fear that Ryan would take him again. The final 6 miles were all down hill or flat and quite bitty as there were quite a few traffic light stops.<\/p><p>Daddy swung around the roundabout by the pier and went down the home stretch where there were loads of people cheering. He raced in at a time of 4 hours 30 minutes. He was very pleased with that time, although wondered what he would have done with a racer or even road tyres.<\/p><p>Ryan came in soon after. However, he had to wait another 4 and a half hours for the final group of CNL'ers to come through. A good day. Daddy had the enthusiasm to look to his next cycling feat.<\/p><img src='images\/years\/2012\/2012_06_17-02-MartinLondon2Brighton.jpg' class='diaryImage' alt='On the 54 mile journey' \/><p class='diaryImageCaption'>On the 54 mile journey<\/p>","images":false},"title":{"value":"London To Brighton Bike Ride"},"version":5},{"date":{"d":16,"m":6,"y":2012},"datev":20120616,"images":2,"info":{"content":"<p>As Daddy was going to be away for most of tomorrow we decided to have a mini Father's Day this morning. We (well Mummy really) got Daddy a newspaper and breakfast in bed. Daddy opened an array of presents and cards which was very nice.<\/p><p>Ben had a day with the Beavers. They had lots of games, activities and craft to do. We couldn't be happier with Beavers. Out of all the clubs this is such a good, well structured thing for Ben to do. He enjoys it to, although he also wanted to spend the day with the rest of us.<\/p><p>The rest of us met up with the Elders and Pop Pop at Little Frensham Ponds and went for a walk. It was quite a windy and chilly day. This did not deter us children to go in the pond for a paddle. Even Dilzo joined in the fun. We had a great time although it was cold when we got out. We finished the walk in an hour and made our way to the Elder household where we all had lunch and a go on their new trampoline.<\/p><p>Later in the afternoon we drove into Alton and satisfied Pop Pop's fix for a 'Costa' as he puts it. We had a coke. Mummy and Daddy left Katie and Jessica with the Elders for a sleepover.<\/p><p>Ben was picked up on the way home. They then prepared for Barrie and Laura to come over. They had a nice evening. Mummy got a bit drunk and slopped red wine all over the new-ish light sofas! She also wanted to make sure that they were the Wests were their best friends and more fun than the Jacksons!<\/p><img src='images\/years\/2012\/2012_06_09-52-LittleFrenshamPond.jpg' class='diaryImage' alt='Mummy and Pop and Jessica Jumping' \/><p class='diaryImageCaption'>Mummy and Pop and Jessica Jumping<\/p><img src='images\/years\/2012\/2012_06_09-82-LittleFrenshamPond.jpg' class='diaryImage' alt='Mummy and Pop' \/><p class='diaryImageCaption'>Mummy and Pop<\/p>","images":false},"title":{"value":"Fathers day, Frensham Ponds, Beaver Day, Wests Over, Sleepover at Elders"},"version":1},{"date":{"d":15,"m":6,"y":2012},"datev":20120615,"first":{"value":null},"info":{"content":"<p>Daddy took the day off work and had two stints at school. Mummy for the first time in a long time (if ever!) did not take us to school. It was big, bad, Daddy.<\/p><p>First up Jessica's Frimley Green Pre School. Daddy started by playing on Happy Street making a track up, then indulged in a bit of painting before overseeing the emptying of the recycling into a big lorry. We ended on snack time, excercise, jumping from the top of the climbing frame and of course storytime. Daddy had a few followers around him!<\/p><p>After some lunch and a £170 bill for fixing the brakes on the car, Daddy went into see Ben at Cross Farm. Ben was very proud and pleased he came in and sported a huge grin. They had to first paint some flags which were to be used at the carnival, then Ben had to write some nice things about Daddy. We had to think hard for that one!<\/p><p>Free play next, which Ben told his friends that he'd play whatever Daddy wanted. Daddy wanted to play anything. After deliberating on a game of Power Rangers, who being which character caused much discussion. In the end we decided to play good old 'it'. Ben was a popular chap in his class. Friends would ask him if they could play, and Ben was the chap organising the games.<\/p><p>Later in the afternoon we had a small quiz on countries and their flags and capital city.<\/p><p>Daddy then swept us all up from our schools and we went back home. Ben conscipted Daddy to play another bout of Civilization which Ben is addicted to at the moment. Daddy thinks it is good up to a point as he is learning about different wonders of the world, different civilization names and different units from back in the day.<\/p>","images":false},"title":{"value":"Bring Daddy To School"},"version":3},{"date":{"d":14,"m":6,"y":2012},"datev":20120614,"first":{"value":null},"images":1,"info":{"content":"<p>Mummy looked after Evie and Joshua Sanders and took them to Jessica's Sports Day. Everyone had a good time.<\/p><img src='images\/years\/2012\/2012_06_14-02-JessicaSportsDay.jpg' class='diaryImage' alt='Phoebe, Jessica and Evie' \/><p class='diaryImageCaption'>Phoebe, Jessica and Evie<\/p>","images":false},"title":{"value":"Jessica Sports Day"},"version":4},{"date":{"d":9,"m":6,"y":2012},"datev":20120609,"first":{"value":null},"info":{"content":"<p>Today Daddy rode to Winchester along with Michael and Millie from work. Mr Elder joined from Alton to just outside Winchester. There were quite a few hills. They managed to do it in about 4 hours. They caught the train home!<\/p>","images":false},"title":{"value":"Bike to Winchester"},"version":5},{"date":{"d":4,"m":6,"y":2012},"datev":20120604,"images":1,"info":{"content":"<p>Daddy woke at 4:30am and as it was light he decided to go on a long walk along the railway line and beach with his camera. Everyone else had quite a lie in which meant we were in a bit of a rush to have breakfast and pack up the cars. We had one final dip in the swimming pools and a go on the on-site softplay before walking into town. The boys sneaked a cornish pasty. There punishment was not to have much of the picnic!<\/p><p>We congrigated on the north beach for our final meet. The Elders were off on their family camping holiday for the week, whilst Charlotte and Luke were meeting friends on the Gower. Us five along with Ma Ma and Pop Pop walked up the big hill at the head of the mainland, then continued along the South beach back to the cars at the campsite. We said our goodbyes and made the long trip home!<\/p><img src='images\/years\/2012\/2012_06_04-35-TenbyDay4-Walk.jpg' class='diaryImage' alt='Canon' \/><p class='diaryImageCaption'>Canon<\/p>","images":false},"title":{"value":"Tenby Holiday - Walk into town"},"version":1},{"date":{"d":3,"m":6,"y":2012},"datev":20120603,"images":2,"info":{"content":"<p>Written by Ben<\/p><p>Had a very good night's sleep even though Mummy and snored all nght Joey slept under his bed and Katie was freezing cos Joey had the duvet. Joey opened a box but didn't want it, Lily and Jess pretended to be monkeys and made mama and poppop get up. The smoke alarm went off but it was a non-event because there was no fire but mummy looked nonchalant as she cooked breakfast. <\/p><p>The weather was pretty miserable, so we decided to leave another trip to the beach till tomorrow and do Folly Farm instead. Ma Ma and Pop Pop were gasping for a coffee so we stopped off in the excellent soft play area. A rare rest bite from the rain meant we could go out and enjoy the animals. The giraffes were looking very friendly with one another and the camel looked a bit of a mess with it's coat in tatters.<\/p><p>The troops were getting peckish and therefore demolished Mummy's picnic in double quick time. Uncle Michael made a brief appearance as he had to look after Dilley. He did join us for the farm tractor ride and subsequent trip to see the big old pigs. The words 'Farfar' were uttered in traditional fashion of course.<\/p><p>In the barn Jessica stroked a rat. She really has little scruples about experiencing new animals. Dog owners have even commented that she is too brave 'as some dogs might nip her'. Still we don't want to discourage her and turn her into a Katie or Mummy. The rain continued so we couldn't really play on the outside playgrounds and toys, instead we had loads of go's on the indoor, olde worldy fairground rides.<\/p><p>Whilst we went in the indoor swimming pool, Daddy and Pop Pop went to get loads of fish and chips and we sat in front of the TV watching the Queen's jubilee pagent. In the evening we went for the entertainment in the main hall which as ever involved some dancing and screaming. Ben was desperate to be picked and be involved in the on-stage games.<\/p><img src='images\/years\/2012\/2012_06_03-41-TenbyDay3-FollyFarm.jpg' class='diaryImage' alt='Jessica stroking a rat' \/><p class='diaryImageCaption'>Jessica stroking a rat<\/p><img src='images\/years\/2012\/2012_06_03-35-TenbyDay3-FollyFarm.jpg' class='diaryImage' alt='The 60 year olds' \/><p class='diaryImageCaption'>The 60 year olds<\/p>","images":false},"title":{"value":"Tenby Holiday - Folly Farm"},"version":1},{"date":{"d":2,"m":6,"y":2012},"datev":20120602,"images":1,"info":{"content":"<p>We woke quite early excited about what the day was going to offer us. The adults had a bacon and egg breakfast and the children had Multigrain shapes. Whilst the adults prepared a picnic, us children went to the playground. There were not many other children around as it was still pretty early.<\/p><p>Written by Ben<\/p><p>We set off to the beech at harf parst 9.Soonafter me and daddy made a dame up biy the sea.Soon after we had a cowll from sharshar saying Luke had got stac on the sand biy this crasiy persn.Then we went back to the campsite and went in the outdoor pool all of the childron dun triks on the slid.Once we wer all driy we had an icecreem,we startid 2 bbq and also Jim and Helon came rawnd.Abit later we went to the r and b club looke plad rok and ruwl bingo. We went to bed, all of the chilldron slept in the luxury carervan.<\/p><img src='images\/years\/2012\/2012_06_02-04-TenbyDay2-Beach.jpg' class='diaryImage' alt='There's a car on the beach' \/><p class='diaryImageCaption'>There's a car on the beach<\/p>","images":false},"title":{"value":"Tenby Holiday - Beach"},"version":1},{"date":{"d":1,"m":6,"y":2012},"datev":20120601,"images":3,"info":{"content":"<p>We took just over four hours to arrive at the Haven holiday park in Tenby. First of all we unpacked and had a look around our caravan. Benjamin liked it because it had quite a bit of space and a lot of bedrooms.<\/p><p>Afterwards we got into our swimming trunks and went to the outdoor pool. It wasn't that busy and the water was quite warm. We played races on the slides and did some wiggly swimming. After half an hour we decided to get up and walk into town up some big hills. We overlooked the North Beach where Daddy was made to feel jealous as there was a lone kayaker about to set off into the very inviting bay. We stopped off at the cafe which overlooked the bay and had some yummy food. We walked down to the castle area and then along the beach back to the holiday camp. Along the way we played up some of the rocks and explored some of the scarey caves.<\/p><p>Soon we met up with Auntie Charlotte, Luke, Duke and the Elders at Bradley's Playground. We went to explore Auntie Ellie's caravan and moved some of our stuff over as Ben and Katie slept there for the night. Much later that evening Ma Ma and Pop Pop arrived having spent 6 hours on the road!!<\/p><img src='images\/years\/2012\/2012_06_01-18-TenbyDay1-Explore.jpg' class='diaryImage' alt='Katie posing' \/><p class='diaryImageCaption'>Katie posing<\/p><img src='images\/years\/2012\/2012_06_01-30-TenbyDay1-Explore.jpg' class='diaryImage' alt='Jessica pulling a straight face' \/><p class='diaryImageCaption'>Jessica pulling a straight face<\/p><img src='images\/years\/2012\/2012_06_01-46-TenbyDay1-Explore.jpg' class='diaryImage' alt='Jessica pulling a straight face' \/><p class='diaryImageCaption'>Jessica pulling a straight face<\/p>","images":false},"title":{"value":"Tenby Holiday - Explore"},"version":1},{"date":{"d":27,"m":5,"y":2012},"datev":20120527,"images":3,"info":{"content":"<p>In the morning we went to church whilst Daddy and Farfar went to the PGA Championship at Wentworth. Farfar's car was really playing up and so they only just made it to Sunningdale. They dumped the car there and went down Onslow Road where they could cut through onto the 12th green \/ 13th tee. They did have tickets although they weren't needed.<\/p><p>They saw McGinley, Donaldson, Olazabal, Jimenez and followed Martin Kaymer a bit. They stayed for 3 hours before the struggle home in the car.<\/p><img src='images\/years\/2012\/2012_05_27-17-Golf.jpg' class='diaryImage' alt='Martin Kaymer' \/><p class='diaryImageCaption'>Martin Kaymer<\/p><p>Daddy then joined the rest of us at Richard and Sue's as Felicity was hosting a BBQ. It was a glorious sunny day and we had water facilites in the back garden. Pretty much everyone other than Grandma was got. Auntie Sue put a bucket of water over Pop Pop, All us children got both Mummy and Daddy. Uncle Steven threw a bucket over Matt from his old bedroom. Everyone took a deep breathe and time stood still for a second. A burst of laughter from us lot, and steam coming outof Matt's ears. When Steve dared to come down the stairs he was chased around the garden, he slipped and got the customary soaking that he deserved.<\/p><p>A good laugh had by all. In the evening Joey and Lily stayed the evening as Uncle Michael was in Asia and Auntie Ellie at work.<\/p><img src='images\/years\/2012\/2012_05_27-25-BarnettBBQ.jpg' class='diaryImage' alt='Auntie Ellie being pulled from the parachute' \/><p class='diaryImageCaption'>Auntie Ellie being pulled from the parachute<\/p><img src='images\/years\/2012\/2012_05_27-29-BarnettBBQ.jpg' class='diaryImage' alt='Uncle Peter about to get it' \/><p class='diaryImageCaption'>Uncle Peter about to get it<\/p>","images":false},"title":{"value":"PGA Golf Championship - Barnett BBQ"},"version":1},{"date":{"d":26,"m":5,"y":2012},"datev":20120526,"images":4,"info":{"content":"<p>Ben and Daddy took the long trip with farfar to the railway museum at York. We went by train, the first long distance express train journey made by Ben.<\/p><p>Farmor took us to Woking station where we took the 8.11am train to London. A bus ride on the number 59 took us to Kings Cross where we took the 9.30 train to York. It was a full of passengers but we all got a seat. The train was very fast and travelled at an average of 90 miles per hour.<\/p><p>The museum was very big and we saw lots of engines, carriages and other bits of railway things. Ben was very active in a short lecture on propulsion and kept volunteering for experiments and answering questions. We returned on the four o’clock train back to London which had more room and we sat at a table to ourselves. We then had some fish and chips in London before catching the train from Waterloo.<\/p><p>There was plenty to eat and drink all day, perhaps too much drink because Ben went the toilet three times on the train to York, once at York station, four times in the museum, four times on the train coming home and again at the fish and chip restaurant outside Waterloo station.<\/p><p>Meanwhile us girls went to ballet which was open for all to watch. Later we popped over to Cross Farm school where we were running two stalls the Lucky Dip and XXXX. Farmor won a day for two at a trendy spa place. Very nice.<\/p><p>Later in the afternoon Farmor took us to Pirbright to see the circus. We loved it. A tiring day for us all.<\/p><img src='images\/years\/2012\/2012_05_26-11-YorkRailMuseum.jpg' class='diaryImage' alt='Ben partaking in an acceleration experiment' \/><p class='diaryImageCaption'>Ben partaking in an acceleration experiment<\/p><img src='images\/years\/2012\/2012_05_26-26-YorkRailMuseum.jpg' class='diaryImage' alt='Rocket Ben' \/><p class='diaryImageCaption'>Rocket Ben<\/p><img src='images\/years\/2012\/2012_05_26-44-YorkRailMuseum.jpg' class='diaryImage' alt='Singing off the train at Kings Cross' \/><p class='diaryImageCaption'>Singing off the train at Kings Cross<\/p><img src='images\/years\/2012\/2012_05_26-53-YorkRailMuseum.jpg' class='diaryImage' alt='Daddy and Farfar' \/><p class='diaryImageCaption'>Daddy and Farfar<\/p>","images":false},"title":{"value":"National Rail Museum - Cross Farm Fair - Circus"},"version":1},{"date":{"d":19,"m":5,"y":2012},"datev":20120519,"images":6,"info":{"content":"<p>Another of our London Walks, this time the Dickens walk. We caught the tube from Gunnersbury to Russel Square where our walk began. Well, a kind of a false start really as just around the corner was Corams Fields which we've visited a number of times, so we decided to stop there for our picnic and a play on the swings.<\/p><p>Now some walking. <\/p><img src='images\/years\/2012\/2012_05_19-12-DickensWalk.jpg' class='diaryImage' alt='Down Chancery Lane, near Grays Inn' \/><p class='diaryImageCaption'>Down Chancery Lane, near Grays Inn<\/p><img src='images\/years\/2012\/2012_05_19-31-DickensWalk.jpg' class='diaryImage' alt='Nice architecture and trees at Temple' \/><p class='diaryImageCaption'>Nice architecture and trees at Temple<\/p><img src='images\/years\/2012\/2012_05_19-43-DickensWalk.jpg' class='diaryImage' alt='Monkeying around by Temple' \/><p class='diaryImageCaption'>Monkeying around by Temple<\/p><img src='images\/years\/2012\/2012_05_19-51-DickensWalk.jpg' class='diaryImage' alt='Walking beside the Thames' \/><p class='diaryImageCaption'>Walking beside the Thames<\/p><img src='images\/years\/2012\/2012_05_19-65-DickensWalk.jpg' class='diaryImage' alt='Don't lose your head Ben' \/><p class='diaryImageCaption'>Don't lose your head Ben<\/p><img src='images\/years\/2012\/2012_05_19-81-DickensWalk.jpg' class='diaryImage' alt='Ben waiting for the tube' \/><p class='diaryImageCaption'>Ben waiting for the tube<\/p>","images":false},"title":{"value":"Walk 32: Dickens - Russel Square to Farringdon"},"version":1},{"date":{"d":13,"m":5,"y":2012},"datev":20120513,"images":1,"info":{"content":"<p>Sun greeted us this morning. A tasty egg bap on the gas stove setup us nicely. Now the daring or stupid was about to happen. The 'lazy' rower along with the 'food snatcher', the 'two times dipper' and the 'titanic paddler' were boarding the most unstable vessel. Daddy was circling around like a shark waiting for it's prey to fall into the water. Michael with his weight issues sitting in the middle coupled with a nervous doggy made the canoe even more unstable. An abort request was made early on and Daddy in true 'Top Gear' type tradition laughed very hard at the panic and the remakable navigational skills of the oarsman in their desperation to find Michael and Dilly dry land. Eventually it happened half a mile down the river leaving a long walk back. Despite the idea of taking it easy, their were some serious efforts made to push the convoy along. Again Rachel and Michael were dotted along the route giving a cheery wave.<\/p><p>Some made the first stop, other 'canoers' didn't. It was so funny to hear the blame and counter-blame of why the boat went in the wrong direction. Thanks to Howard and Susan who kept Daddy most amused. We did eventually stop for lunch at Lower Lydbrook and a much earned rest. Daddy and Auntie Ellie who paired in a boat wondered why Charlotte and Pop Pop were quicker, so we swapped partners and we don't like to say what the results were. Needless to say Auntie Charlotte was in the stronger boat on noth occassions.<\/p><p>Come mid afternoon we finally reached Symonds Yat. Exit points from the river were few and far between, all charging to exit on their land! One canoe hire company was very reluctant to provide information on where we could drag the boats out. Very unfriendly. We finally made it out of the water, 42 miles since Hereford. A big well done and thank you to all who took part.<\/p><img src='images\/years\/2012\/2012_05_17-19-RossOnWye.jpg' class='diaryImage' alt='13 miles to Symonds Yat' \/><p class='diaryImageCaption'>13 miles to Symonds Yat<\/p>","images":false},"title":{"value":"Day 3 - Kayaking Weekend"},"version":1},{"date":{"d":12,"m":5,"y":2012},"datev":20120512,"images":4,"info":{"content":"<p>Daddy awoke early to the sound of bird song and funny sounds emanating from the Weston tent!!! It was quite frosty as well which poses quite an issue in a compact tent. Anyway it was lovely to peer out of the tent to see swans elegantly landing in the River Wye next to us. We ferried the vessels and campers up to Hereford boat yard and met the Fars and the Elders.<\/p><p>Away we go. 28 miles to Ross On Wye. The river was flowing at a good pace but not enough we thought for the hire companies to cancel their bookings. The sun was blazing and weather just about perfect. Down the river we saw a mink which was very exciting. Midway through the first leg a number of parties stop off at a campsite for a coffee, leaving the other two boats to carry on. Shocking teamwork.<\/p><p>Daddy swapped to the Canadian Canoe for a bit which was interesting using a single paddle and kneeling down. We spotted Rachel and Michael who dotted themselves along our route. The Fars caught a glimpse of us from high up in the hills.<\/p><p>16 miles in and our first accident. Not realizing how close we were to our lunchtime meeting point, Ellie and Susan wanted top stop for a rest. Howard and Daddy attempted to assist in landing on the river bank. The boys rested against a pole in a fast flowing part of the river. The ladies then bumped into the boys canoe, capsizing them and spilling the contents into the river. The girls of course remained dry and Ellie had the audacity to video the aftermath rather than help get the boys and bags out of the river! Daddy's phone and diabetes gear was in the bag which was rescued under the water. Pheeww. We lost Susan's jumper however.<\/p><p>The 'coffee crew' caught up and we set sail once again for about half a mile to Hoarwithy campsite, our lunchtime destination. Landing here didn't go without incident either and poor old Howard went in the drink again. His partner, the honourable Susan Tilbury stood up in the boat, lost balance and made the Canadian canoe capsize for a second time in half an hour. Oh how we laughed. Howard wasn't too impressed at first, but quickly saw the funny side.<\/p><p>We ate our lunch..... Dilly eating other peoples lunches and prepared for our second stint. Personnel changes meant the laziest rower in the world, Mr Michael Elder, partnered Howard in the Canadian canoe. Ellie was with her Dad, Jon with brother Gerry and Daddy with 'Billy No Mates'. Boys will be boys and much of Daddy's trek involved playing silly buggers with Uncle Michael and Howard. This leg was quite hard but it was very tranquil and nice just to stop and suck in the fresh air.<\/p><p>At about 6pm we finally landed just past Ross On Wye by a pub in Wilton. The patch of grass between the pub and the river was our camp site. It was a glorious sunny evening. The stuck the tents up, went to the pub and have a lovely meal and a couple of sherberts. We hadn't realized how much sun we had all caught during the day. Most kayakers had a touch of sunburn. There were many tired bodies with the 28 mile trek from Hereford.<\/p><img src='images\/years\/2012\/2012_05_17-17-RossOnWye.jpg' class='diaryImage' alt='Morning route' \/><p class='diaryImageCaption'>Morning route<\/p><img src='images\/years\/2012\/2012_05_17-07-RossOnWye.jpg' class='diaryImage' alt='In the boat with Howard' \/><p class='diaryImageCaption'>In the boat with Howard<\/p><img src='images\/years\/2012\/2012_05_17-18-RossOnWye.jpg' class='diaryImage' alt='Afternoon route' \/><p class='diaryImageCaption'>Afternoon route<\/p><img src='images\/years\/2012\/2012_05_17-05-RossOnWye.jpg' class='diaryImage' alt='Our campsite. Pub and river on the doorstep' \/><p class='diaryImageCaption'>Our campsite. Pub and river on the doorstep<\/p>","images":false},"title":{"value":"Day 2 - Kayaking Weekend"},"version":1},{"date":{"d":11,"m":5,"y":2012},"datev":20120511,"images":1,"info":{"content":"<p>Daddy had originally arranged for 16 people to go to Ross On Wye this weekend to go camping and kayaking. To get there Mummy and Jessica took Daddy to the A34 \/ A303 junction where Jon and Rachel picked him up and took him the scenic route to Hoarwithy, the location of the first campsite. After dumping our kit we had to go and collect the Canadian canoe 10 miles away at Symonds Yat.<\/p><p>When we arrived we were presented with a slight problem as we were told the river was flowing too fast and were told to reconsider our plans. Apparently the resovoir upstream was full and the Environment Agency had opened a dam and released loads of water. Some canoe hire companies had cancelled all weekend bookings. You could see that the water level was a meter or so higher than usual. So we decided tomorrow we'd start from Hereford.<\/p><p>Other arrivals at the campsite were Pop Pop, Jon's brother Gerry, Charlotte, Howard and Susan. Everyone laughed at Daddy's very small one man tent! We had a BBQ and a camp fire. It got pretty cold during the night.<\/p><img src='images\/years\/2012\/2012_05_17-09-RossOnWye.jpg' class='diaryImage' alt='Hoarwithy campsite and some very large tents!' \/><p class='diaryImageCaption'>Hoarwithy campsite and some very large tents!<\/p>","images":false},"title":{"value":"Day 1 - Kayaking Weekend"},"version":1},{"date":{"d":7,"m":5,"y":2012},"datev":20120507,"images":1,"info":{"content":"<p>In the morning we fitted a new tacky chiming doorbell and tested out our new one man tent.<\/p><p>We then drove to Cheltenham to celebrate Charlotte's 26th birthday with a BBQ along with the Elders and Steve, Joyce and Eva. Dilley and Duke were manic running around the house.<\/p><img src='images\/years\/2012\/2012_05_07-10-CharlottesBday.jpg' class='diaryImage' alt='Mummy playing with Eva' \/><p class='diaryImageCaption'>Mummy playing with Eva<\/p>","images":false},"title":{"value":"Charlotte's BBQ Birthday"},"version":1},{"date":{"d":6,"m":5,"y":2012},"datev":20120506,"info":{"content":"<p>Daddy and Auntie Susan decided they would bike from our house going along the canal and river to central London! Madness. It was pretty cold and there were a few drops of rain in the air, however, they soildered off along the roads to Knaphill where they joined the Basingstoke Canal. From there they headed north east and joined the River Wey right by the M25. A muddy path led to Weybridge and a short trip on the roads made them join up with the Thames.<\/p><p>Farfar waited by the burger van at Walton bridge egging them to have an all day breakfast. After his recent find of having heart trouble we thought it best to steer him away from this. We had a cup of tea and then off again up towards Hampton Court where they rode through Home Park and out to Kingston. It got a little muddy to the next town of Richmond. They again went by road up to Chiswick bridge and then joined the river again to Hammersmith and Putney. Riding on the north side of the river, they eventually hit Embankment and cycled past the busy Parliament Square, up Whitehall to Trafalgar Square where a big Vaisakhi festival was being held.<\/p><p>They had an entertaining walk past South Bank and all the street performers before catching a train ride to Ash Vale. A final 3 miles, made a total of about 45 miles on the day!<\/p><p>In the evening Joey and Lily came over to stay the night as Uncle Michael went to Thailand and Auntie Ellie worked.<\/p>","images":false},"title":{"value":"Canal and River Trek to London on the Bike"},"version":1},{"date":{"d":5,"m":5,"y":2012},"datev":20120505,"images":5,"info":{"content":"<p>After ballet we ventured to another of our London walks. This time was a trip to Upper Sydenham and Dulwich where we explored the woods along the disused train line to the old Great Exhibition. We had a good time, stopping for a game of 'forty-forty'. We played in the swing park at Dulwich before ending in the village.<\/p><img src='images\/years\/2012\/2012_05_05-08-Dulwich.jpg' class='diaryImage' alt='The family' \/><p class='diaryImageCaption'>The family<\/p><img src='images\/years\/2012\/2012_05_05-11-Dulwich.jpg' class='diaryImage' alt='Stand to attention' \/><p class='diaryImageCaption'>Stand to attention<\/p><img src='images\/years\/2012\/2012_05_05-14-Dulwich.jpg' class='diaryImage' alt='What a treesome!' \/><p class='diaryImageCaption'>What a treesome!<\/p><img src='images\/years\/2012\/2012_05_05-21-Dulwich.jpg' class='diaryImage' alt='Stepping up' \/><p class='diaryImageCaption'>Stepping up<\/p><img src='images\/years\/2012\/2012_05_05-35-Dulwich.jpg' class='diaryImage' alt='Katie happy at a walk' \/><p class='diaryImageCaption'>Katie happy at a walk<\/p><p>In the evening Daddy did a BBQ for us. Mmmm.<\/p>","images":false},"title":{"value":"Walk 31: Wild Woods of Dulwich"},"version":1},{"date":{"d":22,"m":4,"y":2012},"datev":20120422,"images":2,"info":{"content":"<p>In the morning Mummy collected us from the Fars. We then had church.<\/p><p>We returned to the Fars for a Frikadeller Sunday lunch with Auntie Susan and Graham. Halfway through the afternoon Ben and Mummy went off to the St Georges Parade in Camberley. All the Beavers, Cubs and Scouts in Surrey Heath attended.<\/p><p>Meanwhile the rest of us completed the second half of the treasure hunt in the woods.... and the rain. Uncle Graham stayed behind to make a Lego version of Ibrox!<\/p><img src='images\/years\/2012\/2012_04_22-16-Fars.jpg' class='diaryImage' alt='What a sad star' \/><p class='diaryImageCaption'>What a sad star<\/p><img src='images\/years\/2012\/2012_04_22-23-Fars.jpg' class='diaryImage' alt='A proud Rangers supporter' \/><p class='diaryImageCaption'>A proud Rangers supporter<\/p>","images":false},"title":{"value":"Fars For Lunch, St Georges Day Parade"},"version":1},{"date":{"d":21,"m":4,"y":2012},"datev":20120421,"images":4,"info":{"content":"<p>Katie had been on two sleepovers. The first on Thursday night was with Brownies and last night she had a fun evening at the Sanders, going for McDonalds and bowling.<\/p><p>Daddy and Ben went off to collect Katie and them headed straight to Headley for a 9am kickoff. Ben got a couple attempts at goal this week, which was very satisfying.<\/p><p>After lunch we went to Farnborough for a swim. It's been a while since we've been. We dashed home to find Charlotte and Farmor waiting for us. Farmor took us in the car to Chertsey to pick Farfar up from football. Steve Powers told us that Daddy used to be a pickle which we found ammusing. After our Fish and Chips we did a twilight Treasure Hunt, then when it got too dark we went back to watch the original Italian Job.<\/p><p>Meanwhile Daddy, Mummy and Auntie Charlotte went all the way to a Barn outside Colchester for a proper Essex wedding party. Mummy's cousin, Kerry married 2 weeks previous in Cuba and this was the home leg as it were. It was real nice to see that side of the family again. Mummy and Auntie Ellie did a lot of dancing. Daddy feasted on the hogg roast! A 1:30am return.<\/p><img src='images\/years\/2012\/2012_04_21-50-KerrySimonWeddingParty.jpg' class='diaryImage' alt='Mummy and Daddy on there way out' \/><p class='diaryImageCaption'>Mummy and Daddy on there way out<\/p><img src='images\/years\/2012\/2012_04_21-25-KerrySimonWeddingParty.jpg' class='diaryImage' alt='Christine, Gerry and Heather' \/><p class='diaryImageCaption'>Christine, Gerry and Heather<\/p><img src='images\/years\/2012\/2012_04_21-16-KerrySimonWeddingParty.jpg' class='diaryImage' alt='Showing us the married moves' \/><p class='diaryImageCaption'>Showing us the married moves<\/p><img src='images\/years\/2012\/2012_04_21-30-KerrySimonWeddingParty.jpg' class='diaryImage' alt='More phone girls than party girls' \/><p class='diaryImageCaption'>More phone girls than party girls<\/p>","images":false},"title":{"value":"Katie's Sleepovers, Swimming, Kerry's Wedding"},"version":1},{"date":{"d":15,"m":4,"y":2012},"datev":20120415,"images":1,"info":{"content":"<p>As there was no Sunday School we stayed at home with Daddy playing and getting the bikes ready for later in the afternoon. After Mummy returned from church we sped off to Kenley and to the Burrows household. It was the first time in a while since Daddy had seen the house after it had been done up. He liked it very much from the white theme to the period architecture. Anyway Ben and Thomas got on like a house on fire. We had a BBQ with some really nice food.<\/p><p>We invaded the home of Fiona's sister and then all moved on to Kenley Aerodrone where it was very windy. Daddy took a foam plane which he threw for the first time and hit Jo on the back of the head. Whoops. Meanwhile Ben had wandered off on his bike half way around the aerodrome, so Daddy raced off to find him on Katie's bike. There wasn't much time for anything else. Mummy and Jessica sheltered in the car waiting for the rest of us to finish up.<\/p><img src='images\/years\/2012\/2012_04_15-02-Burrows.jpg' class='diaryImage' alt='Lounging around' \/><p class='diaryImageCaption'>Lounging around<\/p>","images":false},"title":{"value":"Over To The Burrows For Lunch"},"version":1},{"date":{"d":14,"m":4,"y":2012},"datev":20120414,"images":1,"info":{"content":"<p>Ben played football next to the Arena in Camberley and done quite well this week. He got a shot off at goal which was marvellous. However, he took a smack to the face which at first it looked if he had absorbed, but 5 seconds later he began to feel the affects and balled out crying. He was substituted, which was a shame as I say as he played very well.<\/p><p>When Ben and Daddy returned the Sanders had just turned up for a feast of Gay entertainment. Evie met the hamster, Milly Molly who was on her two week vacation here much to our delight, but not quite Daddy's. In the two weeks she has kept us awake by going on her wheel during the night, poo'ed over the carpet and generally we've found hamster food all over the house. Ben got his revenge by painting nail varnish on it yesterday!<\/p><p>After lunch we went to the Garden Of Eden swings where Daddy set out an obsticle course. Ben and Katie went around and around trying to beat each others time. Even each of the adults had a go. On the way back we stopped off at the Royal Logistics Museum which had a Jeep and a Land Rover which we played in for quite a time. An ex-army now policeman turned up and spoke about his experiences in the Land Rover when he was stationed in Northern Ireland. It sounded pretty scary stuff.<\/p><p>Later in the afternoon Ma Ma and Pop Pop popped around to take Milly Molly away.<\/p><img src='images\/years\/2012\/2012_04_14-04-Sanders.jpg' class='diaryImage' alt='Jam Sandwiches' \/><p class='diaryImageCaption'>Jam Sandwiches<\/p>","images":false},"title":{"value":"Sanders Over For Lunch, Milly Molly returns"},"version":1},{"date":{"d":8,"m":4,"y":2012},"datev":20120408,"images":1,"info":{"content":"<p>We had church in the morning. Mummy was on sidesman duty. There was no Sunday school so went into creche instead.<\/p><p>We went home to pick up Daddy and raced over to the Elder household for a lovely roast lamb lunch. Daddy was very pleased at this as we never have this at home as he is the only one who loves it.<\/p><p>Later in the afternoon we all piled around to Uncle Pete's house. It was nice to see alot of the family. We had an Easter Egg hunt where we hauled more than enough to last for weeks.<\/p><img src='images\/years\/2012\/2012_04_08-22-EasterSunday.jpg' class='diaryImage' alt='Sue dishing out the Easter Eggs' \/><p class='diaryImageCaption'>Sue dishing out the Easter Eggs<\/p>","images":false},"title":{"value":"Easter Sunday - Elders lunch and Peter's Party"},"version":1},{"date":{"d":7,"m":4,"y":2012},"datev":20120407,"images":4,"info":{"content":"<p>We started at a reasonable time on Saturday morning and travelled through London and parked up by Tower Hill. Before starting the walk we went to an excellent playground just by the tube station. There were funny springy aparatus and a fast roundabout which Daddy spun us off! After the obligatory toilet trips we ventured down to St Katherines dock where we passed all the posh yachts.<\/p><img src='images\/years\/2012\/2012_04_07-01-WappingLimehouseWalk.jpg' class='diaryImage' alt='To the tower' \/><p class='diaryImageCaption'>To the tower<\/p><p>We largely followed the Thames path and soon passed the steps where Daddy and Katie ended the London kayak expedition back last year. Mummy was getting fed up listening to this constant story! We soon stopped for lunch overlooking Tower Bridge. Ben scooted along as we headed upon virgin territory, well for us anyway. Wapping, the home of the newspapers, had many luxury flats overlooking the river. So close to the hustle and bustle of Tower Hill and the City, however, very quiet. Hardly any traffic and the occassional jogger and dog walker. We stopped at a playground and continued along our 5 mile journey, eventually reaching the financial district. We reached Cabbot Square and West India Dock where we ended our walk, one which the children seemed to enjoy, or at least they've got used to the routine now!<\/p><img src='images\/years\/2012\/2012_04_07-24-WappingLimehouseWalk.jpg' class='diaryImage' alt='Tower Bridge' \/><p class='diaryImageCaption'>Tower Bridge<\/p><img src='images\/years\/2012\/2012_04_07-46-WappingLimehouseWalk.jpg' class='diaryImage' alt='Daddy with the crew at West India dock' \/><p class='diaryImageCaption'>Daddy with the crew at West India dock<\/p><img src='images\/years\/2012\/2012_04_07-51-WappingLimehouseWalk.jpg' class='diaryImage' alt='Lovers' \/><p class='diaryImageCaption'>Lovers<\/p><p>We caught the Docklands Light Railway ad Tube back to the car and made home via the weekly food shop at Shannons Corner.<\/p>","images":false},"title":{"value":"Walk 30 - Tower Hill to Canary Wharf Walk"},"version":1},{"date":{"d":6,"m":4,"y":2012},"datev":20120406,"images":1,"info":{"content":"<p>In the morning we went to the Easter workshop, taking Summer with us where we made plenty of craft stuff as well as 'hot buns' (hot cross buns) as Jessica puts it. It has been a delight to have Summer over she is very well behaved and plays very well with Katie. They are good friends.<\/p><p>In the afternoon we went over to Reigate where we met up with Karen and Alice. We went on the excellent playground. It was a very sunny day. After spending a couple of hours there, we climbed up Reigate hill where we went exploring down the bottom of the hill.<\/p><img src='images\/years\/2012\/2012_04_06-02-ReigatePark.jpg' class='diaryImage' alt='Mummy chatting away to Karen' \/><p class='diaryImageCaption'>Mummy chatting away to Karen<\/p>","images":false},"title":{"value":"Good Friday: Easter Workshop, Reigate with the Teales"},"version":1},{"date":{"d":5,"m":4,"y":2012},"datev":20120405,"first":{"value":null},"info":{"content":"<p>Summer came over for a sleepover with Katie. They stayed up till gone midnight watching the film Hairspray.<\/p>","images":false},"title":{"value":"Summer over for a sleepover"},"version":5},{"date":{"d":1,"m":4,"y":2012},"datev":20120401,"images":1,"info":{"content":"<p>We churched in the morning as usual. After Sunday lunch the girls went to church for the Baptism party, whilst the boys enjoyed a leisurely stroll down the Thames in the Kayak. They started in Old Windsor and paddled to the swings at Runymede where they stopped for a play. Ben was helpful as ever in the boat. They returned back to the car in quick time. They chatted all the way back about World War II and the computer game, Civilization III.<\/p><img src='images\/years\/2012\/2012_04_01-16-ThamesRunnymedeKayak.jpg' class='diaryImage' alt='Alternative paddling style' \/><p class='diaryImageCaption'>Alternative paddling style<\/p>","images":false},"title":{"value":"Ben Kayaking, Church Baptism Party"},"version":1},{"date":{"d":30,"m":3,"y":2012},"datev":20120330,"first":{"value":null},"info":{"content":"<p>Jessica had ballet in the morning, Ben lost 6-0 at football and in the afternoon we went to the new softplay in Fleet for Jessica's friends birthday party.<\/p>","images":false},"title":{"value":"Ballet, Football, Birthday Party"},"version":5},{"date":{"d":29,"m":3,"y":2012},"datev":20120329,"first":{"value":null},"info":{"content":"<p>I was the first one to wake up in the morning. We got dressed and went to the cafe to have our breakfast which was Frosties and an apple and you could have a yoghurt, but I didn't because they had bits in it. We went back to our dormitory to chill out for a bit. I was in group B which meant I played in the playground. Me Caitlin played horses for an hour. After that we made pottery. I made a duck pond with ducks and a snake in the middle. Then Mrs G then had a turn on the potters wheel and made a vase which turned out quite good. Next up was lunch which comprised of a packet of salt and vinegar crisps, a ham sandwich, and two apples. I had apple juice to wash it all down.<\/p><p>After that we went to the 'Living History' part and went in lots of roundhouses. We made flour and butter.<\/p><p>After our roast dinner we went into the barn and had a pirate party. We danced the Conga and played a game of musical statues which I came joint first in. We went back to our dormitories and had another story read to us and were given glowsticks to help us in the night.<\/p>","images":false},"title":{"value":"Day 2 - Katie's New Barn School Trip"},"version":5},{"date":{"d":28,"m":3,"y":2012},"datev":20120328,"first":{"value":null},"info":{"content":"<p>We got to school, did the register and lined up with a partner. My partner was Catilin who I sat next to on the coach down to Dorset. When we got there we had our packed lunch and had a tour around the site at New Barn. We explored the barn, the quiet area and the playground.<\/p><p>Then we got to know who we slept with. I was sleeping on the top bunk in the Hayloft and Caitlin slept below on Wednesday night and Megan on the Thursday. Others in my dormitory were: Phoebe, Mezlie, Tolu, Natasha, Georgia, Megan, Poppy and Caitlin. The activity we did first was orienteering and I partnered with Nina. We had to find all the places marked on the map. We then went back to our dormitories and we were a bit smelly so we had a shower. Then we went to have our dinner in the cafe which was chips, chicken nuggets and baked beans. For pudding we had ice cream with kind of bread around it. Then we went back to our dormitory, got into our pyjamas and chatted for a bit. Our leader, Mrs G, read us the story, The Grufalo, and another story called 'Ridiculous'. She then gave us a glowstick each. We took about 5 minutes to get into bed and another 5 minutes to fall fast asleep.<\/p>","images":false},"title":{"value":"Day 1 - Katie's New Barn School Trip"},"version":5},{"date":{"d":27,"m":3,"y":2012},"datev":20120327,"first":{"value":null},"images":1,"info":{"content":"<p>Ben dressed as an old Londoner for the Music Festival. He was beeming, excited and nervous beforehand. He sang very well, played the glockenspiel and did his Londener dance.<\/p><img src='images\/years\/2012\/2012_03_27-18-BenMusicFestival.jpg' class='diaryImage' alt='Ben as performing as a Londoner' \/><p class='diaryImageCaption'>Ben as performing as a Londoner<\/p>","images":false},"title":{"value":"Ben's Surrey Heath Music Festival"},"version":5},{"date":{"d":25,"m":3,"y":2012},"datev":20120325,"first":{"value":null},"images":2,"info":{"content":"<p>I, Daddy, spent the weekend away with Michael and a group called the Madhatters who are an Airsoft team. For the uninitiated Airsoft is like paintball on steroids. Ball bearings are the bullets, but there is also grenades of various sorts (stun, smoke, frag), tracer or glow in the dark ball bearings, competitors with 3rd generation night vision which cost into the thousands of pounds. There are various weapons from pistols, sniper rifles and the million variants of machine gun. There were lots of other 'pyros' which were exploded to signify air strikes and mortar fire all of which were very loud, especially when you are in a building which bounces the sound.<\/p><p>Anyway I prepared in customary style. He had no kit, no gun, no ammo, no place to sleep, little food and no idea on the rules of the game, even that it was a 24 hour non-stop game! Instead, rolling up on the motorbike with a sleeping bad half falling out of the top box. 'You are joking!!' Thankfully Michael and the Madhatters provided the rest. First night, Friday, was spent in the tent on uncomfortable ground. Having being told to man-up and not bring two sleeping bags and balaclava, Michael had two of everything and an airbed! Last time I'll listen to that advice!!<\/p><p>Over 300 competitors, 80 odd buildings at Copehill, Salisbury plain, a military training location. The shouty, swear mongering sergent major figure outlining the rules at the equivilent of the FA Cup final event, barked out if everyone had done Airsofting before. Clearly everyone had... other than Myself and Michael, but we were no way going to admit that. We started at 11am as reserves, clearing houses where enemy stragglers were situated. In our Madhatters section there were seven of us, lead by Rich. To begin with communications were good. The platoon leader would give, Rich orders and he'd relay them on and we all stuck together. Nearer the end it was a case of get together if you can. Still it did not ruin the experience. Some other teams were like well oiled machines. The 'Tigers' section were the in-house, home team. It was a slick operation watching them perform house clearences.<\/p><p>After our initial task, we got bogged down in a group of 4 houses in a fire fight on the front line for about 3 hours. One of the idiosyncrasies of us fighting men was to stop for tea break back at the campsite. We had the finest leaf tea money could buy served with the china tea set that Alex had bought for 25 pounds! We all agreed it was a spiffing brew and decided to go and give the hun a jolly good boff on head for not playing with a straight bat!!<\/p><img src='images\/years\/2012\/2012_03_25-02-AirsoftWithTheMadhatters.jpg' class='diaryImage' alt='Daddy in the army' \/><p class='diaryImageCaption'>Daddy in the army<\/p><p>After a slow start with the gun, I managed to kind of get hang of it. By the end of the game I was getting frustrated at how quick the ammo was going I was firing so much. After the tea break we had lost a lot of ground and so a new environment and set of problems to overcome. As night fell we were tasked to defend the ammo compound. Not one of us fired a weapon for about an hour. Humiliatingly one of the 'tans' (the opposition) walked up to our building said 'how are you?', to which we replied, then he shot me with a pistol from close range and knife killed Brett and then took our 'intel'. Our excuse was that we couldn't tell in the dark which side he was on, the truth was, we were embarrassingly caught off guard. It was pitch black in the building, but some of the enemy had \"night vision\", effectively being able to see in the dark! I couldn't even see to the end of the room I was in. To add to this was the fact that most competitors had tracer rounds and I did not, so even if I did shoot I would not be able to see where I was aiming at. These disadvantages and a cracking headache I decided to make use of Michal's airbed and turn in early with the thought of getting up at first light.<\/p><p>At 5:45 I got up, scraped the frost from my gun and kit and went into battle leaving others in bed. I felt very refreshed and got a second wind of enthusiasm. It all seemed to click in to place now. Movement, tactics, gun usage. I had a lot of fun. My highlight was being the last survisor on the top flight of Bangalore School. I had enemy firing at me from all angles. No one else in the building. My allies all on one side of the building firing at the enemy on the other side of the building. I killed two by just reaching out of the window and firing below me. It was such a buzz. Alas I ran out of ammo and had to go back and re-stock.<\/p><p>The game ended 11am on the Sunday morning, a full 23 hours, with the clocks moving forward. I wanted more, but my feet did not! We lost narrowly and after the results, a debrief and packing up the tents we all parted ways back to civilazation. A cracking weekend.<\/p><img src='images\/years\/2012\/2012_03_25-AirsoftWithTheMadhatters.jpg' class='diaryImage' alt='Airsoft, Section 3, aka The Madhatters' \/><p class='diaryImageCaption'>Airsoft, Section 3, aka The Madhatters<\/p>","images":false},"title":{"value":"Airsoft Weekend"},"version":5},{"date":{"d":24,"m":3,"y":2012},"datev":20120324,"info":{"content":"<p>Over the past two weeks we had both Katie and Ben's parents evening. The reports were that Ben is very enthusiastic in class and inquisitive enough to ask questions. Excels in Maths, but is a little sloppy on quality in terms of rushing things. Not because he is lazy, but because he wants to get on to the next thing. He's basically doing very well and we couldn't ask for more from him. Katie on the other hand.... no Katie is also doing well. Having Mrs Farage as a teacher has made such a difference as Katie loves her. As such she is progressing so much better than she was last year. All round she is a lot more confident in class. She is doing well in reading.<\/p><p>To this weekend. Daddy was away (see Sunday's account). Ben had football in the morning which the team lost 2-0. Again he played about half the match, watching the ball go past him mostly. Harsh but true.<\/p><p>In the afternoon we went over to Auntie Ellie's to stay the night. we played with Joey and Lily as usual. However, we were very, very naughty. We finished dinner early and asked to go out and play. We were told only to play on the grass at the back of the house, instead we went across two roads to the playground. After a bit, Mummy and Auntie Ellie could not find us. After 20 minute they had called the police. Fortunately before they came out we found them again and gave them a good telling off. Ben and Katie were very sorry.<\/p>","images":false},"title":{"value":"Football, Over to Auntie Ellie's"},"version":1},{"date":{"d":18,"m":3,"y":2012},"datev":20120318,"images":3,"info":{"content":"<p>Ben woke daddy up at 5:45 informing him he had to get up and help make Mummy's breakfast in bed and to put the meat on for a Sunday lunch! Great. Well Mummy certainly got some nice home made gifts. After a double church service. <\/p><p>In the afternoon we drove up to London, parked right by Regents Park and started our 3 mile walk. First was the house where the 101 Dalmations lived. That was the first and last reference to those muts!<\/p><p>Although we have been to Regents Park before, it was a while ago and we explored different areas this time. We traversed our way through, visiting the lake, rose garden, an island where we played 'it' and walked across the Regent's Canal right next to London Zoo. We got to Primrose Hill and climbed to the top, well Jessica was of course pushed there, the lazy madam. Good views over London. <\/p><p>We ended the walk going through the high street in Primrose Hill then over the railway bridge to Chalk Farm.<\/p><img src='images\/years\/2012\/2012_03_18-35-RegentsParkWalk.jpg' class='diaryImage' alt='Katie with wooden animals in Regents Park' \/><p class='diaryImageCaption'>Katie with wooden animals in Regents Park<\/p><img src='images\/years\/2012\/2012_03_18-44-RegentsParkWalk.jpg' class='diaryImage' alt='Beaut Ben' \/><p class='diaryImageCaption'>Beaut Ben<\/p><img src='images\/years\/2012\/2012_03_18-46-RegentsParkWalk.jpg' class='diaryImage' alt='Jessica on the run down Primrose Hill' \/><p class='diaryImageCaption'>Jessica on the run down Primrose Hill<\/p>","images":false},"title":{"value":"Walk 29 - Mother's Day - 101 Dalmations Walk"},"version":1},{"date":{"d":10,"m":3,"y":2012},"datev":20120310,"images":2,"info":{"content":"<p>Jessie had ballet in the morning, then we split. Mummy, like last year, agreed to collect for Marie Curie in memory of her Grandad. So we dropped her off at Longacre garden centre. The rest of us went to Crookham Memorial Hall for Joshua's first birthday party.<\/p><p>There were loads of toys set out for us to play with. Joey and Lily came along too which was nice.<\/p><p>After the party we returned to pick Mummy up in her funny costume.<\/p><p>Ben was really looking forward to the afternoon as he went on his first Beaver camp held just at the scout hut in Frimley Green. He took some old clothes which he cut up for his castaway outfit. They had a map and had to do a treasure hunt. He stayed over night, which we were a little worried about just in case he wet himself. We sent him off with two sleeping bags just in case.<\/p><p>Pop Pop, popped over for a quick cup of tea.<\/p><img src='images\/years\/2012\/2012_03_10-06-Joshua1stBirthday.jpg' class='diaryImage' alt='The young'uns crew' \/><p class='diaryImageCaption'>The young'uns crew<\/p><img src='images\/years\/2012\/2012_03_10-19-Joshua1stBirthday.jpg' class='diaryImage' alt='Mummy The Marie Curie Girl' \/><p class='diaryImageCaption'>Mummy The Marie Curie Girl<\/p>","images":false},"title":{"value":"Joshua 1st Birthday Party, Mummy collecting, Ben Beaver Camp"},"version":1},{"date":{"d":4,"m":3,"y":2012},"datev":20120304,"images":2,"info":{"content":"<p>We missed church, instead going to Natasha Burrows 4th birthday party held in the leisure centre in Redhill. As Katie and Ben were not really invited Daddy took them for a swim. Ben put so much effort into his 20 metre swim. The longest he's ever swum. They also went in the deep end and tried to sink to the bottom of the pool. Ben found this difficult as he was too bouyent.<\/p><p>It poured down outside and it even turned to sleet on occassions. We next stopped off at the Elders in Alton to meet their new dog, Dilley for the first time. The girls were not brave enough to go beyound the stair gate at first, but it was Dilley who was more nervous of the Gay's. A sweet doggy which was doted upon by the male Elders.<\/p><img src='images\/years\/2012\/2012_03_04-03-Natashas3rdBirthday.jpg' class='diaryImage' alt='Musical Bumps' \/><p class='diaryImageCaption'>Musical Bumps<\/p><img src='images\/years\/2012\/2012_03_04-07-DilleyMeet.jpg' class='diaryImage' alt='Doggy Dilley' \/><p class='diaryImageCaption'>Doggy Dilley<\/p>","images":false},"title":{"value":"Natasha 4th birthday party, Dilley meet"},"version":1},{"date":{"d":3,"m":3,"y":2012},"datev":20120303,"info":{"content":"<p>We headed Kent bound for Alices 5th birthday party. The car was not feeling too good so we were a bit worried if we going to make it or not. Alas we arrived albeit 10 minutes late at Monkey Biz, a soft play. Daddy came in to eat us all up and did actually catch us sometimes.<\/p><p>It was nice to see the Teale's. Karen is working hard a mum and working 5 days a week in London. The girl must be tired out.<\/p><p>Jessica had sausage and chips, we sang happy birthday. A nice time had by all.<\/p><p>Later in the afternoon Jessica had a final practice for her ballet exam. We also went over to the Army swings and popped into see Farmor.<\/p><object width=\"560\" height=\"315\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/Dl2Rvi13vWw?version=3&amp;hl=en_GB\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/Dl2Rvi13vWw?version=3&amp;hl=en_GB\" type=\"application\/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"><\/embed><\/object>","images":false},"title":{"value":"Alice 5th birthday party, Jessica Ballet"},"version":1},{"date":{"d":26,"m":2,"y":2012},"datev":20120226,"images":2,"info":{"content":"<p>In the next installment of our walks book we drove up to Lambeth and began our trek by the extermely busy London Eye and walked along South Bank, stopping to watch some of the entertainers. There were more acts than ever before. The whole park area was being improved so was fenced off to us which was a shame. We had a hug with the Queen, watched a magic man and some street dancing.<\/p><p>It was a glorious sunny day, good for a stroll. We moved on passed Festival Hall and to the skate park which was good for us as we all had our scooters with us. We were mixing it with the cool dudes. A boy tried to teach us how to go down the steep banks. However, we were a bit unsure and not confident enough to follow his lead. Daddy and Katie told the rest of us how they had lunch on 'Katie Island' which we saw out on the river between Waterloo and the Jubilee bridges. We were rather tired of hearing about it after a while!<\/p><p>We were stopped off by a few students who were doing a Tv piece for their university project. They asked a few questions to Mummy about her first ever kiss. She agreed but was very embarrassed and nervous. Still it made Daddy laugh.<\/p><p>We continued and stopped off at Gabrielle's Wharf for a little play on the wooden animals before passing the music man come sand sculturer. Jessica was the only person to manage to throw the money into the buckets on the small beach! We skirted the Tate Modern and crossed the wibbly-wobbly bridge before hitting the end point of St Paul's cathedral.<\/p><p>By this point we were all flagging a little and kind of not caring about St Paul's, which was a shame. We found a food shop and shoved a load of sweets, chocolates and crisps down our throats. We walked all the way back to the car in Lambeth and drove home. It takes about 1.25 \/ 1.5 hours to commute to London for us lot which is not too bad.<\/p><img src='images\/years\/2012\/2012_02_26-00-SouthBank.jpg' class='diaryImage' alt='Let's Entertain You' \/><p class='diaryImageCaption'>Let's Entertain You<\/p><img src='images\/years\/2012\/2012_02_26-29-SouthBank.jpg' class='diaryImage' alt='Angelic Jecmunda' \/><p class='diaryImageCaption'>Angelic Jecmunda<\/p>","images":false},"title":{"value":"Walk 28: Festival Of Britain"},"version":1},{"date":{"d":25,"m":2,"y":2012},"datev":20120225,"info":{"content":"<p>Daddy's boss, Paul Matthews got the sack yesterday which was very sad. He hates it when that kind of thing happens.<\/p><p>Jessica was preparing for her ballet exam next month. Ben came on as sub for his football team against Rushmoor in a 2-2 draw. The sofas also arrived which excited Mummy very much, but Daddy not so much as he spent the day deconstructing and dumping the old sofas!<\/p><p>In the evening Ellie and Lily came over and babysay us whilst Mummy and Daddy went to Berkhamsted Centenary Hall to see David perform in Strictly Learn Dancing. He did ever so well dancing both the Waltz and the Jive. They sat next to Linda and Alan which was nice so they could catch up. Lisa was saying David was very nervous.<\/p><p>Dance 1 - The Waltz - David Dixon and Toni Godbold<\/p><div class=\"youtube\"><object width=\"560\" height=\"315\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/GeXXfSzfbeY?version=3&amp;hl=en_GB&amp;rel=0\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/GeXXfSzfbeY?version=3&amp;hl=en_GB&amp;rel=0\" type=\"application\/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"><\/embed><\/object><\/div><p>Dance 2 - The Jive - David Dixon and Toni Godbold<\/p><div class=\"youtube\"><object width=\"560\" height=\"315\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/b-xnQM4EW2k?version=3&amp;hl=en_GB&amp;rel=0\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/b-xnQM4EW2k?version=3&amp;hl=en_GB&amp;rel=0\" type=\"application\/x-shockwave-flash\" width=\"560\" height=\"315\" allowscriptaccess=\"always\" allowfullscreen=\"true\"><\/embed><\/object><\/div>","images":false},"title":{"value":"Ballet, Football, Sofas, Dixon Strictly"},"version":1},{"date":{"d":19,"m":2,"y":2012},"datev":20120219,"images":1,"info":{"content":"<p>In the morning Mummy went to church, she was on sidesmans duties. Katie and Ben was being looked after by a sleeping Daddy. After a quick lunch we left at midday for the next walk out of the book: Richmond Marshes. Both Mummy and Daddy were sporting their new walking boots, although 99% of the walk was on gravel or tarmac!<\/p><p>We started off at Richmond station in the town centre and quickly moved towards the river past some nice looking parks and buildings, through Richmond palace and onto the river. It was a pretty chilly, but bright day. There were plenty of others walking along the Thames. Daddy had not been well for most of the week, and was starting to feel effects. However, we marched on and hit the midpoint at the river boat crossing by Ham House. We crossed and went on the swings on the north side of the river.<\/p><p>We went passed the impressive looking Marble House on our return leg, went on some more swings, back over Richmond bridge and to the car.<\/p><p><\/p><img src='images\/years\/2012\/2012_02_19-34-RichmondWalk.jpg' class='diaryImage' alt='Petersham Wall' \/><p class='diaryImageCaption'>Petersham Wall<\/p>","images":false},"title":{"value":"Walk 27: Richmond Thames Walk"},"version":1},{"date":{"d":18,"m":2,"y":2012},"datev":20120218,"first":{"value":null},"images":1,"info":{"content":"<p>Ben had football in the morning and came on as sub against Headley. <\/p><img src='images\/years\/2012\/2012_02_18-03-FrimleyVHeadley.jpg' class='diaryImage' alt='Three cheers' \/><p class='diaryImageCaption'>Three cheers<\/p><p>In the evening Daddy went over to Alton and played two games of poker. Unfortunately he did not win.<\/p>","images":false},"title":{"value":"Elder Poker Night"},"version":4},{"date":{"d":12,"m":2,"y":2012},"datev":20120212,"images":1,"info":{"content":"<p>In the afternoon Mummy went off to help transport children to the stables for Poppy's party. Katie of course went and enjoyed being on the back of a horse.<\/p><p>Meanwhile Daddy, Jessica and Ben played domino rally. We had a competition on who could build the longest continuos stack without it breaking. Ben won.<\/p><img src='images\/years\/2012\/2012_02_12-01-Dominos.jpg' class='diaryImage' alt='Domino Champ' \/><p class='diaryImageCaption'>Domino Champ<\/p>","images":false},"title":{"value":"Poppy birthday"},"version":1},{"date":{"d":11,"m":2,"y":2012},"datev":20120211,"images":1,"info":{"content":"<p>We fortunately went to Jessica's ballet as this week they let parents come in and watch. It was one of the funniest things ever as a parent. Jessica was constantly smiling and showing off her skills, always looking over to make sure we were watching her. She was brilliant<\/p><p>In the afternoon Katie went over to Poppy's for a play and a sleepover. Auntie Charlotte took Ben to the circus in Basingstoke which was fantastic.<\/p><img src='images\/years\/2012\/2012_02_11-13-JessicaBallet.jpg' class='diaryImage' alt='Jessica's ballet' \/><p class='diaryImageCaption'>Jessica's ballet<\/p>","images":false},"title":{"value":"Jessica ballet, Ben to circus, Katie sleepover"},"version":1},{"date":{"d":5,"m":2,"y":2012},"datev":20120205,"images":2,"info":{"content":"<p>We awoke to loads of snow. So much that it had weighed down the bush at the side of house and made it fall over the path. Another job for Daddy to get on with.<\/p><img src='images\/years\/2012\/2012_02_05-02-Fars.jpg' class='diaryImage' alt='Woods Snowy Walk' \/><p class='diaryImageCaption'>Woods Snowy Walk<\/p><p>We wrapped up warm got the wooden sleigh out and treked through the woods to Richmond Close. It was tough pulling two children up the hills. The snow was fast thawing making out heads all wet and cold.<\/p><img src='images\/years\/2012\/2012_02_05-03-Fars.jpg' class='diaryImage' alt='The cattle feeding' \/><p class='diaryImageCaption'>The cattle feeding<\/p><p>We had breakfast at the Fars, played with the electric train set and completed the treasure hunt the fars set us. We made some hamma bead mats which we were going to give to Mummy as a welcome home present. Fortunately Farfar gave us a lift back home. The roads were not that bad.<\/p><p>We went off to Farnham to collect Mummy who eventually returned! We had a relaxing afternoon, making a snowman and clearing up!<\/p>","images":false},"title":{"value":"Fars and Mummy returns"},"version":1},{"date":{"d":4,"m":2,"y":2012},"datev":20120204,"images":1,"info":{"content":"<p>Mummy went off to her cousin Kerry's Hen Night last night and didn't return until Sunday. Therefore we had the Dark Side Daddy to look after us and threatened to send us to bed at 5:30pm. Well first off we all played rough and tumble in bed for 45 minutes in the morning. Daddy tried to trap us. We eventualy got up and took Jessica to her ballet lesson. Whilst Jessica was again smiling and laughing in her lesson, Katie beat us at a game of Whist! There was an announcement being made so Daddy rushed out of the kitchen into the main hall way, as Ben followed he pushed his way through, pushing so much he made Daddy lose his balance and make a right old racket in trying to avoid little baby Lucy. He eventually fell out of the fire escape doors! He never did find out what the announcement was.<\/p><p>We went off to the shops to get some hot dog sausages which we had for lunch and of course some sweeties. Ben felt a little unwell when we returned home. I think he was the next in line to contract 'Slapped Cheek' which has being doing the rounds. Anyway we snuggled him up to bed for a little sleep. Katie and Jessica made him little 'Get Well Soon' pictures. Very sweet.<\/p><p>The first part of the afternoon was spent doing homework. Katie had to make a map and plot co-ordinates as well as reading. Ben had reading and sentences to write. I am still trying to get Jessica to consistently count to 20. This is proving a hard task. She misses out seven, then gets stuck at thirteen. Frustrating. Later we went to Aldershot Ski for Adam's birthday party. We went snow tubing down the ski slope. Daddy and Jessica managed to go down as well, which was a surprise as we thought it might be a bit too fast for Jessica to go down. At the end just the four of us had a race down. Katie won!<\/p><img src='images\/years\/2012\/2012_02_04-01-Snow.jpg' class='diaryImage' alt='Katie on the slide' \/><p class='diaryImageCaption'>Katie on the slide<\/p><p>Funnily enough as we left the ski slope it started snowing for the first time this winter. Woo Hoo. We quickly popped in to see the West's and drop Freya's birthday present off. However, only Barrie was at home. We had a drink and a play with the Star Wars figures before returning home.<\/p><p>Daddy missed his 5:30pm by a couple of hours. We still had time for some stories.<\/p><p>Meanwhile Mummy went to Colchester with her mum and sisters for a spa day then a trip on the party bus down to London, then onto the party boat, then back up to Colchester. All we heard about was the amazing party bus and the lack of food. This spelt trouble in terms of alcohol! The journey was a little frought with the snow blizzard conditions. The party bus tried to drop off 15 half cut women 7 miles short at 2am in the morning! Erm NO. They eventually got home but it was snowing hard.<\/p>","images":false},"title":{"value":"Daddy only!"},"version":1},{"date":{"d":29,"m":1,"y":2012},"datev":20120129,"images":1,"info":{"content":"<p>In the morning we went off to church as usual. As we were not able to make Joey's midweek birthday party we went to the Monkey pool in Woking to celebrate. Katie dared to go on the super fast slide all by her slef. We also managed to workout that if you stretched your arms behind you, then you slide quicker. We ended with a drink and some birthday cake in the cafe.<\/p><img src='images\/years\/2012\/2012_01_29-08-JoeyWokingSwim.jpg' class='diaryImage' alt='Katie sharing her Slush Puppy with Joey' \/><p class='diaryImageCaption'>Katie sharing her Slush Puppy with Joey<\/p><p>Meanwhile, Jessica had her best friends party, Amee Huggets, down at Tomlinscote school which Mummy walked her to.<\/p><p>Later in the afternoon, Daddy returned to work, whilst the rest of us went to the church party. Mummy had just joined the church social committee so had to help organise.<\/p>","images":false},"title":{"value":"Joey Swim, Church Party"},"version":1},{"date":{"d":28,"m":1,"y":2012},"datev":20120128,"images":2,"info":{"content":"<p>After taking Jessica to ballet and picking up Daddy's perscription we headed west to Gloustershire to see Auntie Charlotte, Luke and of course the new Duke. Duke being a new addition to the family, a Staffordshire Pit Bull puppy. We were all pretty anxious about how sharp it's teeth might be.<\/p><p>Ben was the first to brave going in the garden to see him. Duke lept up at Ben, but Ben stood his ground although pretty nervous. Ben also ran away from him a couple of times being a bit scared. However, Duke was well behaved and only caught Ben the once with a scratch.<\/p><img src='images\/years\/2012\/2012_01_28-02-DukeMeet.jpg' class='diaryImage' alt='Ben meet Duke' \/><p class='diaryImageCaption'>Ben meet Duke<\/p><p>Eventually the rest of us were integrated to Duke gradually and he came into the huse. Katie and Jessica were still quite nervous of him and managed to just about stroke him. We are a funny lot really being scared of a puppy.<\/p><p>After some lunch we went to the park by the Cheltenham Pump Rooms so we all could have a run around. Having a young puppy really turns you into a mecca for other gossiping dog owners. We walked around the huge lake and played on the swings and went on the adventure trails.<\/p><img src='images\/years\/2012\/2012_01_28-27-DukeMeet.jpg' class='diaryImage' alt='Ben meet Duke' \/><p class='diaryImageCaption'>Ben meet Duke<\/p><p>Returning to Charlotte and Luke's house we were graced with the Elder's presence who were visitng friends locally. We stopped off for pizzas before a petrol hungry journey home!<\/p><p>By the end of the day we all had a go at feeding Duke from our hand, a big step up from where we were at the start of the day. <\/p>","images":false},"title":{"value":"Duke Meet"},"version":1},{"date":{"d":22,"m":1,"y":2012},"datev":20120122,"images":2,"info":{"content":"<p>Church and work in the morning as usual. It was quite a chilly day, this week we braved going for our bike ride starting off at Hampton Court Palace. We were impressed with 'toparied' gardens. Unfortunately Daddy still has not fixed Katie's bike which meant her pedal kept coming off. Still we had lots of freedom and didn't need to worry about Ben continually falling off his bike. We're not sure what he's doing half the time, he seems a little out of control and therefore constantly fighting the bike to stay upright. Is he drunk? We made our way out of one of the gates into Home Park which led us past the deer and playing logs up to Kingston bridge. <\/p><img src='images\/years\/2012\/2012_01_22-06-HamptonCourtBikeRide.jpg' class='diaryImage' alt='Formal Gardens, Hampton Court Palace' \/><p class='diaryImageCaption'>Formal Gardens, Hampton Court Palace<\/p><img src='images\/years\/2012\/2012_01_22-20-HamptonCourtBikeRide.jpg' class='diaryImage' alt='The gang in Home Park, Hampton Court' \/><p class='diaryImageCaption'>The gang in Home Park, Hampton Court<\/p>","images":false},"title":{"value":"Hampton Court Palace Bike Ride"},"version":1},{"date":{"d":21,"m":1,"y":2012},"datev":20120121,"info":{"content":"<p>Another busy Saturday, first up Jessica to ballet, then Ben to football which was a bit of a mission. He needed some encouragement as his confidence was running a little low. Returning home, Daddy had to help Katie out with her 'Chunk Division' homework as Mummy hadn't a clue. This actually this was a bit unfair as Katie could do it without Daddy's help really. Just need to work on the addition and subtraction of small numbers. Daddy expects Katie to answer quickly, rather than using her fingers to calculate.<\/p><p>In the afternoon we had three concurrent parties. Jessica was at the lavish Jermimah's house, Ben went to Jake's football party, and Katie was lucky enough to go to Leah Rushforth's party which was a trip to the Polka Theatre, Wimbledon to see the Charlotte's Web production. They are a great family always hosting and putting on great events. Daddy thinks they're wonderful.<\/p><p>We had a treat and went to the fish and chip shop for tea.<\/p>","images":false},"title":{"value":"3 Parties at 3pm"},"version":1},{"date":{"d":15,"m":1,"y":2012},"datev":20120115,"images":1,"info":{"content":"<p>It was bitterly cold. Our walk at Hampton Court was cancelled because it was too cold apparently. So a load jobs to be done and a trip to the army swings.<\/p><img src='images\/years\/2012\/2012_01_15-05-ArmySwings.jpg' class='diaryImage' alt='Katie playing at the swings' \/><p class='diaryImageCaption'>Katie playing at the swings<\/p>","images":false},"title":{"value":"Not a lot"},"version":1},{"date":{"d":14,"m":1,"y":2012},"datev":20120114,"images":2,"info":{"content":"<p>A busy day, first up was ballet where Jessica was taken Daddy who waited in a cramped waiting area. It was the coldest day of the winter so far. Daddy managed to peek through and watch Jessica with a smile on her face constantly attempting to follow the leader, sometimes slipping onto the floor and getting back up laughing. Daddy was very proud of watching his happy little girl.<\/p><p>Next up was a quick excursion to the Fars, then a trip for all of us to see Hart Jets versus Frimley Green Cheetahs. The Sanders came over to watch Ben play 20 minutes in a ding dong game which ended in a 4-4 draw.<\/p><img src='images\/years\/2012\/2012_01_14-01-FrimleyGreenVHartJets.jpg' class='diaryImage' alt='Ben on the subs bench' \/><p class='diaryImageCaption'>Ben on the subs bench<\/p><p>Farnborough shopping next to buy a sofa and a new router! £1200 lighter in the wallet.<\/p><p>The afternoon was spent at a couple of birthday parties, one at Tonlinscote with Jessica, the other Leah Sumners at Cross Farm School.<\/p><img src='images\/years\/2012\/2012_01_14-19-AvaBirthdayParty.jpg' class='diaryImage' alt='Jessica and her best friend Amy Huggets' \/><p class='diaryImageCaption'>Jessica and her best friend Amy Huggets<\/p><p>The Elders came around in the evening for some playtime. Mummy and Ellie sorted out the Weston 60th birthday outing, the boys went off to Chertsey Town F.C. to lose at poker!<\/p>","images":false},"title":{"value":"Ballet, Football, Birthday Parties"},"version":1},{"date":{"d":8,"m":1,"y":2012},"datev":20120108,"images":1,"info":{"content":"<p>After church  we went up to London and started off at Hyde Park near the Italian fountains. We took our scooters and caught the tube from Lancaster gate to Notting Hill Gate where the walk officially starts.<\/p><p>The first half of the walk was down Portabello Road. Daddy made us go slowly as he went in record and shoe shops! We also went in the occasional tourist boutique.<\/p><img src='images\/years\/2012\/2012_01_08-24-PaddingtonWalk.jpg' class='diaryImage' alt='Portabello Road' \/><p class='diaryImageCaption'>Portabello Road<\/p><p>The second half of the walk was along the Grand Union canal. We stopped off at Trellick Towers playground and a cool skate park at Westbourne Terrace. We scooted past Little Venice and into Paddington Station. We couldn't find the Paddington Bear statue unfortunately. A good walk.<\/p>","images":false},"title":{"value":"Walk 26: Paddington"},"version":1},{"date":{"d":7,"m":1,"y":2012},"datev":20120107,"images":1,"info":{"content":"<p>A bits and pieces day. Ben had football which Mummy and the Fars went to see. Daddy stayed home with the girls and lost 4 games of 'Teego' or 'Stratego'. We then went to get Daddy's motorbike fixed, and looked at some new sofas in Farnham. Next we rushed over to the Old Dean to drop Mummy and Jessica off at Lily's birthday party. Meanwhile the 'crocodile' and two bits of meat went swimming at the Arena. Ben's swimming has really come on. He can swim the length of the baby pool, a bit of a struggle, but still he's come on so much since moving swimming lessons.<\/p><img src='images\/years\/2012\/2012_01_07-06-Family.jpg' class='diaryImage' alt='Jessica playing 'Teego'' \/><p class='diaryImageCaption'>Jessica playing 'Teego'<\/p>","images":false},"title":{"value":"Birthday Party, Swimming"},"version":1},{"date":{"d":5,"m":1,"y":2012},"datev":20120105,"first":{"value":null},"images":1,"info":{"content":"<p>Ben went through the induction process to become a fully fledged Beaver. He absolutely loves it there and cannot wait till the next meet. He's been going for the past 2 months in the same hut Katie has Brownies.<\/p><img src='images\/years\/2012\/2012_01_05-04-BeaversCeremony.jpg' class='diaryImage' alt='Beaver Ben' \/><p class='diaryImageCaption'>Beaver Ben<\/p>","images":false},"title":{"value":"Beaver Induction"},"version":5},{"date":{"d":2,"m":1,"y":2012},"datev":20120102,"images":2,"info":{"content":"<p>We headed to Suffolk for the next of our Walks. The furthest one from our house, so decided to stay overnight at a Travelodge as well! We got to Pin Mill in good time, about 2:30 hours. We parked up, put our boots and gloves on and made our way along the Orwell. Mummy decided we should do the extended walk which took us on a record breaking 5.6 miles circuit around Woolverstone and Chelmondiston. Us children survived quite well not moaning really at all.<\/p><img src='images\/years\/2012\/2012_01_02-04-OrwellWalk.jpg' class='diaryImage' alt='Katie edging the Orwell' \/><p class='diaryImageCaption'>Katie edging the Orwell<\/p><img src='images\/years\/2012\/2012_01_02-48-OrwellWalk.jpg' class='diaryImage' alt='Ben through the puddles' \/><p class='diaryImageCaption'>Ben through the puddles<\/p><p>We celebrated the walk with a trip to Pizza Hut and made our way back into Capel St Mary for a little play on the swings before an early bed time.<\/p><p>We got up the day after at 5:45am so we could get Daddy to work for a 9am start.<\/p>","images":false},"title":{"value":"Walk 25: River Orwell Walk"},"version":1}],"version":1672110787}