{"entries":[{"date":{"d":31,"m":12,"y":2013},"datev":20131231,"first":{"value":null},"images":1,"info":{"content":"<p>Seeing we had no Christmas Party this year and everyone had entertained us, we had just the Elders over for New Years celebration. We had the usual fair of games and mayhem.<\/p><img src='images\\years\\2013\\2013_12_31-03-NewYearsEve.jpg' class='diaryImage' alt='Game face' \/><p class='diaryImageCaption'>Game face<\/p>","images":false},"title":{"value":"New Years Eve"},"version":1},{"date":{"d":25,"m":12,"y":2013},"datev":20131225,"first":{"value":null},"images":5,"info":{"content":"<p>Mummy and Daddy made us wait until 6am until we were allowed for us all to start opening presents. I think Father Christmas had delivered 18 presents each!<\/p><p>Katie and Jessica got quite a bit of Barbie stuff, whilst Ben had a big Nerf gun and lots of Lego sets. It was all opened in good spirits and had a lovely time exploring what each other had received.<\/p><p>Then it was Mummy and Daddy's turn in their bedroom before moving downstairs to open presents we had got from friends.<\/p><p>We made our way over to the fars for 9:30-ish. Daddy had contemplated a Parkrun, but thought better of it as it was family time. Mummy had gone for an early half an hour church service at 8am. There were only 4 others there!<\/p><p>At the fars we had a lovely breakfast with Giffler, croissants and nice bread. We opened the present from Uncle Ron, which was a lovely big telescope which was extremely kind of him. We also had the annual game of Coppit which is fiercely contested, especially amongst the younger elements of the family.<\/p><img src='images\\years\\2013\\2013_12_25-67-ChristmasDay.jpg' class='diaryImage' alt='Present time' \/><p class='diaryImageCaption'>Present time<\/p><img src='images\\years\\2013\\2013_12_25-13-ChristmasDay.jpg' class='diaryImage' alt='Family Lineup' \/><p class='diaryImageCaption'>Family Lineup<\/p><img src='images\\years\\2013\\2013_12_25-85-ChristmasDay.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><img src='images\\years\\2013\\2013_12_25-86-ChristmasDay.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><img src='images\\years\\2013\\2013_12_25-113-ChristmasDay.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2013},"datev":20131224,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy's new job meant that he did not have to go into work today which was a bit of luck as the weather was terrible. Work had a power cut for most of the day and the river had burst it's banks and flooded the road.<\/p><p>In the morning Daddy spent an hour and a half onto Talk Talk trying to get the internet connection sorted out. It was now 3 weeks in the new house and still no connectivity. He was fobbed off again with 3 different explanations as to the problem.<\/p><p>The rest of us were getting really excited about Christmas. Ben was more hyper than the other two.We played games for most of the day.<\/p><p>In the afternoon we went around to the Fars for the traditional fare of a Danish Christmas. First up a treasure hunt which Farfar thought would be a lot more challenging than it turned out to be. The children each won £10. I think this is one of their favourite gifts. Not sure why. I think it is the power of choice of what to purchase. They still need to respect money a little more and keep it safe. Katie has no concept of saving either. She wanted to go shopping to spend her money. When asked what she wanted to spend it on, she didn't really know. It was the fact that she could hand it over to the shop keeper I think thrilled her.<\/p><p>Auntie Susan and Graham arrived soon after and we sat down at about 5pm for the feast. This year the food was cooked as good as it can get. The pork was amazing. New secret weapon apparently is the 'cooking bag'. Need to try that out. Daddy again went for being fatty of the year, having double helpings for about everything..... and he found the nut in the riselamange!<\/p><p>Us children had chippolates, but steal a bit of crackling off the pork<\/p><p>After food and washing up we played the 'dice game'. A variant on the 'Chinese auction'. We had good fun at that.<\/p><p>Then came the main event. Us children had already been casing out the presents beforehand. Ben was the main organiser and distributor. He was turning more Weston-like in his methods. In the good old days there was only one present being opened at any one time. Ben's decided to give people their presents in batches, so there would be 3 or 4 people opening their queue of presents at any one time. Ben could not understand any other way when told to slow down.<\/p><p>We got through the present opening in about 45 minutes we would say. I think everyone was pleased with their haul. Katie received a magic box set which Uncle Graham and Katie went through and tried a few tricks on us. We ended the evening at about 9pm and returned home. Not too sure how much sleep we got that night. There must have been a period between 11pm and 2am when we actually slept solidly. Jessica said she couldn't get to sleep as Father Christmas had put too many presents on her bed!<\/p><img src='images\\years\\2013\\2013_12_24-38-ChristmasEve.jpg' class='diaryImage' alt='Presents all opened' \/><p class='diaryImageCaption'>Presents all opened<\/p>","images":false},"title":{"value":"Christmas Eve"},"version":1},{"date":{"d":23,"m":12,"y":2013},"datev":20131223,"first":{"value":null},"images":2,"info":{"content":"<p>It was incredibly wet outside and when Daddy turned up straight from work we wondered if he had been dragged through a puddle he was so wet. Anyway we went to the new-ish Frankie And Benny's at Westgate, Aldershot. We had a lovely time.<\/p><img src='images\\years\\2013\\2013_12_23-06-FrankieAndBennys.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><img src='images\\years\\2013\\2013_12_23-08-FrankieAndBennys.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Annual Pre Christmas Family Meal"},"version":1},{"date":{"d":22,"m":12,"y":2013},"datev":20131222,"first":{"value":null},"images":1,"info":{"content":"<p>Ben and Katie had starring roles in the Nativity Play performed in front of the whole church in Paddock Hill. They were great. Farmor and Farfar popped along to see it too.<\/p><img src='images\\years\\2013\\2013_12_22-04-BaptistNativity.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Baptist Church Nativity Play"},"version":1},{"date":{"d":20,"m":12,"y":2013},"datev":20131220,"first":{"value":null},"images":2,"info":{"content":"<p>Mummy went out with Paula to the Frimley Green Pre School works do at the Village Hotel.<\/p><img src='images\\years\\2013\\2013_12_20-02-LauraWorksChristmasDo.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><p>The rest of us got dolled up as well. Auntie Charlotte was the make up stylist. Daddy didn't like his little girls having all that make-up on. It's just not right.<\/p><img src='images\\years\\2013\\2013_12_20-08-LauraWorksChristmasDo.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Mummy's Works Do"},"version":5},{"date":{"d":14,"m":12,"y":2013},"datev":20131214,"first":{"value":null},"images":1,"info":{"content":"<p>Mummy and Daddy had a Swordsmans Road party. It was nice to see everyone again.<\/p><img src='images\\years\\2013\\2013_12_14-02-NeighboursParty.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Adam and Jo's Neighbours Party"},"version":4},{"date":{"d":7,"m":12,"y":2013},"datev":20131207,"first":{"value":null},"images":1,"info":{"content":"<p>After parkrun, we went off to the Frimley CofE Christmas Fair. Ben had volunteered to be an Elf for Santa's Grotto. He looked so sweet.<\/p><img src='images\\years\\2013\\2013_12_07-08-BenChristmasElf.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><p>Farmor came along and stopped by to see our new house properly.<\/p>","images":false},"title":{"value":"Frimley CofE Christmas Fair"},"version":1},{"date":{"d":5,"m":12,"y":2013},"datev":20131205,"first":{"value":null},"info":{"content":"<p>After what seems an eternity to put through the sausage machine we finally moved house today. Of course, Daddy took the cheaper option and decided that we should move all our stuff rather than get removal men in. Over the past 2 or 3 weeks we've been boxing up and trying to find somewhere appropriate to store the boxes. The garage has been filled for weeks. Katie's bedroom was used as a store room after the bed had been dismantled. All in all, the house was looking pretty uninhabitable for the past few days.<\/p><p>In today's crack squad we had Daddy, Mummy, Farfar, Uncle Peter, Pop Pop and Uncle Michael. A few of them were here the night before filling the Luton up with it's first load.<\/p><p>Mr and Mrs Reeve were still packing and clearing up when Daddy knocked on the door at the agreed 9:30 and basically was not allowed back again until 11-ish. The crack squad then decided to have brunch at the Deepcut Cafe. A first.<\/p><p>After a round of fry ups we were allowed to start dumping our gear around the back of the house in the garden. Luckily the weather was dry, but windy and threatening clouds above. At least it wasn't too cold.<\/p><p>After shifting the first load, we went back for a second, this time with some of the larger items. Time was pressing and surprisingly we needed a third load as well.<\/p><p>The troops did fantastically well, there were minimal breakages \/ damage. The funniest bit is when Farfar reversed the Luton into Pop Pop's car. Not much damage done thankfully.<\/p><p>The light was drawing in, the rain started, so there was a bit of a rush to get all the stuff into the house. Most of it was just dumped into the conservatory, awaiting Mummy and Daddy to sort it all out over the next few days and weeks.<\/p><p>One by one people departed. The Fars stayed around for the prize fish and chip dinner, although this time it was an Indian and Chinese takeaway.<\/p><p>Whilst all this fun was happening Ben was at Jaspers, Katie at Nina's and Jessica helping out. It was only later in the evening that we all got together and was taken on a tour of the house. We loved it. At first us girls are sharing a room. No more bunk beds, and Benny had a room all to himself. The first time since he had a cot!<\/p><p>Daddy managed to rig up the TV to Freeview so they relaxed at about 9pm watching Celebrity Get Me Out Of Here.<\/p>","images":false},"title":{"value":"Moving House"},"version":1},{"date":{"d":30,"m":11,"y":2013},"datev":20131130,"first":{"value":null},"images":1,"info":{"content":"<p>Ben had cub camp for the weekend. This time they played lots of games, made tye dye t-shirts and went to the Lightbox Theatre in Woking<\/p><img src='images\\years\\2013\\2013_11_30-03-Cubs-WeekendAway-LightboxWoking.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Ben's Cub Camp"},"version":5},{"date":{"d":29,"m":11,"y":2013},"datev":20131129,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica was again in her own little world when it came to her Christmas Play that mummy and daddy came to see. We can not work her out as she is so expressive normally. Here she seems barely awake!<\/p><img src='images\\years\\2013\\2013_12_12-01-JessicaSchoolPlay.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p>","images":false},"title":{"value":"Jessica's School Play"},"version":5},{"date":{"d":16,"m":11,"y":2013},"datev":20131116,"first":{"value":null},"images":3,"info":{"content":"<p>We went over to the Barnett's for a Sunday lunch which beats all Sunday lunches, prepared not by Joyce, but by Uncle Dawg! Fantastico. We had a trip to the local park and a game of Newmarket for sweets.<\/p><img src='images\\years\\2013\\2013_11_17-01-BarnettSundayLunch.jpg' class='diaryImage' alt='Roast Pork - Kiddy Style' \/><p class='diaryImageCaption'>Roast Pork - Kiddy Style<\/p><img src='images\\years\\2013\\2013_11_17-15-BarnettSundayLunch.jpg' class='diaryImage' alt='Beautiful Mummy' \/><p class='diaryImageCaption'>Beautiful Mummy<\/p><img src='images\\years\\2013\\2013_11_17-25-BarnettSundayLunch.jpg' class='diaryImage' alt='Ben enjoying success at Newmarket' \/><p class='diaryImageCaption'>Ben enjoying success at Newmarket<\/p>","images":false},"title":{"value":"Barnett Sunday Roast"},"version":1},{"date":{"d":10,"m":11,"y":2013},"datev":20131110,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Ben proudly wore his great grandfather war medals, was the flag bearer, much to his delight, and played an acting role at the Remembrance service, St Andrews. Katie was representing the Guides and Jessica the Rainbow pack.<\/p><img src='images\\years\\2013\\2013_11_10-01-RememberanceBenCubCeremony.jpg' class='diaryImage' alt='Ben the flag bearer' \/><p class='diaryImageCaption'>Ben the flag bearer<\/p><p>After the service Ben and his good friend Jasper had to 'jump the log' which is the official ceremony where they move from Beavers to being a Cub.<\/p><p>We then dashed over to the Sanders household, which we have not seen for a good long while and had a lovely Lasagne lunch and play.<\/p>","images":false},"title":{"value":"Remembrance Day - Ben Jumping The Log - Sanders Lunch"},"version":1},{"date":{"d":3,"m":11,"y":2013},"datev":20131103,"first":{"value":null},"images":2,"info":{"content":"<p>We went over from Istead Rise to watch the annual Firecracker event at Thurrock. We had a great time.<\/p><img src='images\\years\\2013\\2013_11_03-02-Firecracker.jpg' class='diaryImage' alt='The Boys dreaming' \/><p class='diaryImageCaption'>The Boys dreaming<\/p><img src='images\\years\\2013\\2013_11_03-15-Firecracker.jpg' class='diaryImage' alt='Ben dreaming' \/><p class='diaryImageCaption'>Ben dreaming<\/p>","images":false},"title":{"value":"Firecracker"},"version":5},{"date":{"d":2,"m":11,"y":2013},"datev":20131102,"first":{"value":null},"images":2,"info":{"content":"<p>For Pop Pops birthday we headed down to East Sussex to do the Kipling Walk, the last out of our outer London treks. It was a 3 mile, muddy affair through a lot of fields.<\/p><img src='images\\years\\2013\\2013_11_02-02-KiplingWalk.jpg' class='diaryImage' alt='62 year old' \/><p class='diaryImageCaption'>62 year old<\/p><img src='images\\years\\2013\\2013_11_02-18-KiplingWalk.jpg' class='diaryImage' alt='Jessa' \/><p class='diaryImageCaption'>Jessa<\/p><p>In the evening the Elders joined us, and some of us went to Broadwhitch Farm for a fright ride on the tractor.<\/p>","images":false},"title":{"value":"Walk 46: Kipling Walk"},"version":1},{"date":{"d":1,"m":11,"y":2013},"datev":20131101,"first":{"value":null},"info":{"content":"<p>Daddy started at employee number 17 at Net Evidence in Eashing, Godalming. It was a good day. The CEO sat with him for over 2 hours explaining the product in the morning, and had others help set-up his computer in the afternoon.<\/p>","images":false},"title":{"value":"First Day At Net Evidence"},"version":7},{"date":{"d":31,"m":10,"y":2013},"datev":20131031,"first":{"value":null},"images":2,"info":{"content":"<p>We went off with Ma Ma, Lily and Natasha around the usual suspects around town. First stop Great Grandma, followed by Uncle Howard, Farfar and Uncle Richard. We collected so many sweets.<\/p><img src='images\\years\\2013\\2013_10_31-07-Haloween.jpg' class='diaryImage' alt='Scaring Howard' \/><p class='diaryImageCaption'>Scaring Howard<\/p><img src='images\\years\\2013\\2013_10_31-12-Haloween.jpg' class='diaryImage' alt='Scaring Farfar' \/><p class='diaryImageCaption'>Scaring Farfar<\/p>","images":false},"title":{"value":"Haloween and Last Day at CNL Software"},"version":1},{"date":{"d":25,"m":10,"y":2013},"datev":20131025,"first":{"name":"katie","value":"In a Taxi Black Cab"},"info":{"content":"<p>The Fars very kindly took us on a surprise trip up to Clapham Common to watch a circus act. We had a spot of bother finding the place, but Katie saw a poster signposting the way to the big top. <\/p><p>It was a good circus. There was one act where there was a huge hamster wheel, as tall as our house and they had to keep running as fast as possible  to make sure they didn't end up at the top of the wheel.<\/p><p>On the way home we were treated to a black cab trip back to the station. Katie went on about this more than the circus trip itself! Ben loved the sword that he was treated to.<\/p><p>We stayed overnight at the Fars, had chips and pizza and stayed up till 11pm!<\/p>","images":false},"title":{"value":"Circus"},"version":3},{"date":{"d":22,"m":10,"y":2013},"datev":20131022,"first":{"name":"katie","value":"Guides"},"images":1,"info":{"content":"<p>Katie has stepped up to Guides which she is very excited about. They are so much more grown up. Katie said that they do stuff as opposed to Brownies where there was a lot of talking about doing stuff.<\/p><img src='images\\years\\2013\\2013_10_22-05-GuidesSwearingIn.jpg' class='diaryImage' alt='Katie being sworn in' \/><p class='diaryImageCaption'>Katie being sworn in<\/p>","images":false},"title":{"value":"Katie's Guides Swearing In Ceremony"},"version":2},{"date":{"d":19,"m":10,"y":2013},"datev":20131019,"first":{"value":null},"info":{"content":"<p><\/p>","images":false},"title":{"value":"Charles Dickens World"},"version":1},{"date":{"d":12,"m":10,"y":2013},"datev":20131012,"images":3,"info":{"content":"<p>Well we were supposed to do this tomorrow, but swapped our plans around as the weather forecast was even worse than today's. Despite the constant drizzle the day was not too badly effected by the weather. We left early in the morning and arrived at opening time at 10am. First roller-coaster that could be seen was the Sonic Pinball. Like a Waltzer car on a roller coaster. This was really good Katie and Ben were a little scared which was good. Jessica and Mummy went on some of the smaller rides, but Jessica is not satisfied with piddly, little roundabouts any more. No she has to take Daddy on the Enterprise. A super fast, upside down big wheel type ride. She absolutely loved it, where as Daddy was thinking it went too fast, too much upside down and what it was doing to his stomach!!! Again, again. Mummy had the dubious pleasure next turn. Ben went on Submission, his favourite ride as it also went upside down. It was like a flying carpet ride but set at all different angles for the rider. Katie got quite scared on some of the scary, ghost train type rides. She hated Hex, which the rest of us liked. It was certainly different. You are placed in a room. You sit down and you are made to feel that you are spinning around the room. Very good.<\/p><p>We tried to get on the ride called Thirteen, or Th13teen. However, it was shut which was disappointing. We did Blade, the teacup ride, the driving experience, the chair-o-plane, the traditional roundabout, Ice Age 4D, which was different again. A film which had live effects like snow and bubbles raining down, wind and even things smacking the backs of your legs! Towards the end of the day we went on the water rides much to Daddy's protests! First up the log flume which we got very wet on. Next the pirate boat ride which was awesome (especially if it was hot). Each of the pirate boats had about 10 cannons which you could fire water from. People on the side of the ride could fire at them with their own cannons. Anyway Ben got soaked, but he loved it! The final water ride was the tyre ride down the rapids which again we got wet! Daddy had one final go on Rita, which was rapid and made especially better as he sat at the front! A good day had by all, finishing up with Fish and Chips and a night's stay in a Travelodge in Stafford.<\/p><img src='images\/years\/2013\/2013_10_12-16-AltonTowers.jpg' class='diaryImage' alt='Spot the fearless and the scardi-cats' \/><p class='diaryImageCaption'>Spot the fearless and the scardi-cats<\/p><img src='images\/years\/2013\/2013_10_12-23-AltonTowers.jpg' class='diaryImage' alt='Rapid Ravine' \/><p class='diaryImageCaption'>Rapid Ravine<\/p><img src='images\/years\/2013\/2013_10_12-35-AltonTowers.jpg' class='diaryImage' alt='Ooo Me Hearties' \/><p class='diaryImageCaption'>Ooo Me Hearties<\/p>","images":false},"title":{"value":"Alton Towers"},"version":1},{"date":{"d":4,"m":10,"y":2013},"datev":20131004,"info":{"content":"<p>What a day. Daddy first found out that our offer on the house on Frimley Green Road has been accepted. £275k. We are all well pleased, even though the house is probably slightly smaller than what we have now. But it's in a great location, has a large garden and most importantly has potential to extend.<\/p><p>And finally Daddy found that Net Evidence has offered a job at their place in Eashing, Godalming. It equates to a 15% pay rise, and better career prospects.<\/p>","images":false},"title":{"value":"New House, New Job"},"version":1},{"date":{"d":29,"m":9,"y":2013},"datev":20130929,"first":{"value":null},"images":3,"info":{"content":"<p>We went up to London with Auntie Charlotte and met up with Barrie, Freya and Harrison in a lay-by off the M3. The professional driver, Barrie West, who has driven to London on many occasions got lost! After 30 mins of waiting around we walked from our parking spot in Notting Hill Gate to the wonderful playground in Hyde Park. I think we could have stayed there all day. We had places to go and Mummies to see. We caught a bus, the first time the West children had been in a double decker, and made our way across the length of Oxford Street to Tottenham Court Road where we stopped off for an expensive Pizza Express!!! Anyway, we made it into the British Museum. Both Ben and Freya were doing projects on the Egyptians this year so thought it a nice idea to see the mummies. It held the children's interest for a bit and they asked lots of questions which was nice. We liked the building of the British Museum. A contemporary roof to match the old internals.<\/p><img src='images\/years\/2013\/2013_09_29-06-LondonWithWests.jpg' class='diaryImage' alt='Hyde Park exodus' \/><p class='diaryImageCaption'>Hyde Park exodus<\/p><img src='images\/years\/2013\/2013_09_29-28-LondonWithWests.jpg' class='diaryImage' alt='Spot the Mummy' \/><p class='diaryImageCaption'>Spot the Mummy<\/p><img src='images\/years\/2013\/2013_09_29-39-LondonWithWests.jpg' class='diaryImage' alt='British Museum was jumpin'' \/><p class='diaryImageCaption'>British Museum was jumpin'<\/p>","images":false},"title":{"value":"British Museum with the West's"},"version":1},{"date":{"d":21,"m":9,"y":2013},"datev":20130921,"images":1,"info":{"content":"<p>We accompanied Daddy down to Littlehampton where he kayaked with Jon and Gerry up the River Arun. En-route they befriended a seal who must of kept them company for about a mile or so into Arundel. We met up with Ma ma and went on the beach then to the pub where we shared lunch with the boys.<\/p><img src='images\/years\/2013\/2013_09_21-02-ArunKayaking.jpg' class='diaryImage' alt='Halfway pub lunch' \/><p class='diaryImageCaption'>Halfway pub lunch<\/p>","images":false},"title":{"value":"River Arun Kayak"},"version":1},{"date":{"d":15,"m":9,"y":2013},"datev":20130915,"images":3,"info":{"content":"<p>Toby William Elder was Christened in Alton with lots of family and friends there. The vicar was a good one making the service interesting. There were lots of children. After we went into the church hall for some nice nosh!<\/p><img src='images\/years\/2013\/2013_09_15-02-TobyChristening.jpg' class='diaryImage' alt='Beautiful Jessica' \/><p class='diaryImageCaption'>Beautiful Jessica<\/p><img src='images\/years\/2013\/2013_09_15-04-TobyChristening.jpg' class='diaryImage' alt='Ben and Katie' \/><p class='diaryImageCaption'>Ben and Katie<\/p><img src='images\/years\/2013\/2013_09_15-16-TobyChristening.jpg' class='diaryImage' alt='The man of the day.' \/><p class='diaryImageCaption'>The man of the day.<\/p>","images":false},"title":{"value":"Toby Elder's Christening"},"version":1},{"date":{"d":11,"m":9,"y":2013},"datev":20130911,"images":1,"info":{"content":"<p>Jessica invited quite a few friends over for her 6th birthday party. Because of the ad weather we had to do all the games inside the house which made things a bit interesting!!! Still we all had good, manic fun.<\/p><img src='images\/years\/2013\/2013_09_11-06-Jessica6thBirthday.jpg' class='diaryImage' alt='Present Time' \/><p class='diaryImageCaption'>Present Time<\/p>","images":false},"title":{"value":"Jessica's 6th Birthday"},"version":1},{"date":{"d":8,"m":9,"y":2013},"datev":20130908,"images":1,"info":{"content":"<p>We met in Binfield for some picnicking fun. The afternoon turned in to a big water fight between Katie, Ben and Jessica against Howard, Gerry, Peter. It was good fun.<\/p><img src='images\/years\/2013\/2013_09_08-11-BarnettFamilyPicnic.jpg' class='diaryImage' alt='Just not cricket' \/><p class='diaryImageCaption'>Just not cricket<\/p>","images":false},"title":{"value":"Barnett Family Picnic"},"version":1},{"date":{"d":26,"m":8,"y":2013},"datev":20130826,"images":2,"info":{"content":"<p>For once we had a bit of a lie in then packed a picnic for our Palaces short walk in London. We parked up at Millbank and due to Mummy's dodgy directions we managed to do everything twice it seemed. We had lunch in Parliament Square where we watched people pose for photos. We circled parliament, the Jewel Tower and Westminster Abbey before crossing Birdcage Walk into St James's Park and a go in the swings and a close up of a pelican.<\/p><p>Finally we played in Green Park where we saw a fountain that we've not seen before. It was half a playground fountain. However, as we were to find out it was a dangerous one. Ben slipped over twice on it, the second time he smacked his head on the marble. Katie purposely slid from the top at a faster than expected rate and smashed her legs on the ledge at the bottom. There was a silence for 2 seconds before the screams of crying began. Bit of a dampener. Daddy walked all the way back to pick the car up and met us at the Ritz before returning home for another game of Monopoly.<\/p><img src='images\/years\/2013\/2013_08_26-08-LondonPalaceWalk.jpg' class='diaryImage' alt='Parliament Fun' \/><p class='diaryImageCaption'>Parliament Fun<\/p><img src='images\/years\/2013\/2013_08_26-27-LondonPalaceWalk.jpg' class='diaryImage' alt='Green Park Dangerous Water Feature' \/><p class='diaryImageCaption'>Green Park Dangerous Water Feature<\/p>","images":false},"title":{"value":"Walk 45: Palaces Walk"},"version":1},{"date":{"d":25,"m":8,"y":2013},"datev":20130825,"images":1,"info":{"content":"<p>In the morning Daddy cycled over to Phoenix Green to start a disasterous bike ride with Nick 'Jonah' King and Mr Elder. Before they even set off together Nicks valve had sheared off in his pump. Michael had punctures in both his back and front tyres!!! Boc. Anyway Daddy had a nice ride.<\/p><p>The weather brightened up and we all went over to Box Hill for a walk down to the stepping stones. Something achieved during the week when we went with Fiona, Thomas and Natasha.<\/p><p>We carried on the river route this time and we paddled in the water. Daddy swore there were things nibbling his feet, but didn't let the rest of us know. A little further on there was the coolest rope swing. All three of us had a go and it was such great fun. We eventually had to stop and crossed the river again and started a very steep climb up the hill again. It was a nice afternoon for us to go out on.<\/p><img src='images\/years\/2013\/2013_08_25-11-BoxHill.jpg' class='diaryImage' alt='Box Hill Stepping Stones' \/><p class='diaryImageCaption'>Box Hill Stepping Stones<\/p>","images":false},"title":{"value":"40 mile bike ride, Box Hill Walk"},"version":1},{"date":{"d":24,"m":8,"y":2013},"datev":20130824,"info":{"content":"<p>We all went for a parkrun today. Daddy beat his PB and now is 22:11. Jess managed half a lap.<\/p><p>Unfortunately 1 Milden Close have decided to pull out of the house sale as Mr Davey has got cancer. We are quite down by it as we would have loved that house. Still, we have to count our chickens as we are not in Mr Davey's position. Anyway we started looking at houses again. This morning we went to view a property on the Farm Road estate. Mummy really liked it, and Daddy really did not.<\/p><p>The weather was pretty grotty which stopped us from doing anything outside, so we started a 3 game bank holiday series of Monopoly. We also all watched James Bond, Tomorrow Never Dies.<\/p>","images":false},"title":{"value":"Parkrun, Monopoly, House Pull Out"},"version":1},{"date":{"d":18,"m":8,"y":2013},"datev":20130818,"images":2,"info":{"content":"<p>Daddy ran with James on the Burnham Beeches Half Marathon. Preparations were not ideal. Daddy went out with the boys the night before, and although he didn't drink he did stay up later than hoped. Also there was a lot of muscle ache from the football match he played last week. Still he had James to pace him around the 13.2 mile hilly, circuit.<\/p><img src='images\/years\/2013\/2013_08_18-01-BurnhamBeechesHalfMarathon.jpg' class='diaryImage' alt='The Sub 2 Hour Taskforce' \/><p class='diaryImageCaption'>The Sub 2 Hour Taskforce<\/p><p>When Daddy ran half marathons in 2000 in preparation for the London Marathon he didn't do well and vowed to beat 2 hours. A time which had always eluded him. All looking good 10 miles in, 30 mins to do the last 3.2 miles. However, there were up hills still to come. A fellow parkrunner, Darren, had finished his run and came back for me and James and gave loads of encouragement. Daddy really struggled up the hills near the end. It was touch and go. However, Daddy finally came in at 1:58:42. A sense of relief and a big thank you to James and Darren. Daddy has learnt control and keeping an even pace is so important.<\/p><p>Later in the afternoon we went around to the Fars to celebrate, sort of his birthday. We had a nice Danish meal. Ben polished off the frikadeller no probs. It was nice to see Susan and Graham. We had a treasure hunt and sweets of course as well.<\/p><img src='images\/years\/2013\/2013_08_18-01-DinnerAtFars.jpg' class='diaryImage' alt='Farfar Dinner' \/><p class='diaryImageCaption'>Farfar Dinner<\/p>","images":false},"title":{"value":"Burnham Beeches Half Marathon - Farfar Birthday Meal"},"version":1},{"date":{"d":17,"m":8,"y":2013},"datev":20130817,"info":{"content":"<p>After Parkrun, Barrie, Freya and Harry came around for a BBQ. The children all played so well together. Freya will come over for a sleepover one day.<\/p>","images":false},"title":{"value":"Barrie BBQ"},"version":1},{"date":{"d":14,"m":8,"y":2013},"datev":20130814,"images":3,"info":{"content":"<p>Our last day. The weather was changeable and therefore we decided not to go the beach, instead another playground which we saw from the train in Bispebjerg. It had a large rope climbing frame which went around like a track. Hard to explain. There was also a massive climbing wall which was brightly sprayed.<\/p><p>On the return journey we stopped off for a customary hot dog from the pølsevogn in the Town Hall Square. There were some Chilean football supporters there who we had some photos taken with. They were mad. We checked out of our hotel in the afternoon and made our way to Lise and Jørgen's who had also prepared some food for us.<\/p><p>It was nice to see Lise again after all her health issues she had been having for the past 12 months plus. They had not lost any of their friendlyness. It was really good to catch up, and the food again they prepared was amazing. Just wished us children would be a little more adventurous and actually try some.<\/p><p>Whoever did the planning needs shooting as we ran out of time in the airport and again almost didn't make the plane. We were last on again. Even more late this time.<\/p><p>The Fars sat with us children on the ride home and we landed at Gatwick on time. Back in Blighty. Bus to Horley, M25, home at 8pm.<\/p><p>It certainly was a bit different this holiday to our normal. It was just as enjoyable and good to see Denmark. We packed a lot in.<\/p><img src='images\/years\/2013\/2013_08_14-03-Denmark-Day8-BispebjergPark-LiseJorgen.jpg' class='diaryImage' alt='Climbing the walls' \/><p class='diaryImageCaption'>Climbing the walls<\/p><img src='images\/years\/2013\/2013_08_14-09-Denmark-Day8-BispebjergPark-LiseJorgen.jpg' class='diaryImage' alt='Cuban Friends' \/><p class='diaryImageCaption'>Cuban Friends<\/p><img src='images\/years\/2013\/2013_08_14-15-Denmark-Day8-BispebjergPark-LiseJorgen.jpg' class='diaryImage' alt='Lise and Jørgens Summer House' \/><p class='diaryImageCaption'>Lise and Jørgens Summer House<\/p>","images":false},"title":{"value":"Denmark Holiday: Bispebjerg Park - Lise of Jørgen"},"version":1},{"date":{"d":13,"m":8,"y":2013},"datev":20130813,"images":3,"info":{"content":"<p>We hopped on the train to Hellerup and walked to Experimentum. A bit like In-Tech in Winchester, but on steroids. It was really good for the kids as they could design a dinosaur and see it come up on a big screen, chisel for fossils, and take part in loads of interactive, science related things from water pressures, electricity, space, wind tunnel, weights and forces, reaction times and events and even attempting to lie on a bed of nails!!<\/p><p>Fredericksberg was the next stop for some nostalgia swimming. The swimming pool Daddy always went to on holidays. It was still a strict regime which was a little awkward. Anyway we had a great time on the diving boards and slides. The fars came and joined in the fun to.<\/p><p>After an hour and a half in the pool we exited and headed down Marinedalesvej which is where Farmor, Olemor and Olefar used to live. The door to flat entrance was open so we stepped in and had a look. It was in very good shape which was nice to see. After having a go on the local playground we headed towards the Little Garden restaurant.<\/p><p>Well Daddy certainly filled his guts here. He and Farmor shared shared fish, eel, port, beef, bacon and desert. Daddy absolutely loved the meal and felt sick afterwards just on the quantity eaten! The rest of us ate a little more conservatively.<\/p><img src='images\/years\/2013\/2013_08_13-06-Denmark-Day7-Experimentum-LittleGarden.jpg' class='diaryImage' alt='Experimentum - Fossil exploration' \/><p class='diaryImageCaption'>Experimentum - Fossil exploration<\/p><img src='images\/years\/2013\/2013_08_13-16-Denmark-Day7-Experimentum-LittleGarden.jpg' class='diaryImage' alt='Benny Bed Of Nails' \/><p class='diaryImageCaption'>Benny Bed Of Nails<\/p><img src='images\/years\/2013\/2013_08_13-19-Denmark-Day7-Experimentum-LittleGarden.jpg' class='diaryImage' alt='Little Garden Evening Meal' \/><p class='diaryImageCaption'>Little Garden Evening Meal<\/p>","images":false},"title":{"value":"Denmark Holiday: Experimentum - FrederickBerg Swimming, Little Garden Meal"},"version":1},{"date":{"d":12,"m":8,"y":2013},"datev":20130812,"images":4,"info":{"content":"<p>We had a bit of a lie in this morning but Daddy and Jessica made it out for the supermarket run ritual. Before getting over to Holmens Bridge to meet with the fars, Daddy went in the Christensborg Palace where the royal reception rooms are. Very regal.<\/p><p>The hour long canal tour was good. It was nice just to sit and relax for an hour and being carted around the canals and see the sights even if there was a heavy down pour near the end.<\/p><p>We made our way to Magasin for some pastries, watched a street performer juggle some fire lit torches and then on to the Round Tower which we raced down. Ben was captivated by the Lego store and absolutely loved it all. I think he could have stayed in there all day!<\/p><p>We caught the Metro and went out to Bisbjerg to see where Olemor and Olefar were scattered. We eventually found the small headstone and paid our respects. It was nice for the children to do that.<\/p><p>We returned back into town and ended up in the Fars accommodation where Ben opened his birthday present, which was another Lego set and we had hot dogs.<\/p><p>Daddy decided that when he got back to the hotel that he would go out for a late evening run which actually turned into a half marathon around the sights.<\/p><img src='images\/years\/2013\/2013_08_12-09-Denmark-Day6-CanalBoat-RoundTower.jpg' class='diaryImage' alt='Ben and Farfar on the Canal Tour' \/><p class='diaryImageCaption'>Ben and Farfar on the Canal Tour<\/p><img src='images\/years\/2013\/2013_08_12-29-Denmark-Day6-CanalBoat-RoundTower.jpg' class='diaryImage' alt='Pilot Benjamin Gay' \/><p class='diaryImageCaption'>Pilot Benjamin Gay<\/p><img src='images\/years\/2013\/2013_08_12-34-Denmark-Day6-CanalBoat-RoundTower.jpg' class='diaryImage' alt='Round Tower Dash' \/><p class='diaryImageCaption'>Round Tower Dash<\/p><img src='images\/years\/2013\/2013_08_12-41-Denmark-Day6-CanalBoat-RoundTower.jpg' class='diaryImage' alt='Lego Store' \/><p class='diaryImageCaption'>Lego Store<\/p>","images":false},"title":{"value":"Denmark Holiday: Canal Boat - Round Tower"},"version":1},{"date":{"d":11,"m":8,"y":2013},"datev":20130811,"images":7,"info":{"content":"<p>We walked along the west side of the station to catch the bus. It was a disappointing site of drug users congregating and the smell of wee. Just a contrast to the other side of Hovedbanegård where all the tourists are. However, we did spot a bakers shop which pleased us. Anyway we caught the 1A and 3A bus past Jørgen's old hairdressers shop to Valby Park, another location that Daddy hadn't visited before. There was just another unique playground with hills and towers to climb as well as animals carved from wood it seemed. After a long play we walked down to the water's edge and paddled in the water before returning through some interesting gardens back onto the bus and train, home to our hotel.<\/p><p>Then comes the highlight of the holiday for us children; Tivoli. First up is the 100 year old rollercoaster called Rutschebane. Everyone liked this one, and it was Daddy's old favourite. Jessica especially liked it and wanted to go on it again and again. She must have had 10 rides on it in the end.<\/p><p>We went on so many rides, like the Aquila, Ben's first ever upside down ride as he puts it, the Star Flyer, a glorified chair-o-plane ride, which we all found extremely scary as the ride broke down the first time we were on it. It goes very high and there was a fair wind. Daddy doesn't mind admitting he was hanging on in there a bit. Got the heart pumping.<\/p><p>We won a Toblerone on the bike game, had 45 minutes of fun in the fun house. We met up with Fars later in the afternoon, they even had a go in the fun house! We got out of the park for some much needed food at Jensens Bøfhus, before returning again for a belly-testing load of rides. The one unique aspect of Tivoli is the fact it opens to late at night and the appearance of the park changes, there are a lot of pretty lights.<\/p><p>Katie's favourite ride was the Drop Tower, Daddy's was the boating lake, Mummy's the Demon roller-coaster ride which was spectacular at night, Ben's the upside-down ride and Jessica the Rutschebane. We trundled out at half ten and took the 2 minute walk back to the hotel.<\/p><img src='images\/years\/2013\/2013_08_11-22-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Rock sliding' \/><p class='diaryImageCaption'>Rock sliding<\/p><img src='images\/years\/2013\/2013_08_11-24-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Rutschebane with Jessica and Mummy' \/><p class='diaryImageCaption'>Rutschebane with Jessica and Mummy<\/p><img src='images\/years\/2013\/2013_08_11-33-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='On top of the Ferris Wheel' \/><p class='diaryImageCaption'>On top of the Ferris Wheel<\/p><img src='images\/years\/2013\/2013_08_11-42-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Aquila' \/><p class='diaryImageCaption'>Aquila<\/p><img src='images\/years\/2013\/2013_08_11-51-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Rolling Barrel' \/><p class='diaryImageCaption'>Rolling Barrel<\/p><img src='images\/years\/2013\/2013_08_11-57-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Candy Floos Girls' \/><p class='diaryImageCaption'>Candy Floos Girls<\/p><img src='images\/years\/2013\/2013_08_11-62-Denmark-Day5-ValbyParkTivoli.jpg' class='diaryImage' alt='Tivoli At Night' \/><p class='diaryImageCaption'>Tivoli At Night<\/p>","images":false},"title":{"value":"Denmark Holiday: Valby Park - Tivoli"},"version":1},{"date":{"d":10,"m":8,"y":2013},"datev":20130810,"images":5,"info":{"content":"<p>We started by searching for the Parkrun in Amagar Faelled. The park has to be 4 square miles so Daddy was stressing a bit in order to find it in time for the traditional 9am start. We were greeted with others who were also attending and met up with a couple of other English families who were running. We didn't set the world alight, but the course was very nice and we got the same warm, friendly atmosphere as we do in Frimley Lodge.<\/p><p>After the boiling hot run we bussed it over to Copenhagen Zoo. Mummy remembered from her previous trip how good it was and was not disappointed this time either.  One of the first things up was the polar bear enclosure. We could go underground and see them playing under the water. It was quite a site to look up and see a polar bear swimming just above us. A huge, heavy thing like that able to not sink to the bottom. Amazing.<\/p><p>What we liked about the zoo, as Mummy says, there is no rubbish animals, and the fact they all seemed to be fairly active, no lying around, sleeping. We saw lions, elephants being feed, a group of 7 tigers playing, monkeys swinging around and being pickles, giraffes, Mummy's favourite, the Tasmainian Devil, snakes, crocs, brown bear, all sorts. We had a lovely day there.<\/p><p>On the way home we walked into Hamley's and had another go around the toys to play with, and sneaked another McDonalds. Honestly the kiddies have been treated!<\/p><img src='images\/years\/2013\/2013_08_10-11-Denmark-Day4-ParkrunZoo.jpg' class='diaryImage' alt='Amagar Fallaed Parkrun' \/><p class='diaryImageCaption'>Amagar Fallaed Parkrun<\/p><img src='images\/years\/2013\/2013_08_10-15-Denmark-Day4-ParkrunZoo.jpg' class='diaryImage' alt='Polar Bear Swimming' \/><p class='diaryImageCaption'>Polar Bear Swimming<\/p><img src='images\/years\/2013\/2013_08_10-31-Denmark-Day4-ParkrunZoo.jpg' class='diaryImage' alt='The tiger in you' \/><p class='diaryImageCaption'>The tiger in you<\/p><img src='images\/years\/2013\/2013_08_10-49-Denmark-Day4-ParkrunZoo.jpg' class='diaryImage' alt='Zoooo' \/><p class='diaryImageCaption'>Zoooo<\/p><img src='images\/years\/2013\/2013_08_10-51-Denmark-Day4-ParkrunZoo.jpg' class='diaryImage' alt='Nerf Attack' \/><p class='diaryImageCaption'>Nerf Attack<\/p>","images":false},"title":{"value":"Denmark Holiday: Parkrun - Zoo"},"version":1},{"date":{"d":9,"m":8,"y":2013},"datev":20130809,"images":2,"info":{"content":"<p>We have found a reasonably priced supermarket at last for our breakfast. The now legendary Rema 1000. Fantastic value compared to Irma. Top travel tip that. Anyway after our morning routine we headed into town again this time searching for Ørstedsparken, another park. We finally arrived going the scenic route. We have been so impressed with the parks in Copenhagen. They are all completely different. This one is actually supervised and managed as it has a lot of play equipment such as trikes and scooters. There was even a table football game which was good, as all 5 of us joined in. A small thing like that is just a nice memory of our holiday. We spent almost a couple of hours there before returning to the hotel for a spot of lunch and to pick our swimming gear up. Next stop Islands Brygge.<\/p><p>We of course walked there which took us half an hour. The weather was good and the lido was busy. It had some diving platforms from a carved ship's hull. We loved it, especially Jessica, a real water baby. She lasted longer than any of us. Some of us had a go of the diving platforms. None of us where particularly brave on that front. It was a really good setup. The coldness set in a bit which put us off from staying in too long. After a spot of sunbathing, we got changed and walked south along the water's edge. We stopped off to watch a game of kayak polo. Looks like they were having a lot of fun playing that game, although some foul play was at hand. All in good humour and spirit though. We continued till one of the new bike bridges which we crossed to Fisketorvet.<\/p><p>We caught a train out to Flintholm, then the Metro back into town where we splashed out on a Jensens Bøfhus meal. Ben loved this meal. Best ever he reckoned.<\/p><img src='images\/years\/2013\/2013_08_09-04-Denmark-Day3-IslandsBrygge.jpg' class='diaryImage' alt='Parklife' \/><p class='diaryImageCaption'>Parklife<\/p><img src='images\/years\/2013\/2013_08_09-13-Denmark-Day3-IslandsBrygge.jpg' class='diaryImage' alt='Islands Brygge Lido' \/><p class='diaryImageCaption'>Islands Brygge Lido<\/p>","images":false},"title":{"value":"Denmark Holiday: Islands Brygge"},"version":1},{"date":{"d":8,"m":8,"y":2013},"datev":20130808,"images":8,"info":{"content":"<p>What a contrast in the weather. It was very gloomy with some showers coming in. We had a walking day today which really pleased the children! We did plonk in a few trips to the park on the way around. We started by walking around Tivoli, Christiansborg Palace, Kongens Nytorv where we decamped into Magasin, which is a huge posh department store and played in the toy department before committing a cardinal sin by visiting McDonalds for lunch. I know, its shocking. The rain had subsided and we continued onto the picturesque Nyhavn where we saw the royal band march through the streets, the Royal Palace (Amalienborg), the Gefion Fountain, the Kastellet Fort and of course the Little Mermaid. A lot of walking so far, and the weather was inclement. We had still plenty more walking to do. Across to two parks. The first was Østre Anlæg where we played loads in the playground. Next was Fælledparken Park which was very cool; from the tower playground, to the biggest skate park you'll ever likely to see and the traffic playground where a mock road system was been created with real traffic lights and road crossings. We had a great time playing all over this park. We were dead on our feet. We caught the bus back to Nørreport and stopped in an excellent Pizzaria that Katie especially loved. We packed in a lot of sights and good parks today. We slept well!<\/p><img src='images\/years\/2013\/2013_08_08-06-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Zig Zag Walk' \/><p class='diaryImageCaption'>Zig Zag Walk<\/p><img src='images\/years\/2013\/2013_08_08-15-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Laura loving Lego' \/><p class='diaryImageCaption'>Laura loving Lego<\/p><img src='images\/years\/2013\/2013_08_08-22-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Girls at Nyhavn' \/><p class='diaryImageCaption'>Girls at Nyhavn<\/p><img src='images\/years\/2013\/2013_08_08-34-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Fountains outside the Royal Palace' \/><p class='diaryImageCaption'>Fountains outside the Royal Palace<\/p><img src='images\/years\/2013\/2013_08_08-49-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Gefion Fountain' \/><p class='diaryImageCaption'>Gefion Fountain<\/p><img src='images\/years\/2013\/2013_08_08-57-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Mermaids and Merman' \/><p class='diaryImageCaption'>Mermaids and Merman<\/p><img src='images\/years\/2013\/2013_08_08-62-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='TV Show' \/><p class='diaryImageCaption'>TV Show<\/p><img src='images\/years\/2013\/2013_08_08-68-Denmark-Day2-WalkCopenhagen.jpg' class='diaryImage' alt='Go play with the traffic' \/><p class='diaryImageCaption'>Go play with the traffic<\/p>","images":false},"title":{"value":"Denmark Holiday: Walk Copenhagen"},"version":1},{"date":{"d":7,"m":8,"y":2013},"datev":20130807,"images":3,"info":{"content":"<p>We started the day very early. Dad's alarm went off at 3:15am. It took a bit of an effort to rally the troops at first, but everyone fell into order by half past. After gulping breakfast and of course stuffing the last few essentials into the suitcase we embarked in the 4am darkness, needing to quieten the kiddies down before they woke the whole street in their excitement. Tight wad Daddy wasn't prepared to spend $80 on parking at the airport, so devised a scheme which involved looking at street view and the local bus timetables for 5am in the morning! We cruised through Gatwick, changed some money, bought books, and then looked at the departure boards only to notice that our gate had closed! Oh no. The sprint was on. Was the gate a million miles away as it always tends to be? No, fortunately. They were still queueing to board.<\/p><p>This was Jessica's first ever plane journey. Mummy was still nervous, but the rest of us coped fine. Luckily the weather was good, not much cloud cover and the window seats could get a nice view of southern England.<\/p><p>Less than 2 hours later we landed and made our way to the central railway station where our hotel Astoria was situated. We dumped our bags and walked through the city centre stopping off at the newly opened Hamley's to scout around. There were many activities and a large range of Lego sets to look at which pleased Ben, who is well into it at the moment. We were finally prized away and made our way to the Kings Garden where we played in the sandpits. The weather was gorgeous and there were a lot of students socializing. We popped around Rosenborg Castle before catching a bus for a weary troops to the Opera House at the edge of Christainhavn. The estuary was looking lovely and blue in the sunshine.<\/p><p>We headed back to the hotel room, which was nice and spacious, via Hamley's to spend Ben's birthday money on a £80 Lego set which he desperately wanted. We had an early night in our hot, top floor room.<\/p><img src='images\/years\/2013\/2013_08_07-01-Denmark-Day1-Airport-Rosenborg.jpg' class='diaryImage' alt='Waiting for the bus at 5am in Horley' \/><p class='diaryImageCaption'>Waiting for the bus at 5am in Horley<\/p><img src='images\/years\/2013\/2013_08_07-10-Denmark-Day1-Airport-Rosenborg.jpg' class='diaryImage' alt='Hans Christian Anderson meet the Gays' \/><p class='diaryImageCaption'>Hans Christian Anderson meet the Gays<\/p><img src='images\/years\/2013\/2013_08_07-28-Denmark-Day1-Airport-Rosenborg.jpg' class='diaryImage' alt='Opera House' \/><p class='diaryImageCaption'>Opera House<\/p>","images":false},"title":{"value":"Denmark Holiday: Jessica's First Flight - Rosenborg"},"version":1},{"date":{"d":5,"m":8,"y":2013},"datev":20130805,"info":{"content":"<p>Ben started the day by opening lots of presents. From the family he got a new mountain bike, an Android tablet and copious amounts of Lego sets. In fact he got so many Lego sets from everyone. It was almost an exclusive deal!<\/p><p>In the afternoon he had a Lego party. About 10 friends were invited. It was pretty raucous and one of the boys spoilt it a little with his bad behaviour. Anyway Ben had a nice time. His friend Theo then stayed for a sleepover.<\/p>","images":false},"title":{"value":"Ben's 8th Birthday"},"version":1},{"date":{"d":28,"m":7,"y":2013},"datev":20130728,"first":{"value":null},"info":{"content":"<p>Daddy went on the Mega Meon 80 mile bike ride, but didn't fair too well. His legs seized up after about 65 miles. Still good to finish in the end.<\/p>","images":false},"title":{"value":"Mega Meon Bike Ride"},"version":5},{"date":{"d":27,"m":7,"y":2013},"datev":20130727,"info":{"content":"<p>The Elders came over for a BBQ. We swapped Joey for Jessica for the night.<\/p>","images":false},"title":{"value":"Elders"},"version":1},{"date":{"d":21,"m":7,"y":2013},"datev":20130721,"images":4,"info":{"content":"<p>We left in early in the morning to go up to the Olympic Park where we met other Park runners. Daddy had entered the National Lottery 5 mile run which wound its way around the Queen Elizabeth Olympic Park.<\/p><p>Daddy actually ran with James, Duncan and Lee. The end of the race finished with a three quatres of a lap around the stadium, where many were watching and supporting. Fortunately we managed to pick Daddy out and vice versa. The last 80 yards turned into a sprint. A great day.<\/p><img src='images\/years\/2013\/2013_07_21-03-OlympicNationalLotteryRun.jpg' class='diaryImage' alt='Outside the Olympic park' \/><p class='diaryImageCaption'>Outside the Olympic park<\/p><img src='images\/years\/2013\/2013_07_21-08-OlympicNationalLotteryRun.jpg' class='diaryImage' alt='Kit Kat waiting for Daddy in the stadium' \/><p class='diaryImageCaption'>Kit Kat waiting for Daddy in the stadium<\/p><img src='images\/years\/2013\/2013_07_21-23-OlympicNationalLotteryRun.jpg' class='diaryImage' alt='About to run' \/><p class='diaryImageCaption'>About to run<\/p><img src='images\/years\/2013\/2013_07_21-12-OlympicNationalLotteryRun.jpg' class='diaryImage' alt='200 yards to go' \/><p class='diaryImageCaption'>200 yards to go<\/p>","images":false},"title":{"value":"Olympic Park Run"},"version":1},{"date":{"d":13,"m":7,"y":2013},"datev":20130713,"images":2,"info":{"content":"<p>Uncle Michael joined us at the Frimley Lodge Parkrun this morning. It was blisteringly hot even at 9am. Anyway Daddy improved on his PB time and now down to 22:21 for 5km.<\/p><p>After freshening up we decided not to go to Bournemouth as we thought the roads and beach would be just so packed that it wasn't worth it. So instead we went to visit the Silent Pool which is just the other side of Guildford. We couldn't get over how clear the water was despite all the wildlife, algy and people swimming in the pond. We walked around and found a nice spot to have our picnic. Us kiddies went and played in the water.<\/p><p>We returned back to Frimley Green in the early afternoon so we could go and visit a house that Mummy was keen for us to do. There was an open day on the house in Milden Close, just around the corner from Great Grandma. The house was very spacious and quite a bargain we thought for the price. Anyway mummy and daddy put an offer in there and then. We'll have to see how that fairs.<\/p><p>We wanted to continue the water theme, even if we weren't going to Bournemouth. So decided on the Aldershot Lido. Well it was packed there. 1500 others had the same idea. We queue for about 45 minutes before we even got in. Still we had a great time all 5 of us playing together and going on the flumes. Good times.<\/p><p>In the evening Mummy, the dirty stop out, went out clubbing at Lakeside Country Club for Silvi's 40th birthday celebrations.<\/p><img src='images\/years\/2013\/2013_07_13-05-SilentPool.jpg' class='diaryImage' alt='Katie rooted' \/><p class='diaryImageCaption'>Katie rooted<\/p><img src='images\/years\/2013\/2013_07_13-11-SilentPool.jpg' class='diaryImage' alt='The ever so Silent Pool' \/><p class='diaryImageCaption'>The ever so Silent Pool<\/p>","images":false},"title":{"value":"Parkrun, Silent Pool, House Viewing, Aldershot Lido"},"version":1},{"date":{"d":12,"m":7,"y":2013},"datev":20130712,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica had a day off school and so spent the morning at Paula's and the afternoon with Mummy having a real mother and daughter afternoon. Or should I say plus Mathilda. Mathilda is the school teddy mole which you are supposed to chronicle her movements. A different child each week takes her home and looks after her.<\/p><img src='images\/years\/2013\/2013_07_12-06-JessicasSchoolMole.jpg' class='diaryImage' alt='Mathilda' \/><p class='diaryImageCaption'>Mathilda<\/p>","images":false},"title":{"value":"Mathilda Mole"},"version":5},{"date":{"d":11,"m":7,"y":2013},"datev":20130711,"first":{"value":null},"info":{"content":"<p>Daddy came along to watch Jessica 'compete' in her sports day. She did ever so well, winning her interclass running sprint race.<\/p><p \/><div class=\"youtube\"><iframe width=\"560\" height=\"360\" src=\"http:\/\/www.youtube.com\/embed\/tvUOeITiWWs\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><p \/>","images":false},"title":{"value":"Jessica's Sports Day"},"version":4},{"date":{"d":10,"m":7,"y":2013},"datev":20130710,"info":{"content":"<p>Daddy was awoken with croissants in bed. A treat in this household. He opened his presents which comprised of cycling tops, a bottle, book and magazine, a shirt, t-shirt, vouchers, cash and a beautifully crafted mug with all our hands prints on.<\/p><p>Ben and Katie had each made a loaf of bread as well which Daddy used in his sandwiches. It didn't matter that it was very soggy and undercooked, Daddy still proudly showed off his lunch to his work colleagues.<\/p><p>The fars popped over with their presents in the evening and stayed for a nice cup of tea.<\/p><p>Ben had been practising for the past 6 weeks on his 100 lines in the school play. He managed to land the role of Tex, the sheriff of the wild west town. It was in the two main parts of the whole show and we and he were nervous before the performance.<\/p><p>There was no need for the nerves as he played his part brilliantly. He was expressive, passionate and loud enough for us to hear him. The rest of the family had queue for an hour to ensure we had the best seats in the house. We were so, so proud of him. Well done Ben. Unfortunately we were not allowed to take any picture of videos of him during the performance. Such a shame as his Stetson hat was massive and almost looked like a sombrero.<\/p>","images":false},"title":{"value":"Daddy's 38th Birthday, Ben starring in School Play"},"version":1},{"date":{"d":9,"m":7,"y":2013},"datev":20130709,"first":{"name":"jessica","value":"Jessicas first school report"},"info":{"content":"<p>We always wonder how Jessica fairs at school as it is so hard to get her to take anything seriously or concentrate for more than 2 minutes. However, her school report was a pleasant surprise to us all.<\/p><p>She exceeded in all aspects of Personal, Social and Emotional development. The teacher commenting: Jessica has an excellent attitude towards behaviour and fully understands the difference between right and wrong. She is a good role model to others with her eagerness to learn and achieve. Jessica has been a pleasure to teach.<\/p><p>Well I never. Pick me up from the floor. Well done Jessica.<\/p>","images":false},"title":{"value":null},"version":5},{"date":{"d":6,"m":7,"y":2013},"datev":20130706,"images":4,"info":{"content":"<p>The Dixons had a nightmare 3 hour journey to get to our house. It was a very hot day. The BBQ was sizzling away and it was nice to see all the children were playing so well together.<\/p><p>The Fars cycled across and joined us and went over the green to the RLC Army Show. There were loads of big trucks and guns which was right up Reuben's street. We also went on the inflatable assault course, a go in the parachute, played noughts and crosses with a deep sea diver, went on the fun house and some other fast fun fair ride. We also had a couple of go's on the grenade course and finally the older children tackled the rope across the water challenge. A favourite by far.<\/p><p>We returned back, had some cold drinks and ice lollies, before everyone had to return home.<\/p><img src='images\/years\/2013\/2013_07_06-04-RLCArmyShow.jpg' class='diaryImage' alt='The RLC Revellers' \/><p class='diaryImageCaption'>The RLC Revellers<\/p><img src='images\/years\/2013\/2013_07_06-10-RLCArmyShow.jpg' class='diaryImage' alt='Jessica and Yasmin watching Katie traverse the rope' \/><p class='diaryImageCaption'>Jessica and Yasmin watching Katie traverse the rope<\/p><img src='images\/years\/2013\/2013_07_06-49-RLCArmyShow.jpg' class='diaryImage' alt='Dave and Reuben driving in the desert' \/><p class='diaryImageCaption'>Dave and Reuben driving in the desert<\/p><img src='images\/years\/2013\/2013_07_06-61-RLCArmyShow.jpg' class='diaryImage' alt='In the middle of being swung about' \/><p class='diaryImageCaption'>In the middle of being swung about<\/p>","images":false},"title":{"value":"RLC Army Day with Dixons"},"version":1},{"date":{"d":30,"m":6,"y":2013},"datev":20130630,"images":1,"info":{"content":"<p>After church we went to the Runnymeade Pleasure Grounds and met with the Sanders who we haven't seen for a long time. We had a splash about in the paddling pool and a nice ice lolly.<\/p><img src='images\/years\/2013\/2013_06_30-03-Runnymede.jpg' class='diaryImage' alt='The lineup' \/><p class='diaryImageCaption'>The lineup<\/p>","images":false},"title":{"value":"Runnymeade Pleasure Grounds with the Sanders"},"version":1},{"date":{"d":29,"m":6,"y":2013},"datev":20130629,"images":3,"info":{"content":"<p>In the morning Daddy, Ben and Natasha went to the Parkrun. Daddy still managed a sub 23 minute time which he was well pleased about. Natasha also completed the circuit for the first time.<\/p><p>Eva and Steve Barnett came over for a chat, cup of tea and a game of ball in the back garden which was nice for them to pop by.<\/p><p>In the afternoon Ben went to a Beaver event at Frimley Lodge Park. He loved the hike and teddy bear picnic.<\/p><p>Later in the evening we went to Heathrow Terminal 4 to pick Charlotte up from her holiday to Thailand.<\/p><img src='images\/years\/2013\/2013_06_29-03-EvaBarnett.jpg' class='diaryImage' alt='Eva Ball Games' \/><p class='diaryImageCaption'>Eva Ball Games<\/p><img src='images\/years\/2013\/2013_06_29-02-BeaverHikeAndPicnic.jpg' class='diaryImage' alt='Beaver Games' \/><p class='diaryImageCaption'>Beaver Games<\/p><img src='images\/years\/2013\/2013_06_29-08-CharlotteAirportPickup.jpg' class='diaryImage' alt='Charlotte Pick Up' \/><p class='diaryImageCaption'>Charlotte Pick Up<\/p>","images":false},"title":{"value":"Parkrun, Eva Barnett visit, Beaver Hike, Airport Pickup"},"version":1},{"date":{"d":26,"m":6,"y":2013},"datev":20130626,"first":{"value":null},"images":2,"info":{"content":"<p>Katie played for the school in a cricket competition a few weeks back. She was given some free tickets and gave them to Daddy for fathers day present. They set off as soon as Daddy got home from work. They stopped off at Sainsbury's for a few snacks, then made the longish walk to the Ageas Bowl in Hedge End, Southampton where Hampshire play. In the queue we saw Leah Rushforth which was nice. The weather was good and we settled down to watch some cricket. Katie was taking it all in and enjoying the atmosphere. Overall we sat in 5 different places within the ground. Katie was taken by the hot tub bath which was weirdly placed by the boundary with a load of teenagers dipping in and out. Katie also took a lot of action shots of the cricket. We had a lovely time, although cannot help feeling the attraction was a lot to having a late night!<\/p><img src='images\/years\/2013\/2013_06_26-03-HampshireCricket.jpg' class='diaryImage' alt='In the stands' \/><p class='diaryImageCaption'>In the stands<\/p><img src='images\/years\/2013\/2013_06_26-07-HampshireCricket.jpg' class='diaryImage' alt='Overlooking the Ageas Bowl' \/><p class='diaryImageCaption'>Overlooking the Ageas Bowl<\/p>","images":false},"title":{"value":"Hampshire V Surrey T20 Cricket"},"version":4},{"date":{"d":23,"m":6,"y":2013},"datev":20130623,"images":2,"info":{"content":"<p>Not more than 12 hours having his new bike, Daddy met up with Uncle Michael and rode 75 miles to meet with us at Ma Ma and Pop Pop's house. Daddy was pleased he could now keep up with Michael on his new bike.<\/p><p>We went to Ma Ma's to celebrate her birthday with the Elders. After the boys turned up, and a cheeky quick BBQ we went down to ride Tiki in the woods.<\/p><img src='images\/years\/2013\/2013_06_23-04-TikiRide.jpg' class='diaryImage' alt='Jessica riding Tiki' \/><p class='diaryImageCaption'>Jessica riding Tiki<\/p><img src='images\/years\/2013\/2013_06_23-01-TikiRide.jpg' class='diaryImage' alt='Katie riding Tiki' \/><p class='diaryImageCaption'>Katie riding Tiki<\/p>","images":false},"title":{"value":"Bike to Ma Ma's, Tiki Ride"},"version":1},{"date":{"d":22,"m":6,"y":2013},"datev":20130622,"images":1,"info":{"content":"<p>As part of Mummy's birthday she wanted to do one of our walks from the book. We started off at Sloane Square and walked down across Albert Bridge to Battersea Park. There we played in the park, then came back.<\/p><img src='images\/years\/2013\/2013_06_22-26-BatterseaParkWalk.jpg' class='diaryImage' alt='Bench pressed' \/><p class='diaryImageCaption'>Bench pressed<\/p><p>Daddy had bought a second hand road bike (racer for you old folk) off the internet which he was very happy with. £425 for a Giant Defy I 2011 model. Anyway he had to go all the way down to Taunton and back again to pick it up. He was well pleased with his purchase.<\/p>","images":false},"title":{"value":"Walk 44: Battersea Park Walk. Katie Party, New Road Bike"},"version":1},{"date":{"d":21,"m":6,"y":2013},"datev":20130621,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy went with Barrie to Royal Ascot in an all expenses paid (courtesy of Bazza's dad) trip. Started at 10:30 at the West household with Champaigne and fish. A bus ride later and we were in the Fast Lane for the Fosters Bar. We didn't win any races, but had a good time and continued drinking in Fleet until midnight!<\/p><img src='images\/years\/2013\/2013_06_21-02-RoyalAscot.jpg' class='diaryImage' alt='Royal Ascot' \/><p class='diaryImageCaption'>Royal Ascot<\/p>","images":false},"title":{"value":"Royal Ascot"},"version":5},{"date":{"d":16,"m":6,"y":2013},"datev":20130616,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy joined Michael and Nick and other fellow CNL'ers on the 54 mile trek from Clapham to Brighton. It took 4.5 hours and Daddy felt it went so much better and easier than last year.<\/p><img src='images\/years\/2013\/2013_06_16-07-LondonToBrightonBike.jpg' class='diaryImage' alt='The L2B'ers' \/><p class='diaryImageCaption'>The L2B'ers<\/p>","images":false},"title":{"value":"London to Brighton Bike Ride"},"version":5},{"date":{"d":15,"m":6,"y":2013},"datev":20130615,"images":1,"info":{"content":"<p>We went to the annual Pribright village fair where they have the unique scarecrow competition.<\/p><img src='images\/years\/2013\/2013_06_15-10-Scarecrow.jpg' class='diaryImage' alt='The Twits' \/><p class='diaryImageCaption'>The Twits<\/p>","images":false},"title":{"value":"Pirbright Scarecrows"},"version":1},{"date":{"d":4,"m":6,"y":2013},"datev":20130604,"first":{"value":null},"images":1,"info":{"content":"<p>Katie represented the school at cricket. She was very good, prefering the bowling. As part of her participation she received two free tickets to a Hampshire Cricket match.<\/p><img src='images\/years\/2013\/2013_06_04-01-KatieSchoolCricketMatch.jpg' class='diaryImage' alt='Katie School Cricket Team' \/><p class='diaryImageCaption'>Katie School Cricket Team<\/p>","images":false},"title":{"value":"Katie in School Cricket Competition"},"version":5},{"date":{"d":2,"m":6,"y":2013},"datev":20130602,"first":{"value":null},"images":3,"info":{"content":"<p>After another big breakfast we decided to lay off the beers and go sightseeing. Again the weather was perfect. We literally done a lap of Paris. The roads were quiet. Sights included: Hotel De Ville, Notre Dame, Invalides, Eiffel Tower and again the Champs-Elysee.... Oh did I mention we stopped for a patisserie.<\/p><p>On our way back to the hotel we stopped to get gifts and even had a McDonalds before boarding the stress-free EuroStar back to Kings Cross. The journey took 2:15 hours. We played cards for most of the journey home.<\/p><p>Mum and Dad picked me up from the station and drove me home whilst the others had to cycle to Paddington, catch a train, then cycle home. Total mileage: 222 miles.<\/p><img src='images\/years\/2013\/2013_06_02-00-Day5-ParisSights.jpg' class='diaryImage' alt='Route' \/><p class='diaryImageCaption'>Route<\/p><img src='images\/years\/2013\/2013_06_02-34-Day5-ParisSights.jpg' class='diaryImage' alt='Invalides' \/><p class='diaryImageCaption'>Invalides<\/p><img src='images\/years\/2013\/2013_06_02-81-Day5-ParisSights.jpg' class='diaryImage' alt='Tour Eiffel' \/><p class='diaryImageCaption'>Tour Eiffel<\/p>","images":false},"title":{"value":"Day 5: Bike Paris Sight Seeing"},"version":5},{"date":{"d":1,"m":6,"y":2013},"datev":20130601,"first":{"value":null},"images":7,"info":{"content":"<img src='images\/years\/2013\/2013_06_01-00-Day4-VillennesToParis.jpg' class='diaryImage' alt='Route' \/><p class='diaryImageCaption'>Route<\/p>\u000a<p>We started the day having bright blue skies for the first time for a long while. It was gorgeous. We tucked in customary style into a large 'eat as much as you like breakfast'. We began what we thought would be a gentle 30 mile ride into Paris. It was nice to get out of the fields scenery and more into towns where the life was.<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-03-Day4-VillennesToParis.jpg' class='diaryImage' alt='Setting off from Hotel Campenile' \/><p class='diaryImageCaption'>Setting off from Hotel Campenile<\/p>\u000a<p>We must have done 2 miles before we had a half an hour stop so Steve could pick up some sun cream and a hanger from a market place!<\/p>\u000a<p>The ride was mainly off road, sometimes on a gravelly path through the woods, some tarmac path. There were a couple of hills to please us all. We made a point at saying 'bonjour' to oncoming riders, and only 2 out of about 15 begrudgingly returned a compliment. They're an unfriendly bunch.<\/p>\u000a<p>We had some busy 70mph dual carriageways to negotiate where Nick's lights fell off his bike. Steve and I lost him for a bit but stopped at Versailles Gardens for him. However, Nick glided past without hearing the bellowing boys. Passers-by were laughing. Eventually we met up at a big statue in the middle of a roundabout.<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-52-Day4-VillennesToParis.jpg' class='diaryImage' alt='Statue at Versailles' \/><p class='diaryImageCaption'>Statue at Versailles<\/p>\u000a<p>The ride was surprisingly a peaceful one through various parks. We had our first sight of Paris itself at Parc de Saint Cloud. We stopped off for a viewing and a drink before continuing over the River Seine.<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-64-Day4-VillennesToParis.jpg' class='diaryImage' alt='Adonis' \/><p class='diaryImageCaption'>Adonis<\/p>\u000a<p>I wanted to detour to go to Roland Garros, especially as the French Open was on this week. They managed to see a Russian woman tennis player, but we do not know who it was.<\/p>\u000a<p>Riding along park land again we were 5 miles from the hotel at this stage. We came across a car parked up on the side of the road. She looked like a hooker. Cleaning the inside of her car down. Something very dubious happened there. Still we got a photo just in case we needed to provide evidence!<\/p>\u000a<p>We stopped off at another top notch patisserie for some lunch. Super high quality. We rolled up the hill to the iconic Arc De Triomphe. I set the challenge to cycle around the 10 lane roundabout. Steve didn't fancy it, he instead got accosted by beggars who had a curious scheme which we still cannot work out. They would drop a ring in front of you making it seem that it was yours. They would then try and give it to you. Then What? Dumbfounded.<\/p>\u000a<p>After circling the Arc a few times, we headed down the very bumpy, cobble stoned Champs-Elysee. We were making slow progress in the traffic. Still this is what it was all about. Don't know how the Tour De France riders handle it on their road bikes at speed. They must need a chiropodist by the end. By now we just wanted to get to the hotel and freshen up and dump the bags.<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-100-Day4-VillennesToParis.jpg' class='diaryImage' alt='Champs Elysee' \/><p class='diaryImageCaption'>Champs Elysee<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-110-Day4-VillennesToParis.jpg' class='diaryImage' alt='Riding Down The Champs Elysee' \/><p class='diaryImageCaption'>Riding Down The Champs Elysee<\/p>\u000a<p>We were in the Chopin Suite on the top floor. I had the choice of beds this time.... and took the double. The bathroom was the size of the kitchen diner at home, and it had jets squirting stuff from the sides.<\/p>\u000a<p>The boys were out on the town. First stop was a beer at the end of the road, then a walk to the Sacre Cour, where Steve made friends again with beggars and was called 'strong man' as he tried to get away from the grabbing man. We went in the impressive, grand cathedral. The views were magnificent. Steve was gasping for a beer. After doing a few laps we ended up in a bar opposite the Moulin Rouges for a 20 euro round of alcohol much to my disgust.<\/p>\u000a<p>Sitting in the sun watching the world go by on the street was very nice. After a frogs legs dinner we hit the metro and waited to see if Steve was going to deliver the promised 'good night out'. He researched by googling 'Where Single Girls Hang Out Paris'. Brilliant. Only the Dawg. We were worried at first as there wasn't too much around, and then we hit Rue Oberkampf. This was very busy. We hit a bar and convinced Steve to climb the stairs that led to the ceiling. Doh!<\/p>\u000a<p>We then went to '114' which had dancing..... a dancing Steve and I. There was a dj spitting out euro music. Nick was not a dancer and so went off for an explore.... and not seen again by the other two for another3 hours! He got lost.<\/p>\u000a<img src='images\/years\/2013\/2013_06_01-25-Day4-VillennesToParis.jpg' class='diaryImage' alt='Out for the night. Me and Kingster' \/><p class='diaryImageCaption'>Out for the night. Me and Kingster<\/p>\u000a<p>Steve and I decided to walk and partially run back to the Hotel. On the way we got a kebab and were approached by prostitutes! Paris at 3am was busier than it was at 3pm strangely enough. There were loads of bars which had massive queues outside. It was 3am.<\/p>\u000a<p>Meanwhile Nick, who had lost his map, not remembered a phone charger or the name of the hotel was lost! He followed others to the 'centre' where ever that was, but soon lost them. Not sure on the order of these events, but he trod in dog poo, attempted to help a man who was worse for wear, then was sick over Nick's shoes (he had no socks on either). Yuk. He also needed the toilet! Still worse was to come after he eventually found the hotel and began to wash the sick out. After settling down and getting some much needed sleep, Steve decided to hop into Nicks bed and 'spoon' him. Nick, startled, told Steve politely to bugger off. The shock on Steve's face was a picture. This happened again!<\/p>\u000a<p>Great day.<\/p>","images":false},"title":{"value":"Day 4: Bike Villennes Sur Seine to Paris"},"version":5},{"date":{"d":31,"m":5,"y":2013},"datev":20130531,"first":{"value":null},"images":3,"info":{"content":"<p>Today I consider as the main cycling day. It started slowly as we stocked up on food and cycle repairs. Nick had almost lost his arm in attempting to pump his tyre up. It wasn't until 11am until we seriously set off over the rolling hills down to Gournay En Bray. It was good to stop at the 15 mile marker for our first patisserie experience. Mmm. It was good. They know how to do pastry these french dudes.<\/p>\u000a<p>Despite been told the weather was going to be bad by a scouser at breakfast time, it was overcast and a little cold, but at least there was none of the wet stuff. During the early stages of the 75 mile ride we stuck together and stopped off at some really nice places. The roads were quiet, the scenery filled with fields.<\/p>\u000a<p>Mid afternoon the shackles were lost and I shot off at a good pace for 5 or 6 miles at first. Then we saw the 20km sign to Marines and again decided to see if I could push the pace on for myself. We all nervously agreed this was the best bit of the trip so far where we rode alone with our mp3 players in. We stopped for a patisserie in Marines. Gorgeous. We had 20 miles to go and Steve was struggling a bit so decided to club together again. We had a few dodgy detours. The route guided us on to a dual carriageway where cars were going past us at 70mph!<\/p>\u000a<p>We meandered through some more built up villages and finally at the top of a massive hill we reached the best hotel so far, Campanile.<\/p>\u000a<p>We spruced up and went back into Villennes Sur Seine, a pretty town, to get some drinks. There was nowhere to eat, so walked back up to the hotel and demolished the buffet styled dinner!<\/p>\u000a<img src='images\/years\/2013\/2013_05_31-00-Day3-ForgeLesEauxToVillennes.jpg' class='diaryImage' alt='Route' \/><p class='diaryImageCaption'>Route<\/p>\u000a<img src='images\/years\/2013\/2013_05_31-10-Day3-ForgeLesEauxToVillennes.jpg' class='diaryImage' alt='Nice Village With Big Church' \/><p class='diaryImageCaption'>Nice Village With Big Church<\/p>\u000a<img src='images\/years\/2013\/2013_05_31-19-Day3-ForgeLesEauxToVillennes.jpg' class='diaryImage' alt='End Of Day Vin Rouge' \/><p class='diaryImageCaption'>End Of Day Vin Rouge<\/p>","images":false},"title":{"value":"Day 3: Bike Forges Les Eaux to Villennes Sur Seine"},"version":5},{"date":{"d":30,"m":5,"y":2013},"datev":20130530,"first":{"value":null},"images":2,"info":{"content":"<p>We woke to a very grey day outside. We tucked into breakfast, got supplies and said our goodbyes to Michael who was riding 100km along the South Downs to Alton.<\/p>\u000a<p>At 10am, we boarded the ferry which was quite exciting, locking our bikes up to a transport container. I was pretty tired and wanted a sleep. However, Steve introduced a new card game which kept us entertained for a while. Nick spent a good few hours attempting to fix his pump which had mysteriously broken over the last day.<\/p>\u000a<img src='images\/years\/2013\/2013_05_30-06-Day2-DieppeToForgesLesEaux.jpg' class='diaryImage' alt='Ferry - Bikes in background' \/><p class='diaryImageCaption'>Ferry - Bikes in background<\/p>\u000a<img src='images\/years\/2013\/2013_05_30-00-Day2-DieppeToForgesLesEaux.jpg' class='diaryImage' alt='Route' \/><p class='diaryImageCaption'>Route<\/p>\u000a<p>We got into Dieppe with the weather being a little brighter. We duly presented our passports and negotiated riding on the right hand side of the road at a bit of a struggle at first. By now it was 4pm and we had a good 35 miles to do, so wanted to make good progress. We soon picked up the Avenue Vert which basically was a cycle path along a disused railway line. There was a slight incline all the way to our destination. We remarked how peaceful and nice the scenery was and how few riders we met. Very country. No cars.<\/p>\u000a<p>It was interesting to see how we would fair after the long ride yesterday. We certainly weren't the freshest. The ride was getting a bit monotonous in the end. Same path, same scenery. Nick, with 2 miles to go decided to spice it up by getting our second puncture! The spare inner tube did not fit the pump properly so Nick decided to patch up the existing one. We left the Avenue Vert path and headed into the town of Forges Les Eaux.<\/p>\u000a<p>We found the hotel easily enough. It was the first time we had to put on our best Del Boy french as the receptionist did not (want to) speak English. We were given keys to the garage to lock our bikes. Dawg produced the biggest, heaviest lock you could imagine. No one was going to take our velo's. I found that Michael had sneaked a teapot into my bag from Newhaven Lodge which was kind of him! We used it in order to make the Farnborough Rockets (Rego) Tea.<\/p>\u000a<p \/>\u000a<p>Farnborough Rockets Cup Of Tea<\/p>\u000a<div class=\"youtube\">\u000a    <iframe width=\"560\" height=\"360\" src=\"http:\/\/www.youtube.com\/embed\/0lmqxzBXv-M\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe>\u000a<\/div>\u000a<p \/>\u000a<p>The room was functional, but in order to squeeze three of us in they'd put in a childs camp bed in. Who was going to get the bum deal here? Nick was quite worried about the lack of puncture strategy kit, so wandered around the seemingly dead town at 8pm looking for bike shops. We gave up on that idea and decided to eat some French food for the first time in a Chinese!<\/p>\u000a<p>The meal was excellent, although I was well behind on the drinking front. We still had not decided which of us would be unlucky enough to sleep in the small bed. We had a coin toss comp. Yes I came last so had to take the camp bed.<\/p>","images":false},"title":{"value":"Day 2: Bike Newhaven to Forges Les Eaux"},"version":5},{"date":{"d":29,"m":5,"y":2013},"datev":20130529,"first":{"value":null},"images":3,"info":{"content":"<p>I decided last summer that I fancied biking from London to Paris. I organised it myself with the help of my fellow L2P'ers; Nick and Steve. I used the excellent Donald Hirsh website which had many of the routes and suggested hotels that we used.<\/p>\u000a<p>We had done some training and Steve has been in and out on some parts of the route. His injuries had subsided enough for him to attempt the whole lot. The starting point was Westminster bridge for a 9am departure. Mum and Dad kindly took me to London, whilst the other two got the train from Reading.<\/p>\u000a<p>Luggage was a major issue. We shared some bits. I bought a rucksack the day before as the ones we had were not big enough. The others brought panniers.<\/p>\u000a<img src='images\/years\/2013\/2013_05_29-00-Day1-LondonToNewhaven.jpg' class='diaryImage' alt='Route' \/><p class='diaryImageCaption'>Route<\/p>\u000a<img src='images\/years\/2013\/2013_05_29-03-Day1-LondonToNewhaven.jpg' class='diaryImage' alt='Starting from Westminster Bridge' \/><p class='diaryImageCaption'>Starting from Westminster Bridge<\/p>\u000a<p>We got a couple of photos before first heading in the opposite direction to Newhaven. We trundled to Parliament Square, through Victoria and onto Chelsea where we stopped for a photo outside Stamford Bridge. We then got a bit lost and made slow progress. We met with Michael close to the M25 and headed continued south with high spirits..... Then the rain came so we decided to stop at the top of Turners Hill at the pub for some much needed lunch.<\/p>\u000a<p>The rain persisted and the next hour or so was just getting miles under the belt. We got closer to Lewes and we all bolted off, leaving poor Steve behind...... with a puncture. Luckily he managed to contact Michael who kindly went back to sort him out! Meanwhile Nick and I went to Newhaven Lodge where we were greeted by an unfriendly Chinaman. It was a typical B and B.<\/p>\u000a<p>We freshened up and went out to a run down Newhaven. It was a pretty depressing place to live. We had a beer in the pub before moving on to the Hotel for some din dins. I fell behind on the drinking steaks. Slept well.<\/p>\u000a<img src='images\/years\/2013\/2013_05_29-07-Day1-LondonToNewhaven.jpg' class='diaryImage' alt='End Of Day Beer' \/><p class='diaryImageCaption'>End Of Day Beer<\/p>","images":false},"title":{"value":"Day 1: Bike London to Newhaven"},"version":5},{"date":{"d":27,"m":5,"y":2013},"datev":20130527,"images":1,"info":{"content":"<p>The Burrows came over for a BBQ in the back garden. We went over to Brooklands in the afternoon to race. Ben came home with a big scrape on his nose.<\/p><img src='images\/years\/2013\/2013_05_24-04-BurrowsVisit.jpg' class='diaryImage' alt='Brooklands Racers' \/><p class='diaryImageCaption'>Brooklands Racers<\/p>","images":false},"title":{"value":"Burrows Over For BBQ"},"version":1},{"date":{"d":26,"m":5,"y":2013},"datev":20130526,"images":3,"info":{"content":"<p>We had tickets to go to Godstone Farm so we went after church. We had a good time and stayed till kicking out time. We built a den as well as looking at the animals and of course going on all the play items.<\/p><img src='images\/years\/2013\/2013_05_23-12-GodstoneFarm.jpg' class='diaryImage' alt='Grass Sliding' \/><p class='diaryImageCaption'>Grass Sliding<\/p><img src='images\/years\/2013\/2013_05_23-27-GodstoneFarm.jpg' class='diaryImage' alt='Jessica Rabbit' \/><p class='diaryImageCaption'>Jessica Rabbit<\/p><img src='images\/years\/2013\/2013_05_23-36-GodstoneFarm.jpg' class='diaryImage' alt='Dirty Den' \/><p class='diaryImageCaption'>Dirty Den<\/p>","images":false},"title":{"value":"Godstone Farm"},"version":1},{"date":{"d":19,"m":5,"y":2013},"datev":20130519,"images":1,"info":{"content":"<p>We left Daddy behind and went to church then over to the Star pub near Leatherhead for Sue and Richard's 40th Wedding Anniversary celebration meal.<\/p><p>Meanwhile Daddy was upping the tempo on his training for the London to Paris ride by completing 65 miles in the Chilterns with Nick and Steve, to go with last Thursday's 60 mile+ ride in the Surrey Hills.<\/p><img src='images\/years\/2013\/2013_05_19-01-BarnettRubyAniMeal.jpg' class='diaryImage' alt='Barnett Family' \/><p class='diaryImageCaption'>Barnett Family<\/p>","images":false},"title":{"value":"Barnett Ruby Lunch, Long Bike Ride"},"version":1},{"date":{"d":18,"m":5,"y":2013},"datev":20130518,"images":2,"info":{"content":"<p>In the morning Mummy, Katie, Ben and Daddy all competed in the parkrun. Mummy was not able to beat Ben this week. However, we all did well. After we came back home to do homework, before going to Jessica's summer school fete at Sandringham School. Mummy was on the tattoo stool whilst Daddy was on wobbly bikes. The Fars and Ma Ma and Pop Pop joined us and helped contribute to the spending! Ben of course came back with 7 new teddy bears from the teddy tombola. We then had a third local event down at the Scout hut. The atmosphere was so nice and the leaders work so hard to make sure the boys had a good time with all the challenges they had laid out. We stayed and supported the AGM.<\/p><img src='images\/years\/2013\/2013_05_18-06-Fetes.jpg' class='diaryImage' alt='Farmor looking on to a mad wobbly biker' \/><p class='diaryImageCaption'>Farmor looking on to a mad wobbly biker<\/p><img src='images\/years\/2013\/2013_05_18-16-Fetes.jpg' class='diaryImage' alt='Benny the balancer' \/><p class='diaryImageCaption'>Benny the balancer<\/p>","images":false},"title":{"value":"Parkrun, Sandringham School Fete, Beaver BBQ"},"version":1},{"date":{"d":12,"m":5,"y":2013},"datev":20130512,"images":1,"info":{"content":"<p>All change at church. We went to the later service which had Sunday School. Felcity came as well. She goes to church sometimes at home.<\/p><p>We then scooted down to Andover and went into Finkley Down Farm. We were able to handle little chicks, stroke the rabbits and feed the lambs. We loved the indoor and outdoor play areas. It was nice to have a day out just the five of us.<\/p><img src='images\/years\/2013\/2013_05_12-23-FinkleyDownFarm.jpg' class='diaryImage' alt='Finkley Down Farm' \/><p class='diaryImageCaption'>Finkley Down Farm<\/p>","images":false},"title":{"value":"Finkley Down Farm"},"version":1},{"date":{"d":11,"m":5,"y":2013},"datev":20130511,"images":1,"info":{"content":"<p>The morning saw the boys go off to the home parkrun. Conditions were good and both smashed their PB's. Ben came in an amazing 28:15, whilst Daddy crossed the finish line in 22:36. Ben, as were we all, was very proud of his achievement.<\/p><p>After some homework action, we all went off to Coral Reef for swimming. It was packed. Still we all had a go on the flumes. The quick one was very quick. Mummy and Daddy could barely breath or see. Ben loved it of course. We saw the Elders, Weston's and Barnett's who joined us in there. After Daddy went home to watch the FA Cup final with Barrie and James. He also did a scrummy BBQ. Meanwhile the rest of us went to the cinema to watch the film: All Stars. Ben gave it 8.5 out of 10.<\/p><p>Felicity stayed over for the night. She played very well Katie. They played board games, watch films and ate sweets. They also prepared a show for the next family gathering.<\/p><img src='images\/years\/2013\/2013_05_11-10-Parkrun172.jpg' class='diaryImage' alt='28:15 - 5km' \/><p class='diaryImageCaption'>28:15 - 5km<\/p><p>Managed to set up Jon Barker from work with Charlotte! I wonder how that'll go.<\/p>","images":false},"title":{"value":"More Running Records, Coral Reef Swim, Cinema, Boys Over For FA Cup Final, Felicity Sleepover"},"version":1},{"date":{"d":6,"m":5,"y":2013},"datev":20130506,"images":1,"info":{"content":"<p>We of course started with the 3rd swim in a day in the morning before heading off to Tesco for breakfast. It was a gloriously sunny day so made the most of it by going to Lydiard Park where we played on the swings and walked down to the pond and saw a massive mansion. We had a great weekend with the Elders who we wish to thank for making it all possible.<\/p><img src='images\/years\/2013\/2013_05_06-14-SwindonHotelWeekend.jpg' class='diaryImage' alt='Lydiard Park' \/><p class='diaryImageCaption'>Lydiard Park<\/p><p>After we went off to the Factory outlet where daddy bought a shirt for work, then made the sleepy journey home.<\/p>","images":false},"title":{"value":"Swindon - Lydiard Park"},"version":1},{"date":{"d":5,"m":5,"y":2013},"datev":20130505,"images":1,"info":{"content":"<p>The big day had arrived for Daddy. He has spent the last month aiming for this event. Two training runs during the week, 2 bike to work and back a week, plus the parkrun and eating better was all to get a good time today. First up was Ben running in the fancy dress, 2.5km run. He dressed as a clone trooper and was interviewed pre-race. Ben completed the course inside 15 minutes and he said it was easy!<\/p><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/ApsGyzKuHek?version=3&amp;hl=en_GB\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/ApsGyzKuHek?version=3&amp;hl=en_GB\" type=\"application\/x-shockwave-flash\" width=\"480\" height=\"385\" allowscriptaccess=\"always\" allowfullscreen=\"true\"><\/embed><\/object><\/div><p>Ben's Interview Pre Race<\/p><p>Next up Daddy. He was running with James, Duncan and Richard. The third of these people didn't do too much training so was trailing a little to start with. The Ball brothers on the other hand hit the start hard. Daddy was able to keep up, although he was running his own race so didn't use them as pacemakers at all.The first hill hit at 3km and Daddy's slender lead over the Ball's had been quickly irradicated, as expected as he's not clever on the up hill. Still as soon as the downhill came, at about 4 or 5km Daddy re-took the lead. Daddy kept it strong, passing Farfar a couple of times and then saw us lot on the final bend. What Daddy was not expecting was a 'come on Duncan'. Daddy always faded at the end and Duncan was strong. However, Friday night's drinks caught up with him and he was sick all along the path. Great! Daddy pushed hard and finished in a very pleasing time of 47:40. A PB by a long shot.<\/p><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/5IMMEYC9-4E?version=3&amp;hl=en_GB\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/5IMMEYC9-4E?version=3&amp;hl=en_GB\" type=\"application\/x-shockwave-flash\" width=\"480\" height=\"385\" allowscriptaccess=\"always\" allowfullscreen=\"true\"><\/embed><\/object><\/div><p>Daddy finishing<\/p><img src='images\/years\/2013\/2013_05_05-02-FrimleyPark10km.jpg' class='diaryImage' alt='Daddy finishing in 47:40' \/><p class='diaryImageCaption'>Daddy finishing in 47:40<\/p><p>We quickly gobbled a poor attempt at BBQ'ed roast pork, before our nightmare jorney to Swindon.<\/p><p>We were as usual in a rush to leave and Daddy had forgotten his diabetes kit. So we had to turn back at Bracknell. Mummy popped in and got the stuff. We then only realized that she hadn't brought needles or the Humalog pen. This time we got as far as Ascot and turned back. On the third time of asking we got all the kit. We were an hour and a bit late!<\/p><p>We arrived at the Marriott, met with the Elder, reunited with Katie and went straight to the room. 5 beds! It's never happened before. Always enough for 4, never 5. We soon trotted down to the swimming pool for a long swim, sauna, jacuzzi and steam room. This made us have a large appetite, so went to McDonalds for the kids and the smallest chip shop ever for the grown ups. We had one last chance to squeeze in another swim session before bedtime.<\/p>","images":false},"title":{"value":"Frimley Park Hospital 10km Run, Swindon Hotel"},"version":1},{"date":{"d":4,"m":5,"y":2013},"datev":20130504,"images":3,"info":{"content":"<p>Frimley Lodge was hosting the Surrey Heath Fair so they cancelled the Park Run which gave us a chance to try somewhere new. We hopped down to Alice Holt where Daddy, Katie and Lily all trekked around the gruelling up and down 5km course. After an initial fall Lily blasted in at 35 minutes, whilst Katie stormed off on the second lap returning a minute quicker.<\/p><p>After we went onto the Elder household and had an afternoon of BBQ fun coupled with the Glidewells. We had a good time. We swapped Katie and Joey for the night.<\/p><p>When we got back home, Daddy started a marathon 4 hour fire in the BBQ in an attempt to burn all the old fence panels. There were some big flames. Katie, Joey and Jessica all worked as a team: Smashing up the fence, breaking up the wood into bite sized burnable chunks and of course the fireman (or lady) who was feeding the dragon.<\/p><img src='images\/years\/2013\/2013_05_04-06-EldersBBQ.jpg' class='diaryImage' alt='One is in her element' \/><p class='diaryImageCaption'>One is in her element<\/p><img src='images\/years\/2013\/2013_05_04-25-EldersBBQ.jpg' class='diaryImage' alt='Having a laugh' \/><p class='diaryImageCaption'>Having a laugh<\/p><img src='images\/years\/2013\/2013_05_04-36-EldersBBQ.jpg' class='diaryImage' alt='Twisted Firestarter' \/><p class='diaryImageCaption'>Twisted Firestarter<\/p>","images":false},"title":{"value":"Elder BBQ, Sleepover"},"version":1},{"date":{"d":1,"m":5,"y":2013},"datev":20130501,"first":{"value":null},"info":{"content":"<p>Sad to hear that Barrie and Laura are to seperate. They are going to live together in the short term. Uncle Barrie was quite upset.<\/p>","images":false},"title":{"value":"West Break Up"},"version":4},{"date":{"d":28,"m":4,"y":2013},"datev":20130428,"images":2,"info":{"content":"<p>In the morning Mummy went to church, whilst the boys went for a bike ride down to Frimley Lodge Park.<\/p><p>After picking up the girls we went to Runnymede to celebrate Farmor's 65th birthday. We sat by the river and had a picnic, which sounds very nice, but it's was chilly and windy. No matter we boarded the old boat which took us down towards Old Windsor. Heather Trott from Eastenders boarded along the way.<\/p><p>We stopped for a go on the swings and the Fars came over for a cup of tea.<\/p><img src='images\/years\/2013\/2013_04_28-05-Farmor65thBirthday.jpg' class='diaryImage' alt='Farmor and Auntie Susan' \/><p class='diaryImageCaption'>Farmor and Auntie Susan<\/p><img src='images\/years\/2013\/2013_04_28-10-Farmor65thBirthday.jpg' class='diaryImage' alt='Farmor and Katie on the boat' \/><p class='diaryImageCaption'>Farmor and Katie on the boat<\/p>","images":false},"title":{"value":"Farmor's 65th Birthday trip"},"version":1},{"date":{"d":27,"m":4,"y":2013},"datev":20130427,"images":3,"info":{"content":"<p>In the morning the Elders came over for another dose of the Parkrun. Daddy managed to get his best 5km time of 23:38.<\/p><p>Ben was being shipped off with the Beaver colony down to Drusillas. Apparently that is the closest place to see a Beaver. He really enjoyed himself as they played the animal Olympics.<\/p><p>Meanwhile the rest of us went up to Kerry'd house in Colchester to surprise Auntie Christine for her 60th birthday. It was nice to visit her and Simon's house. It looked really good, especially Simon's partition in the garage: A mini pub. A great BBQ.<\/p><p>In the evening Katie and Jessica joined their cousins for a sleepover at Ma Ma and Pop Pops.<\/p><img src='images\/years\/2013\/2013_04_27-02-Christines60th.jpg' class='diaryImage' alt='The Dog Inn' \/><p class='diaryImageCaption'>The Dog Inn<\/p><img src='images\/years\/2013\/2013_04_27-11-Christines60th.jpg' class='diaryImage' alt='Toby and Betsy' \/><p class='diaryImageCaption'>Toby and Betsy<\/p><img src='images\/years\/2013\/2013_04_27-13-Christines60th.jpg' class='diaryImage' alt='Birthday girl' \/><p class='diaryImageCaption'>Birthday girl<\/p>","images":false},"title":{"value":"Christine's 60th Surprise Party, Ma Ma Sleepover, Drusilla's"},"version":1},{"date":{"d":21,"m":4,"y":2013},"datev":20130421,"images":1,"info":{"content":"<p>Mummy and Daddy came to pick us up at the Fars. We got up at 6:15 much to the dismay of the Fars!<\/p><p>We bought some rather expensive tickets to see the Horrible History performance at GLive, Guildford theatre. Ben had just completed a project in the Tudors and was well into thrm and the horrible histories adaptation of them. So we went.<\/p><p>It was great and something for us to all learn. Certainly Mummy and Daddy learnt stuff. It was worth it.<\/p><p>In the afternoon Ben went with the Beavers for a St Georges day church parade with Mummy.<\/p><p>Just a note to say that Ben came top of his Maths class and got 20 out of 20 in a mental arithmetic test. Basically top of his year and some of the brighter students of the year above. Well done Ben.<\/p><img src='images\/years\/2013\/2013_04_21-02-HorribleHistories.jpg' class='diaryImage' alt='Horrible Histories' \/><p class='diaryImageCaption'>Horrible Histories<\/p>","images":false},"title":{"value":"Terrible Tudors"},"version":1},{"date":{"d":20,"m":4,"y":2013},"datev":20130420,"images":4,"info":{"content":"<p>We were graced with the presence of the Elders this morning, starting with the Parkrun at Frimley Lodge. It was a fine, sunny day with a record attendance. We had a great run, Uncle Michael finishing first out of us lot in a time of 20:46, followed by Daddy on 24:36, then Mummy on 34:01 and Ben and Joey at 34:58. Well done all. We went back home for a play and a fry up.<\/p><p>In the afternoon Ben went to one of his best friend's, Yuraj's birthday party held again at Frimley Lodge. Meanwhile Farmor came around to pick us two girls up and took us over to Laleham to play on the swings, have a sneaky ice cream, then pick Farfar up from the football club. We met Ben back at the Fars and had some nice dinner and a couple of walks into the woods.<\/p><p>Mummy and Daddy just about coped without us and went to Hemel Hempstead to Lisa Dixon's 40th birthday party. They met Lynda and Alan of course and got chatting to Lynda's nephew and wife which was very nice.<\/p><img src='images\/years\/2013\/2013_04_20-03-ParkrunElders.jpg' class='diaryImage' alt='The Boys Running' \/><p class='diaryImageCaption'>The Boys Running<\/p><img src='images\/years\/2013\/2013_04_20-03-Toby.jpg' class='diaryImage' alt='Jessica and Toby' \/><p class='diaryImageCaption'>Jessica and Toby<\/p><img src='images\/years\/2013\/2013_04_20-03-Lisas40th.jpg' class='diaryImage' alt='Going Out' \/><p class='diaryImageCaption'>Going Out<\/p><img src='images\/years\/2013\/2013_04_20-18-Lisas40th.jpg' class='diaryImage' alt='David and Lisa' \/><p class='diaryImageCaption'>David and Lisa<\/p>","images":false},"title":{"value":"Parkrun, Elders, Yuraj Birthday, Fars Sleepover, Lisa Dixon's 40th"},"version":1},{"date":{"d":14,"m":4,"y":2013},"datev":20130414,"images":2,"info":{"content":"<p>Mummy went on her own to church this morning. After an early lunch we trooped off to the Intech Science Centre where Katie had recently gone on a school trip. She had raved about it and coupled with a special Star Wars day we decided that it would be nice for all of us to experience it.<\/p><p>Everything was a hands on experience aimed for the children. It certainly kept us entertained. Overtakes the science museum. It was very good, capped off with a planetarium which we went in to. A fantastic afternoon out.<\/p><img src='images\/years\/2013\/2013_04_14-08-InTech.jpg' class='diaryImage' alt='Captured' \/><p class='diaryImageCaption'>Captured<\/p><img src='images\/years\/2013\/2013_04_14-39-InTech.jpg' class='diaryImage' alt='InTech' \/><p class='diaryImageCaption'>InTech<\/p>","images":false},"title":{"value":"Intech Science"},"version":1},{"date":{"d":13,"m":4,"y":2013},"datev":20130413,"images":1,"info":{"content":"<p>Busy day starting with the whole 5 of us starting the parkrun. Jessica went sprinting off and burnt herself out after 500m, which meant her and Mummy stopped. Katie, Daddy and Ben continued until we'd seen the others stopped after the mile mark and that point Katie felt she could go on no longer. That left the Boys to do another 2 miles on there own. The target was to beat last weeks time which they did by about a minute. 32:09 mins was there time which was fantastic. Ben certainly was panting hard around the course.<\/p><p>We headed straight off to Gravesend where Daddy went off with Ma Ma, Pop Pop and Bradley Teale to Gillingham for an adventurous Kayak trip around Hoo Ness. It's been Bradley's ambition for the past 6 years to actually go around the fort so we had good purpose to explore. First potential disaster overerted when the boot of our car slid up which pushed the kayak forward and almost on to the car parked in front. Just so happened Bradley was alert and thus saved a crash!<\/p><p>They set off towards Hoo Ness Island from Gillingham Strand at low tide which was not ideal. Bradley was a little unsure and found the choppy conditions a little unnerving at first. However he settled down and began to enjoy the scenery. There was quite a lot of rubbish which was quite noticeable as they circumnavigated the north side of the island. After half an hour or so, the intrepid sailors looked for a landing spot close to the 150 year old fort. It was difficult as the tide was out which left a lot of mud flats. Finally they found a place, however they were beached 5 metres from dry land. Daddy took his boots and socks off and pulled the vessels in. The intention was for the others not to get wet or muddy. However, once landed they were met with plenty of sinking mud. Daddy foolishly trekked off and didn't get too far before the sinking mud almost ate his boots! In an effort to help pretty much everyone fell over and lost footwear! It was pretty funny really. After a wash down and a struggle they re-boarded their craft and continued past all the scuttle ships which were a great site.<\/p><p>A bay of opportunity presented itself closer to the fort and this time they were able to land and reach ashore without too much bother. They stopped for some much needed Tomato soup which went down well as they were all beginning to feel the chill. Daddy and Bradley went off to see if they could get inside the fort which was defended well with thick foliage. Finally they did find the gangplank which went over the moat. However, it was sunken under water. At the same time they found the opening they could hear Gerry shouting for us quite loudly. What was wrong? Well luckily Carol and Gerry had stayed behind as the tide had quickly turned and came in. Gerry managed to move his Kayak up the beach and Carol was in the water holding Daddy's kayak. Thank goodness for the mother in law!<\/p><p>I think physical and mental strength was waining, that coupled with the weather drawing in meant the travellers were keen to get back to the mainland and get cleaned! The water was quite choppy with waves splashing on to the boats. 25 minutes of paddling ensured the safe return. It was a good adventure even if they didn't get inside Hoo Ness or the intended Darnet fort. Maybe another day.<\/p><p>Meanwhile the girls along with Benny stayed for lunch at the Teales and then went to Shorne Country Park. They went for a long walk to the mausoleum, a bit longer than expected which didn't thrill the kiddies, especially as it was raining. We finally all met up, went home and got a well deserved fish and chips for dinner.<\/p><img src='images\/years\/2013\/2013_04_13-06-HooNessKayak.jpg' class='diaryImage' alt='Tomato Soup Never Tasted So Good' \/><p class='diaryImageCaption'>Tomato Soup Never Tasted So Good<\/p>","images":false},"title":{"value":"Parkrun, Hoo Ness Kayak, Shorne Country Park"},"version":1},{"date":{"d":6,"m":4,"y":2013},"datev":20130406,"images":4,"info":{"content":"<p>Continuous promises for the participation in the 5km Parkrun was excused away week after week over the past 2 months. Now Benny Boy has stepped up and decided to take on the 3 mile challenge, a distance he's never even got close to running before. We weren't sure what to expect in terms of performance . Would he last 2 laps? What sort of time would he get? We met up with James and Duncan and we told Ben about the 10 run t-shirt. However, he'd have to complete 2 laps to register for this. This I think spurred him on. Daddy, Ben and James all ran together and it was difficult to gauge as Ben seemed like he could go faster whenever he wanted and didn't sweat at all despite wearing his hoody! Anyway his trainers fell off twice, once near the finish line, he completed the course in 33:06 minutes and came 281 out of 309 runners. We were very proud and made Daddy's day.<\/p><img src='images\/years\/2013\/2013_04_06-03-Parkrun.jpg' class='diaryImage' alt='Ben's First Parkrun' \/><p class='diaryImageCaption'>Ben's First Parkrun<\/p><p>Finally we had some blue skies, sun and no wind. Time for a walk then. We choose the Greenwich walk which starts at the O2, somewhere we've not been before. We parked up in Charlton and caught the bus in. We were impressed and excited at being at the O2. Mummy felt guilty that we've never taken us to see a concert or anything here. One day maybe. We circled the building and even saw people climb some stairs to the top! Wicked. Anyway we got to the Thames and headed west on our slightly weird journey into Greenwich. We walked by heavy plant places, along the Blackwall Tunnel road and along some of the quainter, quieter streets. We stopped for a picnic outside the Cutty Sark pub which was much need by Jessica, before finally hitting the University Buildings. We wet inside our favourite Painted Hall. There are mirrors mounted on top of tea trolleys so you can marvel at the paintings on the ceiling. However, Jessica was marvelling at herself more I think and being silly.<\/p><p>After the chapel we entered the park and played on the swings. There were some more apparatus there now. It was a lovely sunny afternoon. We climbed the hills, and roly pollied down some of them on our way to top and the observatory. There were loads of tourists there. What will it be like in the summer? We wound our way back dow n into town and Daddy had spotted his favourite Pie And Mash shop had reformed and relocated. This made his day. Goddards had ceased to exist in the past few years, the premises taken over by Gourmet Burger (yuk, Judas, errr), but happily they sprung up again on the other side of the shopping bit. We just had to go in and get some pies and a sausage roll. Thank goodness they were as good as ever. We then went in to the big sweet shop and fleeced mummy for some sweets before fighting our way through the market and over to the Cutty Sark. The first time we've seen it since it was restored. It had a strange glass bit around the bottom. When we peered through, there was an underground bit which meant you could effectively walk under the boat.<\/p><p>At the other end of the boat was a street performer singing blues music and playing a harmonica and a steel, electric, slide guitar. This made Daddy's day now three times over. He was compelled to buy the chaps CD, which we all had to endure on the way home. Actually Ben said he liked it! Anyway back to proceedings. We had our race down the foot tunnel. Daddy, Katie and Ben ran down the steps quicker than Mummy and Jessica could go down in the lift. Once up the other side we got the DLR to Royal Victoria Dock. To end our planes, trains and automobiles trek we caught a 'flight' across the Thames in the cable car which took us back to the O2. We loved it, although we were little embarrassed when Ben was saying he should take a bomb into our carriage! A fine 5 mile afternoon.<\/p><img src='images\/years\/2013\/2013_04_06-17-GreenwichWalk.jpg' class='diaryImage' alt='Roly Pollies Down Greenwich Park' \/><p class='diaryImageCaption'>Roly Pollies Down Greenwich Park<\/p><img src='images\/years\/2013\/2013_04_06-24-GreenwichWalk.jpg' class='diaryImage' alt='The Gang In London' \/><p class='diaryImageCaption'>The Gang In London<\/p><img src='images\/years\/2013\/2013_04_06-53-GreenwichWalk.jpg' class='diaryImage' alt='Flight Across Thames' \/><p class='diaryImageCaption'>Flight Across Thames<\/p>","images":false},"title":{"value":"Walk 43: Greenwich and Sky Ride, Ben Parkrun"},"version":1},{"date":{"d":1,"m":4,"y":2013},"datev":20130401,"images":2,"info":{"content":"<p>We joined Uncle Richard, Evie and Joshua for a cold, windy walk around the second of our National Trust Easter Egg hunts of the long weekend.<\/p><img src='images\/years\/2013\/2013_04_01-12-HatchlandsPark.jpg' class='diaryImage' alt='Hatchlands Park (NT)' \/><p class='diaryImageCaption'>Hatchlands Park (NT)<\/p><img src='images\/years\/2013\/2013_04_01-33-HatchlandsPark.jpg' class='diaryImage' alt='All Made Up' \/><p class='diaryImageCaption'>All Made Up<\/p>","images":false},"title":{"value":"Hatchlands Park Easter Egg Trail"},"version":1},{"date":{"d":31,"m":3,"y":2013},"datev":20130331,"images":1,"info":{"content":"<p>In the morning mummy was mad and went to the 6am church service held on top of Frimley Green hill! Daddy then went off for a bike ride to Farnham and back and met Uncle Michael on the way.<\/p><p>Mummy's side of the family came around for a roast pork lunch before we all moved off to Pete's for an Easter Egg hunt. It's always fun playing there as there are so many interesting things you don't often see.... like the caravan in the back garden.<\/p><p>It was child swap time. Joey came over to stay the night and played with Ben on the computer. Meanwhile Katie joined Lily over at Ma Ma's house.<\/p><img src='images\/years\/2013\/2013_03_31-04-EasterAtPetes.jpg' class='diaryImage' alt='Where Are The Eggs' \/><p class='diaryImageCaption'>Where Are The Eggs<\/p>","images":false},"title":{"value":"Easter Lunch and Pete's Egg Party"},"version":1},{"date":{"d":30,"m":3,"y":2013},"datev":20130330,"info":{"content":"<p>Daddy went for his Parkrun and came back to pick us up and take us out whilst Mummy prepared for a house viewing, only to be told 5 minutes beforehand that the viewers had cancelled! Still there was another couple at 2pm. This pretty much ruined our day in terms of being able to go out and do something substantial. Daddy took us to Sandhurst Memorial park for a play. It was pretty cold.<\/p><p>We decided to fill the evening with the final contestant in the Come Dine With Me competition, Daddy. He spent 3 hours in the kitchen making, mini pizzas for starter, Sausage Plat and mash for main and Chocolate Ganache for pudding.<\/p><p>Then came the opening of the envelopes. In fifth place came Jessica, not helped with a score of 5 from Benjamin Alan Uhrskov! Fourth was Ben, Third Mummy, a sympathetic second for Daddy and Katie walks away with the £10 prize fund for first place!! Well done Katie.<\/p>","images":false},"title":{"value":"House Viewing. Come Dine With Me - Daddy, Finale"},"version":1},{"date":{"d":29,"m":3,"y":2013},"datev":20130329,"images":1,"info":{"content":"<p>We started the Easter weekend with an Easter Egg trail for what is the coldest Easter since records began. Not only is the temperature hovering above freezing, there was a cold biting wind on the common. Still we made the most of it and circled the trail and found all 15 clues to earn an Easter Egg and a go on some of the activities.<\/p><p>In the evening we invited the Fars over for dinner.<\/p><img src='images\/years\/2013\/2013_03_29-00-HeadleyHeath-EasterTrail.jpg' class='diaryImage' alt='Headley Park' \/><p class='diaryImageCaption'>Headley Park<\/p>","images":false},"title":{"value":"Headley Common Easter Trail, Fars over for Dinner"},"version":1},{"date":{"d":22,"m":3,"y":2013},"datev":20130322,"images":1,"info":{"content":"<p>Jessica's turn for Come Dine With Me. Mummy helped but did tell Jessie to lay the table to which the response was. \"I don't want to do it, it's too boring\". She's got to get marks knocked off for that!<\/p><p>Mummy and Daddy's new bed arrived, putting to bed the old bed which lasted 13 years!<\/p><img src='images\/years\/2013\/2013_03_22-04-JessicaComeDineWithMe.jpg' class='diaryImage' alt='Ben looking handsome' \/><p class='diaryImageCaption'>Ben looking handsome<\/p>","images":false},"title":{"value":"Jessica Come Dine With Me - New Bed"},"version":1},{"date":{"d":16,"m":3,"y":2013},"datev":20130316,"images":2,"info":{"content":"<p>Cold, terrible weather again and a house viewing meant a day mostly at home. We played a family game of Scrabble in the afternoon. The quality was immense. We almost reached 5 letter words!<\/p><p>In the evening Katie hosted the next round of Come Dine With Me. We had a knock out starter, starter of a ring of sweets. For starter we had onion rings and bread with dips. For main we had Hot Dogs and chips followed by ice cream with more sweeties.<\/p><img src='images\/years\/2013\/2013_03_16-02-ScrabbleGame.jpg' class='diaryImage' alt='Scrabble' \/><p class='diaryImageCaption'>Scrabble<\/p><img src='images\/years\/2013\/2013_03_16-01-KatieComeDineWithMe.jpg' class='diaryImage' alt='Sweet Starter' \/><p class='diaryImageCaption'>Sweet Starter<\/p>","images":false},"title":{"value":"Scrabble - Katie Come Dine With Me - House Viewing"},"version":1},{"date":{"d":13,"m":3,"y":2013},"datev":20130313,"first":{"value":null},"images":1,"info":{"content":"<p>Mummy and Daddy attended Jessica's class assembly today which was a sports montage performed in front of the school. Jessica was a runner!<\/p>\u000a<img src='images\/years\/2013\/2013_03_13-01-JessicaClassAssembly.jpg' class='diaryImage' alt='Jessica's Class' \/><p class='diaryImageCaption'>Jessica's Class<\/p>","images":false},"title":{"value":"Jessica's Class Assembly"},"version":3},{"date":{"d":10,"m":3,"y":2013},"datev":20130310,"info":{"content":"<p>We got up early this morning and tried to make Mummy breakfast in bed. However, filling the kettle for the cup of tea we managed to flood half the kitchen. Worse still we switched the dripping wet kettle on and the fuse when for downstairs! Whoops. After Croissants in bed, it was present and card opening time. It was chocolates all the way, along with some fine cards. We then put on a Mother's Day show on downstairs which included costumes, a stage, songs, poems and a little acting scene. It was very touching.<\/p><p>Later Daddy went for a 40km cycle ride with Nick and Martin, Katie and Ben went to Nina's bowling party, later in the afternoon Mummy and Jessica went to a nice hotel in Haselmere with the Barnett \/ Weston clan for Mother's Day tea and cake, whist Daddy, Katie and Ben went to the fars to play Coppit and Trains.<\/p>","images":false},"title":{"value":"Mothers Day"},"version":1},{"date":{"d":9,"m":3,"y":2013},"datev":20130309,"images":3,"info":{"content":"<p>Daddy had done no training all week so was quite pleased with a sub 25 minute performance on a muddy Frimley Lodge Park track. As soon as he got home we went off with him to the RLC museum who were doing an event. We had a good time looking around. Mummy popped over to church for the lent lunch.<\/p><p>In the afternoon Mummy and Daddy had volunteered to rattle a collection tin for the Marie Curie at the Meadows. Ma Ma and Pop Pop came to save us so we didn't have to wait around for the two full hours.<\/p><p>Ben's turn for Come Dine With Me. His menu consisted of: Popadoms, Chicken Korma and Ice Cream inside a scooped out Orange. He showed a lot of enthusiasm for it and was proud of his final result. It was very nice. A lot of clean plates.<\/p><img src='images\/years\/2013\/2013_03_09-02-BenComeDineWithMe.jpg' class='diaryImage' alt='Jessica Superstar' \/><p class='diaryImageCaption'>Jessica Superstar<\/p><img src='images\/years\/2013\/2013_03_09-00-MarieCurieCollecting.jpg' class='diaryImage' alt='Marie Curie Collectors' \/><p class='diaryImageCaption'>Marie Curie Collectors<\/p><img src='images\/years\/2013\/2013_03_09-00-RLCMuseum.jpg' class='diaryImage' alt='RLC Museum Fun' \/><p class='diaryImageCaption'>RLC Museum Fun<\/p>","images":false},"title":{"value":"RLC Museum, Marie Curie Collecting, Come Dine With Me - Benjamin"},"version":1},{"date":{"d":6,"m":3,"y":2013},"datev":20130306,"images":2,"info":{"content":"<p>The Royal 'We' have decided to put the house on the market with a property agent. You pay them £250, they come around take pictures, get dimensions, etc., and put it on all the popular house web sites. Much better than the £4000 for the estate agent fees. Anyway on Friday we have our first viewing. Lots of DIY for Daddy to do.<\/p><img src='images\/years\/2013\/2013_03_09-01-HouseSale.jpg' class='diaryImage' alt='Advert' \/><p class='diaryImageCaption'>Advert<\/p><img src='images\/years\/2013\/2013_03_09-03-HouseSale.jpg' class='diaryImage' alt='Dimensions' \/><p class='diaryImageCaption'>Dimensions<\/p>","images":false},"title":{"value":"House On The Market - Again?"},"version":1},{"date":{"d":3,"m":3,"y":2013},"datev":20130303,"info":{"content":"<p>We went over to Natasba Burrows 5th birthday over in Kenley. We also went over to see the Fars.<\/p>","images":false},"title":{"value":"Fars - Natasha Birthday Party"},"version":1},{"date":{"d":2,"m":3,"y":2013},"datev":20130302,"images":1,"info":{"content":"<p>In the morning we parted three ways. Katie went off for a Brownie Thinking day, Mummy, Ben and Jessica went over to Meopham for Alice Teale's 5th birthday and Daddy went to do the Nuts Challenge in Dorking with his work colleagues.<\/p><p>Daddy was not too sure what to expect from the 7km course. The website listed 6 or 7 obstacles (including Hell River and Hamburger Hill) and so he thought it would be mainly a running event. How wrong he was. There must have been 10 obstacles in the first 500m, including getting very wet and muddy and climbing through underground steel tube tunnels, cargo nets, firemans poles, trenches, (freezing) river walking and at the end a neck high 100m walk\/swim through a lake! Over 20 people got hypothermia, broken bones and even a helicopter airlift! Daddy finished in 350th out of over 900 competitors. 60 people attempted the 28km version and only 6 finished!<\/p><img src='images\/years\/2013\/2013_03_02-16-NutsChallenge.jpg' class='diaryImage' alt='Nuts Challenge' \/><p class='diaryImageCaption'>Nuts Challenge<\/p><p>Later in the day Ma Ma and Pop Pop popped to visit, we also went to view a house in Frimley Green which we really liked. Katie's friend Emma came to stay the night.<\/p>","images":false},"title":{"value":"Nuts Challenge - Brownie Thinking Day - Alice Birthday - House Viewing - Emma Sleepover"},"version":1},{"date":{"d":1,"m":3,"y":2013},"datev":20130301,"images":1,"info":{"content":"<p>Katie has really got into Come Dine With Me, so we are all going to take a turn in hosting an evening. Tonight Mummy's menu was: Dough Balls, Egg and Bacon Pizza, Strawberry Ice Cream Sundaes.<\/p><img src='images\/years\/2013\/2013_03_01-03-LauraComeDineWithMe.jpg' class='diaryImage' alt='The Guests' \/><p class='diaryImageCaption'>The Guests<\/p>","images":false},"title":{"value":"Come Dine With Me - Laura"},"version":1},{"date":{"d":24,"m":2,"y":2013},"datev":20130224,"images":2,"info":{"content":"<p>We had an early start as Charlotte came with us to Heathrow Airport to welcome back Ma Ma and Pop Pop from their New Zealand holiday. More importantly we were there to get our presents! However, we had to trade Jessica who went to stay at Ma Ma and Pop Pops for the night.<\/p><p>She luckily escaped not only the 5 mile run that Daddy and Charlotte later did, but also the long Regents Canal walk. There was a lot of traffic getting there and pretty cold outside. We even saw the odd flake of snow. Still not even the moaning from Katie and Ben deterred Mummy, Daddy and Charlotte from the walk which commenced at Kings Cross station.<\/p><p>Ben, within 5 minutes fell off the scooter, hurt his hands and began crying. Oh dear. Still we made it to the canal and had a lovely walk along, popping off at Camden to go up and down the high street. There were plenty of people shopping and there were loads of market stalls selling food.<\/p><p>We continued past London Zoo and Little Venice before we all were glad to see the car at Warwick Avenue. As Mummy says: That's another ticked off. We missed Jessica lots with her happy face.<\/p><img src='images\/years\/2013\/2013_02_24-03-RegentCanalWalk.jpg' class='diaryImage' alt='Camden High Street' \/><p class='diaryImageCaption'>Camden High Street<\/p><img src='images\/years\/2013\/2013_02_24-09-RegentCanalWalk.jpg' class='diaryImage' alt='Happy Ben Over Regents Canal' \/><p class='diaryImageCaption'>Happy Ben Over Regents Canal<\/p>","images":false},"title":{"value":"Walk 42: Regents Canal Walk - Heathrow Pickup, Jessica sleepover"},"version":1},{"date":{"d":23,"m":2,"y":2013},"datev":20130223,"info":{"content":"<p>Daddy went off to do his parkrun and smashed his best time by almost 2 minutes. PB is now set at 24:05. He was very happy. As soon as he came back home we went over to the Spectrum and met the Elders for a swim. It was really busy there, so the queues were quite long. Still we had fun on all the things. We didn't manage the 5m diving board this time though.<\/p><p>We all came back to our house where Daddy did a fry up, without anything actually being fried. We swapped Katie for Joey who stayed over for the night. We also accrued Charlotte at Hotel Gay.<\/p>","images":false},"title":{"value":"Elders Spectrum Swim, PB in Parkrun, Joey and Katie swap sleepover"},"version":1},{"date":{"d":22,"m":2,"y":2013},"datev":20130222,"images":1,"info":{"content":"<p>We don't see Ron that often and now that he finds it difficult to travel long distances we arranged to meet with the rest of the Gay family over in the Royal Saracens pub in Beaconsfield. Ron wanted to treat us all to lunch which was very generous of him.<\/p><p>We did very well considering we were there for 4 hours and not a lot to entertain us. Still Daddy had a nice chat with Great Uncle Ron, comparing diabetes notes, recalling stories about his Dad and other stuff. He's quite a laid back, easy to talk to character.<\/p><p>It was nice to see everyone together.<\/p><img src='images\/years\/2013\/2013_02_22-05-RonLunch.jpg' class='diaryImage' alt='The Gay Family' \/><p class='diaryImageCaption'>The Gay Family<\/p>","images":false},"title":{"value":"Lunch With Ron"},"version":1},{"date":{"d":18,"m":2,"y":2013},"datev":20130218,"images":1,"info":{"content":"<p>For valentines day mummy got another walk book, much to the delight of the children! It contains 45 walks all in the area, not much more than a 10 miles journey from home. Today was local, starting off at the Basingstoke canal at the bottom of Deepcut. Jessica had been upgraded to Katie's old bike. Unfortunately there was only one brake and Jessica found it hard to squeeze. So there were a few hairy moments along the route. Once she raced off the hill, went over a branch at pace, wobbled, kept her balance but then slowed to a halt by riding into a steep bank! Ben ended up crying a couple of times. Once for going over the handlebars right at the start and secondly by getting stuck in a deep puddle and getting soaked! Typical Benjamin.<\/p><p>It was a lovely ride as we explored parts of Deepcut and Frimley Green we never had before. We finally ended up at the Canal centre in Mytchett and then back home. A 4 hour epic ride which was only 7 miles long!<\/p><img src='images\/years\/2013\/2013_02_19-15-DeepcutBikeRide.jpg' class='diaryImage' alt='Hill Climb' \/><p class='diaryImageCaption'>Hill Climb<\/p>","images":false},"title":{"value":"Deepcut Cycle Ride"},"version":1},{"date":{"d":17,"m":2,"y":2013},"datev":20130217,"first":{"value":null},"info":{"content":"<p>Each year Katie has a sleepover with friends who all started Frimley Green playgroup on the same day, namely: Natasha, Grace and Nina. You couldn't see the carpet in the front room they made so much mess. No Barbie's were played with, instead there were boxing gloves and a tablet computer. They watched films and Pop Girl till about 11pm - midnightish which is relatively early for a Katie sleepover.<\/p>","images":false},"title":{"value":"Sleepover mayhem"},"version":5},{"date":{"d":16,"m":2,"y":2013},"datev":20130216,"images":1,"info":{"content":"<p>Daddy completed the ParkRun 15 seconds outside his best which was not very satisfying. However, he went out afterwards with the Balls for the ParkRun breakfast and was introduced the rest of the team.<\/p><p>Daddy bought mummy a booking at the hairdressers. Possibly the first haircut she has had for 3 or 4 years plus. Mummy was worried that if she had it cut short that'll Jessica would have nothing to cling onto. Still it didn't stop her. Ben said she looked beautiful when she came out. We all of course agreed.<\/p><img src='images\/years\/2013\/2013_02_16-00-Haircut.jpg' class='diaryImage' alt='Before and After Haircut' \/><p class='diaryImageCaption'>Before and After Haircut<\/p><p>Whilst Mummy had her haircut the rest of us popped over to Auntie Susan's to have a drink and see the cats. Uncle Graham was at work. Later in the afternoon we were able to have another cuddle with Toby as the Elders came over for a cuppa.<\/p>","images":false},"title":{"value":"Park Run, Mummy Haircut, Auntie Susan's and Elders"},"version":1},{"date":{"d":15,"m":2,"y":2013},"datev":20130215,"first":{"value":null},"images":1,"info":{"content":"<p>Katie went with her youth group and daddy over to Guildford's Craggy Island for a spot of climbing. She loved it and was pretty good at it.<\/p>\u000a<img src='images\/years\/2013\/2013_02_16-13-Climbing.jpg' class='diaryImage' alt='Climbing the walls' \/><p class='diaryImageCaption'>Climbing the walls<\/p>","images":false},"title":{"value":"Craggy Island"},"version":4},{"date":{"d":11,"m":2,"y":2013},"datev":20130211,"first":{"name":"jessica","value":"Parents Evening"},"info":{"content":"<p>Mummy and Daddy were a little apprehensive about what was going to be said. Concentration levels and intelligence were the main issues. Jessica is as mad as a hatter. You never know what is going on upstairs in there. Well it seems a bit. She is working with some year ones for a couple of subjects. The teacher seemed very happy with her. The only thing was confidence in doing the work. She always checks what she does with the teacher before getting on with it. She always has the right idea. Mummy and Daddy were very pleased and proud of number 3!<\/p>","images":false},"title":{"value":"Jessica's Parents Evening"},"version":3},{"date":{"d":10,"m":2,"y":2013},"datev":20130210,"info":{"content":"<p>We were at church for 3 hours today. Katie spoke at the front of church as part of her Brownies group.<\/p><p>In the afternoon Daddy took the three of us swimming at the Arena. Daddy was well impressed with Jessica's ability to swim only after two lessons. She must have done 5 metres. Hopefully with the rate of progression we'll have her out of armbands by the end of the year.<\/p><p>After we popped over to the Fars to see how they are doing and to wreck the joint as usual.<\/p>","images":false},"title":{"value":"Church Parade, Swimming, Fars"},"version":1},{"date":{"d":9,"m":2,"y":2013},"datev":20130209,"images":2,"info":{"content":"<p>The weather was shocking today and after Daddy and Auntie Charlotte's morning Park Run we all went over to Alton to see our new cousin who was very sleepy during the day as he was awake all night! A very contented boy. Daddy cycled home through the rain.<\/p><img src='images\/years\/2013\/2013_02_09-26-TobyWilliamElder.jpg' class='diaryImage' alt='Six Cousins' \/><p class='diaryImageCaption'>Six Cousins<\/p><img src='images\/years\/2013\/2013_02_09-41-TobyWilliamElder.jpg' class='diaryImage' alt='Sub 40 Family' \/><p class='diaryImageCaption'>Sub 40 Family<\/p>","images":false},"title":{"value":"Visiting Toby Elder"},"version":1},{"date":{"d":7,"m":2,"y":2013},"datev":20130207,"info":{"content":"<p>We have a new cousin in Toby Elder who was induced out at 6pm, weighing in at 9lbs, 10 ounces. He was a healthy boy born at Basingstoke Hospital.<\/p>","images":false},"title":{"value":"Toby William Elder born"},"version":1},{"date":{"d":3,"m":2,"y":2013},"datev":20130203,"first":{"value":null},"info":{"content":"<p>Daddy went off with his fellow London to Paris compatriots; Nick and Steven, on a training ride around the Chilterns.<\/p>","images":false},"title":{"value":"Chiltern Bike Ride"},"version":5},{"date":{"d":2,"m":2,"y":2013},"datev":20130202,"images":1,"info":{"content":"<p>Mummy helped organize the church party which went off very well. Ma Ma and Pop Pop came over as well as Uncle Peter and Great Grandma. In between times Katie went off to Leah Rushforth's 10th birthday party and it was nice to see Jessica and Aimee being best off buddies at Aimee's 5th birthday party held at Tomlinscote School.<\/p><img src='images\/years\/2013\/2013_02_02-05-Aimee5thBirthday.jpg' class='diaryImage' alt='Jessica and Aimee' \/><p class='diaryImageCaption'>Jessica and Aimee<\/p><p>Daddy and Ben also made a video for Ben's homework on the nine times table.<\/p><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/KxnN19Z_pOQ&amp;hl=en_GB&amp;fs=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/KxnN19Z_pOQ&amp;hl=en_GB&amp;fs=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><\/div>","images":false},"title":{"value":"Church Party, Leah R 10th Birthday, Aimee H 5th Birthday"},"version":1},{"date":{"d":26,"m":1,"y":2013},"datev":20130126,"info":{"content":"<p>We had Great Grandma and Uncle Pete over for a nice Sunday Roast.<\/p>","images":false},"title":{"value":"Great Grandma and Uncle Peter for Sunday lunch"},"version":1},{"date":{"d":26,"m":1,"y":2013},"datev":20130126,"images":1,"info":{"content":"<p>Last night Mummy and Daddy went out with the West's for a nice meal down the Swan in Ash Vale. Auntie Charlotte came around to stay the night even though she'd worked a double shift and was tired. Too tired to join Daddy in the Park Run, which was extremely muddy. It was a close run thing between James and Daddy. James took an early lead. With 400m to go Daddy ran past Mr Ball quite strongly, however, James had a bit left in the tank for a sprint finish. Time: 26:55 for 5km.<\/p><p>Auntie Charlotte departed. The Teale's came over in the afternoon. Daddy and Bradley planned their WWII fort kayak run in Kent. Summer and Katie played like a dream with each other. They have very imaginative minds when it comes to playing Barbies with one another! They didn't go to sleep until well gone midnight!<\/p><img src='images\/years\/2013\/2013_01_26-02-ParkRun.jpeg' class='diaryImage' alt='James beating Daddy in the Park Run.' \/><p class='diaryImageCaption'>James beating Daddy in the Park Run.<\/p>","images":false},"title":{"value":"Summer Teale Sleepover"},"version":1},{"date":{"d":20,"m":1,"y":2013},"datev":20130120,"images":1,"info":{"content":"<p>Some more woes with the car. The battery has died again which means another bail out from the Fars. This time they stopped by for a spot of tea.<\/p><p>In the afternoon Daddy, Ben and Jessica ventured into the woods, wrapped up well, armed with two sledges and a few square miles of hilly woods. They managed to get to four hills, steadily getting better each time. By the end, Daddy's heart was in his mouth as Jessica slid down a fast icy track so fast she lay down flat on the sledge not seeing where she was going! Luckily she did not hit anything, and she absolutely loved the thrill!<\/p><p>We stayed out till gone dark which was a bit of a worry in the dark. Mummy and Katie came out as a search party worried Daddy had a diabetic coma! I ask ya. Anyway all was well and snuggled in and watched Harry Potter in the evening.<\/p><img src='images\/years\/2013\/2013_01_20-06-WoodsSledging.jpg' class='diaryImage' alt='Sledging siblings' \/><p class='diaryImageCaption'>Sledging siblings<\/p>","images":false},"title":{"value":"More Sledging - Woods"},"version":1},{"date":{"d":19,"m":1,"y":2013},"datev":20130119,"first":{"name":"benjamin","value":"Jump off 5m diving board"},"images":1,"info":{"content":"<p>In the morning we went out to play in the snow. We took the sledges to the local fields and played on the smallest slopes in the world. Still we had it all to ourselves and we loved it. Daddy ended up pulling the three of us as quick as he could and made us all fall off!<\/p><p>In the afternoon we went to the Spectrum for a swim with the Elders and Ma Ma and Pop Pop. After singing happy birthday and a coffee we went into the relatively quiet pool. We had a great time on the slides and wave machine. We eventually made our way over to the diving boards to test our courage. We'd not done the 3.5m board before and although we just jumped off it, still we made it. Ben then went to the highest, 5m board. He chickened out at first, but after Daddy showed him the way, Ben did jump. With all our hearts in our mouths he surfaced unscathed. He was trembling with excitement at what he had just achieved. It made Daddy proud. It made Mummy not be there. She did not want to see it. Joey and Uncle Michael followed off the 5m platform as well. Ben had a total of 5 jumps off the top board. Katie had a look, but sense prevailed.<\/p><p>In the evening we went over to the Elders for Auntie Ellie's baby-shower. We gave her a nappy cake and played games. Katie joined in whilst the rest of us went to bed.<\/p><img src='images\/years\/2013\/2013_01_19-15-SnowDettingen.jpg' class='diaryImage' alt='Jessica racing down the hill, helped on by Katie' \/><p class='diaryImageCaption'>Jessica racing down the hill, helped on by Katie<\/p>","images":false},"title":{"value":"Snow, Spectrum Swim, Ellie Baby Shower"},"version":1},{"date":{"d":13,"m":1,"y":2013},"datev":20130113,"images":1,"info":{"content":"<p>After church, Steven, Joyce and the cute Eva came over for Sunday lunch.<\/p><img src='images\/years\/2013\/2013_01_13-01-EvaBarnett-Jessica.jpg' class='diaryImage' alt='Jessica and Eva - Crafting away' \/><p class='diaryImageCaption'>Jessica and Eva - Crafting away<\/p>","images":false},"title":{"value":"Steven, Joyce and Eva for Sunday Lunch"},"version":1},{"date":{"d":7,"m":1,"y":2013},"datev":20130107,"first":{"name":"jessica","value":"Jessica First Rainbows Meet"},"info":{"content":"<p>Jessica has been on the Rainbows waiting list since the age of 2 and now she has started to go. She enjoyed her first outing and made a cool name badge.<\/p>","images":false},"title":{"value":"Jessica starts Rainbows"},"version":5},{"date":{"d":6,"m":1,"y":2013},"datev":20130106,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy joined Michael, Nick and Steve for a nice ride in the Spencers Wood, Aldermarston direction.<\/p>\u000a<p>In the afternoon Mummy was helping Auntie Charlotte to find a job.<\/p>\u000a<img src='images\/years\/2013\/2013_01_06-03-MartinBiking.jpg' class='diaryImage' alt='Martin just before riding out' \/><p class='diaryImageCaption'>Martin just before riding out<\/p>","images":false},"title":{"value":"Berkshire 30 miler"},"version":4},{"date":{"d":5,"m":1,"y":2013},"datev":20130105,"images":3,"info":{"content":"<p>Auntie Charlotte came to stay this weekend and this morning her and Daddy went to try the British Military Fitness session down at Frimley Lodge Park. Both were being a bit farty about it. Nervous they were going to something out of their league. There were 60 or so people there ranging from 20's to 60's year olds. It was an hour of almost non-stop jogging, squat trusts, burpees, mountain climbs, etc. Both survived with aching muscles.<\/p><p>In the afternoon we drew lots on where we were to go. The winning ticket was a trip with the bikes around California Country Park. After circuling the lake we went on the playground assault course where Katie won and Ben got in a bad mood for losing!<\/p><p>In the evening we snuggled up to watch the film, Nativity.<\/p><img src='images\/years\/2013\/2013_01_05-06-CaliforniaCountryPark.jpg' class='diaryImage' alt='Daddy and Charlotte Post Fitness Session' \/><p class='diaryImageCaption'>Daddy and Charlotte Post Fitness Session<\/p><img src='images\/years\/2013\/2013_01_05-18-CaliforniaCountryPark.jpg' class='diaryImage' alt='California Country Park Walk' \/><p class='diaryImageCaption'>California Country Park Walk<\/p><img src='images\/years\/2013\/2013_01_05-42-CaliforniaCountryPark.jpg' class='diaryImage' alt='Grump Guts' \/><p class='diaryImageCaption'>Grump Guts<\/p>","images":false},"title":{"value":"British Military Fitness, California Country Park"},"version":1},{"date":{"d":1,"m":1,"y":2013},"datev":20130101,"images":1,"info":{"content":"<p>The West's arranged for us to go to Alice Holt with them for a nice walk in the mud. It was packed there, everyone had the same idea I think. The children were almost trying to get as muddy as possible!<\/p><p>When it came to leaving Daddy attempted the reverse the new car out of the mud so the rest of us could get in more easily. However, it was so muddy the wheels were spinning. In an attempt to get some traction, Daddy went forward and back at an angle. Mud was spraying everywhere. All Daddy could see was Mummy going absolutely beserk and almost having a nervous breakdown. Daddy had manoeuvred the  car into a hollow, some would say shallow ditch and the front bumper was embedded into the grass verge \/ bank. Daddy didn't know this and wondered why the car would no longer go forward. By this stage Mummy I think let the whole car park at Daddy's shortcomings. Daddy was stuck and had even taken off his boots which now sat 5 meters away from the car in an effort to keep everything clean inside.<\/p><p>Stunned, Daddy just sat in the car for about a minute not knowing what to do. A man came across an offered to help get it out. First Daddy had to step out into the mud to get his boots back on, and then address the helpful man. Eventually 6 or 7 blokes came to help, I think in sympathy for Daddy's ear-bashing that he received. After a bit of pushing the car came out easily. However there was a little bit of damage on the under-carriage which cost £10 to fix. Mummy was still not happy for a good long while! funny story though.<\/p><img src='images\/years\/2013\/2013_01_01-07-WestWalk.jpg' class='diaryImage' alt='Glorious Mud' \/><p class='diaryImageCaption'>Glorious Mud<\/p>","images":false},"title":{"value":"Alice Holt Walk With West's - Car Ditched"},"version":1}],"version":1426776543}