{"entries":[{"date":{"d":31,"m":12,"y":2018},"datev":20181231,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Daddy and Ben went to their favourite London carpark, Gunnersbury Park. From there they started a 18 mile tour of West London's entertainment centres. Ben was on a navigation as well as biking on the London roads. Only once did he swerve right in front of Daddy almost causing a collision in the road! The boys took in Brentford FC, Fulham FC, Chelsea FC, Earls Court, Olympia, Shepherds Bush Empire and QPR. Ben loved it and wants to do some more London landmark based bike rides.<\/p><img src='images\\years\\2018\\2018_12_31-01-LondonFootballGroundBikeRideBen.jpg' class='diaryImage' alt='London Bike Tour' \/><p class='diaryImageCaption'>London Bike Tour<\/p><a href=\"https:\/\/www.strava.com\/activities\/2046934630\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>In the evening we had the Elders over for a traditional New Years Eve party..... with the usual party games. Boys v Girls. Toby, Lily and Joey all stayed over which was nice.<\/p><img src='images\\years\\2018\\2018_12_31-17-NewYearsEveParty.jpeg' class='diaryImage' alt='News Years Girls' \/><p class='diaryImageCaption'>News Years Girls<\/p>","images":false},"title":{"value":"West London Football Ground tour, New Years with Elders"},"version":3},{"date":{"d":30,"m":12,"y":2018},"datev":20181230,"first":{"value":null},"images":1,"info":{"content":"<p>This year there were 20 of us attending the Yvonne Arnaud theatre in Guildford. The theatre was one of the best. Great view, big stage and circular. A theatre has to be circular to be proper!<\/p><img src='images\\years\\2018\\2018_12_30-01-Panto.jpg' class='diaryImage' alt='Cinderella' \/><p class='diaryImageCaption'>Cinderella<\/p><p>We all enjoyed the performance.<\/p>","images":false},"title":{"value":"Cinderella Panto in Guildford"},"version":0},{"date":{"d":29,"m":12,"y":2018},"datev":20181229,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy went to Langley to do the Black Park parkrun. There were over 800 runners on a relatively narrow pathway. It took a kilometer to get over the traffic. The last 4km were all sub 5 minutes which is the goal these days.<\/p><p>Later in the afternoon we had a visit from the Sanders crew. We've not met up since last Easter. We swapped presents. The Sanders got us a lovely game called Get A Grip - we decided to play it. You wrap a glove around your hands which restricts your thumb. Then there were a series of rapidough, titles and physical challenges. It was good fun to play. Ma Ma and Pop Pop popped in for a cuppa too.<\/p><p>Jessica's long term friend Imogen came for a sleepover. The girls played with all the children in and out of the conservatory. Being locked in! They played Minecraft on the PS4 too.<\/p><img src='images\\years\\2018\\2018_12_29-06-SandersOver.jpg' class='diaryImage' alt='Playing Get A Grip' \/><p class='diaryImageCaption'>Playing Get A Grip<\/p>","images":false},"title":{"value":"Black Park parkrun, Sanders Over, Imogen Sleepover"},"version":0},{"date":{"d":28,"m":12,"y":2018},"datev":20181228,"first":{"value":null},"images":3,"info":{"content":"<p>Us three children had over £100 each given over Christmas and so we felt the need to spend.... and spend big in London. Katie was brave enough to travel the tube from Acton Town to Leicester Square.<\/p><p>At Leicester square we saw the big cinemas, where our favourite, Capital Radio was produced and went into M and Ms World. Massive it was.<\/p><img src='images\\years\\2018\\2018_12_28-07-OxfordStreetSalesShopping.jpeg' class='diaryImage' alt='Capital Radio, Leicester Square' \/><p class='diaryImageCaption'>Capital Radio, Leicester Square<\/p><img src='images\\years\\2018\\2018_12_28-13-OxfordStreetSalesShopping.jpeg' class='diaryImage' alt='M and M's World' \/><p class='diaryImageCaption'>M and M's World<\/p><p>We then headed via China town and Soho up to Oxford Street where we did a lot of shopping. Ben came back with some new Nike Huarache's and a t-shirt. Jessica came back with a Lush Bath Bomb and an Umbrella. Katie bought some shorts and a big, white jacket.<\/p><img src='images\\years\\2018\\2018_12_28-18-OxfordStreetSalesShopping.jpeg' class='diaryImage' alt='Entering China Town' \/><p class='diaryImageCaption'>Entering China Town<\/p><p>Daddy of course found somewhere free to park but got scared the Gunnersbury park gates would shut. So after getting off the bus at Acton Green, he ran 2.5km to get the car and collect us. A long day out deserved a fish and chip supper.<\/p>","images":false},"title":{"value":"Oxford Street Sales Shopping"},"version":5},{"date":{"d":26,"m":12,"y":2018},"datev":20181226,"first":{"value":null},"images":1,"info":{"content":"<p>In the late afternoon we headed over to the Elders for the usual fun and games with the Barnett family. There were lots of games contributions mainly from Ma Ma and Eva this year.<\/p><img src='images\\years\\2018\\2018_12_26-02-BoxingDay.jpg' class='diaryImage' alt='Boxing Day Family Games' \/><p class='diaryImageCaption'>Boxing Day Family Games<\/p><p>Ben stayed at the Elders, whilst Lily came over to us.<\/p>","images":false},"title":{"value":"Boxing Day, Ben and Lily sleepover swap"},"version":3},{"date":{"d":25,"m":12,"y":2018},"datev":20181225,"first":{"value":null},"images":4,"info":{"content":"<p>It was a 6am for us. We clambered into Ben's bedroom to see what Father Christmas had left behind. There were 17 presents. Katie's main presents were here pink watch and a Calvin Klein handbag. Ben got a Man Utd top and a boxing punch bag and gloves. Jessica got a manikin and an IPhone 6. We then when into Mummy and Daddy's room to watch them open presents from each other. Mummy got a coat, dress and a jumper. Daddy got a jumper, a t-shirt and a lot of food stuff.<\/p><img src='images\\years\\2018\\2018_12_25-01-ChristmasDay_1-Home.jpg' class='diaryImage' alt='6am start for the opening of FC's presents' \/><p class='diaryImageCaption'>6am start for the opening of FC's presents<\/p><p>We then headed downstairs to open presents from friends.... which was nice.<\/p><p>We got to the Fars for 9:30am for some breakfast and our traditional game of Coppit. Daddy won!<\/p><img src='images\\years\\2018\\2018_12_25-01-ChristmasDay_2-Gays.jpg' class='diaryImage' alt='Christmas Breakfast' \/><p class='diaryImageCaption'>Christmas Breakfast<\/p><p>we returned home for 30 mins whilst Mummy made up some of the Children's Christmas dinner. Auntie Ellie was doing the other half. It was nice and a bit different this year as it was the first time not spent in Istead Rise. The adults also ate, Daddy of course doing his impression of Henry VIII with his massive turkey leg.<\/p><img src='images\\years\\2018\\2018_12_25-02-ChristmasDay_3-Westons.jpg' class='diaryImage' alt='Children's Christmas Meal' \/><p class='diaryImageCaption'>Children's Christmas Meal<\/p><p>The post lunch walk was only attended by half the crew. It was a nice walk around Caesars Camp with Lenny.<\/p><a href=\"https:\/\/www.strava.com\/activities\/2036724650\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>Grandma joined us this year for the festivities which was nice to see. She sat on the sofa soaking in everyone elses enjoyment. She did very well to keep with it all the way till 9pm.<\/p><p>Philip and Emma also came to see us Children open our presents.<\/p><img src='images\\years\\2018\\2018_12_25-27-ChristmasDay_3-Westons.jpg' class='diaryImage' alt='Present opening at the Westons' \/><p class='diaryImageCaption'>Present opening at the Westons<\/p><p>The adults were next opening their presents. After we had a game of Articulate we collapsed and watched a bit of Michael McIntyre before heading home.<\/p>","images":false},"title":{"value":"Christmas Day"},"version":1},{"date":{"d":24,"m":12,"y":2018},"datev":20181224,"first":{"value":null},"images":2,"info":{"content":"<p>Daddy worked in the morning while the rest of us got on with doing bits and pieces around the house. Jessica made a gingerbread house.<\/p><p>At about 3:30pm we got to the Fars and started straight away with a Treasure Hunt around the Tomlinscote estate devised by Farfar. It was a little easier than last year and Farfar used WhatsApp. A first? Despite that it was felt better if the clues were written on paper on the course. Tough crowd. Each of us won £5 each.<\/p><p>Auntie Susan and Graham arrived and we started eating a little after 5:15pm, of course a traditional Danish affair.... except that is us kiddies. We had the usual butchers sausages!<\/p><img src='images\\years\\2018\\2018_12_24-06-ChristmasEve.jpg' class='diaryImage' alt='Danish Christmas Meal' \/><p class='diaryImageCaption'>Danish Christmas Meal<\/p><p>After Daddy won the Risalamande challenge, we played the dice game had a boys vs girls quiz and then on to the main event that is the present opening.<\/p><img src='images\\years\\2018\\2018_12_24-15-ChristmasEve.jpg' class='diaryImage' alt='Opening presents at the Fars' \/><p class='diaryImageCaption'>Opening presents at the Fars<\/p>","images":false},"title":{"value":"Christmas Eve at Fars"},"version":1},{"date":{"d":23,"m":12,"y":2018},"datev":20181223,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Mummy went to church and watched a nativity play.<\/p><p>After lunch we ventured out into the mild, Berkshire air to complete walk 104, Thatcham Lakes. It was nice. Not much resistance from the troops. Only Ben complaining about the amount of time it would take to get there and back. Daddy had lovely chats with Katie and Ben. Jessica is just a fruit loop.<\/p><img src='images\\years\\2018\\2018_12_23-05-Walk104-ThatchamLakes.jpg' class='diaryImage' alt='Thatham Lakes walk' \/><p class='diaryImageCaption'>Thatham Lakes walk<\/p><img src='images\\years\\2018\\2018_12_23-03a-Walk104-ThatchamLakes.jpg' class='diaryImage' alt='Don't mess with this lot' \/><p class='diaryImageCaption'>Don't mess with this lot<\/p><a href=\"https:\/\/www.strava.com\/activities\/2031617534\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>After returning home we had a family game of Risk. Ben won!<\/p><p>In the evening Daddy went for a run and then watched Watership Down with Mummy. They both almost cried. Mummy not feeling too well at the moment with a sore throat. We are all very excited for tomorrow.<\/p>","images":false},"title":{"value":"Walk 104 - Thatcham Lakes"},"version":0},{"date":{"d":22,"m":12,"y":2018},"datev":20181222,"first":{"value":null},"images":3,"info":{"content":"<p>Daddy went off to do Brooklands parkrun this morning and ran his fastest since May 2016, 24:06 minutes. So he was well happy and celebrated with a cuppa down the canal cafe.<\/p><p>Meanwhile, Farmor had both Katie and Jessica over for Christmas cooking. They cooked giffler, vaniljekranse and as Katie calls them, brown cakes and a bakewell tart! Lovely. Jessica also managed to finish sewing her \"I Love You\" cushion for Mummy.<\/p><p>In the mid afternoon they were picked up by Ma Ma and taken over to Farnborough cinema where they met with Lily to watch the latest carnation of Mary Poppins.<\/p><p>Mummy, Daddy and Ben went over to Mercedes Benz World over in Brooklands (again Daddy!). A place we've surprisingly not been before. There were three floors of cars and history..... as well as a few interactive things. One was a remote control car game. 10 lined up on the grid. Daddy came 4th and Ben 2nd.... although Daddy did get 2nd fastest lap!<\/p><p>Daddy and Ben went on a 4x4 experience where a driver took the pair around a steep gradient off road course. Ben was on the brakes for a 60% decline..... which ended in them sliding down the hill! Ben loved it. They also saw a car race display. It was a really nice chilled afternoon.<\/p><img src='images\\years\\2018\\2018_12_22-18-MercedesBenzWorld.jpg' class='diaryImage' alt='Mercedes Benz World' \/><p class='diaryImageCaption'>Mercedes Benz World<\/p><img src='images\\years\\2018\\2018_12_22-13b-MercedesBenzWorld.jpg' class='diaryImage' alt='Mummy and Daddy in front of their car' \/><p class='diaryImageCaption'>Mummy and Daddy in front of their car<\/p><img src='images\\years\\2018\\2018_12_22-07-MercedesBenzWorld.jpg' class='diaryImage' alt='The World Championship winning F1 car' \/><p class='diaryImageCaption'>The World Championship winning F1 car<\/p><p>In the evening we all watched Jingle All The Way!<\/p>","images":false},"title":{"value":"Mercedes Benz World, Farmor Cooking, Ma Ma Mary Poppins"},"version":0},{"date":{"d":21,"m":12,"y":2018},"datev":20181221,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy was let out at 3pm, whilst us three for relieved from school yesterday. Katie had spent most of today doing her Maths homework. It took her ages, but at least she has done it now.<\/p><p>Each year we have a family meal out. This time around we headed to Frankie and Benny's in Aldershot. We all had a go on the kids game sheet! We had a lovely meal.<\/p><img src='images\\years\\2018\\2018_12_21-04-FamilyChristmasMeal.jpg' class='diaryImage' alt='Frankie and Benny's Christmas Meal out' \/><p class='diaryImageCaption'>Frankie and Benny's Christmas Meal out<\/p>","images":false},"title":{"value":"Christmas Family Meal"},"version":0},{"date":{"d":19,"m":12,"y":2018},"datev":20181219,"first":{"value":null},"images":1,"info":{"content":"<p>Mummy and Daddy went out to the Highlight Christmas Meal at the Giggling Squid in Farnham. Same place as last year. We sat opposite Anthony and his wife, Rachel which was very nice. The food was too spicy for Daddy. They had a good time. KBJ were left to themselves.<\/p><img src='images\\years\\2018\\2018_12_21-01-HighlightXmasMeal.jpg' class='diaryImage' alt='Daddy and Mummy pre going out' \/><p class='diaryImageCaption'>Daddy and Mummy pre going out<\/p>","images":false},"title":{"value":"Highlight Christmas Meal"},"version":0},{"date":{"d":16,"m":12,"y":2018},"datev":20181216,"first":{"value":null},"images":2,"info":{"content":"<p>In the afternoon Farmor and Susan took Jessica to a pottery shop where you could make pottery pieces and collect them a week or so later.<\/p><img src='images\\years\\2018\\2018_12_16-02-PotteryJessicaFarmorSusan.jpg' class='diaryImage' alt='Jessica and Farmor pottering' \/><p class='diaryImageCaption'>Jessica and Farmor pottering<\/p><img src='images\\years\\2018\\2018_12_16-01-PotteryJessicaFarmorSusan.jpg' class='diaryImage' alt='The Potters' \/><p class='diaryImageCaption'>The Potters<\/p>","images":false},"title":{"value":"Jessica Pottery making with Farmor and Susan"},"version":0},{"date":{"d":15,"m":12,"y":2018},"datev":20181215,"first":{"value":null},"images":4,"info":{"content":"<p>The football was very touch and go this morning. The ref delayed the start and eventually we asked the parents if they accepted a few icey patches on the pitch. We had spent half an hour travelling and almost an hour waiting around, so the resounding response was yes - crack on. Just three weeks previous the two sides met in Mytchett and the scoreline was 2-2. Today was a different story, 8 - 0 to Mytchett. Ben even scored an overhead bicycle kick. Not that I want to take anything away from Ben, it was just a yard out in a goalmouth melee and he hooked the ball over his head as he was falling. Still it was a second goal within a month. Daddy was well pleased, especially as Ben, Abe, Kevon and Ben H all scored! Joey wasn't too gutted at the result. After stopping for a cup of tea with the Elders, they returned home with Joey.<\/p><p>Meanwhile Mummy went with Ma Ma to Cedar Lodge and Holly Lodge to sing with the church to the old people.<\/p><p>In the early afternoon Katie was dropped into Camberley with a few friends. It was kind of a date with Dan who bought her cinema ticket. She watched Spiderman into the Spider-verse. She had a nice time and we gave Dan a lift back home. Katie was all excited and confused. Nothing will come of Dan we suspect.<\/p><p>In the evening we had the traditional Gay's Christmas Party which we hosted. This year we invited just the Elders, Maisey's and West's - no Julie. Mummy made most of the games up which included of course; spoons, titles, give us a clue, a bush tucker trial of a sprout smoothie, the electrocution game and Linkee. Daddy roasted a pork on the BBQ and boiled a gammon up. The food went down well. It was good fun. Proceeding finished at about 10:30. Ellie, Joey and Lily stayed over.<\/p><img src='images\\years\\2018\\2018_12_15-25-GaysChristmasParty.jpg' class='diaryImage' alt='Harrison playing 'Give Us A Clue'' \/><p class='diaryImageCaption'>Harrison playing 'Give Us A Clue'<\/p><img src='images\\years\\2018\\2018_12_15-22-GaysChristmasParty.jpg' class='diaryImage' alt='The Electrocutioners game' \/><p class='diaryImageCaption'>The Electrocutioners game<\/p><img src='images\\years\\2018\\2018_12_15-13-GaysChristmasParty.jpg' class='diaryImage' alt='Spoons' \/><p class='diaryImageCaption'>Spoons<\/p><img src='images\\years\\2018\\2018_12_15-02-GaysChristmasParty.jpg' class='diaryImage' alt='Girls strength test' \/><p class='diaryImageCaption'>Girls strength test<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/EIGkkcXNz64\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/M5PLlR8F8n8\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Joey 0 v 8 Ben Football, Katie Date, Carol signing at Old People's home, Gay's Christmas Party"},"version":3},{"date":{"d":14,"m":12,"y":2018},"datev":20181214,"first":{"value":null},"info":{"content":"<p>Mummy and Daddy took a day off work to go Christmas shopping in Basingstoke. Thrilling! Highlight was having lunch outside at the Festival kitchen!<\/p>","images":false},"title":{"value":"Mumma and Dadda Christmas Shopping"},"version":0},{"date":{"d":8,"m":12,"y":2018},"datev":20181208,"first":{"value":null},"images":4,"info":{"content":"<p>A packed day with the weather looking decidedly dodgy putting pay to Ben's football match.<\/p><p>Instead Daddy could attend parkrun and Chris's 250th attempt and the café after.<\/p><img src='images\\years\\2018\\2018_12_08-01-parkrunChris250th.jpg' class='diaryImage' alt='Chris Peddle's 250th parkrun' \/><p class='diaryImageCaption'>Chris Peddle's 250th parkrun<\/p><p>Katie had left the night before to go down to Summer's. They went shopping at Bluewater then stayed in a Premier Inn just the two of them. Summer has here first boyfriend. They spent lots of money getting Christmas presents.<\/p><img src='images\\years\\2018\\2018_12_08-01-KatieAtSummers.jpg' class='diaryImage' alt='Katie and Summer's shopping haul' \/><p class='diaryImageCaption'>Katie and Summer's shopping haul<\/p><p>Jessica went to Lily's birthday party down in Havant. They did aerial acrobatics, something Ellie has been doing for a number of months. <\/p><img src='images\\years\\2018\\2018_12_08-03-LilysBirthdayArielHoopParty.jpeg' class='diaryImage' alt='Jessica doing Aerial acrobatics' \/><p class='diaryImageCaption'>Jessica doing Aerial acrobatics<\/p><p>Mummy, Daddy, Ben and Ma Ma went down to Bournemouth. They were going to help the Maisey's to move to their new house in Springbourne. They hadn't completed, but were allowed to move stuff across. However, the estate agent was not too forthcoming with the keys. Mummy and Daddy went in to the town while they waited to look about.<\/p><p>We got the keys, and started unloading a van load of stuff. The house was in need of a  lot of decoration. It's has a lot of 1950's hallmarks. There was a lot of potential. Loz is going to have his hands full for many months to come.<\/p><p>After some fish and chips and unloading a second load, we all headed into town and the Christmas Tree walk. It was mainly situated in the Winter Gardens. Some massive trees with beautiful lights. We tried to go ice skating but it was all booked up. We went for a bit of après ski in one of the temporary ski huts. Mulled wine. Warms the old cockles.<\/p><p>We headed back to the car via the upside down house. A very nice trip out.<\/p><img src='images\\years\\2018\\2018_12_08-03-BournemouthTreeWalk.jpeg' class='diaryImage' alt='Christmas Tree walk in Bournemouth' \/><p class='diaryImageCaption'>Christmas Tree walk in Bournemouth<\/p>","images":false},"title":{"value":"parkrun, Lily's Birthday, Katie at Summer's, Bournemouth Move and Xmas Tree Walk"},"version":0},{"date":{"d":2,"m":12,"y":2018},"datev":20181202,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy, Ben and Jessica travelled over to the Fars on the bikes. Jessica stayed to carry on with her Christmas Present she is sewing with Farmor. A lovely 'I Love You' cushion.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/txgbG5FD0B0\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><p>The boys continued on the bikes and went into the adjoining woods. It was quite wet. Ben slipped over whilst pushing his bike up a hill!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1996218643\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_12_02-02-BenMTB.jpg' class='diaryImage' alt='Ben MTBing at back of Dettingen Park' \/><p class='diaryImageCaption'>Ben MTBing at back of Dettingen Park<\/p><p>At lunch time Katie had her Science tutor. Things appear to be going well on that front. Katie is working very hard with her revision.<\/p><p>Later Daddy and Ben went to the Restaurant at the Packhouse for the Frimley Flyers meal. James made a number of speeches. After 3 hours we only had the main course. We had to skip the deserts. Daddy stood up and made a speech about next years events.<\/p><p>They were collected by the girls and moved on to the Elder lock in. A video \/ photos of their recent trip to Utah and Colorado. Michael did well editing the video.<\/p>","images":false},"title":{"value":"MTB Ben and Daddy, Jessica sewing, Tutoring, FF Christmas Meal, Elder Lock in"},"version":1},{"date":{"d":1,"m":12,"y":2018},"datev":20181201,"first":{"value":null},"images":1,"info":{"content":"<p>The weather has been terrible which cost Falcons their fixture this morning. This allowed Daddy to go to parkrun and even a trip to the café afterwards.<\/p><p>After lunch we had planned to go to the cinema and watch the new Harry Potter film and Grinch 2. Due to the weather everyone else had the same idea, and the films were booked up. Daddy and Jess then tried the bowling alley. That too was booked up.<\/p><p>We all returned home and we made a Bingo Christmas card game. We each drew 20 Christmas items and placed them on a bingo card. Each time we open a Christmas card any items that match our bingo cards gets crossed off!<\/p><p>Whilst mummy watch Strictly, Katie went to Kian's 16th birthday house party. There was alcohol involved! Daddy, Jessica and Ben went over to the Fars and played Coppit. Ben won!<\/p><img src='images\\years\\2018\\2018_12_01-01-FarsCoppit.jpg' class='diaryImage' alt='Playing Coppit with the Fars' \/><p class='diaryImageCaption'>Playing Coppit with the Fars<\/p>","images":false},"title":{"value":"parkrun, Games, Fars Coppit, Katie house party"},"version":1},{"date":{"d":24,"m":11,"y":2018},"datev":20181124,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy went to parkrun at Frimley Lodge park. First time in a long while. After, still at Frimley Lodge was the big match, Falcons v Alton Huskies. It was a fiercely contested match with Alton taking the lead in the first half, with Tyler equalizing. Joey was making some last ditch tackles in the heart of the Huskies defence. Ben was battling in the centre of midfield. Both had battle wounds at the end of the game. In the second half Alton regained the lead with some dodgy keeping from Cam. Ben popped up later from a corner, used his physical presence (i.e. fouled 2 players) whic allowed him to scramble in an equalizer. Late in the game, Tyler was through 1 on 1 with the keeper and Joey miss-timed his tackle and wiped the Falcons forward out. Joey was booked. The first time we've ever seen a player booked in Ben's football! A proud moment. The game ended 2-2.<\/p><p>Auntie Charlotte had just had her eggs implanted into her, so she had to take it easy. For some reason she thought it would be relaxing around ours so we were happy she stayed the day with us..... along with Len Dog.<\/p><p>The girls made a camp in the lounge and lay and watched films in the afternoon. One was Polar Express. Very relaxing. Later on in the afternoon Jessica's acting academy had an awards evening coupled with 10 acting and singing scenes. Jessica had one to do, but we were very disappointed that it got cancelled last minute as they couldn't find the music. To make up for this Jessica was called out and won a certificate for being a helpful and good member of her class. Well done Jessa.<\/p><img src='images\\years\\2018\\2018_11_24-01-JessicaActingCertificate.jpg' class='diaryImage' alt='Jessica's Acting Certificate' \/><p class='diaryImageCaption'>Jessica's Acting Certificate<\/p>","images":false},"title":{"value":"parkrun, Ben v Joey Football, Jessica Acting Certificate, Auntie Charlotte over"},"version":0},{"date":{"d":21,"m":11,"y":2018},"datev":20181121,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy gave in and let mummy spend a fortune on carpets!<\/p><img src='images\\years\\2018\\2018_11_20-10-NewCarpets.jpg' class='diaryImage' alt='New carpets' \/><p class='diaryImageCaption'>New carpets<\/p>","images":false},"title":{"value":"New Carpets"},"version":0},{"date":{"d":18,"m":11,"y":2018},"datev":20181118,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy joined mummy in church! I know - shock.<\/p><p>There was a split. Jessica and Mummy went on a 3 hour shopping spree in Camberley.<\/p><p>Ben and Daddy went on a Minley Mountain Bike adventure.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1972208838\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_18-01-MinleyMTB.jpg' class='diaryImage' alt='Biking near an explosives depot' \/><p class='diaryImageCaption'>Biking near an explosives depot<\/p>","images":false},"title":{"value":"Boys Bike Ride, Girls shopping"},"version":1},{"date":{"d":17,"m":11,"y":2018},"datev":20181117,"first":{"value":null},"images":5,"info":{"content":"<p>Ben and Daddy had a Mytchett Falcons match over in Yateley. They only had 10 men so we felt obliged to also only play with 10. Ben played in centre midfield, battling away. He really is improving in that respect. It was a tense finish. 5-2 up, then 5-5. With 2 minutes to go Harvey stuck in a goal to make it 6-5. Our first win in a long time.<\/p><p>After lunch, we departed for walk 103. Katie stayed at home to do some revision and because she lost 0.5kg last week which is not good for her anorexia. Exercise, albeit a walk, wouldn't help. It was from the Berkshire Walk book, so we started over in the Thatcham area again, Donnington Castle. The weather was fine, and we circled Donnington Grove Country club.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1969856213\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_17-01-DonningtonCastleWalk102.jpg' class='diaryImage' alt='Off we go' \/><p class='diaryImageCaption'>Off we go<\/p><img src='images\\years\\2018\\2018_11_17-05-DonningtonCastleWalk102.jpg' class='diaryImage' alt='See Jessica loves a walk' \/><p class='diaryImageCaption'>See Jessica loves a walk<\/p><img src='images\\years\\2018\\2018_11_17-03-DonningtonCastleWalk102.jpg' class='diaryImage' alt='Give us a kiss' \/><p class='diaryImageCaption'>Give us a kiss<\/p><img src='images\\years\\2018\\2018_11_17-14-DonningtonCastleWalk102.jpg' class='diaryImage' alt='Donnington Castle' \/><p class='diaryImageCaption'>Donnington Castle<\/p><p>On our way home we stopped in at Steve and Joyces for a cup of tea and a catch up.<\/p><p>In the evening Daddy and Ben went to the cinema to watch the new Queen film, Bohemian Rhapsody. They both loved it.<\/p><img src='images\\years\\2018\\2018_11_17-01-BohemianRhapsody.jpg' class='diaryImage' alt='Bo Rhap' \/><p class='diaryImageCaption'>Bo Rhap<\/p>","images":false},"title":{"value":"Mytchett Falcons, Walk 103 - Donnington Castle, Steve's, Bohemian Rhapsody Cinema"},"version":3},{"date":{"d":13,"m":11,"y":2018},"datev":20181113,"first":{"value":null},"info":{"content":"<p>Last day and we packed up our bikes and tided up. Daddy went for a quick run. It was hilly and slow. There was nothing left in the legs.<\/p><p>There was a bit of a panic at the house, we couldn't find the second set of keys. We must have spent an hour looking for them, emptying bags, looking all around the house. Fingers were being pointed. In the end Michael had them in one of his bike bags!<\/p><p>The trip back was good. We all went to Gatwick to meet Daddy. As Daddy travelled between the customs and the doors to the outside world he dropped his green bag and lost it! Dipstick.<\/p>","images":false},"title":{"value":"Teneriffe Biking Day 5 - Homeward bound"},"version":3},{"date":{"d":12,"m":11,"y":2018},"datev":20181112,"first":{"value":null},"images":4,"info":{"content":"<p>The weather was terrible and we had some bike issues to sort. Daddy needed brake blocks and a tyre, Tim needed a new front wheel. Eventually we got going up to the peak of Tiede, attempting to get above the rain clouds. Robin had decided to leave earlier and bike up in the rain. Nutter! We caught him three quatres of the way up. He was very wet and cold and welcomed seeing the rest.<\/p><p>Once on top, the boys were just above the rain clouds. They headed off on a 'there and back' sortie, going via the cafe for a spot of lunch. It was beautiful up top and they stuck largely together.<\/p><img src='images\\years\\2018\\2018_11_12-29-TeneriffeCycling_4-TiedeTop.jpg' class='diaryImage' alt='Heading north towards Tiede' \/><p class='diaryImageCaption'>Heading north towards Tiede<\/p><img src='images\\years\\2018\\2018_11_12-25-TeneriffeCycling_4-TiedeTop.jpg' class='diaryImage' alt='Beautiful straight road to Tiede' \/><p class='diaryImageCaption'>Beautiful straight road to Tiede<\/p><img src='images\\years\\2018\\2018_11_12-23-TeneriffeCycling_4-TiedeTop.jpg' class='diaryImage' alt='What a bunch' \/><p class='diaryImageCaption'>What a bunch<\/p><a href=\"https:\/\/www.strava.com\/activities\/1960682031\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>In the evening they went to the same Restaurant as 3 days previous. Big portions and a lovely meal.<\/p><img src='images\\years\\2018\\2018_11_12-09-TeneriffeCycling_4-TiedeTop.jpg' class='diaryImage' alt='Evening meal at Restaurant' \/><p class='diaryImageCaption'>Evening meal at Restaurant<\/p>","images":false},"title":{"value":"Teneriffe Biking Day 4 - El Tiede, Ride on top"},"version":2},{"date":{"d":11,"m":11,"y":2018},"datev":20181111,"first":{"value":null},"images":4,"info":{"content":"<p>After yesterdays efforts we all wanted something a little less demanding. Another of the routes was the iconic TF12 looping north of Santa Cruz. It was another 1200 metre total climb. There was some stunning scenery on this peninsula. At points looking left we could see the dramatic southern coast, to the right the north coast. We reached the top at El Bailadero however there were no cafes here. A very chirpy girl pointed us in the direction westwards. Daddy set off first, keen to be first for once. However, he raced down the hill on the wrong side of the road. The boys were shouting to get on the right side of the road. However, it fell on deaf ears. Daddy rounded the corner downhill at speed and thought what on earth is that car doing on the wrong side of the road coming quickly towards him. Daddy skidded, the backend of the bike going sideways for a bit. A change of underpants later and he somehow managed to avoid the car!<\/p><img src='images\\years\\2018\\2018_11_11-47-TeneriffeCycling_3-SantaCruzTF12.jpg' class='diaryImage' alt='Some lovely scenery climbing TF12 ' \/><p class='diaryImageCaption'>Some lovely scenery climbing TF12 <\/p><img src='images\\years\\2018\\2018_11_11-38-TeneriffeCycling_3-SantaCruzTF12.jpg' class='diaryImage' alt='Hills!' \/><p class='diaryImageCaption'>Hills!<\/p><p>Finally they found a great cafe stop called Casa Santiago and ate Tappas. Almost at the top now and again they split up, leaving Daddy trailing behind..... and bang! Puncture going down the hill. Not only that the same 'valve' problem as before at London Ride 100. The pump kept unscrewing the valve. This was exhausting work. Finally Daddy managed to get going again. Everyone else was waiting a while. Another two miles on. Bang! Not again! A second puncture. He almost threw the bike in the bushes. He cut through some slippery rocks having gone off road attempting to reach the others. Michael took a look and noticed that the brakes block had been scraping against the tyre sidewall and created holes! A boot was made, a second change of innertube and the boys were off and running again.<\/p><img src='images\\years\\2018\\2018_11_11-61-TeneriffeCycling_3-SantaCruzTF12.jpg' class='diaryImage' alt='Second puncture repair' \/><p class='diaryImageCaption'>Second puncture repair<\/p><p>It was all downhill from here and they all stuck together going through the city centre and final stretch of flat where Daddy could confidently put some power down and wasn't last! The finish line was crossed and they collapsed into a beach side bar overlooking the Atlantic Ocean.<\/p><img src='images\\years\\2018\\2018_11_11-43-TeneriffeCycling_3-SantaCruzTF12.jpg' class='diaryImage' alt='Finished and a well earned beer in the bar on the beach' \/><p class='diaryImageCaption'>Finished and a well earned beer in the bar on the beach<\/p><p>In the evening Bazza made us all a Spag Bol and we all played Killer pool.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1965761392\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Teneriffe Biking Day 3 - Santa Cruz TF12"},"version":4},{"date":{"d":10,"m":11,"y":2018},"datev":20181110,"first":{"value":null},"images":5,"info":{"content":"<p>A lovely sunny day, 22 degrees. A suggested route we decided to follow was the Bradley Wiggins trail from Los Christianos to the top of Tiede, around 2300 metres above sea level. Los Christianos was on the other side of the island. We decided to start by the beach so we were at sea level to begin with. After a bit of a mishap at the start with directions, we crossed north of the TF1 and ascended up Tiede which was the focal point of the whole island.<\/p><img src='images\\years\\2018\\2018_11_10-41-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='At the beginning in Los Christianos ' \/><p class='diaryImageCaption'>At the beginning in Los Christianos <\/p><p>Daddy really struggled compared to the others. After just 8 miles he was ready to quit, only a quatre of the way up. Michael had an injury and was taking it easy, so went up with Daddy. They stopped off half way up at Vilaflor for a baguette, coffee and coke and replenish water. The others had nearly reached the top by this point!<\/p><p>At 2200, by the Tiede national park plaque, Michael decided to turn around and head back to the start point to pick up the van. Daddy was determined to continue to the top and continue onto the other side of the volcano.<\/p><img src='images\\years\\2018\\2018_11_10-22-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='Reached Tiede park, near the top' \/><p class='diaryImageCaption'>Reached Tiede park, near the top<\/p><img src='images\\years\\2018\\2018_11_10-06-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='Made it Tiede in the background' \/><p class='diaryImageCaption'>Made it Tiede in the background<\/p><woops woopstitle=\"Riding down Spain's highest mountain with no lights in pitch dark. Crashed. Car almost hits me, tourist gets flat car battery\" rating=\"8\"><p>Reaching the cable cars by the volcano took a lot longer than expected. Five and half hours predominantly in first gear (28 cassette). The final 3 miles had quite an ascent. Daddy was still going up hill after the cable cars. Dusk was forming. The views were amazing. Some sand dunes, strange rock formations and a dried lava river. Fantastic. The light was drawing in quick and as the sun descended and the shadows grew, the temperature dropped as Daddy started his descent down the north side. Cars had there lights on, Daddy unfortunately had no front light and the back had run out of battery. However, not a problem in the semi light, Daddy descended at a steady pace. Within the next mile or two, close to Portillo Alto, the skies were clear and the moon could be seen clearly. Still enough to descend. Now the rocky landscape changed to pine trees lining the roads. This meant what little light there was had now gone. Daddy was freezing, especially on the hands. He was shivering so much it slowed him down as his bike wobbled down the hill. With no light Daddy chose to use the maps on his phone to know when a bend was coming up. Fortunately most of the traffic had gone, but there was still the odd car coming down the mountain. Whenever car lights were seen from behind, Daddy thought it best to stop and go into the side of the road. Daddy had managed to descend about 1000 metres like this. <\/p><img src='images\\years\\2018\\2018_11_10-14-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='It's getting darker. I can see the moon' \/><p class='diaryImageCaption'>It's getting darker. I can see the moon<\/p><p>Another car came from behind quite quick and Daddy went to the side of the road on a bend. However, he couldn't see the side of the road and misjudged it. He rode into the gutter \\ ditch. He fell off into the gutter, his bike ended on the road, on the bend. Fortunately the car behind swerved around it, the car following also managed to somehow miss it! Daddy picked himself up, brushed himself down. He sustained a bruised elbow and a small cut to the knee. The bike however had a buckled wheel and was un-rideable.<\/p><p>As there was no place to stop, the two cars went 50 yards down the road and then stopped. Both drivers spoke to each other in English. Daddy could hear that they were saying I was stupid for riding down a mountain with no lights.The second was accusing the first of hitting Daddy! Daddy assured them it was his fault and apologised profusely. They both offered to take Daddy down the mountain in the car. Daddy had already international rescue, aka Michael to pick him up. The first driver who was a German tourist offered to take Daddy back to the villa with the bike. A little taken aback from his generosity, Daddy politely refused and urged him to continue on his travels. Michael was an hour away. The German tourist insisted in staying until Michael arrived. He left his car lights on so Michael could see where we were. After conversations about WWII, Brexit and the car industry, he noticed that the car lights dimmed. He tried starting his car, but all that was heard was tick, tick, tick! Oh no. His battery was now flat.<\/p><p>The obvious solution was to push start the car, but both were unsure. What happens if that was not the problem and the car was pushed down the mountain in the pitch black, little on the brakes (servos no power) and no place to rest up if it didn't work. With Daddy's luck he envisaged pushing the German off the mountain to his death!<\/p><p>Michael arrived and with some convincing the car was bump started and all was good. The adventure was over. Goodbyes were said. Michael laughed at Daddy.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1957848159\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_10-15-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='Corner I crashed at on the right, but in the pitch black' \/><p class='diaryImageCaption'>Corner I crashed at on the right, but in the pitch black<\/p><\/woops><p>The boys drove down the mountain into Puerto De La Cruz to pick up the others. Barrie, Nick and Phil had been drinking since midday. They were hammered.<\/p>","images":false},"title":{"value":"Teneriffe Biking Day 2 - El Tiede"},"version":1},{"date":{"d":9,"m":11,"y":2018},"datev":20181109,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy, Michael, Nick, Phil, Barrie, Steve (Alton), Tim (Alton) and Robin (Alton) all went off to Teneriffe for a few days of cycling. The plane took off late from Gatwick, there were queues at passport control at Teneriffe and a long car journey to the north of the island all meant there was not enough time to do any riding today.<\/p><p>The villa was massive with a swimming pool. Daddy and Michael shared a room together. It was situated just outside Rincón, near Puerto de la Cruz.<\/p><img src='images\\years\\2018\\2018_11_09-08-TeneriffeCycling_1-Departure.jpg' class='diaryImage' alt='View from the villa up to Tiede' \/><p class='diaryImageCaption'>View from the villa up to Tiede<\/p>","images":false},"title":{"value":"Teneriffe Biking Day 1 - Setting Off"},"version":1},{"date":{"d":7,"m":11,"y":2018},"datev":20181107,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica was chosen to be included in the Frimley C of E cross country team. All schools in Surrey Heath were represented. Jessica finished the 2.5km course in 36th place out of 72 runners. Well done Jessica you did very well.<\/p><img src='images\\years\\2018\\2018_11_07-02-JessicaCrossCountry.jpg' class='diaryImage' alt='Jessica racing at Lightwater Country Park' \/><p class='diaryImageCaption'>Jessica racing at Lightwater Country Park<\/p>","images":false},"title":{"value":"Jessica Cross Country Run"},"version":2},{"date":{"d":4,"m":11,"y":2018},"datev":20181104,"first":{"value":null},"images":2,"info":{"content":"<p>Daddy took out Joey and Ben along with the Turners up to Tunnel Hill for a spot of Mountain biking. They tackled the newly found see-saw. Well everyone except Daddy. His wheel kept popping out of the bracket!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1946042603\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_04-03-MountainBiking.jpg' class='diaryImage' alt='Ben mountain biking' \/><p class='diaryImageCaption'>Ben mountain biking<\/p><p>In the evening we had the Masey's, Elder's, Weston's and Gay's over for a firework party. There were a number of rockets heading for the sky.<\/p><img src='images\\years\\2018\\2018_11_04-06-FireworkParty.jpg' class='diaryImage' alt='Farmor teaching us to make Aebleskiver' \/><p class='diaryImageCaption'>Farmor teaching us to make Aebleskiver<\/p>","images":false},"title":{"value":"Mountain biking, Firework Party"},"version":2},{"date":{"d":3,"m":11,"y":2018},"datev":20181103,"first":{"value":null},"images":3,"info":{"content":"<p>Mummy wanted to get back on to the walks now that Katie is getting a lot better. The walk was out towards the Newbury area, so Daddy seeked an opportunity to firstly go to a different parkrun: Prospect Park. He saw Richard there guiding.<\/p><p>After we headed to Buckleberry Common. There were some road closures which made it not that straight forward. The book isn't great at pinpointing the start at the best of times. There were narrow lanes and mummy got road rage at this old couple in a fat 4x4..... from the back seat. Calm down dear! We headed off on the 2.5 mile adventure. The weather was good and we strolled through the woods.<\/p><a href=\"https:\/\/www.strava.com\/activities\/https:\/\/www.strava.com\/activities\/1942898878\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_03-16a-Walk101-BuckleberryCommon.jpg' class='diaryImage' alt='Buckleberry Common swing' \/><p class='diaryImageCaption'>Buckleberry Common swing<\/p><img src='images\\years\\2018\\2018_11_03-13-Walk101-BuckleberryCommon.jpg' class='diaryImage' alt='Siblings getting on well' \/><p class='diaryImageCaption'>Siblings getting on well<\/p><img src='images\\years\\2018\\2018_11_03-03-Walk101-BuckleberryCommon.jpg' class='diaryImage' alt='Buckleberry Common walk' \/><p class='diaryImageCaption'>Buckleberry Common walk<\/p><p>After the walk we ventured into close by Thatcham for some lunch. Fish and Chips! Daddy decided to cycle home from here!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1943415437\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>The Elders popped by for a bit and Joey and Jessica swapped for a sleepover. Joey is very sweet and polite. Michael said that Jessica is a bit of a nutter.<\/p>","images":false},"title":{"value":"Prospect Park parkrun, Walk 102 - Buckleberry Common, Bike Home From Thatcham, Joey Jessica swap"},"version":2},{"date":{"d":31,"m":10,"y":2018},"datev":20181031,"first":{"value":null},"images":1,"info":{"content":"<p>Ben and Jessica went out with Yuv and Amerette knocking on doors. They went to a really house in Mytchett where you had to queue up to get into the haunted house.<\/p><img src='images\\years\\2018\\2018_10_31-03-BenHalloween.jpg' class='diaryImage' alt='Scary Ben' \/><p class='diaryImageCaption'>Scary Ben<\/p>","images":false},"title":{"value":"Halloween"},"version":0},{"date":{"d":28,"m":10,"y":2018},"datev":20181028,"first":{"value":null},"images":1,"info":{"content":"<p>Ben was desperate to go to the Fright Night at Thorpe Park. He loved it there. He went with Yuv and Oli whose birthday treat it was.<\/p><img src='images\\years\\2018\\2018_10_28-01-ThorpePark-Oli14thBirthday.jpg' class='diaryImage' alt='Ben at Fright Night' \/><p class='diaryImageCaption'>Ben at Fright Night<\/p>","images":false},"title":{"value":"Oli's 14th Birthday Trip"},"version":0},{"date":{"d":27,"m":10,"y":2018},"datev":20181027,"first":{"value":null},"images":2,"info":{"content":"<p>We took Summer back to Gravesend. On the way Daddy did a very hilly Lullingstone parkrun in the beautiful hills. <\/p><img src='images\\years\\2018\\2018_10_27-11-LullingstoneParkrun.jpg' class='diaryImage' alt='Daddy at Lullingstone parkrun' \/><p class='diaryImageCaption'>Daddy at Lullingstone parkrun<\/p><p>We popped in at the Teales for a cuppa before making our way down to the Cyclo park. Daddy forgot the helmets! Daddy took all 5 children around the mountain bike course. Then Ben, Jess and Daddy had time trial races around the tarmac surface.<\/p><img src='images\\years\\2018\\2018_10_27-06-GravesendCycloPark.jpg' class='diaryImage' alt='Jessica lining up for a time trial at the Cyclo Park' \/><p class='diaryImageCaption'>Jessica lining up for a time trial at the Cyclo Park<\/p>","images":false},"title":{"value":"Lullingstone parkrun, Cyclo Park"},"version":0},{"date":{"d":25,"m":10,"y":2018},"datev":20181025,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica went over to the Teales, whilst Summer came here. Ben, Katie and Summer went to Thorpe Park.<\/p><img src='images\\years\\2018\\2018_10_25-04-ThorpePark1.jpg' class='diaryImage' alt='Katie and Summer and Thorpe Park' \/><p class='diaryImageCaption'>Katie and Summer and Thorpe Park<\/p>","images":false},"title":{"value":"Teale Swap"},"version":0},{"date":{"d":24,"m":10,"y":2018},"datev":20181024,"first":{"value":null},"images":1,"info":{"content":"<p><\/p><img src='images\\years\\2018\\2018_10_24-02-BroadditchFarm.jpg' class='diaryImage' alt='Broadditch Farm haunted house' \/><p class='diaryImageCaption'>Broadditch Farm haunted house<\/p>","images":false},"title":{"value":"Broadditch Farm - Morley's and Burrows"},"version":0},{"date":{"d":23,"m":10,"y":2018},"datev":20181023,"first":{"value":null},"images":3,"info":{"content":"<p>Our travel back day. We headed off straight after breakfast. We passed through Wrexham. Daddy therefore had to seek the football ground and have a mooch around. Close by was Pontcysllte Aquaduct which we walked along. It was pretty high up and pretty windy. Scary stuff.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1922253807\" target=\"_blank\">Pontcysllte Aquaduct Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_23-11-Wales_Day4-Aquaduct.jpg' class='diaryImage' alt='On Pontcysllte Aquaduct' \/><p class='diaryImageCaption'>On Pontcysllte Aquaduct<\/p><img src='images\\years\\2018\\2018_10_23-21-Wales_Day4-Aquaduct.jpg' class='diaryImage' alt='Pontcysllte Aquaduct walk' \/><p class='diaryImageCaption'>Pontcysllte Aquaduct walk<\/p><p>We moved on down the River Dee down to Llangollen which was a pretty village and stopped for some lunch and again a walk around town. It had a fantastic bakers shop.<\/p><img src='images\\years\\2018\\2018_10_23-25-Wales_Day4-Aquaduct.jpg' class='diaryImage' alt='Llangollen' \/><p class='diaryImageCaption'>Llangollen<\/p><p>We made it home mid afternoon. Lovely few days.<\/p>","images":false},"title":{"value":"North Wales - Day 4 - Pontcysllte Aquaduct"},"version":0},{"date":{"d":22,"m":10,"y":2018},"datev":20181022,"first":{"value":null},"images":7,"info":{"content":"<p>We had a nice cooked breakfast before snaking our way through the picturesque route to Betws-y-Coed and Go Below. Here we had booked in to go on an adventure trip around Penmachono Slate mines which ran for 200 years. We kitted up in wellies and a hard hat and caught a mini bus, southwards. The site was close to Ffestiniog. The slate was also quarried at this site. We could see the rejected slate. We climbed up on the slate, then through the most beautiful wood ever. It was thick with trees, ladened with moss on the trunk. It was almost eerie as we climbed a kilometer or so to one of the modest entrances to the mine. Last wee stop for a few hours!<\/p><p>We entered the mine. Glad we had wellies on as the ground was a mix of puddles and a running stream. We continued to climb and got to a chamber filled with water. The only way to the next stage was to get in the rubber dinghy and paddle across. The guide told us all we needed to know about the slate mine. We had a number of other elements to tackle during our 3 hour stint under ground including: zip wire, abseil and plenty of rock climbs. Interestingly enough we were told to be careful when we stopped for lunch as any crumbs created would turn into lumps of penicillin. There is nothing else to take the debris out of the cave! We finally climbed up a 80 foot ladder back to the surface near to the top of the mine. A great experience in a beautiful part of the country.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1921375148\" target=\"_blank\">Not very accurate Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_22-05-Wales_Day3-Caving.jpg' class='diaryImage' alt='The woods where the mine entrance was' \/><p class='diaryImageCaption'>The woods where the mine entrance was<\/p><img src='images\\years\\2018\\2018_10_22-12-Wales_Day3-Caving.jpg' class='diaryImage' alt='Underground boating lake' \/><p class='diaryImageCaption'>Underground boating lake<\/p><img src='images\\years\\2018\\2018_10_22-22-Wales_Day3-Caving.jpg' class='diaryImage' alt='Rope climbing' \/><p class='diaryImageCaption'>Rope climbing<\/p><img src='images\\years\\2018\\2018_10_22-23-Wales_Day3-Caving.jpg' class='diaryImage' alt='Underground abseiling' \/><p class='diaryImageCaption'>Underground abseiling<\/p><img src='images\\years\\2018\\2018_10_22-31-Wales_Day3-Caving.jpg' class='diaryImage' alt='Out and concerned!' \/><p class='diaryImageCaption'>Out and concerned!<\/p><p>We got back to Rhuddlan and decided to walk to the Castle and mucked about there for a bit. There was a lovely sunset. Opposite our hotel was an American Diner place where we stopped off and ate too much!<\/p><img src='images\\years\\2018\\2018_10_22-69-Wales_Day3-Caving.jpg' class='diaryImage' alt='Rhuddlan Castle with a lovely sunset' \/><p class='diaryImageCaption'>Rhuddlan Castle with a lovely sunset<\/p><img src='images\\years\\2018\\2018_10_22-70-Wales_Day3-Caving.jpg' class='diaryImage' alt='Rhuddlan Castle' \/><p class='diaryImageCaption'>Rhuddlan Castle<\/p>","images":false},"title":{"value":"North Wales - Day 3 - Penmachno Mine Caving, Rhuddlan Castle"},"version":2},{"date":{"d":21,"m":10,"y":2018},"datev":20181021,"first":{"value":null},"images":10,"info":{"content":"<p>We awoke in Holyhead Travelodge, picked up some breakfast at McDonalds and the local supermarket for those that were a little more health conscious. The weather was turning. Within an hour the rain was coming in sideways. We first headed to Parys Mountain, a copper mine. Due to the weather we were the only ones there. It was an interesting walk. We headed towards the tower, crossed the high bridge and looked at the bleak landscape.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1918209271\" target=\"_blank\">Parys Mountain Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_21-10-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Parys Mountain' \/><p class='diaryImageCaption'>Parys Mountain<\/p><p>A little further around the coast was Llanbadrig, just north of the most northerly village in Wales! Again another walk in blustery, but dry conditions. We saw a dead fox. Daddy and Katie continued on the walk to the head. We again headed off towards a cafe highly rated on Trip Advisor. It was closed. Closed till Easter!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1918716707\" target=\"_blank\">Llanbadrig Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_21-46-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Llanbadrig' \/><p class='diaryImageCaption'>Llanbadrig<\/p><img src='images\\years\\2018\\2018_10_21-51-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Llanbadrig' \/><p class='diaryImageCaption'>Llanbadrig<\/p><p>After the dissapointment of not getting food at the cafe, Daddy looked up Trip Advisor and found Pete's Burger Bar... we travelled there only to find it was a burger van! We all laughed at Daddy. Thankfully just down the road was the Bull pub who were doing a Sunday Carvery. Yum.<\/p><p>After our fill, we headed for our third mini walk of the day at a 5,000 year old Burial Chamber in Bryn Celli Ddu. We had fun running up and down the hill, which I guess isn't too respectful. We had fun.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1919011858\" target=\"_blank\">Neolithic Burial Chamber Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_21-61-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Bryn Celli Ddu Burial Chamber' \/><p class='diaryImageCaption'>Bryn Celli Ddu Burial Chamber<\/p><p>Within 8 miles was Newborough Beach. A huge stretch of sand with a spit of land reaching out in to the Irish Sea. It was quite picturesque especially with the sky. First dark and cloudy, eventually the sun won through and gave us some nice pictures. Katie and Daddy walked a fair way until Daddy got a hypo so they turned back. Meanwhile Jessica and Ben were playing secret agents.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1919342658\" target=\"_blank\">Newborough Beach Out Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_10_21-77-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><img src='images\\years\\2018\\2018_10_21-82-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><img src='images\\years\\2018\\2018_10_21-86-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><img src='images\\years\\2018\\2018_10_21-88-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><img src='images\\years\\2018\\2018_10_21-96-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><img src='images\\years\\2018\\2018_10_21-110-Wales_Day2-Anglesey.jpg' class='diaryImage' alt='Newborough Beach' \/><p class='diaryImageCaption'>Newborough Beach<\/p><p>We headed to Rhuddlan for our next hotel, a Premier Inn. Whilst Mummy watched the Strictly results, Daddy went out for a run around the village.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1919576048\" target=\"_blank\">Rhuddlan Run Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"North Wales - Day 2 - Anglesey - Parys Mountain, Llanbadrig, Bryn Celli Ddu Burial Chamber, Newborough Beach"},"version":2},{"date":{"d":20,"m":10,"y":2018},"datev":20181020,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy did parkrun, then the Falcons lost 9-2 to a strong Windlesham side. We went down to a bare 11 men. Ben really played well, getting stuck in with some tough sliding tackles.He won Man Of The Match. Well done Ben.<\/p><p>We then travelled on the long journey north up to Wales. We stopped off a few times, but reached Holyhead in about 6 hours. We got Fish and Chips and sat on the quayside and saw the ferries which travel to Dublin.<\/p><img src='images\\years\\2018\\2018_10_20-04-Wales_Day1-Travel.jpg' class='diaryImage' alt='Fish and Chips on Holyhead quayside' \/><p class='diaryImageCaption'>Fish and Chips on Holyhead quayside<\/p>","images":false},"title":{"value":"North Wales - Day 1 - Travel"},"version":0},{"date":{"d":14,"m":10,"y":2018},"datev":20181014,"first":{"value":null},"images":2,"info":{"content":"<p>Katie had a photography project. She needed some family members and a gloomy beach.<\/p><img src='images\\years\\2018\\2018_10_14-29a-Southsea.jpg' class='diaryImage' alt='Ben, Daddy, Jess at Southsea beach in the rain' \/><p class='diaryImageCaption'>Ben, Daddy, Jess at Southsea beach in the rain<\/p><img src='images\\years\\2018\\2018_10_14-01c-Southsea.jpg' class='diaryImage' alt='Southsea beach' \/><p class='diaryImageCaption'>Southsea beach<\/p>","images":false},"title":{"value":"Southsea"},"version":0},{"date":{"d":13,"m":10,"y":2018},"datev":20181013,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning the Falcons lost 2-0 to Badshot Lea Ninjas. The game could have gone either way. However, there was an unsavory incident with one of the parents.<\/p><p>In the afternoon, us girls went to Camberley shopping.<\/p><p>In the evening Katie went to Catherine's 16th birthday. It was a house party with alcohol and some boys. Katie came home at 11pm.<\/p><img src='images\\years\\2018\\2018_10_13-01a-Catherines16thBirthdayParty.jpg' class='diaryImage' alt='Katie going to the party' \/><p class='diaryImageCaption'>Katie going to the party<\/p><img src='images\\years\\2018\\2018_10_13-04-Catherines16thBirthdayParty.jpg' class='diaryImage' alt='Party time at Catherine's 16th' \/><p class='diaryImageCaption'>Party time at Catherine's 16th<\/p>","images":false},"title":{"value":"Badshot Lea 2 v 0 Falcons, Shopping, Katie first proper party"},"version":0},{"date":{"d":12,"m":10,"y":2018},"datev":20181012,"first":{"value":null},"images":1,"info":{"content":"<p>Katie and Jess stayed in the car from 5pm till 11am the next morning.<\/p><img src='images\\years\\2018\\2018_10_12-02-KatieJessCarSleepover.jpg' class='diaryImage' alt='Katie and Jess in the car' \/><p class='diaryImageCaption'>Katie and Jess in the car<\/p>","images":false},"title":{"value":"Overnight stay in the car"},"version":0},{"date":{"d":7,"m":10,"y":2018},"datev":20181007,"first":{"value":null},"info":{"content":"<p>In the morning, Daddy went off for a bike ride. This time wanting to ride the A331 and the Hogs Back. Mummy went to church. Katie had her second tutoring session, this time on Chemistry.<\/p><p>Farfar popped around and played with Jessica, Ben and Daddy in a game of Hotel.<\/p><p>In the afternoon we chilled out and later Ben and Katie went to Church Youth Group.<\/p>","images":false},"title":{"value":"Tutoring and Youth Group"},"version":1},{"date":{"d":6,"m":10,"y":2018},"datev":20181006,"first":{"value":null},"info":{"content":"<p>Last night Katie went for a sleepover at Summer's. So we went to collect Katie from Guildford later in the day.<\/p><p>In the morning, after Mummy and Daddy's flu jab, Ben and Daddy went off to Windlesham for a match. They were far better than us. Daddy was on his own as Loz was away. It was also Silent Weekend, so no coaching during the match. We ran out 8-3 losers. It tipped it down by the end of the game.<\/p><p>Later, Mummy and Jessica went into Camberley to do some shopping.<\/p>","images":false},"title":{"value":"Katie Sleepover, Windlesham 8 v 3 Falcons"},"version":0},{"date":{"d":30,"m":9,"y":2018},"datev":20180930,"first":{"value":null},"images":2,"info":{"content":"<p>Mummy came to collect us from Bournemouth.<\/p><woops woopstitle=\"Sold motorbike to two different Russians\" rating=\"4\"><p>Daddy was waiting for the Russian to turn up for him to be told he can't take the bike away! Daddy put his motorbike on Autotrader at £750, listing all the problems with it. The most severe was an oil leak. On Thursday he got a phone call from a Russian chap (Russian 1) wanting to come down from Leicester to see it. He arrived after football training in the dark. He could barely speak English. So bad, Daddy had to send the house postcode by text. The Russian brought his friend along (spoke equally as badly) who almost drove it through next door's front window. They were obviously concerned about the oil leak, but they really didn't have a clue about motorbikes. They liked the bike and offered £700 which Daddy accepted. They paid a £300 deposit and said he'll be back on Sunday morning (today) to collect it.<\/p><p>Friday came along and a short email message came through from a chap called Dimitri asking if I knew where the oil leak was. Daddy replied no, and the chap asked to see the bike that evening. Daddy thought it was Russian 1, given the name 'Dimitri' just wanting a closer look at that oil leak. Dimitri emailed to say he's had a job cancelled in Watford and he come down. Bearing in mind this was Friday night rush hour, he must have spent an hour and a half getting from Watford. He arrived and Daddy soon realized Dimitri was not the same person as Russian 1. Massive dilemma. Does he tell this new chap that there is a mistake in identity. Daddy couldn't do this so explicitly seeing he had traveled so far. Daddy's tactic was to exaggerate the oil leak and all the other faults. He did such a bad job that Dimitri offered the full amount and could pay for it all right now! Arrrgghhh. Daddy couldn't say no - what excuse could he have given? So the paper work was done, the only proviso was that he couldn't take the bike away till Monday, during the daytime. So Daddy gave him the keys to the motorbike so he could just ride off.<\/p><p>Daddy then frantically tried to get hold of Russian 1 to say the deal was off. Citing a problem in Daddy's new bike, therefore needing his old bike. Over a dozen calls and texts were sent during the Saturday and Sunday and no reply.<\/p><p>Daddy was very nervous. What if Russian 1 just turned up, having not read any of the messages, seeing the motorbike in driveway and wondering why he couldn't drive it away. Fortunately, he didn't turn up. Not a peep. Perhaps he'd forgotten.<\/p><p>In the end Russian 1 contacted Daddy a few days later, and was ok about the situation. It then took another week for the deposit money to be returned as there was an issue with receiving SMS texts from him. Daddy feels he got away with that one.<\/p><img src='images\\years\\2018\\2018_09_17-14-SellingMotorbike.jpg' class='diaryImage' alt='The silver bullet has got to go' \/><p class='diaryImageCaption'>The silver bullet has got to go<\/p><\/woops><p>Katie has been struggling with science at school, which is partially at the fault of the school and their bad teachers. The tutor, said he tutors many from Tomlinscote! Katie found it rewarding. He charges £35 for the hour.<\/p><p>In the afternoon Jessica really wanted to go Banger racing over in Aldershot. They saw hot rods and caravan Bangers. There were only 4 caravans and they raced in a figure of 8!<\/p><img src='images\\years\\2018\\2018_09_30-02-MartinJessicaBangerRacing.jpg' class='diaryImage' alt='Caravan Banger Racing at Aldershot' \/><p class='diaryImageCaption'>Caravan Banger Racing at Aldershot<\/p>","images":false},"title":{"value":"Katie Tutoring, Banger Racing, Youth Group, The Motorbike and Russians"},"version":8},{"date":{"d":29,"m":9,"y":2018},"datev":20180929,"first":{"value":null},"images":2,"info":{"content":"<p>Busy day, starting with parkrun for Daddy. He has been feeling under the weather with a cold that hasn't shifted, so he took it nice and easy.<\/p><p>Straight after and still at Frimley Lodge Park, the Falcons played Camberley. Ben was well up for the match as a lot of Tomlinscoters filled the opposition lineup. He even went to bed slightly earlier to be fresh for today! The game was physical from the opposition. There was a little bit of needle. We suffered as a result, many of the boys not liking it and not really wanting to play. Part of the managers were thinking the boys have got to get used to this treatment. Some parents really didn't like it. In the end we ended up losing 2-0.<\/p><p>After a speedy lunch we headed down to Bournemouth to see Charlotte. Once the Elders arrived we headed into town to get a Shakeaway. It took forever, but well worth it.. Mummy and Daddy headed home after and we stayed with our cousins and Auntie Charlotte. We played games; code words and linky. We watched Shrek and went to bed at gone 1am!<\/p><img src='images\\years\\2018\\2018_09_29-06-CharliesOvernightStay.jpg' class='diaryImage' alt='The Bournemouth Crew' \/><p class='diaryImageCaption'>The Bournemouth Crew<\/p><p>Meanwhile Mummy and Daddy went out for a meal to the Villa Bianca, Frimley.<\/p><img src='images\\years\\2018\\2018_09_29-02-VillaBiancaMealOut.jpg' class='diaryImage' alt='Villa Bianca' \/><p class='diaryImageCaption'>Villa Bianca<\/p>","images":false},"title":{"value":"parkrun, Falcons 0 v 2 Camberley, Bournemouth Sleepover, Villa Bianca"},"version":1},{"date":{"d":23,"m":9,"y":2018},"datev":20180923,"first":{"value":null},"images":1,"info":{"content":"<p>We travelled up to Colchester to meet with Mummy's cousin Kerry and husband Simon, along with Pop Pop's sisters and the rest of the Weston crew. It was raining and the first day of it feeling autumnal.<\/p><p>They had gone to so much effort getting huge gazebos up. Jessica and Hattie got on well. The rope swing proved a winner with the boys especially. We had a good laugh resulting in some impromptu Latin party dancing!<\/p><img src='images\\years\\2018\\2018_09_23-08-KerrySimonBBQ.jpg' class='diaryImage' alt='The Weston's and derivatives' \/><p class='diaryImageCaption'>The Weston's and derivatives<\/p>","images":false},"title":{"value":"Kerry and Simons for a BBQ"},"version":1},{"date":{"d":22,"m":9,"y":2018},"datev":20180922,"first":{"value":null},"images":4,"info":{"content":"<p>A busy morning starting off with Daddy running his 250th parkrun (or is it 251st, eh James?). It was nice to see all the well wishers. Daddy ran with Loz to start with and completed the course in an average time of 26 minutes. There was an announcement before the run and photos, cake and a card after the run. All very touching, especially as we all turned up to support him including the Fars. Jessica and Ben ran the last kilometre with Daddy.<\/p><img src='images\\years\\2018\\2018_09_22-10-Parkrun250.jpg' class='diaryImage' alt='Daddy ballooned and carded up' \/><p class='diaryImageCaption'>Daddy ballooned and carded up<\/p><img src='images\\years\\2018\\2018_09_22-08-Parkrun250.jpg' class='diaryImage' alt='The celebration crew' \/><p class='diaryImageCaption'>The celebration crew<\/p><p>Fortunately today's Falcons match was at Frimley Lodge Park, so Daddy quickly swapped to manager role. We faced Yateley, who went 2-0 up. A few changes at half time, saw a fight back by the boys and eventually we ran out 7-3 winners. Ben played well as a terrier in midfield.<\/p><p>Jessica heard that Farmor was running the tea bar down at Chertsey T Football Club, so got it in to her head that wanted to go down and help. She took her apron and made herself at home in the tea bar, helping making the teas, coffees and tidying up. She loved it. Chertsey also riding high, top of the table having won every game so far.<\/p><img src='images\\years\\2018\\2018_09_22-03-CTFCTeaBar.jpg' class='diaryImage' alt='Jessica and Farmor tea barring' \/><p class='diaryImageCaption'>Jessica and Farmor tea barring<\/p><p>Later in the evening Daddy went to buy a motorbike from someone at his work's friend. He bought the 4 year old, CB500X for £2250. It is nice to have a bike where everything works, it has heated handlebar grips and a scotoiler. It is noticeably less fast, but more trustworthy around the corners. It has 50,000 miles on the clock. Now we need to sell the old bike.<\/p><img src='images\\years\\2018\\2018_09_03-01-NewCB500Motorbike.jpg' class='diaryImage' alt='New CB500X motorbike' \/><p class='diaryImageCaption'>New CB500X motorbike<\/p>","images":false},"title":{"value":"parkrun 250, Falcons 7 v 3 Yateley, Jessica at Chertsey T FC teabar, Bought Motorbike"},"version":4},{"date":{"d":21,"m":9,"y":2018},"datev":20180921,"first":{"value":null},"images":1,"info":{"content":"<p>We went over to see Auntie Susan and Graham as it was Susan's birthday this week. We had a cup of tea and sat in Graham's new Mercedes. Loving the internal lights.<\/p><img src='images\\years\\2018\\2018_09_21-10-SusanAndGrahamsForCuppa.jpg' class='diaryImage' alt='In the Tremear's Kitchen' \/><p class='diaryImageCaption'>In the Tremear's Kitchen<\/p>","images":false},"title":{"value":"Visit the Tremears"},"version":1},{"date":{"d":20,"m":9,"y":2018},"datev":20180920,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica prepared a speech to the rest of the class in a bid to become House Captain for Endurance. There was a little bit of pressure seeing both Katie and Ben had previously been voted in as house captain. She had practiced her talk a number of times, amending it a bit here and there. Anyway today we found out she had been elected. Well done Jessica.<\/p><img src='images\\years\\2018\\2018_09_20-01-JessicaVotedInAsHouseCaptain.JPG' class='diaryImage' alt='Exert out of the Frimley Times' \/><p class='diaryImageCaption'>Exert out of the Frimley Times<\/p>","images":false},"title":{"value":"Jessica voted in as House Captain"},"version":2},{"date":{"d":18,"m":9,"y":2018},"datev":20180918,"first":{"value":null},"info":{"content":"<p>The Fars invited Jessica out to see the circus in West End. There weren't too many people in the audience. Jessica had a nice time.<\/p>","images":false},"title":{"value":"Jessica and Fars to Jay Millars Circus"},"version":2},{"date":{"d":16,"m":9,"y":2018},"datev":20180916,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy set off early for Brands Hatch. He was supposed to be joined by Robin, Michael and Nick, but they all bailed out for one reason or another. Daddy was set the task of doing 100 miles in 6 hours. After the first hour he was 5 to 10 mins ahead of schedule, by 3 hours he was just on time having completed 50 miles. However, he had used all his energy to accomplish this and only managed 30 miles in the final 3 hours. Can't say it was enjoyable, but at least he's done 34 laps of Brands Hatch. He finished 20th out of 51 in his category.<\/p><img src='images\\years\\2018\\2018_09_16-14-Revolve24BrandsHatchBike.jpg' class='diaryImage' alt='Daddy taking on Graham Hill Bend' \/><p class='diaryImageCaption'>Daddy taking on Graham Hill Bend<\/p><a href=\"https:\/\/www.strava.com\/activities\/1845618062\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Revolve Brands Hatch 6 Hour Biking"},"version":0},{"date":{"d":15,"m":9,"y":2018},"datev":20180915,"first":{"value":null},"images":3,"info":{"content":"<p>In the morning Ben had his first game of the season, away to Hart Tornados. He won 6-0.<\/p><p>As part of Jessica's birthday present she was treated to a trip to London. First off to the Barbican (via the normal Gunnersbury route) to see a fashion show. Expectations were high because it was London Fashion Week. However, they didn't have a great seat, the models were young children and brands, although posh, we hadn't heard of them.<\/p><p>So they skipped out in the interval and headed towards Oxford Street and Regent's Street for some retail therapy..... lasting hours!<\/p><img src='images\\years\\2018\\2018_09_15-01-LondonFashionShowAndOxfordStreet.jpg' class='diaryImage' alt='Just off to London Fashion Show' \/><p class='diaryImageCaption'>Just off to London Fashion Show<\/p><img src='images\\years\\2018\\2018_09_15-09-LondonFashionShowAndOxfordStreet.jpg' class='diaryImage' alt='Not sure!' \/><p class='diaryImageCaption'>Not sure!<\/p><img src='images\\years\\2018\\2018_09_15-18-LondonFashionShowAndOxfordStreet.jpg' class='diaryImage' alt='Jessica and her balloons' \/><p class='diaryImageCaption'>Jessica and her balloons<\/p>","images":false},"title":{"value":"Hart 0 v 6 Falcons, London Fashion Show, Oxford Street Shopping"},"version":1},{"date":{"d":14,"m":9,"y":2018},"datev":20180914,"first":{"value":null},"info":{"content":"<p>Jessica invited 12 friends over for a party. We hired a big bouncy slide. Amirette stayed for a sleepover.<\/p>","images":false},"title":{"value":"Jessica's 11th Birthday Party"},"version":2},{"date":{"d":11,"m":9,"y":2018},"datev":20180911,"first":{"value":null},"info":{"content":"<p>We started in bed with opening cards and presents..... well mainly cards with money in them. She accrued over £300! Shocking and a very lucky girl. Of course pancakes for breakfast before a day at school.<\/p><p>After school the idea was to go to Thorpe Park. However, a combination of it being shut and Great Grandma being whisked to hospital meant we went to Frimley Park Hospital instead. Great Grandma had fallen over and cracked a vertebrae! She is in pain, but getting on as well as can be expected.<\/p><p>Jessica wanted to go to eat in the middle of a roundabout for dinner. Sound strange eh? Well she is referring to the Shepherd and Flock pub in Farnham. We booked a table and dressed it up with some banners and a balloon. She loved it. Jessica chose the exotic 'beans and chips' option. IT wasn't even on the menu, they were just side orders. We stayed for a while before going for a walk around the 'island'. We decided who in the family should live in each of the 14 or so houses.<\/p>","images":false},"title":{"value":"Jessica's 11th Birthday"},"version":3},{"date":{"d":9,"m":9,"y":2018},"datev":20180909,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Daddy went out with Bob and Jim for a Guildford circular. The pace was faster than usual which was good. They stopped to watch a few Flyers run in the Pilgrims Half Marathon.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1830050036\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_09_09-01-JimBobGuildfordBikeRide.jpg' class='diaryImage' alt='Bob, Jim and Daddy cycling' \/><p class='diaryImageCaption'>Bob, Jim and Daddy cycling<\/p><p>In the afternoon we relaxed at home and played a new quiz game on our mobiles and PS4. It's called Knowledge Is Power. There are a number of rounds on various subjects. The Maisey's popped around so they joined in a game as well. Jessica won!<\/p><img src='images\\years\\2018\\2018_09_09-02-KnowledgeIsPower.jpg' class='diaryImage' alt='Jessica won a family game of Knowledge Is Power' \/><p class='diaryImageCaption'>Jessica won a family game of Knowledge Is Power<\/p>","images":false},"title":{"value":"Guildford Circular Ride, Maiseys Over For Knowledge Is Power"},"version":0},{"date":{"d":8,"m":9,"y":2018},"datev":20180908,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Daddy went to do parkrun. Ben came along but only did one lap as he had to get back and take Jessica for a 1-2-1 football training session. The girls went off to a fashion show in Guildford. High Street shops were the presenters. There were a couple of dudes from Love Isalnd which pleased Katie no end - she went bright red when she went next to them.<\/p><img src='images\\years\\2018\\2018_09_08-11-FashionShow.jpg' class='diaryImage' alt='Guildford Fashion Show' \/><p class='diaryImageCaption'>Guildford Fashion Show<\/p><p>Jessica's drama group were putting on a show. This was slightly different. The script was first seen by everyone at 7:30pm on Friday. They only had 24 hours to produce it and learn the music and lines. It was Joseph and his Amazing Technicolour Dream coat. There must have been a cast of 40 or 50 ranging from Jessicas age to old adults. Jessica had a small part. We dropped her off at 3pm at the theatre. We all came along with the Fars and Ma Ma and Pop Pop. She loved it.<\/p><img src='images\\years\\2018\\2018_09_08-00-JosephPlay24Hours.jpg' class='diaryImage' alt='Jessica in Joseph' \/><p class='diaryImageCaption'>Jessica in Joseph<\/p>","images":false},"title":{"value":"parkrun, Fashion Show, Jessica in Joseph Theatre"},"version":0},{"date":{"d":5,"m":9,"y":2018},"datev":20180905,"first":{"value":null},"images":1,"info":{"content":"<p>New School years:<\/p><p>Katie Year 11<\/p><p>Jessica Year 6<\/p><p>Ben Year 9<\/p><img src='images\\years\\2018\\2018_09_11-09-NewSchoolYear.jpg' class='diaryImage' alt='Off to school' \/><p class='diaryImageCaption'>Off to school<\/p>","images":false},"title":{"value":"First day back at school"},"version":1},{"date":{"d":4,"m":9,"y":2018},"datev":20180904,"first":{"value":null},"info":{"content":"<p><whoops whoopstitle=\"Ben forgot to switch Bathroom taps off - water pouring through ceiling\" rating=\"3\">Ben set the bath off. However it was dinner time. He had forgotten about the bath. When Katie finished dinner and went in to the front room she shouted out that water was pouring down the light and onto the carpet! Oh dear. To coin a en-vogue saying from Ben himself, 'You plonker' Ben. Fortunately there was no lasting damage.<\/whoops><\/p>","images":false},"title":{"value":"Ben forgot to switch Bathroom taps off - water pouring through ceiling"},"version":2},{"date":{"d":2,"m":9,"y":2018},"datev":20180902,"first":{"value":null},"images":2,"info":{"content":"<p>We split today. Daddy, Ben, Farfar, Ma Ma and Pop Pop went up towards Milton Keynes to visit Bletchley Park. It was a veterans day and Great Grandma was invited too, however, she fell over yesterday and was not well enough to attend.<\/p><p>The day started registering for the veterans day and grabbing a cup of coffee in the hospitality tent. Ma Ma got talking to one of the hosts who setup a future interview with great grandma to talk about her days at Bletchley Park. We found out that grandma was part of the WRENs working in hut 8 and doing detective work from the messages received. It was said she worked on the Italian and Japanese intercepts. We then toured around some of the huts and saw the exhibits, including a very interesting piece on the war pigeons.<\/p><p>After the buffet lunch, we went on a tour around the part of the house and park. Some very interesting stories. After, we ventured into hut 11 and the Bombe. The machine used to decipher Enigma messages.<\/p><img src='images\\years\\2018\\2018_09_02-06-BletchleyPark.jpg' class='diaryImage' alt='Bletchley Park House' \/><p class='diaryImageCaption'>Bletchley Park House<\/p><p>After finishing up at Bletchley Park itself, we walked around the corner to the National Computer Museum. Seeing the Bombe gave us thirst to see more, especially Colossus, the first programmable computer. For the hour or so we were there it was very interesting. There was a man describing the Harwell Dekatron computer aka WITCH, which allowed you to see memory registers change values. We also saw Colossus working away, with tape whizzing around. Daddy also got to see many of the home computers of the 80s. We had to wrench him off playing Manic Miner on the Spectrum! A good day.<\/p><img src='images\\years\\2018\\2018_09_02-15-BletchleyPark.jpg' class='diaryImage' alt='Colossus computer' \/><p class='diaryImageCaption'>Colossus computer<\/p><p>Meanwhile us girls went to Thorpe Park. Jessica tried a number of new ride including Stealth.<\/p>","images":false},"title":{"value":"Bletchley Park, Thorpe Park"},"version":1},{"date":{"d":1,"m":9,"y":2018},"datev":20180901,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Daddy and Ben went to do parkrun. Ben is now regularly beating Daddy. It would be a shock if Daddy finished ahead.<\/p><p>The ugly job of re-felting the shed roof was upon Daddy. He has been putting it off for a while now. £80 of felt. Ben helped getting the old felt off the roof. Hopefully this will stop it leaking now. Although not sure about the nails, leaving gaps for rain water.<\/p><p>We know it's not Mummy and Daddy's anniversary until tomorrow. But tomorrow Daddy is out. Ben, enthusiastically stated that he'll host and cook the meal right from menu planning, shopping, cooking, prep'ing the table and room and washing up. He hired a couple of helpers, in Jessica who made the desert and Katie who made the starter and washed up. It was very sweet of them.<\/p><p>They exchanged presents. Daddy received a waistcoat, whilst Mummy a jumper that she'd asked for. For starters they ate homemade garlic bread, mains was a pasta in a tomato sauce and chrizo, desert was a gin and tonic sorbet with homemade brownies. The meal was delicious, even down to the Rose wine! Thanks guys. Top cooking.<\/p><img src='images\\years\\2018\\2018_09_01-06-18thWeddingAniversaryMeal.jpg' class='diaryImage' alt='Anniversary Meal' \/><p class='diaryImageCaption'>Anniversary Meal<\/p><img src='images\\years\\2018\\2018_09_01-03-18thWeddingAniversaryMeal.jpg' class='diaryImage' alt='18th year' \/><p class='diaryImageCaption'>18th year<\/p>","images":false},"title":{"value":"parkrun, re-felt shed roof, 18th Wedding Anniversary Meal"},"version":1},{"date":{"d":27,"m":8,"y":2018},"datev":20180827,"first":{"value":null},"images":2,"info":{"content":"<p>The weather still wasn't great on this bank holiday weekend. Still we were determined to make the most of it and continue with our trip to the coast. The main aim was to actually use Ben's body board that was bought a while back. Daddy being daddy saw this trip to the coast as an excuse to get the bike out, so we dropped him off in Bordon and he biked down from there.The rest of us continued and first went in the cafe to get some food and drink and then had a go on the funfair with tokens left over from a previous excursion.<\/p><p>When Daddy arrived we met in our usual spot next to the volleyball court. and had a picnic lunch. Then it was time to enter the water. Who was brave? Well Mummy, Jess and Ben were. We did use the body board for about 15 minutes before the cold got the better of us.<\/p><p>We returned home and played a family game of risk. Despite a poor start, Ben came back strongly and won, much to his hapiness.<\/p><img src='images\\years\\2018\\2018_08_27-34-HaylingIsland.jpg' class='diaryImage' alt='Lunch on the beach' \/><p class='diaryImageCaption'>Lunch on the beach<\/p><img src='images\\years\\2018\\2018_08_27-43-HaylingIsland.jpg' class='diaryImage' alt='body boarding it up' \/><p class='diaryImageCaption'>body boarding it up<\/p>","images":false},"title":{"value":"Hayling Island"},"version":0},{"date":{"d":26,"m":8,"y":2018},"datev":20180826,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Mummy went down to the lake to join Ellie and Lily and mermaid it around the usual circuit.<\/p><p>As we were away on Farfar's birthday, Auntie Susan and Daddy decided to have a family meal at the Leathern Bottle in Wokingham. The weather was terrible, raining all day which scuppered the supplementary Crazy Golf. However, we spent over 3 hours chatting and eating away. It was good fun.<\/p><img src='images\\years\\2018\\2018_08_26-03-Farfar72ndBirthdayMeal.jpg' class='diaryImage' alt='Leathern Bottle, Wokingham' \/><p class='diaryImageCaption'>Leathern Bottle, Wokingham<\/p><p>In the evening we played a family game of Monopoly. This Monopoly was  a 'Make Your Own Monopoly' where you could make up your own properties and chance \/ community chest cards. There were some forfeits like, 'Farfar tells you a long story. Miss a go', or 'Go on one of Mummy's walks, miss a go' or 'Daddy buys a dodgy car, pay £100'. Daddy won!<\/p>","images":false},"title":{"value":"Farfar 72nd Birthday Meal"},"version":2},{"date":{"d":22,"m":8,"y":2018},"datev":20180822,"first":{"value":null},"images":2,"info":{"content":"<p>Sadly it was home day. We handed the villa back at 11am and packed our bags and went to Los Abrogos to scrape the undercarriage of the car on some rocks, oops, and to try some Churros in a local cafe type place. They were OK to eat. We headed up the road and did some supermarket shopping for presents and lunch. We then headed back to Costa Adeje and took a long walk along the promenade to Playa de Torviscas. Here we hired another pedalo boat with a slide. However, it wasn't quite as good as the other day. There were some islands 100 metres from the beach which we all swum out to and had a look.<\/p><img src='images\\years\\2018\\2018_08_22-06-Tenerife_8-CostaAdeje.jpg' class='diaryImage' alt='J and D in sand. for Jessica and Daddy' \/><p class='diaryImageCaption'>J and D in sand. for Jessica and Daddy<\/p><img src='images\\years\\2018\\2018_08_22-07-Tenerife_8-CostaAdeje.jpg' class='diaryImage' alt='Ben and Daddy in Costa Adeje' \/><p class='diaryImageCaption'>Ben and Daddy in Costa Adeje<\/p><p>We dawdled back to the car, stopped of for a KFC and McDs before returning the car back at the airport. The flight went well, landing back in Gatwick at just gone midnight. However, because we parked the car a couple of miles away and we were so late, there were no buses, there was no way Daddy would stretch for paying for a taxi, so he decided he could run it! Getting out of the airport was a mission in itself. Or at least getting out at the right exit. Eventually he was out and running up a dark, spooky path with 6 foot high chain link fences either side. At Horley some people who had finished in the pub for the night were wondering why I was jogging at 1am in the morning! Having got back to the car (it was OK), Daddy then didn't do too well at re-locating us at the bus station. We rolled into the house at 2:30am, leaving the suitcases in the car. It had been a long day. Daddy had 5 hours sleep before work next morning!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1791098321\" target=\"_blank\">Back to car route\u000a    \u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Tenerife Holiday - 8 - Costa Adeje and Home"},"version":6},{"date":{"d":21,"m":8,"y":2018},"datev":20180821,"first":{"value":null},"images":2,"info":{"content":"<p>Everyone was looking forward to this day. The reason we chose Tenerife was because we looked up where the best Water Park in the world was. Siam Park was the answer, so based our whole holiday around this. Mummy had saved £600 to get us all the VIP tickets. This granted us unlimited fast pass entries and unlimited food and drink. The Teale's were also in Tenerife and we met up here to experience the day together.<\/p><p>The big question was going to be whether Ben could get on the Tower of Power. The large, drop slide. The big problem was you had to be 14. When Alice also said you had to be 45kg, Ben was upset and had resigned himself to not going on the slide. There was a bit of phaffing at the start, but by 10:30 we were off and starting our first slide. Mummy was relishing the free food and drink. Having the fast pass was certainly useful. The normal queues were long and would have taken 30 \/ 40 minutes plus. Fast passes were about 10 minute queues.<\/p><p>Most rides involved an inflatable ring. Many of them needed 2, 3, or 4 people to ride in them. It was great. Having got around to the afternoon having tried all but 2 rides. Probably the best two rides. First up the Tower of Power.<\/p><p>No fast pass on this, but the queue was reasonably short. Daddy was confident that Ben would not pass for 14. He was shocked at the exchange. Attendant: How old are you? Ben: 14 Attendant: Really? Ben: Yes. Attendant: OK then, on you go! Unbelieveable. Ben very happy. Daddy dreading what was coming up. 20 minutes later Ben at the top and the lady gently shoving him down the slide. Daddy followed. Ben's reaction: it wasn't that scary! The second ride was one with a shared inflatable with 4. It went so high up the banked edges. Daddy and Ben went on with some weighty people. We stayed to the end. Daddy and Ben calculated 18 slide goes and a trip on the lazy river and big wave machine.<\/p><img src='images\\years\\2018\\2018_08_21-05-Tenerife_7-SiamPark-Teales.jpg' class='diaryImage' alt='Jessica and Alice' \/><p class='diaryImageCaption'>Jessica and Alice<\/p><p>We were invited back to the Teale's villa just 10 minutes away. It was gorgeous. We even had a go in their pool which was even bigger than ours. We strolled down to Costa Adeje's beach front to get dinner in a restaurant. Very nice end to the day.<\/p><img src='images\\years\\2018\\2018_08_21-04-Tenerife_7-SiamPark-Teales.jpg' class='diaryImage' alt='Meal out' \/><p class='diaryImageCaption'>Meal out<\/p>","images":false},"title":{"value":"Tenerife Holiday - 7 - Siam Park, Teales Villa"},"version":3},{"date":{"d":20,"m":8,"y":2018},"datev":20180820,"first":{"value":null},"images":1,"info":{"content":"<p>We headed to the north coast. Another challenge for the car, who had to make a number of climbs. Once we had got to the north the roads got even steeper. So steep that the brakes were getting very hot. Daddy could smell them and decided we needed to stop, fearing a brake failure. We needed the brakes. El Tanque and Les Cruces are not for the driving faint hearted going up or down! Definitely the steepest roads Daddy has ever driven. After an hour and a half of driving we eventually we reached the town of Garachico.<\/p><p>Garachico used to be the biggest port in the Canaries until a volcano erupted and destroyed the town. The lava formed these natural rock pools which is used to today by us and other tourists to swim in. Dare devil Ben was finding the highest rocks and jumping in first. The rest of us timidly followed in after him. It was an interesting setup. We played around for an hour or so before heading in to the sleepy town. We walked the picturesque streets via the church and town square. We made it to an ice cream shop to have some much needed cool down time.<\/p><p>We returned to another part of the natural pools. Daddy got stuck right into the rock pools and saw about 50 crabs scaling an isolated rock. There were some massive crabs. They were scared of him which was a relief.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1785015428\" target=\"_blank\">First Swim Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_20-05-Tenerife_6-Garachico.jpg' class='diaryImage' alt='In the rock pools' \/><p class='diaryImageCaption'>In the rock pools<\/p><p>After completing the long journey home via KFC (again), Daddy cooked up a BBQ before our now traditional hot tub and swimming pool trips.<\/p><p>Later in the evening Daddy decided he needed to do a local run. Having plotted, what he thought was a 5km run, he began heading north, 5km had passed and he was still heading away from the villa something not right. He passed the end of Tenerife's main runway and was later on the road to El Medano. He had plotted incorrectly. Near the end, he got a hypo which restricted him to run walking the last few kilometers. As Ben would say, 'you plonker Daddy'.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1785949884\" target=\"_blank\">Runway Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Tenerife Holiday - 6 - Garachico Natural Pools"},"version":5},{"date":{"d":19,"m":8,"y":2018},"datev":20180819,"first":{"value":null},"images":2,"info":{"content":"<p>Being a Sunday we found a church for Mummy in Los Christanos. She said it was a good service. Whilst she was praying the rest of us went to the sea front and hired a pedalo that had a slide off the back of it. We had great fun. Ben challenged us to jumping from the top step of the slide. We saw some big ships come in and we had ample of space to play around. The weather again was scorching. At the end of our hour, mummy made it to the beach and swum to join us. We loved it.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1783082013\" target=\"_blank\">Pedalo'ing Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_19-04-Tenerife_5-LosChristianos-CamelPark-MontanaRoja.jpg' class='diaryImage' alt='Finishing on Los Christianos beach' \/><p class='diaryImageCaption'>Finishing on Los Christianos beach<\/p><p>Just outside Los Christianos was the Camel Park. A little, strange place with a slightly eccentric lady running the place. It was nice to experience something a little different. Between the five of us we shared 2 camels. Children on one, adults on the other. There were 6 camels in the caravan, all roped closely together. So close that the camel behind us was less than a metre away from the back of our head. We got intimate knowledge of the camels mouth movements. On occasions they got so close we had to duck out of the way. We headed off on a 30 minute walk, zig zagging along some paths. It was interesting and something to say we had done, but wasn't amazing.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1783108318\" target=\"_blank\">Camel Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>We returned back to base and had an ice cream and a dip in the pool. We then split. Daddy decided he wanted to climb the local Mountana Roja, whilst the rest of us went to the beach where the kite surfers seemed to hang out. Daddy chose the most difficult of routes up the mountain it seemed. He enjoyed the stunning view from the top. The rest of us enjoyed the crashing waves, before being told off for being in the wrong area of the beach. It was reserved for sports people!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1783998283\" target=\"_blank\">Mountana Roja Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_19-17-Tenerife_5-LosChristianos-CamelPark-MontanaRoja_Moment.jpg' class='diaryImage' alt='Mont Roja' \/><p class='diaryImageCaption'>Mont Roja<\/p>","images":false},"title":{"value":"Tenerife Holiday - 5 - Los Christianos, Camel Riding, Mountana Roja Climb"},"version":4},{"date":{"d":18,"m":8,"y":2018},"datev":20180818,"first":{"value":null},"images":7,"info":{"content":"<p>Daddy found a nice treat for us by taking to Amarilla Golf and the Pancake Cafe. We of course had pancakes except mummy who had a full English! It was yummy. We then made our way for a stop off at Los Christianos, one of the touristy hot spots. We walked along the promenade and enjoyed the sun.<\/p><img src='images\\years\\2018\\2018_08_18-08-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Jessica tucking into a pancake breakfast' \/><p class='diaryImageCaption'>Jessica tucking into a pancake breakfast<\/p><img src='images\\years\\2018\\2018_08_18-10-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Aviators' \/><p class='diaryImageCaption'>Aviators<\/p><p>We then headed up the coast to Los Gigantes for a spot of lunch, then down to the harbour and the Dive Centre. We had booked a snorkeling trip under the 500 metre cliffs. We got kitted up and taken out on a speed boat for 10 minutes. We anchored under the cliffs and told to explore. The flippers handicapped some of us. Snorkeling was great. Seeing all the types of fish. The rocks under the sea were a little boring but we had an interesting time nosing around. Daddy retrieved a shell for this girl who dropped it too deep. We were snorkeling for an hour or so before returning back to the harbour and taking on some much needed ice cream.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1781385985\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_18-48-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Los Gigantes coast we explored snorkelling' \/><p class='diaryImageCaption'>Los Gigantes coast we explored snorkelling<\/p><p>Daddy had parked up the cliff, seemingly miles away so we sent him to get the car. Our next stop on this road trip was another popular resort, Playa De Las Americas. Here we relaxed on the sandy beach, explored the shopping mall and stopped off at a restuarant for a bite to eat. Jessica and Ben hired an electric mini jeep and terrorized the promenade.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1781386717\" target=\"_blank\">Playa De Las Americas Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_18-17-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Beauty queen in Playa De Las Americas' \/><p class='diaryImageCaption'>Beauty queen in Playa De Las Americas<\/p><img src='images\\years\\2018\\2018_08_18-21-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Katie on the beach in Playa De Las Americas' \/><p class='diaryImageCaption'>Katie on the beach in Playa De Las Americas<\/p><img src='images\\years\\2018\\2018_08_18-31-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Daddy and Katie' \/><p class='diaryImageCaption'>Daddy and Katie<\/p><img src='images\\years\\2018\\2018_08_18-40-Tenerife_4-PancakeCafe-LosChristanos-LosGigantes-PlayaDeLasAmericas.jpg' class='diaryImage' alt='Ben on a quad bike on the promenade in Playa De Las Americas' \/><p class='diaryImageCaption'>Ben on a quad bike on the promenade in Playa De Las Americas<\/p>","images":false},"title":{"value":"Tenerife Holiday - 4 - Pancake Cafe, Los Christianos, Los Gigantes Snorkeling, Playa De Las Americas"},"version":4},{"date":{"d":17,"m":8,"y":2018},"datev":20180817,"first":{"value":null},"images":2,"info":{"content":"<p>We headed to the local supermarket to get breakfast, which mainly consisted of doughnuts and croissants.<\/p><p>Daddy drove us up the east coast, along the motorway to the capital of Tenerife, Santa Cruz. On one side of the motorway a steep incline up the mountains, the other side it was the ocean and coastal landscapes.<\/p><p>We decided to go for a walk first to the food market in the centre of the city. There was a large range of food, like a mini Borough Market. We bought some tomato pasta and some sweeties of course. We then walked to a shopping mall where we Katie bought a swimming costume from the much loved Primark and Jessica an inflatable for the pool.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1778146612\" target=\"_blank\">Santa Cruz Walk Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_17-05-Tenerife_3-SantaCruz.jpg' class='diaryImage' alt='Getting ready for the pools' \/><p class='diaryImageCaption'>Getting ready for the pools<\/p><p>We then entered the purpose made swimming pools. There were two massive pools, one had an inflatable slide. We had a great time here. Daddy decided to go for a Flyers 5km run around the city which took in the large football stadium.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1778350311\" target=\"_blank\">Santa Cruz run Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>We spent most of the day here. At the end, Ben and Jessica played football on a inflatable, water pitch. Ben made a Spanish football friend for a bit. Quite interesting to see the both of them communicate in their opposite broken language.<\/p><p>We made our way home and Daddy cooked us up a nice BBQ, whilst we chilled in the hot tub.<\/p><img src='images\\years\\2018\\2018_08_17-11-Tenerife_3-SantaCruz.jpeg' class='diaryImage' alt='Playing the locals at water football' \/><p class='diaryImageCaption'>Playing the locals at water football<\/p>","images":false},"title":{"value":"Tenerife Holiday - 3 - Santa Cruz"},"version":5},{"date":{"d":16,"m":8,"y":2018},"datev":20180816,"first":{"value":null},"images":4,"info":{"content":"<p>We left our villa in La Tejita and drove up and up and up again to Mount Tiede. Tenerife all came about from the Volcano Tiede. It must have been an hour's drive, winding our way up. There were no flats and no downhills. It was just up. If we did have the Fiat 500, then we would not have made it. The Clio struggled with the 5 of us in it! There were some stunning views. Us children were stunned that we could drive above the clouds. We stopped a few time to take pictures. Our final destination was the last 500m and the cable car to the top. It was scorching hot. Unfortunately, we needed to book in advance to ride the cable car. No one was that gutted, having seen the length of the queue and the cost. We instead climbed a hill just to the other side.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1776734374\" target=\"_blank\">Route on Mt. Tiede\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_16-10-Tenerife_2-MountTiede-PlayaDeLaTejita-ElMedano.jpg' class='diaryImage' alt='Looking from Mount Tiede' \/><p class='diaryImageCaption'>Looking from Mount Tiede<\/p><img src='images\\years\\2018\\2018_08_16-20a-Tenerife_2-MountTiede-PlayaDeLaTejita-ElMedano.jpeg' class='diaryImage' alt='Mount Tiede' \/><p class='diaryImageCaption'>Mount Tiede<\/p><p>We descended and a few miles down we stopped for a picnic lunch. We were still above the clouds and the sun was 'El Scorchioo'. On our way back to the villa we stopped at a supermarket for supplies and then hit the swimming pool at the villa.<\/p><p>Later in the afternoon we hit the beach, our local beach. It was 600 metres away. It was a course sandy beach and with the strong wind, it made for an unpleasant walk as the sand whipped around our ankles. With wind, comes bigger waves. The sea water was the warmest we've experienced ever. We were having such fun battling the waves. In the end, Ben got himself wedged into the sand and a wave came over him and he bent his back under the water. He was hurt and we had to return back to the villa. Great fun.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1776817600\" target=\"_blank\">Route down to Playa De La Tejita\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>After some dinner, we headed out to the local big town, El Medano, a couple of miles down the road. We walked around the town, down to the sea front. A lovely walk.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1777031496\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_16-30a-Tenerife_2-MountTiede-PlayaDeLaTejita-ElMedano.jpeg' class='diaryImage' alt='El Medano Family shot' \/><p class='diaryImageCaption'>El Medano Family shot<\/p><img src='images\\years\\2018\\2018_08_16-58-Tenerife_2-MountTiede-PlayaDeLaTejita-ElMedano.jpeg' class='diaryImage' alt='El Medano quay side' \/><p class='diaryImageCaption'>El Medano quay side<\/p>","images":false},"title":{"value":"Tenerife Holiday - 2 - Mount Tiede, Playa De La Tejita, El Medano"},"version":3},{"date":{"d":15,"m":8,"y":2018},"datev":20180815,"first":{"value":null},"images":2,"info":{"content":"<p>For once we had a sensible take off time in the afternoon, so drove to Gatwick and parked in our normal 'housing estate' car parking spot in Carlton Tye, Horley. We caught the bus into the South terminal, then the 4.5 hour BA flight to Tenerife's South Airport. We landed on time, got our luggage, but then the wallet was dropped with about 30 coins rolling out in all directions! Then the rental car was sought after and that's when the real fun began!<\/p><img src='images\\years\\2018\\2018_08_15-02-Tenerife_1-Arrival.jpg' class='diaryImage' alt='Gatwick travelators. Always fun' \/><p class='diaryImageCaption'>Gatwick travelators. Always fun<\/p><woops woopstitle=\"Within 30 minutes of landing the police were threatened to be called\" rating=\"3\"><p>Mummy had booked a 5 seater car as it clearly stated on the email. We arrived at our car and it was a Fiat 500. A small, four seater car. Oh dear. Houston we have a problem. So Daddy went back to the airport terminal to get a 5 seater car. The Europcar lady behind the counter basically wasn't having any of it and said that's the type of car provided for that booking. Daddy pointed out that the sales said we should get a 5 seater car and it would be illegal for the 5 of us to go in the Fiat as it only had 4 seat belts. The Europcar lady replied when asked Daddy said there were only 4 people. Daddy called her a liar, because he hadn't said that. The voices were raised and anger displayed from both parties. At the 'liar' accusation the lady threatened to call the police. Daddy welcomed, this and invited her to do so. Daddy wasn't going away! The lady turned to her next customer, who was listening to this and served them for the next 10 minutes. Daddy waited patiently. After dealing with the customer, Daddy asked where the police were, so the matter could be dealt with...... she hadn't called them. Daddy said she had therefore lied again! Eventually she allowed the use of her phone (which was not available) so Daddy could speak to customer services. They agreed straight away and after a 10 minute heated discussion between the Europcar Lady and Europcar Customer Services, we were granted a 5 seater, Renault Clio! The Europcar Lady still wouldn't have it, and expressed that we should pay more for a 5 seater car. Daddy responded that you shouldn't falsely advertise. The whole getting the car thing took an hour out of our holiday.<\/p><img src='images\\years\\2018\\2018_08_15-05-Tenerife_1-Arrival.jpg' class='diaryImage' alt='Fiat 500 anyone?' \/><p class='diaryImageCaption'>Fiat 500 anyone?<\/p><\/woops><p>This little incident made us late meeting up with our contact at the villa. It was dark now. We did eventually meet up and the villa was lovely. It had a bed for each of us, a hot tub and a shared, big, swimming pool. We got some local food and it was time for bed.<\/p>","images":false},"title":{"value":"Tenerife Holiday - 1 - Arrival"},"version":3},{"date":{"d":12,"m":8,"y":2018},"datev":20180812,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy ran in the Hart 4 with a strong number of Flyers. It was 4 in a team (Daddy, James, Peta and Oli). There was a 4km lap and they had 4 hours to see how many they could do. Daddy ran 3 laps.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1766770770\" target=\"_blank\">Hart 4 Lap 1 Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><a href=\"https:\/\/www.strava.com\/activities\/1766971795\" target=\"_blank\">Hart 4 Lap 2 Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><a href=\"https:\/\/www.strava.com\/activities\/1767139669\" target=\"_blank\">Hart 4 Lap 3 Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_08_12-00-Hart4.jpg' class='diaryImage' alt='Hart 4' \/><p class='diaryImageCaption'>Hart 4<\/p>","images":false},"title":{"value":"Hart 4"},"version":0},{"date":{"d":9,"m":8,"y":2018},"datev":20180809,"first":{"value":null},"images":1,"info":{"content":"<p>After 37 hours of work, Daddy finally got his coaching certificate<\/p><img src='images\\years\\2018\\2018_08_09-01-FALevel1_Coaching_Certificate.jpg' class='diaryImage' alt='FA Level 1 Coaching Certificate' \/><p class='diaryImageCaption'>FA Level 1 Coaching Certificate<\/p>","images":false},"title":{"value":"FA Coaching Certificate"},"version":3},{"date":{"d":6,"m":8,"y":2018},"datev":20180806,"first":{"value":null},"images":4,"info":{"content":"<p>A friend from church worked at parliament for an MP and was able to give Daddy and Ben a tour around the place. First, they went up by train (£42) to Waterloo. Ben directed, with his new phone, them to the Imperial War museum. They continued touring around where they had left off 6 month ago. Mainly they saw the floor on the conflicts since 1945.<\/p><img src='images\\years\\2018\\2018_08_06-02-LondonBen.jpg' class='diaryImage' alt='Imperial War Museum' \/><p class='diaryImageCaption'>Imperial War Museum<\/p><p>The pair got lunch and ate it on the wall of the Thames looking on to the Houses Of Parliament, watching all the tourists go by. After, they walked around Parliament Square looking at all the statues and onto Westminster Abbey.<\/p><img src='images\\years\\2018\\2018_08_06-11-LondonBen.jpg' class='diaryImage' alt='Lunching by parliament' \/><p class='diaryImageCaption'>Lunching by parliament<\/p><p>2pm and they made it to Portcullis House, got security screened and met up with James. He's a church friend who works for Gary Streeter MP. He happens to be the chairman of the Christians In Politics group, which James helps on. James's degree in Politics and Theology means this is the perfect job it would seem. However, after 5 years he leaving to train as a vicar.<\/p><p>James first led us through a tunnel, under Westminster Bridge Road, which we didn't realise existed. He began by taking us to Westminster Hall, the only original part of Parliament after the fire in 1834. Through St. Stephens Hall and into the Central Lobby. We first turned right towards the Lords end of Parliament. Everything is red and gold. It was very interesting to hear the stories and protocol. We headed towards the Commons next. At first I thought this was big, then thought how small it was to house 650 MPs. It was interesting to the galleries which you don't see on the TV. Again some interesting points of fact. After an hour and a half we ended back up at Westminster Hall and thanked James very much for his time.<\/p><img src='images\\years\\2018\\2018_08_06-18-LondonBen.jpg' class='diaryImage' alt='Westminster Hall' \/><p class='diaryImageCaption'>Westminster Hall<\/p><p>We caught a bus and briefly got off at Trafalgar Square. Ben was very pleased to see London again. Because of Katie's anxiety over London we generally don't go up much these days. Ben loves it. They continued on the bus past Piccadilly Circus and up Regents Street. They disembarked went in the Bose shop and visited all 5 floors of Hamleys. Harry Potter and Lego are still the big sellers. They walked through Carnaby Street, visiting some sports shops before hitting Nike Town at Oxford Circus. The initial purchase was made for a school bag. We then went into many other sports shops. Ben loved it as there were all the shops he could hope for, and they were all the flagship outlets, which meant they were big. Time was marching on and they were both fatigued from their excursion. A tube ride took them back to Waterloo. They were then able to train it back home.<\/p><img src='images\\years\\2018\\2018_08_06-12-LondonBen-COLLAGE.jpg' class='diaryImage' alt='Various London bits' \/><p class='diaryImageCaption'>Various London bits<\/p>","images":false},"title":{"value":"Parliament Tour, Imperial War Museum, Oxford Street retailing"},"version":2},{"date":{"d":5,"m":8,"y":2018},"datev":20180805,"first":{"value":null},"images":3,"info":{"content":"<p>Ben turned into a teenager today. We woke late and began the present opening process. Well there weren't many of your traditional presents, mainly cards with money in it!<\/p><p>As a treat we went to Farnborough Gate McDonalds to have some breakfast. Ben had pancakes with maple syrup with orange juice. His favourite.<\/p><img src='images\\years\\2018\\2018_08_05-00-Ben13thBirthday.jpg' class='diaryImage' alt='All sorts of things on Bens Birthday' \/><p class='diaryImageCaption'>All sorts of things on Bens Birthday<\/p><p>We shortly went up to London for a surprise treat. We parked up at the Queen Elizabeth Olympic park and went to the ArcelorMittal Orbit, the big red, scaffolding looking structure next to the stadium. First we had a picnic next to the 'Orbit'. We had booked to go on the slide. It takes about 45 seconds to go down it. It was very quick.<\/p><img src='images\\years\\2018\\2018_08_05-37-Ben13thBirthday.jpg' class='diaryImage' alt='The ArcelorMittal Orbit' \/><p class='diaryImageCaption'>The ArcelorMittal Orbit<\/p><img src='images\\years\\2018\\2018_08_05-46-Ben13thBirthday.jpg' class='diaryImage' alt='The slide' \/><p class='diaryImageCaption'>The slide<\/p><p>We rushed back to host Ben's football birthday party. Dad had made some points based system, with 3 football matches, a game of World Cup and a penalty shoot out. There were 7 others: Oli, Kieran, Jamie C, Freddie, Jayden, Jonny and Joey. After we came back home, had pizza and played in the pool.<\/p><p>In the evening Ma Ma and Pop Pop popped over, then the 5 of us watched Ben's choice of film, Mission Impossible 5.<\/p>","images":false},"title":{"value":"Ben's 13th Birthday"},"version":0},{"date":{"d":30,"m":7,"y":2018},"datev":20180730,"first":{"value":null},"images":6,"info":{"content":"<p>We left on Saturday down to Wareham to the campsite we went to 2 years ago. We left Daddy at home!<\/p><ul><li>Saturday: camp setup<\/li><li>Sunday: Rained all day. We went to Auntie Charlotte's and watched a film<\/li><li>Monday: Lyme Regis\u000a<img src='images\\years\\2018\\2018_07_30-04-WarehamCamping_Day3-LymeRegis.jpg' class='diaryImage' alt='Us and our cousins' \/><p class='diaryImageCaption'>Us and our cousins<\/p><\/li><li>Tuesday: Wild swim and Puddletown tea shop<\/li><li>Wednesday: Camp, swimming pool and Swanage fireworks<\/li><li>Thursday: Studland Bay\u000a<img src='images\\years\\2018\\2018_08_02-07-WarehamCamping_Day6-StudlandBay.jpg' class='diaryImage' alt='Jessica paddle boarding' \/><p class='diaryImageCaption'>Jessica paddle boarding<\/p><\/li><li>Friday: Dancing ledge sunrise, Mud park, Durdle Door\u000a<img src='images\\years\\2018\\2018_08_03-20-WarehamCamping_Day7-SunriseAndMudAndDurdleDoor.jpg' class='diaryImage' alt='Jessica through the mud course' \/><p class='diaryImageCaption'>Jessica through the mud course<\/p><img src='images\\years\\2018\\2018_08_03-23-WarehamCamping_Day7-SunriseAndMudAndDurdleDoor.jpg' class='diaryImage' alt='The boys and Durdle Door' \/><p class='diaryImageCaption'>The boys and Durdle Door<\/p><img src='images\\years\\2018\\2018_08_03-24-WarehamCamping_Day7-SunriseAndMudAndDurdleDoor.jpg' class='diaryImage' alt='The girls at Durdle Door' \/><p class='diaryImageCaption'>The girls at Durdle Door<\/p><\/li><li>Saturday: Home time\u000a<img src='images\\years\\2018\\2018_08_04-04-WarehamCamping_Day8-Packup.jpg' class='diaryImage' alt='Hello campers' \/><p class='diaryImageCaption'>Hello campers<\/p><\/li><\/ul>","images":false},"title":{"value":"Wareham Camping for the week"},"version":0},{"date":{"d":29,"m":7,"y":2018},"datev":20180729,"first":{"value":null},"images":8,"info":{"content":"<woops woopstitle=\"Possibly worst bike ride ever\" rating=\"5\"><p>This is a bit of a sob story. Not sure whether to laugh or cry. Myself and Michael had entered the Prudential Ride 100. A 100 mile bike ride, starting and ending in London. As a back-drop to this, I had not done any distance training, and I had the Thursday and Friday off work due to feeling rundown, sore throat and a headache. So going into this I was concerned about my overall physical state.<\/p><p>We had to register on the Saturday at Excel. The traffic around to the opposite end of the M25 meant it was touch and go whether we'd make the 5pm deadline. The journey involved going in Michael's mobile gas chamber. There is a fault, such that exhaust fumes go into the car, so we had to roll the windows down. With just a few minutes to spare, we dumped the car in a pub car park close by, hoping we wouldn't get clamped. We got in just in time. Even managed to get some cheeky photos in.<\/p><img src='images\\years\\2018\\2018_07_29-03-PrudentialRide100.jpg' class='diaryImage' alt='At the show' \/><p class='diaryImageCaption'>At the show<\/p><p> We made our way to the hotel, 'rebuilt' our bikes and watched the Tour De France highlights. After, I went out to the supermarket to get some supplies from Tesco. Got on the bike went around a bend and almost fell off. Rear puncture! Great one of my two inner-tubes used up before I'd even started! Eventually rode the 1.5 mile trip past Excel to a Tesco Express. There were a lot of people shopping and milling about outside. I was a little nervous at leaving the bike right outside, so wheeled it down a barrier'ed slipway to a car park. I went in got yogurt, milk and some fruit. I was panicking a bit, so quickly went out to check. The bike was still there. I went back in again to pay for the shopping. Must have been 2 or 3 minutes. GONE. Bike was nicked.<\/p><img src='images\\years\\2018\\2018_07_29-29-PrudentialRide100.jpg' class='diaryImage' alt='Where has my bike gone. Site of crime!' \/><p class='diaryImageCaption'>Where has my bike gone. Site of crime!<\/p><p>I knew there was no chance finding it. It would have been long gone. I did look around, but nothing. I wasn't so worried about the bike so much, but it had my timing chip on it and the bracket \/ clips for my lights which are going to be hard to replace. Also, what was I going to tell Michael? I started the long trudge back to the hotel and was resigned to the face I wasn't going to do the ride. It was now 9:30pm, I entered the hotel and told Michael what had happened. After he stopped laughing, he hatched a plan which would involve driving 1h 45 minutes back to Alton to pick up his spare bike and drive all the way back again. So windows down in the car for a 3.5 hour round trip plus a bit extra as the bike had no pedals and needed a tweak here and there.<\/p><p>On returning back, I managed somehow to lose the hotel entry card. So we needed to call the receptionist, issue us a new card. We just needed our beds. As soon as we got in our room, I went to the toilet and pressed what I thought was the cord for the light switch. As it was a disabled toilet, it wasn't a cord for the light switch, instead it was the emergency cord! Oh dear. A mini-siren sounded, a flashing red light out the room and the receptionist running towards us. Again this is 2:30 in the morning! After apologising and setting the phone alarm for 2 hours 10 minutes time we finally went to sleep.<\/p><p>4:40am and the alarm went off. What were we doing? Gulped some breakfast down, managed to lose the second of our room cards, and took our stuff out to the car. Michael hid his car key on the tyre of the car, misjudged it and the keys clattered inside the wheel. We just left it for now as we were running behind schedule. The weather was a little nippy as we rode the 6 miles to the start line. The scale of the operation was vast. 29,000 riders all starting from the same area. Myself and Michael, not only had different start times, but also were starting at opposite ends of the Queen Elizabeth Park. So I decided to try and sneak in and start with the 'Greens' at the earlier time.<\/p><p>It was 7:05am and we were finally off. It was nice to get going finally. Within 15 minutes the heavens opened and for the next 8 hours it rained and rained. We hooked on to some fast trains as we snaked our way through London and finally out into the countryside. My 'new' bike was great. Loved it. The seat post needed adjusting, but otherwise the ride was much better than my Giant Defy.<\/p><img src='images\\years\\2018\\2018_07_29-12-PrudentialRide100.jpg' class='diaryImage' alt='To the Tower' \/><p class='diaryImageCaption'>To the Tower<\/p><p>Michael picked up a puncture around the Byfleet area. The stop and the rain made us a little cold so we stopped in for a coffee. We got to Newlands Corner and stopped for a bit, before heading down the fast descent down towards Gomshall. As I raced down, Pssstttt. A wobbly front wheel made me almost lost control as I had a blow out. Damm it, another puncture.<\/p><img src='images\\years\\2018\\2018_07_29-14-PrudentialRide100.jpg' class='diaryImage' alt='Puncture going down Newlands Corner' \/><p class='diaryImageCaption'>Puncture going down Newlands Corner<\/p><p>My turn. We must have spent over 30 minutes trying to sort this out. We had a problem. We changed the tube, pumped it up and as we unscrewed the pump, the valve unscrewed with, making the air come all out. We must have tried 2 or 3 times. It really is exhausting stuff trying to get enough pressure into the tubes. Michael ingenious idea was to tighten the valve to the inner-tube by trapping it in the rear axel with the use of the quick release. This worked a treat and finally we pumped the tyre again, and off we went. Better still there was a track pump just up the road to get me up to the ideal pressure. Also a chap sold his spare inner tube as we had none between us and we hadn't much luck so far. Then down the next hill again and Pssssttttt. Arrrrgghhhh. Another puncture in the same wheel. Something fishy going on now. The tyre sidewall had eroded a bit. We worked out that the brake block was set too low and was rubbing against the tyre, causing the punctures. We happened to fix the puncture at the bottom of the road leading to Netley House, my company's old premises. Again quite a time was spent re-enforcing the tyre with a gel and getting the tyre pumped up. It was still hammering down with rain. Again we were down to no spare inner-tubes between us and now I couldn't use the front brake. We were just entering the really hilly section now!<\/p><img src='images\\years\\2018\\2018_07_29-15-PrudentialRide100.jpg' class='diaryImage' alt='At this point, chucking the bike in the hedge was looking appealing' \/><p class='diaryImageCaption'>At this point, chucking the bike in the hedge was looking appealing<\/p><p>We were diverted past Leith Hill as someone had a heart attack and CPR was being administered by the paramedics. That explained the various ambulances and medical vehicles screaming passed us. I found a track pump, but rather than making things better it made them worse as all the air escaped. It was a rubbish pump. I managed to get back to 40 psi, but it was less than half inflated. It was slow going through Dorking due to the traffic. The organisers had shut Box Hill due to an accident. So we avoided both main hills and it meant we were only going to do 90 miles, not 100. At the next stop there was a bike shop. Yippee.. I managed to get full pressure again in my tyre, but they had sold out of inner tubes. With 25 miles to go we hit another blockage in the road at Leatherhead.<\/p><img src='images\\years\\2018\\2018_07_29-17-PrudentialRide100.jpg' class='diaryImage' alt='Held up in Leatherhead' \/><p class='diaryImageCaption'>Held up in Leatherhead<\/p><p>The rest of the journey back to London was quite pleasurable. The weather started to clear and as I hadn't actually felt we had started, I had plenty of energy to push some pace. We finished at goodness knows in what time. It was largely irrelevant.<\/p><img src='images\\years\\2018\\2018_07_29-22-PrudentialRide100.jpg' class='diaryImage' alt='Finishing down The Mall' \/><p class='diaryImageCaption'>Finishing down The Mall<\/p><img src='images\\years\\2018\\2018_07_29-27-PrudentialRide100.jpg' class='diaryImage' alt='The Medal shot' \/><p class='diaryImageCaption'>The Medal shot<\/p><p>We collected our medals, took some photo's and headed back to City Airport. However, we were determined to do 100 miles. Considering we had done 6 extra miles to get to the start line, we decided to ride back to Tower Hill and catch the DLR. I made it back home at 8pm. What a journey the past 28 hours were. Because my timing chip was stolen it hadn't counted officially, so that means I got to do it again another year. I'm chasing the London Classic medal.\u000a<\/p><a href=\"https:\/\/www.strava.com\/activities\/1739819086\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/woops>","images":false},"title":{"value":"Prudential Ride 100"},"version":5},{"date":{"d":26,"m":7,"y":2018},"datev":20180726,"first":{"value":null},"images":1,"info":{"content":"<p>Summer came over to stay, whilst Jessica went over to the Teale's. Jess went to the beach at Bluewater.<\/p><p>The majority went over to Fiona's and played in their pool along with Helen and Guy.<\/p><img src='images\\years\\2018\\2018_07_26-05-Burrows.jpg' class='diaryImage' alt='Mummy subjected to an attack' \/><p class='diaryImageCaption'>Mummy subjected to an attack<\/p>","images":false},"title":{"value":"Summer here - over to Burrows, Jess to the Teale's "},"version":1},{"date":{"d":25,"m":7,"y":2018},"datev":20180725,"first":{"value":null},"images":3,"info":{"content":"<p>Katie turned 15 today. Shock, horror, the standard format of eating breakfast in Mummy and Daddy's bed has been temporarily postponed! The present opening did happen. And there were loads. The main present was her new IPhone7+. Katie was mightily pleased after begging for one for months.<\/p><p>After the present opening, we all went into Camberley and surprised Katie by going in Frankie and Benny's for breakfast. We were just about the only ones there, but we had a nice time nonetheless. We all sang happy birthday after having polished off our brekkie.<\/p><img src='images\\years\\2018\\2018_07_24-1-Morning08-Katie15thBirthday.jpg' class='diaryImage' alt='Frankie And Benny's for breakfast' \/><p class='diaryImageCaption'>Frankie And Benny's for breakfast<\/p><p>When we returned Auntie Charlotte came over with Lenny. She took Katie and Jessica out to get their nails done and buy them a subway lunch in Camberley. Whilst the birthday girl was out, the rest of us dressed up the back garden with banners and got the bouncy castle up and running. A couple of Katie's friends popped in to give presents and say happy birthday.<\/p><p>At about 4:30pm our guests began to arrive for a party. The guests included the Elders, the Fars, Ma Ma and Pop Pop. We ordered in Dominos Pizzas and had lots of goodies to eat, including a birthday cake. The party was in full flow and somebody suggested we make a circuit up which included the bouncy castle and running or walking it blindfolded. It was like the ministry of funny walks. It was very funny to see peoples attempts. Ma Ma almost dug into next doors garden! That entertained us for almost an hour!<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/-cT1OKnHqCA\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><img src='images\\years\\2018\\2018_07_24-2-Party11-Katie15thBirthday.jpg' class='diaryImage' alt='Singing happy birthday as Katie blow birthday cake candles out' \/><p class='diaryImageCaption'>Singing happy birthday as Katie blow birthday cake candles out<\/p><p>One of Katie's bucket list items was to sleep under the stars. Most of us stayed behind and gave it a go. However, there were a lot of mozzies about. Many of the adults gave up some part of the night, but all the children managed to last till dawn. Katie had a really good birthday.<\/p><img src='images\\years\\2018\\2018_07_24-4-Bedtime01-Katie15thBirthday.jpg' class='diaryImage' alt='Sleeping under the stars' \/><p class='diaryImageCaption'>Sleeping under the stars<\/p>","images":false},"title":{"value":"Katie's 15th Birthday"},"version":4},{"date":{"d":22,"m":7,"y":2018},"datev":20180722,"first":{"value":null},"images":4,"info":{"content":"<p>We headed towards Cullompton and Diggerland, Devon. Daddy was a little worried at the target age group for this attraction. There weren't many cars in the car park at 11am. Still we eventually got in after a bit of admin trouble from our end concerning vouchers. There were a dozen or so rides and things to do. We enjoyed them all. Jessica and Katie drove a Land Rover and a JCB for their first times. Daddy even drove a JCB for the first time. Jessica was pretty competent for a first attempt. She wasn't phased at all.<\/p><p>We had a go at using the claw and actually digging a hole in a JCB, as well as some games in mini diggers. Quite difficult controlling the arm and claw. Ben was enamoured by the 'Crazy Carts'. Small, electric powered carts with trolley wheels. He wanted one for home!<\/p><p>We tried everything out and made our way home to end a lovely, family weekend.<\/p><img src='images\\years\\2018\\2018_07_22-10-Diggerland.jpg' class='diaryImage' alt='Placing tyres' \/><p class='diaryImageCaption'>Placing tyres<\/p><img src='images\\years\\2018\\2018_07_22-20-Diggerland.jpg' class='diaryImage' alt='Tip trucks' \/><p class='diaryImageCaption'>Tip trucks<\/p><img src='images\\years\\2018\\2018_07_22-29-Diggerland.jpg' class='diaryImage' alt='Jessica digging for gold' \/><p class='diaryImageCaption'>Jessica digging for gold<\/p><img src='images\\years\\2018\\2018_07_22-34-Diggerland.jpg' class='diaryImage' alt='Mummy v Katie 10-pin bowling' \/><p class='diaryImageCaption'>Mummy v Katie 10-pin bowling<\/p>","images":false},"title":{"value":"Torquay Weekend: Diggerland"},"version":1},{"date":{"d":21,"m":7,"y":2018},"datev":20180721,"first":{"value":null},"images":6,"info":{"content":"<p>This was Daddy's birthday treat. We were heading down to Torquay for the weekend. Of course on the way we had to stop off at a parkrun. Montacute House is National Trust venue which hosts the Yeovil parkrun. It was double hot as Daddy went on his own around the 5km course. There were plenty of sheep, some there I am sure to trip you up by running right across the traffic of parkrunners. Daddy came in at 26:45 which he was pleased about.<\/p><img src='images\\years\\2018\\2018_07_21-02-Coasteering.jpg' class='diaryImage' alt='Montacute House' \/><p class='diaryImageCaption'>Montacute House<\/p><p>Onwards to Torquay, more specifically Oddicombe Beach where we stopped off for a spot of lunch on the pebbles. We then walked along the coastal path to Babbacombe beach and then up the 30% gradient road back to the car.<\/p><img src='images\\years\\2018\\2018_07_21-55-Coasteering.jpg' class='diaryImage' alt='Jessica on the way to Babbacombe Beach' \/><p class='diaryImageCaption'>Jessica on the way to Babbacombe Beach<\/p><p>We were advised to come up the wrong way up a one way street because the other access was shut...... well we were slightly mis-advised as the road had re-opened. Needless to say we faced an oncoming car. Whoops.<\/p><p>We met Charlie, our guide for the coasteering session. We squeezed into our wet suits and buoyancy aids and headed down into Anstey Cove. It was a reasonably quiet and secluded cove with no obvious public access. We climbed around the fence and jumped in. Katie stood on the sidelines not sure about what was ahead so dipped out of this one.<\/p><p>The rest of us spent the next two hours swimming from rock to rock to cliff and jumped off various ledges and boulders. Some high and some not so high. There were a couple that Mummy, Daddy and Jessica were unsure about. However, we all managed the jumps in the end. Poor Ben got stung a couple of times by a Compass Jellyfish. You could see them from the ledges in their bright orange clothes!<\/p><p>We got some great photos from the experience. One that comes highly recommended.<\/p><img src='images\\years\\2018\\2018_07_21-108-Coasteering.jpg' class='diaryImage' alt='The coasteering crew' \/><p class='diaryImageCaption'>The coasteering crew<\/p><img src='images\\years\\2018\\2018_07_21-61-Coasteering.jpg' class='diaryImage' alt='Group jump' \/><p class='diaryImageCaption'>Group jump<\/p><img src='images\\years\\2018\\2018_07_21-60-Coasteering.jpg' class='diaryImage' alt='Rock climbing' \/><p class='diaryImageCaption'>Rock climbing<\/p><p>We then headed to our hotel. A Travelodge near Exeter on the M5. We got ourselves cleaned up and then headed out again for Fish and Chips..... as well as an Indian for mummy. We then drove to the River Exe and ate them on picnic benches.<\/p><img src='images\\years\\2018\\2018_07_21-103-Coasteering.jpg' class='diaryImage' alt='River Exe'ing' \/><p class='diaryImageCaption'>River Exe'ing<\/p>","images":false},"title":{"value":"Torquay Weekend: parkrun and Coasteering"},"version":1},{"date":{"d":15,"m":7,"y":2018},"datev":20180715,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy and Ben went to Frimley Lodge park for the Frimley Flyers Handicap event. The competition rules were very different. This year who had to predict a time that you were going to run 5km, and then without a watch or any timing device had to run that time. Ben had chosen to run 26 minutes and Daddy 27 minutes dead.<\/p><p>We were all let go in intervals, in theory we all cross the line together. Out of the thirty two running, Ben was just 7 seconds slower than his predicted time. Daddy was 5 seconds too quick and came in 7th and 6th respectively. Bob and Alfie were spot on with their predictions and were joint winners.<\/p><p>After, we went over to the BBQ pits and had a BBQ, prize giving and a game of rounders. By this stage Mummy and Jessica had joined us. Daddy scored the winning rounder!<\/p><img src='images\\years\\2018\\2018_07_15-23-FrimleyFlyersHandicap.jpg' class='diaryImage' alt='Flyers at our handicap event' \/><p class='diaryImageCaption'>Flyers at our handicap event<\/p>","images":false},"title":{"value":"Frimley Flyers Family Handicap BBQ"},"version":0},{"date":{"d":14,"m":7,"y":2018},"datev":20180714,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy and Ben did Frimley Lodge parkrun in 26 minutes.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1701551794\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>Charlotte came over to stay for the weekend and we all decided to use the Wild Swim book she got us. There was a reservoir over in Ceasers Camp. It was a long walk to get there and once we did we found it was out of bounds to swimmers! Gutted.<\/p><img src='images\\years\\2018\\2018_07_14-02-FailedWildSwimCasesarsCamp.jpg' class='diaryImage' alt='The unlucky would be swimmers' \/><p class='diaryImageCaption'>The unlucky would be swimmers<\/p>","images":false},"title":{"value":"parkrun, Failed Wildswim, Charlotte stay over"},"version":0},{"date":{"d":13,"m":7,"y":2018},"datev":20180713,"first":{"value":null},"info":{"content":"<p>Katie, Ben and Jessica all go to the trampolining club every Monday. Tonight was the end of season competition. Jessica was placed in a higher ability group than Ben and was awarded a bronze for her performance.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/2CONaLGWudg\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><p>Ben was awarded a gold medal for his jump.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/uiyDE_spSnQ\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Ben and Jess in Trampolining Competition"},"version":0},{"date":{"d":11,"m":7,"y":2018},"datev":20180711,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica has been going to the acting group for about 5 months. Each week she has been practicing her lines and role as Lord Capulet, Juliet's Father. She did every so well with her lines. She must have had 20 or so. Auntie Ellie, Joey, Lily and Farmor all came to watch too. The production, at Camberley Theatre last for about 40 minutes and all the actors were 13 or younger. Katie's friend Katherine was part of the production staff. Well done Jessica.<\/p><p>The boys rushed back to watch the England game in the semi final of the World Cup.<\/p><img src='images\\years\\2018\\2018_07_11-19-JessicaRomeoAndJulliet.jpg' class='diaryImage' alt='Jessica as Lord Capulet' \/><p class='diaryImageCaption'>Jessica as Lord Capulet<\/p>","images":false},"title":{"value":"Romeo and Juliet - Jessica"},"version":1},{"date":{"d":10,"m":7,"y":2018},"datev":20180710,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy turns 43 today. We made breakfast for him in bed and gave him his presents. From Mummy we are going on a Coasteering weekend in a couple of weeks time. From Ben, Daddy got a bumper Tour De France pack which included a big magazine, water bottle, socks and energy tablets. Katie got some veg crisps, Marmite crisps and a nice t-shirt. Jessica got Daddy a nice new belt. From the Elders Daddy got some 3 peaks bits, Susan got Dad some nice swim shorts and beer preserve.<\/p><p>In the evening we had a lovely Lasagne, one of Dad's favourites and he relaxed watching the France v Belgium World Cup semi final match.<\/p><img src='images\\years\\2018\\2018_07_10-03-Martin43rdBirthday.jpg' class='diaryImage' alt='Daddy opening 43rd birthday presents' \/><p class='diaryImageCaption'>Daddy opening 43rd birthday presents<\/p>","images":false},"title":{"value":"Daddy's 43rd Birthday"},"version":1},{"date":{"d":9,"m":7,"y":2018},"datev":20180709,"first":{"value":null},"info":{"content":"<p>So things have moved fast. Today all five of us went to the Eating Disorder clinic in Epsom where we had a 3 hour meeting talking about Katie's condition. They were assessing whether they would take us on for a 6 week course of treatment which largely involves giving advice and helping Katie get back to a healthy weight. The meeting involved the Nurse, a psychiatrist and a student nurse. In fact Mummy knew the psychiatrist from a talk she gave a few weeks previous on the very subject matter. The nurse also lived in Mytchett and had a son who goes to Tomlinscote and is in the same year!<\/p><p>It was very hard to hear Katie's account. It boils down to body image. The trigger point happened in February. A number of contributing factors include: Being called fat by one of her friends, body image pressure, looking up to friends who have a thin figure, seeing on the internet that you shouldn't eat after 7pm, sometimes bored after school, thinking we were too poor to buy food and probably lots of other things. Daddy cried in the meeting - when Katie was out of the room, it distressed him greatly. Mummy was obviously very concerned and anxious as well. Jessica and Ben contributed as well in the meeting and had a role to play.<\/p><p>We were told that BMI was not used as a measure in children. Instead they use some other height vs weight measurement. It was expressed that 100% is a normal, healthy weight. They recommend children should be between 95% and 105%. At 80% they recommend that the child should be taken out of school. Katie was just above that at 81%. Very concerning. The solution was simply to load calories. Avoid anything that takes away the calories such as exercise. 3000 calories was suggested. 3 meals a day, 3 snacks a day and a pint of 3% fat milk (blue top).<\/p><p>The clinical team went away to meet and they agreed to take Katie on. Initially for a 6 week stint to get her weight back. After that, depending on how she is doing, some psychiatric treatment will be given.<\/p><p>It was quite a session, but at the end of it, we had acceptance from Katie and we felt we had a plan going forward.<\/p><p>After, we went into Kingston and went to Pizza Hut to eat the unlimited buffet. We walked around the shops and got a few bits and pieces for the house and bought the English version of Monopoly, after having the American version for so long.<\/p><p>WE LOVE YOU KATIE.<\/p>","images":false},"title":{"value":"Eating Disorder Clinic"},"version":2},{"date":{"d":8,"m":7,"y":2018},"datev":20180708,"first":{"value":null},"images":4,"info":{"content":"<p>Daddy joined Auntie Ellie, Rachel, Jon, Loz and Michael on a massive road trip around Britain, with a few mountains thrown in for fun too. They set off on Friday at about 5pm, arriving for a 5am start at Ben Nevis.<\/p><p>The mountaineering was tough. The challengers were certainly putting a sweat on. It was shorts and t-shirt weather even where the snow was and even at night. The weather was hot to say the least.<\/p><p>Driving<\/p><ul><li>Alton to Ben Nevis: 528 miles<\/li><li>3 Peaks Route: 463 miles<\/li><li>Snowdon to Alton: 252 miles<\/li><li>Total: 1,243 miles<\/li><\/ul><p>Mountains<\/p><ul><li>Ben Nevis<\/li><ul><li>\u000aStart Time: 5:01am - Peaked: 8:06am - End Time: 10:24am (Up: 3h 5m, Down: 2h 18m)<\/li><li><a href=\"https:\/\/www.strava.com\/activities\/1686092713\" target=\"_blank\">Ben Nevis Route\u000a    \u000a\u000a                <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/li><\/ul><li>Scafell Pike<\/li><ul><li>Start Time: 4:53pm - Peaked: 7:28pm - End Time: 9:35pm (Up: 2h 35m, Down: 2h 7m)<\/li><li><a href=\"https:\/\/www.strava.com\/activities\/1687997785\" target=\"_blank\">Scafell Pike Route\u000a    \u000a                \u000a                \u000a                \u000a                <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/li><\/ul><li>Snowdon<\/li><ul><li>Start Time: 2:20am - Peaked: 4:55am - End Time: 7:36am (Up: 2h 35m, Down: 2h 41m)<\/li><li><a href=\"https:\/\/www.strava.com\/activities\/1687998142\" target=\"_blank\">Snowdon Route\u000a    \u000a                \u000a                \u000a                \u000a                <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/li><\/ul><\/ul><p>The crew got back to Alton mid afternoon on the Sunday. Exhausted and barely able to walk, but satisfied of their weekend's achievements.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/H3it6UDKiHQ\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><img src='images\\years\\2018\\2018_07_07-24-3Peaks_02_ScafellPike.jpg' class='diaryImage' alt='Scafell Pike' \/><p class='diaryImageCaption'>Scafell Pike<\/p><img src='images\\years\\2018\\2018_07_07-32-3Peaks_01_BenNevis.jpg' class='diaryImage' alt='Ben Nevis' \/><p class='diaryImageCaption'>Ben Nevis<\/p><img src='images\\years\\2018\\2018_07_08-33-3Peaks_03_Snowdon.jpg' class='diaryImage' alt='Snowdon' \/><p class='diaryImageCaption'>Snowdon<\/p><img src='images\\years\\2018\\2018_07_08-21-3Peaks_03_Snowdon.jpg' class='diaryImage' alt='Snowdon - We did it' \/><p class='diaryImageCaption'>Snowdon - We did it<\/p><woops rating=\"6\" woopstitle=\"Secret Megaphone Evacuates Church\"><p>We went to church as usual, Mummy was on Sunday school. She was running late, so entered the church service and sat in one of the pews. For Sunday School she needed a microphone so the children could be interviewed. The nearest we had was Ben's megaphone which was accidentally left on. This unknown to anyone played havoc with the church's sound system and basically provided feedback. The feedback was so loud, the congregation were blocking their ears. Unknown to anyone the megaphone was the cause of this problem. Some stand in engineers were up on ladders, fiddling around with cables attempting to fix the problem. They even switched off the sound system and yet the feedback was still reverberating around the church. It was then decided that the service could not continue inside, so it was decided that the service should be held outside.<\/p><p>As Mummy went to leave the church to go outside with the others, she picked up the bag and all of a sudden the noise stopped for a bit, and the pitch of the squeal changed. At that point she knew the cause of the problem. The Megaphone!<\/p><p>Instead of owning up or even just removing the bag, mummy panicked and just left the bag inside the church and joined the service outside.<\/p><p>After 10 minutes Mummy had to leave the service to do Sunday school and made Auntie Charlotte go and get the bag which was in church. However, the men who were busy attempting to find the source of the problem were still there. Mummy told Charlotte to grab the bag and quickly escape. Instead, once the bag was moved it became very obvious to everyone the source of the problem! As no one knew her, she just owned up and said it was her sister's and then sheepishly sloped off. After Sunday school we all ran home without talking to anyone.<\/p><p>The parishioners  later were gossiping about the silly girl who brought a megaphone into church. I mean who would do a thing like that.<\/p><\/woops>","images":false},"title":{"value":"3 Peaks Challenge - Mummy Caused Church Evacuation with Megaphone"},"version":9},{"date":{"d":7,"m":7,"y":2018},"datev":20180707,"first":{"value":null},"images":1,"info":{"content":"<p>Whilst Daddy and the Elders were away doing the 3 peaks, Mummy looked after Toby, Lily and Joey. She took them to the RLC Army show at Deepcut. It was very hot. On the parade ground we saw motorbikes do a display. Toby loved that. We also had a go on the fairground for a bit. It was far too hot so came home shortly after.<\/p><p>Meanwhile Ben went with some Tomlinscoters up to Alton Towers. It was a trip for the well behaved. It was a reward for their efforts of the year. You didn't go unless you were a good boy or girl. Ben managed to go on just 4 rides, spending a lot of his afternoon in front of a big TV screen watching England beating Sweden in the World Cup quatre finals.<\/p><p>Back at home again, Mummy took us to the Hale Carnival with Ma Ma and Pop Pop.<\/p><img src='images\\years\\2018\\2018_07_07-04-RLCArmyShow.jpg' class='diaryImage' alt='Kaite at the RLC Army Show' \/><p class='diaryImageCaption'>Kaite at the RLC Army Show<\/p>","images":false},"title":{"value":"RLC Army Show, Ben to Alton Towers, Hale Carnival, Elders overnight to stay"},"version":4},{"date":{"d":6,"m":7,"y":2018},"datev":20180706,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica competed in three running races. She was the final runner in the relay and won!<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/ZawXp6FhBzo\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><img src='images\\years\\2018\\2018_07_06-02-JessicaSportsDay.jpg' class='diaryImage' alt='Jessica starting her race' \/><p class='diaryImageCaption'>Jessica starting her race<\/p>","images":false},"title":{"value":"Jessica's Sports Day"},"version":1},{"date":{"d":3,"m":7,"y":2018},"datev":20180703,"first":{"value":null},"images":1,"info":{"content":"<p>The highs and lows of being a parent. In the evening we went to an awards ceremony at Tomlinscote School. Pupils from all years of the school were present to pick up awards from different subject area. There were just two awards for maths in year 8. Ben won his for attainment. A fantastic achievement. He went onto the stage and received the award from the Head Of Maths and from a guest speaker. Well done Ben we are very proud of you.<\/p><img src='images\\years\\2018\\2018_07_03-02-BenTopOfYearMaths.jpg' class='diaryImage' alt='Ben receiving his award' \/><p class='diaryImageCaption'>Ben receiving his award<\/p><p>The previous day, Ben was selected to go on a Maths and Computing exercise over in Crowthorne. He didn't enjoy it very much. He likes to be thought of as a geek, but does not like all the other geeks because they are too geeky. Now that's logic that no-one understands.<\/p><p>Over the past couple of months, Katie's weight and diet has become a concern. The lack of food intake has been minimal and what is being consumed has all been healthy stuff. She has been having fruit for breakfast, skipping lunch at school (because she hasn't time) and then not eating much for dinner. No snacks either. Today and last night it all came to a head, and Mummy took her down to the GPs where she was diagnosed with Anorexia. She is 43kg and her height is 163.5cm. The GP has referred her on, and in 2 weeks we have a follow up appointment for bloods. Katie does not like speaking about it and has been in denial about it. Today, however, she recognises there is an issue and is positive about resolving it. She loves 'planning' at the moment. So we popped to Hobbycraft and purchased a large piece of card. Katie has looked up meals and snacks that she would like and has written them on cards. So for each day of the following week she knows what she is going to have at breakfast, lunch and dinner. She also has a snack card. She seems quite determined to follow the plan. She says she feels a lot happier and that she has turned over a new leaf. This week at shopping she went around the supermarket and got all the ingredients for the menu's she has devised. We are very proud how she wants to turn this around.<\/p>","images":false},"title":{"value":"Ben Top Of Year for Maths, Katie Anorexia"},"version":4},{"date":{"d":1,"m":7,"y":2018},"datev":20180701,"first":{"value":null},"images":4,"info":{"content":"<p>In the morning we made an early start on this gloriously sunny summer's day. We made our way down to the Mytchett lake where we swum. Daddy came for the first time, and I think we'll leave him behind because he was so slow and struggled to do 500 metres. Katie and Mummy whizzed around. Jessica even beat Daddy back. It was a busy lake. There must have been over 100 swimmers during the morning.<\/p><img src='images\\years\\2018\\2018_07_01-02-OpenWaterSwim.jpg' class='diaryImage' alt='Mytchett Mermaids and Mermen' \/><p class='diaryImageCaption'>Mytchett Mermaids and Mermen<\/p><p>After Mummy went to the early church service, we headed to Cookham, just the other side of Maidenhead for walk 101. Daddy loved his new walking boots. It was a very hot day. Katie has been converted to a walking lover, not a hater. DoE has changed her she said.<\/p><img src='images\\years\\2018\\2018_07_01-07-CookhamWalk100.jpg' class='diaryImage' alt='Holy Trinity Church, Cookham' \/><p class='diaryImageCaption'>Holy Trinity Church, Cookham<\/p><p>As it was what we thought was to be the 100th walk we decided to stop off for lunch at the Bounty pub half way around. It was only later that Daddy miss-calculated (really it was walk 101). Just to think walk number one was completed on 31 December 2010. 7.5 years later we get to 101! The walks have larger been taken from a number of children's walking books: London, Surrey, Hampshire and Berkshire. We still have 21 to complete before all the walks have been done in all the books.<\/p><p>After passing some cows who took refreshment in the Thames, we finished the walk hot and bothered and needed to get home for some ice lollies and iced water.<\/p><img src='images\\years\\2018\\2018_07_01-12-CookhamWalk100.jpg' class='diaryImage' alt='We met cows who went for a swim' \/><p class='diaryImageCaption'>We met cows who went for a swim<\/p><img src='images\\years\\2018\\2018_07_01-14-CookhamWalk100.jpg' class='diaryImage' alt='Daddy and Katie going through a farmers field' \/><p class='diaryImageCaption'>Daddy and Katie going through a farmers field<\/p><a href=\"https:\/\/www.strava.com\/activities\/1674273661\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Mytchett Mermaids and Mermen, Walk 101 - Cookham"},"version":1},{"date":{"d":30,"m":6,"y":2018},"datev":20180630,"first":{"value":null},"info":{"content":"<p>In the morning Daddy went with Ben to a very hot and well attended parkrun. 670 runners. They battled through the traffic and came in at 27 minutes.<\/p><p>Ellie was 40 today and to celebrate she hosted a BBQ with the invite list restricted to the Barnett family members. We had a good time playing in the back garden with the water. She got a Mini Clubman as a present from Michael!<\/p>","images":false},"title":{"value":"parkrun, Auntie Ellie's 40th BBQ"},"version":0},{"date":{"d":29,"m":6,"y":2018},"datev":20180629,"first":{"value":null},"images":2,"info":{"content":"<p>After work Daddy went to Elstead and ran the 'marathon' for the 2nd time out of the 106 that have been run. The run includes some sandy parts and because of the exceptionally dry, hot weather. There were dust clouds as the leading runners passed. Daddy had to jump a gate, go over some very rough farmers ground and of course a splash across the River Wey. A cracking event, with a short pub trip after.<\/p><img src='images\\years\\2018\\2018_06_29-03-ElsteadMarathon.jpg' class='diaryImage' alt='The river crossing' \/><p class='diaryImageCaption'>The river crossing<\/p><img src='images\\years\\2018\\2018_06_29-02-ElsteadMarathon.jpg' class='diaryImage' alt='Liquid refreshment' \/><p class='diaryImageCaption'>Liquid refreshment<\/p>","images":false},"title":{"value":"Elstead Marathon"},"version":0},{"date":{"d":26,"m":6,"y":2018},"datev":20180626,"first":{"value":null},"images":1,"info":{"content":"<p>It was the final group game for Denmark which they need to get a point in order to qualify. Daddy took half a day holiday and went around to the Fars house to watch the France game. Aftr school both Jessica and Ben arrived. It was a fairly drab match, but we enjoyed ourselves there.<\/p><img src='images\\years\\2018\\2018_06_26-08-DenmarkVFrance.jpg' class='diaryImage' alt='Jessica not watching the game sharing a joke with Farmor' \/><p class='diaryImageCaption'>Jessica not watching the game sharing a joke with Farmor<\/p>","images":false},"title":{"value":"World Cup: Denmark V France"},"version":0},{"date":{"d":25,"m":6,"y":2018},"datev":20180625,"first":{"value":null},"images":1,"info":{"content":"<p>Mummy's 42nd Birthday. We started the day in bed opening presents and cards. From Daddy she got the weekend away in Flamingo Land. From Jessica she got a charm for an impending bracelet. Katie got some clothes. Auntie Susan some shorts and a top. The Fars a frying pan and a camping bucket thing. Ellie and Charlie a Pandora bracelet.<\/p><img src='images\\years\\2018\\2018_06_25-04-Laura42ndBirthday.jpg' class='diaryImage' alt='Birthday treats in bed' \/><p class='diaryImageCaption'>Birthday treats in bed<\/p><p>Ben made a treasure hunt where he hid 16 bars of chocolate around the back garden which Mummy had to seek out. Mummy had the day off, but didn't do anything special. In the evening she took us to trampolining whilst going to Palettes.<\/p>","images":false},"title":{"value":"Mummy's 42nd Birthday"},"version":2},{"date":{"d":23,"m":6,"y":2018},"datev":20180623,"first":{"value":null},"images":3,"info":{"content":"<p>We had an early 5am departure from Frimley Green for our trip to Yorkshire. We made it for the 9:30 gate opening and plotted our route around the half theme park, half zoo. Jessica wanted to do her first upside down rides. Before now she has been too small, but the restrictions here were generous. She was tentative on the first ride, Hero where you lie on your front and get whisked around upside down. However, she managed to pluck the courage up and went on Mumbo Jumbo with Daddy and loved it. There was no stopping her now. We managed all the white knuckle rides, well except Daddy who couldn't take any spinning around. There were some firm favourites, like Velocity and Kumali. I don't think many enjoyed the high chair-o-plane ride. <\/p><img src='images\\years\\2018\\2018_06_23-09a-FlamingoLand.jpg' class='diaryImage' alt='Jessa looking beautiful' \/><p class='diaryImageCaption'>Jessa looking beautiful<\/p><img src='images\\years\\2018\\2018_06_23-22-FlamingoLand.jpg' class='diaryImage' alt='Posers in the park' \/><p class='diaryImageCaption'>Posers in the park<\/p><p>In the afternoon we walked around the zoo bits. Mummy was fascinated with the hippos. We perched on a viewing platform so had excellent views of the hippos in and out of the water.<\/p><p>We took a cable car back to the main theme park, where Ben, Jess and Daddy went to play laser quest. Daddy went out within 5 minutes, Ben 7 minutes. Jess must have lasted 15+ minutes. I think her tactic was to hide and hide good. She was very proud of her achievement of lasting longest. <\/p><p>We scrabbled around in the last half hour to fit in as many rides as possible. It was a good day. A smallish park, witch was not packed out like a Thorpe Park and kept us entertained all day.<\/p><img src='images\\years\\2018\\2018_06_23-37-FlamingoLand.jpg' class='diaryImage' alt='Real life Call Of Duty' \/><p class='diaryImageCaption'>Real life Call Of Duty<\/p><p>We trundled off and stopped at Malton and ate Fish and Chips by the river. It was a glorious evening. We then had a 45 minute drive to Leeds where we had a hotel for the night. We were all fairly bushed. We watched the end of a very tense Sweden v Germany World Cup game.<\/p>","images":false},"title":{"value":"Flamingo Land"},"version":1},{"date":{"d":18,"m":6,"y":2018},"datev":20180618,"first":{"value":null},"images":2,"info":{"content":"<p>Katie has arranged to do a week's work experience at Loseley Park. It is centred around events planning which is close to the wedding planning that Katie eventually would like to go in to. Today was her first day and she dressed appropriately, got there in time for the 9am start and began work! She was looking forward to the experience very much.<\/p><img src='images\\years\\2018\\2018_06_18-02-LoseleyHouseWorkExperience.jpg' class='diaryImage' alt='Katie just before work' \/><p class='diaryImageCaption'>Katie just before work<\/p><p>Here tasks through out the week involved:\u000a    <\/p><ul><li>Monday: Group interview for front of house staff. All applicants passed. Katie did some data entry on employees profiles.<\/li><li>Tuesday: More data entry and a couple of meetings with couples who are having their wedding at Loseley Park. They were discussing menus and costs.<\/li><li>Wednesday: Serving guests in the tea room as well as more meetings.<\/li><li>Thursday: Bike BBQ where there was a lot of washing up and clearing of tables. There was also some office work on a computer. The accounts lady offered Katie a summer job!<\/li><li>Friday: Tours around the house itself.<\/li><\/ul><img src='images\\years\\2018\\2018_06_18-03-LoseleyHouseWorkExperience.JPG' class='diaryImage' alt='Employers Report' \/><p class='diaryImageCaption'>Employers Report<\/p>","images":false},"title":{"value":"Katie's Loseley Park Work Experience"},"version":2},{"date":{"d":17,"m":6,"y":2018},"datev":20180617,"first":{"value":null},"images":3,"info":{"content":"<p>Daddy woke and eventually he got some breakfast in bed!!! There were some presents floating about including some chocolate, veg crisps and a wallet to replace the one that Daddy dropped down the toilet whilst he was doing a poo!<\/p><img src='images\\years\\2018\\2018_06_17-37-StrawberryPicking.jpg' class='diaryImage' alt='Daddy' \/><p class='diaryImageCaption'>Daddy<\/p><p>Us 3 stayed in and missed church. Auntie Charlotte popped by to pick Lenny up as we looked after him yesterday and overnight.<\/p><p>Daddy went on a long bike ride. He left without a plan and ended up having to rush back for 1pm. He managed 40 miles around the Bracknell and Windsor areas. He tested out his new rucksack in preparation for the 3 peaks.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1645873939\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>In the afternoon we all went to Petersfield to go strawberry picking with the Westons and Elders. We manage to eat as many strawberries in the field as we paid for. We got 2 punnets, had a cup of coffee, saw a load of posh people and made our way home.<\/p><img src='images\\years\\2018\\2018_06_17-17-StrawberryPicking.jpg' class='diaryImage' alt='Strawberry pickers' \/><p class='diaryImageCaption'>Strawberry pickers<\/p><p>In the evening Daddy went off with Farfar to play croquet over at St Johns. Daddy won and played reasonably well, making some nice breaks. His hitting in was still a bit wayward. It was nice to see Barry Huxley who Daddy hasn't seen for over 20 years!<\/p><img src='images\\years\\2018\\2018_06_17-03-CroquetDadVFarfar.jpg' class='diaryImage' alt='Dad playing Farfar at croquet' \/><p class='diaryImageCaption'>Dad playing Farfar at croquet<\/p>","images":false},"title":{"value":"Fathers Day, Strawberry Picking, Croquet"},"version":1},{"date":{"d":16,"m":6,"y":2018},"datev":20180616,"first":{"value":null},"images":2,"info":{"content":"<p>Daddy and Ben went off to parkrun and shifted around in slightly slower than average pace.<\/p><img src='images\\years\\2018\\2018_06_16-04-parkrun.jpg' class='diaryImage' alt='Ben beating Daddy at parkrun' \/><p class='diaryImageCaption'>Ben beating Daddy at parkrun<\/p><p>There were four World Cup matches on today. The third of which was Denmark v Peru. And for that special reason we had Daddy's friends around for a World Cup BBQ, with WAGS. Daddy went out to Costco yesterday and got £180's worth of stuff.... which Mummy thought was excessive.<\/p><p>We had the usual food fare and the same level of mayhem with a mix of children running about. The boys tried to do keepy-upys. They were rubbish! They've certainly lost any talent they might had once had. We sort of watched the football. Denmark won 1-0. All the WAGS got on very well with each other.... in fact it was a lovely afternoon. We finished at about 10pm.<\/p><img src='images\\years\\2018\\2018_06_16-17-DenmarkvPeruBBQ.jpg' class='diaryImage' alt='Carnage' \/><p class='diaryImageCaption'>Carnage<\/p>","images":false},"title":{"value":"parkrun, Denmark v Peru World Cup BBQ"},"version":1},{"date":{"d":10,"m":6,"y":2018},"datev":20180610,"first":{"value":null},"images":2,"info":{"content":"<p>James poked his head into the tent at 3:30am. Martin you're up in 20 minutes. Great Daddy thought! It was a nice time, because it was the first lap where the torch was not needed. Dawn was breaking and the birds were twittering away. The third lap of Daddy's was slow again at 50 mins.<\/p><p>Ellie finished her lap and effectively her Endure24 2018 with another solid effort. She did a fantastic 15 miles. She said she enjoyed it enough to come back another year. Woo Hoo.<\/p><p>Although the knee was hurting Daddy had one more effort at around 10am. He felt he ought to do 4 laps otherwise would feel unfulfilled. He made amends with his relatively slow lap 2 and 3 efforts with a 46 minute 4th lap to complete 20 miles. He could barely walk after as he put so much effort in.<\/p><img src='images\\years\\2018\\2018_06_10-12-Endure24_Day3-End.jpg' class='diaryImage' alt='Daddy horsing around' \/><p class='diaryImageCaption'>Daddy horsing around<\/p><p>We all crossed the line together as a team and collected our medals, had photos and went to take the tents down.<\/p><p>Overall a very enjoyable weekend. Ben wanted to come back and do more laps. Auntie Ellie wants to do it again....and Anthony enjoyed it. Jury is still out whether he wants in for 2019.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1628744499\" target=\"_blank\">Lap 3\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><a href=\"https:\/\/www.strava.com\/activities\/1629154575\" target=\"_blank\">Lap 4\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_06_10-10-Endure24_Day3-End.jpg' class='diaryImage' alt='Daddy and Ben medalled' \/><p class='diaryImageCaption'>Daddy and Ben medalled<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/IMmzc0Miu4Y\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/ptE4HDa20LI\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Endure24 - Day 2"},"version":5},{"date":{"d":9,"m":6,"y":2018},"datev":20180609,"first":{"value":null},"images":4,"info":{"content":"<p>This year the Frimley Flyers entered 3 teams into the Glastonbury for runners. Yesterday Daddy and an army of tent erectors went to prepare the site for 30+ runners, friends and family. This year Daddy wasn't on is own. He had Ben, Auntie Ellie, Joey and his friend from work; Anthony.<\/p><img src='images\\years\\2018\\2018_06_08-15-Endure24_Day1-TentSetup.jpg' class='diaryImage' alt='Tent setup' \/><p class='diaryImageCaption'>Tent setup<\/p><img src='images\\years\\2018\\2018_06_09-22-Endure24_Day2-Start.jpg' class='diaryImage' alt='Team lineup' \/><p class='diaryImageCaption'>Team lineup<\/p><p>Daddy and Ben arrived at about 11am, met up with everyone, made introductions, did the obligatory photo shoot and away the Flyers went.<\/p><p>Daddy smashed around the circuit in 43 minutes which was his quickest since 2015. He was happy with that, although there was still knee pain. Anthony went sub 40 minutes and Auntie Ellie threw in a steady 48 mins. Ben was desperate to run, however there was a bit of talk of disqualifying teams who raced with non registered runners. So we decided against it until night fall. At around 11pm Ben went out for his first ever 5 miles and first ever night run. Ellie guided him around in a time of 48 minutes. A really good time, better than Daddy's 50 minute night lap.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1627388158\" target=\"_blank\">Lap 1\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><a href=\"https:\/\/www.strava.com\/activities\/1628744012\" target=\"_blank\">Lap 2\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>After showers, a chance to sleep at 1am. Unfortunately Joey tried to clean his knee with water in the tent above Daddy's sleeping bag. Needless to say Daddy had an uncomfortable, damp sleep. Uncomfortable because the knee was hurting bad.<\/p><img src='images\\years\\2018\\2018_06_09-47-Endure24_Day2-Start.jpg' class='diaryImage' alt='Daddy Completing Lap 1' \/><p class='diaryImageCaption'>Daddy Completing Lap 1<\/p><img src='images\\years\\2018\\2018_06_09-66-Endure24_Day2-Start.jpg' class='diaryImage' alt='Night runner' \/><p class='diaryImageCaption'>Night runner<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/8qsnHyWtu8g\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Endure24 - Day 1"},"version":2},{"date":{"d":1,"m":6,"y":2018},"datev":20180601,"first":{"value":null},"info":{"content":"<p>Daddy managed to get Jessica and Mummy £25 Thorpe Park annual passes off Eagle Radio. So along with Ben and Alice Teale they headed to the Theme Park and enjoyed themselves for the day. Ben went around with his mates.<\/p><p>Meanwhile Katie was with the Teales and visited Brighton.... again! She was spoilt and was taken on the fair rides and shopped in the Lanes.<\/p>","images":false},"title":{"value":"Teale Swap - Thorpe Park and Brighton"},"version":0},{"date":{"d":31,"m":5,"y":2018},"datev":20180531,"first":{"value":null},"images":1,"info":{"content":"<p>We went out with the Burrows and Elders to Liquid Leisure which is a big water adventure park in Wraysbury.<\/p><img src='images\\years\\2018\\2018_05_31-04-WraysburyWaterPark.jpeg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><p>Later Alice came over to us for a sleepover with Jessica, whilst Katie headed in the other direction and stayed with Summer overnight.<\/p>","images":false},"title":{"value":"Water Inflatables with Burrows and Elders. Alice, Katie swap sleepover"},"version":2},{"date":{"d":30,"m":5,"y":2018},"datev":20180530,"first":{"value":null},"info":{"content":"<p>Written by Farfar<\/p><p>It was an early start on the Wednesday, but not as much as the outward journey, for our journey back to England. Graham and Susan took Jette to Thyregod railway station as she was going to Copenhagen to stay with Joan and Gert for their joint 70 birthday celebrations. The rest of us went direct, well via some country roads actually, to the airport for the 11.15 flight back to Blighty. It was delayed here and there which eventually put an extra hour on the clock but we all got home under a leaden sky mid afternoon, happy but exhausted. It had been quite an intense holiday, even if we were unable to experience the delights of Rørbæk Sø!<\/p>","images":false},"title":{"value":"Denmark Day 5 - Homeward bound"},"version":5},{"date":{"d":29,"m":5,"y":2018},"datev":20180529,"first":{"value":null},"images":8,"info":{"content":"<p>Written by Farfar<\/p><p>It was wall to wall sun again on the Tuesday. Having run out of theme parks for the time being, we all went to Horsens, and the newly opened museum that once was a Victorian prison. It proved to be bigger and more comprehensive than first imagined. Katie was absolutely fascinated with the place. She has a thing for prisons at the moment.<\/p><img src='images\\years\\2018\\2018_05_29-02-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Katie in Horsens Prison' \/><p class='diaryImageCaption'>Katie in Horsens Prison<\/p><img src='images\\years\\2018\\2018_05_29-04a-Denmark_Day4-HorsensSwim.png' class='diaryImage' alt='Farmor's Uncle who worked at the prison' \/><p class='diaryImageCaption'>Farmor's Uncle who worked at the prison<\/p><img src='images\\years\\2018\\2018_05_29-09-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Tempting to drop her off' \/><p class='diaryImageCaption'>Tempting to drop her off<\/p><p>Later, we journeyed into the town and took in the shops. Ben and Martin though, hired a couple of ‘Boris Bikes’ at the prison and made their own way into town, but we met up for a while near the main square.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1603623790\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_05_29-13-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Daddy and Ben Bike ride around Horsens' \/><p class='diaryImageCaption'>Daddy and Ben Bike ride around Horsens<\/p><p>The next item on our itinerary was to swim in a lake. Jette had done this in Ejstrupholm So as a child but a repeat performance was not possible as there were too many reeds separating bank and water. We took a fifteen minute drive over to Hampen Sø which was suitable and the Frimley Green contingent took a dip, although Laura was uncertain about the experience after seeing fish swimming about. The lake was something akin to Frensham Pond but without the crowds.<\/p><img src='images\\years\\2018\\2018_05_29-17-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Hampen Lake for a Mermaids outing' \/><p class='diaryImageCaption'>Hampen Lake for a Mermaids outing<\/p><p>We stopped off at Ejstrupholm church and the Uhrskov stone for some photo oppotunities and see if we could spot any ancestors in the graveyard. There were some Uhrskovs and Hansens, but none rang a bell in the current family tree.<\/p><p>We then returned back to the house for a short while before rolling off again, almost back to the same place, but this time a little nearer, to the roadside café for a full evening meal.<\/p><img src='images\\years\\2018\\2018_05_29-24-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Ejstrupholm church' \/><p class='diaryImageCaption'>Ejstrupholm church<\/p><img src='images\\years\\2018\\2018_05_29-28-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='The Uhrskov Stone - don't look at the spelling!' \/><p class='diaryImageCaption'>The Uhrskov Stone - don't look at the spelling!<\/p><p>When we went back to the house, a car was there when we arrived with Johanas sat in it. I did say that we would visit him during the day on the Tuesday but the Horsens trip, planned at short notice, thwarted that idea. Anyway, he suggested we might like to go to the airfield (that he formally owned) for a drink at its clubhouse. Thus, me Jette and Martin did for an hour and met half a dozen other people to watch the sun set over the heather in amiable conversation. It turned out one couple had stayed in Deepcut when the Farnborough air show was on a little while back. The place again threw up move coincidences.<\/p><img src='images\\years\\2018\\2018_05_29-37-Denmark_Day4-HorsensSwim.jpg' class='diaryImage' alt='Meeting Johanas' \/><p class='diaryImageCaption'>Meeting Johanas<\/p>","images":false},"title":{"value":"Denmark Day 4 - Horsens Prison, Bike Ride, Hampen Lake Swim, Airstrip Johanas"},"version":3},{"date":{"d":28,"m":5,"y":2018},"datev":20180528,"first":{"value":null},"images":11,"info":{"content":"<p>Written by Farfar<\/p><p>Monday morning broke with yet more sunshine. This time the journey was not so far as we went back to Billund, this time to Legoland. We set out a little later than planned and arrived soon after opening time. All nine of us stayed until the six o’clock closing time and ran out of minutes to fit all the rides as they stopped at five. The place was quite busy but with hardly any queues for the rides. Not all the adults went on with the kids, but most were represented by one or other of the older generation.<\/p><p>The highlights were the aquarium where we saw a shark close up as well as manta rays. We even got to get tickled by a shrimp! The Lego cars were eagerly awaited and didn't disappoint. Katie was an expert at pulling off a u'ie without notice, Ben an expert at looking cool and easy and Jessica loved a good car wash and petrol station visit. There was the River Tyre ride which Daddy got soaked on (see video) and possibly the most exhilarating rides were at the end of the day. Mummy said the Polar Express rollercoaster ride was the best she's been on, whilst Ben absolutely loved the Ice Pilots School where you could design your own ride. Sounds a bit bonkers. Anyway overall a good visit.<\/p><img src='images\\years\\2018\\2018_05_28-10-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Legoland - Billund' \/><p class='diaryImageCaption'>Legoland - Billund<\/p><img src='images\\years\\2018\\2018_05_28-27-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Katie swimming in the aquarium' \/><p class='diaryImageCaption'>Katie swimming in the aquarium<\/p><img src='images\\years\\2018\\2018_05_28-45-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Jessica stuck in the aquarium' \/><p class='diaryImageCaption'>Jessica stuck in the aquarium<\/p><img src='images\\years\\2018\\2018_05_28-52-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Tickled by the shrimp' \/><p class='diaryImageCaption'>Tickled by the shrimp<\/p><img src='images\\years\\2018\\2018_05_28-64-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Lego Millennium Falcon' \/><p class='diaryImageCaption'>Lego Millennium Falcon<\/p><img src='images\\years\\2018\\2018_05_28-69-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Beautiful smile' \/><p class='diaryImageCaption'>Beautiful smile<\/p><img src='images\\years\\2018\\2018_05_28-141-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Trouble on the roads. Evacuate!' \/><p class='diaryImageCaption'>Trouble on the roads. Evacuate!<\/p><img src='images\\years\\2018\\2018_05_28-152-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Legal to drive now' \/><p class='diaryImageCaption'>Legal to drive now<\/p><img src='images\\years\\2018\\2018_05_28-155-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Log Flume ride' \/><p class='diaryImageCaption'>Log Flume ride<\/p><img src='images\\years\\2018\\2018_05_28-159-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Fars join us for the rapid river drop' \/><p class='diaryImageCaption'>Fars join us for the rapid river drop<\/p><img src='images\\years\\2018\\2018_05_28-169-Denmark_Day3-Legoland.jpg' class='diaryImage' alt='Billund Airport' \/><p class='diaryImageCaption'>Billund Airport<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/FQNQgC8JVDc\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div><p>The evening was spent back at base playing board games or watching the television which was dominated by football. Jette and I went for a walk around Ejustrupholm which, as expected, was pretty well deserted. However, I was pleased with myself after conducting a ten minute conversation alone, entirely in Danish with a local man who was walking his dog. Martin came too and, in the meanwhile, tested out his knee with a 5K run around the village.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1602288914\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Denmark Day 3 - Legoland"},"version":6},{"date":{"d":27,"m":5,"y":2018},"datev":20180527,"first":{"value":null},"images":4,"info":{"content":"<p>Written by Farfar<\/p><p>Sunday morning dawned full of sun. An isolated rain storm was forecast but none were encountered at any time. This time we set off for the Summerland Theme Park near Randers. The journey, at a little over two hours. Rather than run along the motorway for most of the miles, I wanted to take a more picturesque route via Silkeborg, but one route was closed so we had to divert along country lanes and there was more holiday traffic on the roads than expected. We got there a little before noon.<\/p><p>They were delighted to see the queue times were very low. There was the usual fill of rollercoaster rides, however it was the other bits and pieces that made this different. The family quad cycles, the 50 or so trampolines, the air cushion, the basketball, the canoeing around a lake. They were there right to the end at 6pm.<\/p><img src='images\\years\\2018\\2018_05_27-26-Denmark_Day2-Sommerland.jpg' class='diaryImage' alt='High risers' \/><p class='diaryImageCaption'>High risers<\/p><img src='images\\years\\2018\\2018_05_27-77-Denmark_Day2-Sommerland.jpg' class='diaryImage' alt='Drive by' \/><p class='diaryImageCaption'>Drive by<\/p><img src='images\\years\\2018\\2018_05_27-83-Denmark_Day2-Sommerland.jpg' class='diaryImage' alt='Log flumes' \/><p class='diaryImageCaption'>Log flumes<\/p><img src='images\\years\\2018\\2018_05_27-138-Denmark_Day2-Sommerland.jpg' class='diaryImage' alt='Canoeing' \/><p class='diaryImageCaption'>Canoeing<\/p>","images":false},"title":{"value":"Denmark Day 2 - Djurs Sommerland"},"version":2},{"date":{"d":26,"m":5,"y":2018},"datev":20180526,"first":{"value":null},"images":3,"info":{"content":"<p>Written by Farfar.<\/p><p>This was a gathering of the clan in that Martin, Laura, Susan, Graham, Katie, Jessica and Ben joined me and Jette for a four night foray into deepest Denmark; to Ejstrupholm to be precise. We all traveled together on the 7.45am flight from T5 at Heathrow to Billund which meant a really early start from our respective homes, but we all made it on time. The day was bright and flight smooth, if a little noisy as it appeared to be doubling up as the ‘Legoland Special.’ We touched down on time at around 10.30 (Danish time) then spent an eternity queuing to go through passport control. There were only two positions available which was obviously inadequate.<\/p><p>That hurdle passed, our next task was to collect our vehicles. Susan and Graham had their own Merc but the rest of us had to do with a more functional nine seater ‘bus,’ but one that did the job admirably well throughout our stay that stretched over four nights. We set off into the sunshine to the nearby town Grinsted and arrived to a near deserted town centre soon after noon to seek a cafe for lunch. A walk through the main street, popping into what shops were open (most close at one o’clock on a Saturday in Denmark), brought us to a highly suitable eatery where we sat outside in the sunshine for a varied lunch.<\/p><img src='images\\years\\2018\\2018_05_26-02-Denmark_Day1-LegoHouse.jpg' class='diaryImage' alt='Katie and the church in Grinsted' \/><p class='diaryImageCaption'>Katie and the church in Grinsted<\/p><p>Thus sated, our next task was to stock up with provisions which we managed at the Kvickly supermarket (in contrast, they stay open all hours) in the town of Brande, five miles from our destination. Beer, of course, was an important item in the inventory, along with sufficient food to get us through the weekend. Arrival at our destination was effected by about two thirty which gave us an hour to settle in before our first event.<\/p><p>The accommodation was at the Damgard B and B on Fasterholt Vej, set back 200 yards or so, just outside Ejustrupholm. It was an annex of a former farm and set in many acres of land that could be explored. Downstairs, it consisted of a utility room, kitchen, living room, one bedroom and a bathroom, all of generous size and well appointed. Upstairs lay a large landing, a room in itself, a bathroom, two ‘normal’ bedrooms and a large family bedroom. There was heaps of room all round.<\/p><p>Our first adventure, the Lego House, beckoned for we had tickets for a 4.00pm entry. Billund, direct, took a smidgen over half hour. Our time at Lego House was the full four hours and proved to be very entertaining for all of us. Favourites were the Stock photo filming, car racing and fish designing as well as marveling at all the Lego villages, dinosaurs, trees, etc.<\/p><img src='images\\years\\2018\\2018_05_26-42-Denmark_Day1-LegoHouse.jpg' class='diaryImage' alt='Making a Lego stock movie' \/><p class='diaryImageCaption'>Making a Lego stock movie<\/p><img src='images\\years\\2018\\2018_05_26-63-Denmark_Day1-LegoHouse.jpg' class='diaryImage' alt='Lego Dinosaurs' \/><p class='diaryImageCaption'>Lego Dinosaurs<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/NRDTj5Ku0f0\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Denmark Day 1 - Lego House"},"version":7},{"date":{"d":25,"m":5,"y":2018},"datev":20180525,"first":{"value":null},"info":{"content":"<p>Tonight was the Mytchett Athletic FC Presentation evening. Daddy presented the boys with trophies. Abe won the Player's Player and Supporters Player of the year awards. Charlie got Manager's Player. Daddy got a load of beers and a trophy.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/pndRBNjWVHs\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Mytchett Athletic FC Presentation Evening"},"version":1},{"date":{"d":22,"m":5,"y":2018},"datev":20180522,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica was picked for the school cricket team who played in a Surrey Heath schools tournament over at the Marconi recreation ground. Jessica's team came second out of six and enjoyed it enough to continue play cricket at school.<\/p><img src='images\\years\\2018\\2018_05_22-19-JessicaSurreyHeathCricket.jpg' class='diaryImage' alt='Jessica chasing the runs' \/><p class='diaryImageCaption'>Jessica chasing the runs<\/p>","images":false},"title":{"value":"Jessica Surrey Heath Cricket Tournament"},"version":0},{"date":{"d":19,"m":5,"y":2018},"datev":20180519,"first":{"value":null},"images":3,"info":{"content":"<p>We split up as a family today. First off was mummy who had to go to some church meeting in Windlesham, Daddy rode his bike on a 12 mile Blackwater River ramble which took in the parkrun at Rushmoor - he supported his fellow Frimley Flyers.<\/p><p>Ma Ma, Pop Pop and Grandma all came over for a Royal Wedding BBQ.<\/p><p>Farfar got FA Cup tickets through Chertsey Town FC. There was some debate whether Daddy or Farfar was going to accompany Ben into the ground. All three traveled to the greasy spoon in Hillingdon before moving onto the stadium. There was aobut 90,000 spectators. Farfar took Ben into the Man Utd end. Daddy watched the game outside and enjoyed sitting against the stadium listening to the radio commentary. He had a luck escape as the game itself was very drab and disappointing. Chelsea beat Man Utd 1-0.<\/p><img src='images\\years\\2018\\2018_05_19-11-FACupFinal.jpg' class='diaryImage' alt='In Wembley Stadium' \/><p class='diaryImageCaption'>In Wembley Stadium<\/p><img src='images\\years\\2018\\2018_05_19-15-FACupFinal.jpg' class='diaryImage' alt='Flying the red flag in vain' \/><p class='diaryImageCaption'>Flying the red flag in vain<\/p><p>Jessica went swimming with Ma Ma in the afternoon.<\/p><p>In the evening Mummy and Katie went to the Maisey's for a Murder Mystery party.<\/p><img src='images\\years\\2018\\2018_05_19-01-MaiseysMurderMystery.jpeg' class='diaryImage' alt='Mysterious murderers' \/><p class='diaryImageCaption'>Mysterious murderers<\/p>","images":false},"title":{"value":"FA Cup Final, Royal Wedding, Maisey Murder Mystery, Swimming"},"version":4},{"date":{"d":13,"m":5,"y":2018},"datev":20180513,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica and Mummy, joined Natasha and Lily for the mermaids second outing at the Keys. They had good fun.<\/p><p>Daddy went off to do his coaching course again at Winston Churchill school. The third of six sessions done. More of the same. Planning and carrying out coaching sessions.<\/p><p>The rest of us went to the cinema in the afternoon.<\/p><img src='images\\years\\2018\\2018_05_13-01-3rdMermaidsOuting.jpg' class='diaryImage' alt='Mermaids' \/><p class='diaryImageCaption'>Mermaids<\/p>","images":false},"title":{"value":"More Mermaids, FA Coaching course, cinema"},"version":3},{"date":{"d":12,"m":5,"y":2018},"datev":20180512,"first":{"value":null},"images":3,"info":{"content":"<p>In the morning Daddy who is injured, volunteered at parkrun. It was hard for him not to run. Farfar however, did run!<\/p><img src='images\\years\\2018\\2018_05_12-03-FarfarParkrun.jpg' class='diaryImage' alt='Farfar running!' \/><p class='diaryImageCaption'>Farfar running!<\/p><p>Katie and Ben went with Catherine and Johnny down to Brighton to stay in the family static caravan for the night. They shopped and bought quite a few items of clothes. They also had some nice food in subwway and KFC. The weather wasn't great so they didn't make much use of the beach.<\/p><img src='images\\years\\2018\\2018_05_12-01-Brighton.jpg' class='diaryImage' alt='Katie, Ben, Johnny and Catherine playing in Brighton' \/><p class='diaryImageCaption'>Katie, Ben, Johnny and Catherine playing in Brighton<\/p><p>In the evening Jessica decided she was going to do Bake Off, but got confused with Come Dine With Me. Earlier in the afternoon she went out with Mummy to get all the ingredients she needed for her 3 course meal. She was so sweet as she wanted to keep it a secret and do all the cooking herself..... she even made a colourful menu up. For starters she made soup, mains was home made potato chips, chicken breast, sweetcorn and cucumber. Pudding was Eton mess. Very well executed. We even got a glass of hot chocolate!<\/p><img src='images\\years\\2018\\2018_05_12-03-JessicaComeDineWithMe.jpg' class='diaryImage' alt='Jessica cooked dinner' \/><p class='diaryImageCaption'>Jessica cooked dinner<\/p><p>Jessica and Mummy slept in the tent for a second night.... although at about 3am they came inside as they got scared and decided to punish Daddy by drawing makeup on his face. Daddy had the last laugh though, as he woke secretly and ROARed at them when they least expected it. It didn't do much for Mummy's anxiety!<\/p>","images":false},"title":{"value":"Katie and Ben Over nighter in Brighton, Jess cooking and back garden camper"},"version":2},{"date":{"d":11,"m":5,"y":2018},"datev":20180511,"first":{"value":null},"images":1,"info":{"content":"<p>In the evening Mummy and Jessica setup the tent in the back garden and slept all night in there. <\/p><p>Daddy headed down to the Prince Of Wales in North Farnborough and met up with Nick, Phil, Martin and Barrie. Nick announced he was getting married at the end of the month.<\/p><img src='images\\years\\2018\\2018_05_11-02-POWWithBoys.jpg' class='diaryImage' alt='Nick looking on as Barrie opens Christmas and Birthday cards' \/><p class='diaryImageCaption'>Nick looking on as Barrie opens Christmas and Birthday cards<\/p>","images":false},"title":{"value":"Daddy down the POW, Camping"},"version":1},{"date":{"d":10,"m":5,"y":2018},"datev":20180510,"first":{"value":null},"images":2,"info":{"content":"<p>Hopefully, the traditionally participation of the Windle Valley Pairs 10km event which we entered two teams into. Team 1 the seniors, Mummy and Daddy. Team 2 the juniors, Ben and Katie. There was some competition as Daddy and Ben were roughly equal and the girls were largely an unknown quantity. The girls set off first from Windlesham Memorial field and headed off down towards the playground. The race was a relay with 1km intervals. Each person did 5x1km. Sounds easy, but in fact very hard, as you are killing yourself 5 times.<\/p><p>Katie came around the first lap before mummy which condemned the old'uns to a loss. However, everyone did very well. Daddy unfortunately picked up an injury which really only became apparent the day after when he could barely walk. It was the cartilage in his left knee again! Well done fam. You did amazing. Same again next year.<\/p><img src='images\\years\\2018\\2018_05_10-04-WindleValleyPairs.jpg' class='diaryImage' alt='Katie handing over to Ben' \/><p class='diaryImageCaption'>Katie handing over to Ben<\/p><img src='images\\years\\2018\\2018_05_10-10-WindleValleyPairs.jpg' class='diaryImage' alt='The Gallivanting Gays' \/><p class='diaryImageCaption'>The Gallivanting Gays<\/p>","images":false},"title":{"value":"Windle Valley Pairs Running Event"},"version":2},{"date":{"d":7,"m":5,"y":2018},"datev":20180507,"first":{"value":null},"images":7,"info":{"content":"<p>Another boiling hot day and another early departure from chez Gay, this time heading north to Warwick Castle.<\/p><p>We arrived and had a long walk from the carpark to the main entrance. The castle looked impressive. There was plenty to do. We saw the old fashioned cannon \/ catapult in action which was interesting. We also had a small guided tour looking at the owners and how scathing they were. We then walked around the ramparts and towers in the castle, saw the gaol, the time tunnel and watched the archery. Inter-family rivalry was rife in the maze. Claim and counter claim who the real winner was, was debated hard! We were exhausted from all the walking around in the heat and the ups and downs.<\/p><img src='images\\years\\2018\\2018_05_07-01-WarwickCastle.jpg' class='diaryImage' alt='The gang one of the regal rooms' \/><p class='diaryImageCaption'>The gang one of the regal rooms<\/p><img src='images\\years\\2018\\2018_05_07-04-WarwickCastle.jpg' class='diaryImage' alt='Katie with her armour' \/><p class='diaryImageCaption'>Katie with her armour<\/p><img src='images\\years\\2018\\2018_05_07-24-WarwickCastle.jpg' class='diaryImage' alt='The gang again infront of the main castle quatres' \/><p class='diaryImageCaption'>The gang again infront of the main castle quatres<\/p><img src='images\\years\\2018\\2018_05_07-38-WarwickCastle.jpg' class='diaryImage' alt='In the keep' \/><p class='diaryImageCaption'>In the keep<\/p><img src='images\\years\\2018\\2018_05_07-45-WarwickCastle.jpg' class='diaryImage' alt='Send them to the tower' \/><p class='diaryImageCaption'>Send them to the tower<\/p><img src='images\\years\\2018\\2018_05_07-56-WarwickCastle.jpg' class='diaryImage' alt='From up high' \/><p class='diaryImageCaption'>From up high<\/p><p>We made our way down to visit the Elders for Michael's 40th birthday BBQ. Ma Ma and Pop Pop were also there. Lovely BBQ punctured by Henry being sick multiple times. We got Michael a track day experience driving 3 super cars around his favourite circuit, Brands Hatch. A nice time had by all. A fitting end to an exhausting bank holiday weekend.<\/p><img src='images\\years\\2018\\2018_05_07-16-Michaels40thBBQ.jpg' class='diaryImage' alt='Jessica waterfall' \/><p class='diaryImageCaption'>Jessica waterfall<\/p>","images":false},"title":{"value":"Warwick Castle, Michael's 40th BBQ"},"version":1},{"date":{"d":6,"m":5,"y":2018},"datev":20180506,"first":{"value":null},"info":{"content":"<p>Early doors and Mummy and Jessica went off for their open water swim at Mytchett.<\/p><p>In the afternoon Ben and Mummy went to the cinema to watch Infinity Wars.<\/p><p>Daddy started his FA football coaching course. It was an all day event. There must have been 15 or so students at Winston Churchill school in Knaphill. It was another boiling hot day and half of the tutoring was done outside - this gave Daddy a bit of a tan!<\/p><p>Meanwhile the rest of us went to church and church club<\/p>","images":false},"title":{"value":"Mermaids, FA Coaching Course, Inifinity Wars"},"version":2},{"date":{"d":5,"m":5,"y":2018},"datev":20180505,"first":{"value":null},"images":5,"info":{"content":"<p>We had a busy day. There was just four of us waking up in the house. Katie was away in the east part of Surrey doing her Duke Of Edinburgh award hike.<\/p><p>We headed up to London, starting at Gunnersbury and the parkrun. Ben and Daddy were going to take it easy, but when do we ever believe that. There is only one gear, and that's full throttle. They were pleased with their sub 25 minute performance. Meanwhile Jessica and Mummy played hide and seek around the playground area.\u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1551926830\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><p>They moved on in the sweltering heat to the underground station and headed to Southwark. A short walk near the Shard and onto the Clink. London's private jail it seemed for the area owned by the Bishop of Winchester. It sounded like the owners were as crocked as the inmates. There were many tales of torture. Jessica and Ben were pleasantly surprised with it. It must have consumed 90 minutes of our time. Next up lunch and a tour around the nearby Borough market. Ben and Mummy got a scrummy pie and Daddy some expensive bread. They were selling doughnuts, 4 for £10! Somewhere to come back to one day. We sat and ate by the Golden Hind.<\/p><img src='images\\years\\2018\\2018_05_05-05-ClinkLondon.jpg' class='diaryImage' alt='The Shard' \/><p class='diaryImageCaption'>The Shard<\/p><img src='images\\years\\2018\\2018_05_05-12-ClinkLondon.jpg' class='diaryImage' alt='In the chair' \/><p class='diaryImageCaption'>In the chair<\/p><img src='images\\years\\2018\\2018_05_05-29-ClinkLondon.jpg' class='diaryImage' alt='Inprisoned' \/><p class='diaryImageCaption'>Inprisoned<\/p><p>We then strolled long the south side of the Thames towards Embankment. We marvelled at some of the street entertainers. Ben stood next to man who was sitting on thin air!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1551241577\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_05_05-25-ClinkLondon.jpg' class='diaryImage' alt='How's he sitting down?' \/><p class='diaryImageCaption'>How's he sitting down?<\/p><p>We made it back to the car and drove to Banstead Woods to collect Katie. We were not too sure when she'd arrive. We waited a good couple of hours. She had got lost earlier in the day, so was one of the last groups back. She done ever so well, carrying more than most. She has a real determination. It sounded that she had barely eaten so quite concerned. She could chose whatever she wanted for dinner. Fish and Chips was on the menu. Well done Katie.<\/p><img src='images\\years\\2018\\2018_05_05-04-KatieDoE.jpg' class='diaryImage' alt='Katie finished DofE' \/><p class='diaryImageCaption'>Katie finished DofE<\/p>","images":false},"title":{"value":"Gunnersbury parkrun, The Clink, Bankside walk, Katie D of E"},"version":1},{"date":{"d":1,"m":5,"y":2018},"datev":20180501,"first":{"value":null},"info":{"content":"<p>A huge write off - that car that we bought last summer. Having pursued the car firm through the small claims courts and won, we decided not to press on with the bailiffs option as there was so much paper work, more costs and after speaking with Dave Rayner little chance of getting our money back. It has been a huge headache and we've decided to cut our losses. Recently got the car MOT'ed at a cost of £250. Sold it for £2,800 and after all the other costs, we must be over £2500 down in total. Grrrr<\/p>","images":false},"title":{"value":"Sold that Damm Car"},"version":0},{"date":{"d":29,"m":4,"y":2018},"datev":20180429,"first":{"value":null},"images":3,"info":{"content":"<p>We all slept well last night. We waited till 8:30 before breakfast was served. It was worth the wait as well. £65 for the 5 of us including a good breakfast. Great value. We set off after 10 having first fixed a puncture on Katie's bike.<\/p><p>We headed south towards Christ's Hospital, Southwater and West Grinstead still along the railway line which ceased being as a result of the Beeching Report in 1966. It was colder than yesterday and people's bottoms were sore! We made good progress and stopped at a supermarker in Henfield for lunch. Jessica was doing ever so well, much better than yesterday. She was happy as she stuffed the iPad in the rucksack, set some tunes up and pressed play.<\/p><img src='images\\years\\2018\\2018_04_29-07-DownsLinkBike_Day2-ToBrighton.jpg' class='diaryImage' alt='Jessica pushing it up the hill' \/><p class='diaryImageCaption'>Jessica pushing it up the hill<\/p><p>We finally reached the end of the Downs Link path at the mouth of the River Adur in Shoreham. Next we headed west along the coast towards our final destination Brighton. It was tough going against the wind. Jessica was now going super slow..... but she stuck at it. We went on the spit of land along Basic Road South. Not much traffic and some big industrial units shipping ballast, steel and wood by the looks of things. We got to the promenade at Portslade and travelled to Hove admiring the views. We saw the burnt out pier and the new tower hanging over Brighton. We eventually arrived at the Palace Pier in the mid afternoon pretty well spent and ready for our treat, McDonalds!<\/p><img src='images\\years\\2018\\2018_04_29-11-DownsLinkBike_Day2-ToBrighton.jpg' class='diaryImage' alt='Finished the Downs Link part at Shoreham' \/><p class='diaryImageCaption'>Finished the Downs Link part at Shoreham<\/p><img src='images\\years\\2018\\2018_04_29-18-DownsLinkBike_Day2-ToBrighton.jpg' class='diaryImage' alt='Reached Brighton Pier' \/><p class='diaryImageCaption'>Reached Brighton Pier<\/p><p>We meandered our way through the Lanes and up to the main street to get our Makkie D's. We then had a small climb to reach the railway station. Two Adult tickets and 3 children tickets were £115. However, 3 adults and 2 child tickets were £86! Got to love the web of train ticketing. The galling thing was, no one checked our ticket all the way home!<\/p><p>We had a small problem when we reached Shalford. There was engineering works all the way to North Camp. Therefore we had to negotiate our bikes onto the coach.... which fortunately Daddy did somehow. The railway employee said it was not allowed. To finish our trip we had the short ride from North Camp to home. In total we did 55km and 61km = 116km over the weekend. Well done Gay's.\u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1539359440\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p>","images":false},"title":{"value":"Downs Link 2: Slinford to Brighton"},"version":13},{"date":{"d":28,"m":4,"y":2018},"datev":20180428,"first":{"value":null},"images":3,"info":{"content":"<p>This is year 2 of spending a long time on a bike ride as a family. This year we aimed to get to Brighton starting from home. All five bikes were prepared. Daddy, Ben and Jessica all had upgrades from last year, and we bought our own paniers this time.<\/p><p>The weather forecast was a little dodgy. Fortunately the rain didn't come, although it was pretty cold. We put Ben in charge of navigation. He had the phone with the map and route on it. Well we didn't have a great start, Mummy forgot her inhaler, so turned back, then Ben started leading us the wrong way. We hadn't even got out of Frimley Green!<\/p><p>We got to Ash Ranges and the red flags were up, so we had to detour around into Pirbright. After a couple of hours we hit Guildford and sought refuge in Starbucks with a much needed warm drink and treats. Then it seemed a constant uphill struggle all the way up to St Martha's Church where there was a wedding and lots of DoE children. We stopped for lunch here overlooking the countryside.<\/p><img src='images\\years\\2018\\2018_04_28-02-DownsLinkBike_Day1-ToSlinford.jpg' class='diaryImage' alt='Church At Pirbright' \/><p class='diaryImageCaption'>Church At Pirbright<\/p><img src='images\\years\\2018\\2018_04_28-04-DownsLinkBike_Day1-ToSlinford.jpg' class='diaryImage' alt='At St Martha's' \/><p class='diaryImageCaption'>At St Martha's<\/p><p>Then the toughest parts of the journey hit us. It was extremely muddy through the Surrey Hills down through Bramley. Despondency was rife through the ranks as well as wet, muddy feet. We literally ploughed on and eventually got past the worst of it as we got to the disused railway line at Bramley. Daddy took up the wrong path which led us to some technically challenging terrain.<\/p><p>Finally we got on to the disused train line for some considerable time. We went along some straight track all the way to Cranleigh where we stopped for refreshments, before pushing on to our half way point of Slinford where we rested for the night. The Red Lyon was situated in the middle of the picturesque village. We had a room with just 4 single beds, so Mummy and Jessica cuddled up together. We didn't find it hard to get to sleep once we had our Dominoes pizza.<\/p><img src='images\\years\\2018\\2018_04_28-12-DownsLinkBike_Day1-ToSlinford.jpg' class='diaryImage' alt='Finished for the day at the back of the Red Lyon' \/><p class='diaryImageCaption'>Finished for the day at the back of the Red Lyon<\/p><a href=\"https:\/\/www.strava.com\/activities\/1537102328\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"value":"Downs Link 1: Biking Home to Slinford"},"version":0},{"date":{"d":27,"m":4,"y":2018},"datev":20180427,"first":{"value":null},"images":5,"info":{"content":"<p>The Fars had hired the hall out the back of the Surrey Cricketers, Windlesham for a mini birthday party for Farmor who celebrated 70 years - well yesterday anyway.<\/p><p>The Rostocks and both Auntie Susan's in laws and Ma Ma and Pop Pop were also in attendance. We arrived an hour early to dress the room up to make it all nice for Farmor. We sat and drank and ate a very nice meal. Susan had bought a selfie polaroid photo thing, which we had fun with.  We also had a game of skittles which Ben was obviously the most competitive about. He managed to put off Ma Ma on one of her attempts, but Ma Ma had the last laugh as she made Ben miss completely! Of course Ben wiggled his way out by reminding us of the aggregate score!<\/p><p>Ben was on DJ duty and Katie on photos. Farmor opened her presents and Farfar made a funny speech. I don't think it was intentionally funny! We all had a nice time.<\/p><img src='images\\years\\2018\\2018_04_27-10-Jette70thBirthday.jpg' class='diaryImage' alt='Top Table' \/><p class='diaryImageCaption'>Top Table<\/p><img src='images\\years\\2018\\2018_04_27-15-Jette70thBirthday.jpg' class='diaryImage' alt='Farmor and Joan' \/><p class='diaryImageCaption'>Farmor and Joan<\/p><img src='images\\years\\2018\\2018_04_27-26-Jette70thBirthday.jpg' class='diaryImage' alt='Birthday girl with the Denmark birthday cake' \/><p class='diaryImageCaption'>Birthday girl with the Denmark birthday cake<\/p><img src='images\\years\\2018\\2018_04_27-37-Jette70thBirthday.jpg' class='diaryImage' alt='The three of us' \/><p class='diaryImageCaption'>The three of us<\/p><img src='images\\years\\2018\\2018_04_27-92-Jette70thBirthday_Polaroid.jpg' class='diaryImage' alt='Muma and a Dadda' \/><p class='diaryImageCaption'>Muma and a Dadda<\/p>","images":false},"title":{"value":"Farmor's 70th Birthday Party"},"version":1},{"date":{"d":25,"m":4,"y":2018},"datev":20180425,"first":{"value":null},"images":1,"info":{"content":"<p>Farmor's school friend, Joan and her husband Gert came over to England to visit. We invited them over for some tea and cakes so we could catch up. It was very nice to see they were fit, healthy and the same as ever.<\/p><img src='images\\years\\2018\\2018_04_25-06-JoanGert.jpg' class='diaryImage' alt='The Rostocks' \/><p class='diaryImageCaption'>The Rostocks<\/p>","images":false},"title":{"value":"Rostocks over for Tea"},"version":1},{"date":{"d":22,"m":4,"y":2018},"datev":20180422,"first":{"value":null},"images":2,"info":{"content":"<p>The inauguration swim of the Frimley Flippers took place this morning at the Kingfisher, Mytchett. Mummy and Jessica went off at 8am in their wet suits for a swim. They said it was cold at first, but ok after that.<\/p><p>Meanwhile Daddy went off on a mountain bike ride into Ash Ranges and got a little lost. He refuses to turn back, so when the path got narrower and narrower he forged ahead dragging the bike through the swampy bits of the Ranges. We're convinced no one else has done that route on a bike before.<\/p><img src='images\\years\\2018\\2018_04_22-01-AshRangesMTB.jpg' class='diaryImage' alt='Ash Ranges' \/><p class='diaryImageCaption'>Ash Ranges<\/p><a href=\"https:\/\/www.strava.com\/activities\/1524224437\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>Daddy did a BBQ Sunday lunch which was nice, especially as we sat outside in the sun. We then biked in the woods to the Mytchett Canal centre. We hired a pedalo and proceeded to be a menace on the water ways. Ben got grumpy and frustrated that he couldn't steer the vessel. Anyway it was fun. We had an ice cream after and went home to watch some more Prison Break.<\/p><img src='images\\years\\2018\\2018_04_22-10-CanalCentreBikeRideAndPedalo.jpg' class='diaryImage' alt='Pedalo'ing' \/><p class='diaryImageCaption'>Pedalo'ing<\/p>","images":false},"title":{"value":"Frimley Flippers, Pedalos"},"version":2},{"date":{"d":21,"m":4,"y":2018},"datev":20180421,"first":{"value":null},"images":3,"info":{"content":"<p>First up was parkrun and the Flyers were doing a pacing weekend. We had representatives from 20 to 40 mins and at some points we had two of us running. Daddy paced 27 minutes with Alfie. It was so nice to help people along.<\/p><img src='images\\years\\2018\\2018_04_21-03-ParkrunPacing.jpg' class='diaryImage' alt='Flyers Pacers' \/><p class='diaryImageCaption'>Flyers Pacers<\/p><p>We had our penultimate fixture of the season at Heatherside. We had a full squad of all 15 players which was nice to see. We could get a squad lineup photo. We ran out winners by 5-1. Things are a little more calm this week. Ben had to leave at half time to go to his next event.<\/p><img src='images\\years\\2018\\2018_04_21-03b-MytchettTeamLineUp.jpg' class='diaryImage' alt='Mytchett Athletic Falcons U13s 2017\/18. Top: Loz, Oli, Tom, Abe, Cam, Ben H, Jayden, Charlie, Daddy. Bottom: Callum, Kieran, Yuv, Freddie, Ethan, Alex, Dan, Ben G' \/><p class='diaryImageCaption'>Mytchett Athletic Falcons U13s 2017\/18. Top: Loz, Oli, Tom, Abe, Cam, Ben H, Jayden, Charlie, Daddy. Bottom: Callum, Kieran, Yuv, Freddie, Ethan, Alex, Dan, Ben G<\/p><p>The next event being quad biking down at the edge of the New Forest. Ben and Joey had an hour and a half of circling a track. The confidence grew and grew. Joey had a moment where he lost concentration and hit the barriers quite hard which shook him up for a bit. He continued on. Ben came off absolutely loving it. He was full of it. We like to see that.<\/p><img src='images\\years\\2018\\2018_04_21-26-QuadBiking.jpg' class='diaryImage' alt='Quad biking' \/><p class='diaryImageCaption'>Quad biking<\/p><p>Ben headed off to the Elders to stay the night. The rest of us went home and watched Die Hard. Too much swearing in it!<\/p>","images":false},"title":{"value":"Parkrun Pacing, Football, Quad Biking, Ben Sleepover"},"version":3},{"date":{"d":20,"m":4,"y":2018},"datev":20180420,"first":{"value":null},"info":{"content":"<p>Ben had an outstanding Parent's evening and interim school report, whilst Katie was rewarded the Titanium award for attaining lots of award points. Jessica achieved Star of the Week at school for being kind to her friends.<\/p>","images":false},"title":{"value":"School Successes"},"version":0},{"date":{"d":18,"m":4,"y":2018},"datev":20180418,"first":{"value":null},"info":{"content":"<p>Mummy, Daddy, Ben and Jessica went to the rec to play cricket for 30 minutes in the evening. Very nice.<\/p>","images":false},"title":{"value":"Cricket"},"version":0},{"date":{"d":15,"m":4,"y":2018},"datev":20180415,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy went off to Alton to meet with some friends to do a 40 miler.\u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1509788913\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><p>In the afternoon Daddy and Ben went to Aldershot Banger racing along with the Elders and Ma Ma and Pop Pop. Daddy chatted with Gary there which was funny. The highlight was undoubtedly the American Styled DD at the end. All the cars were in a squared off part of the track. They faced each other and when the flag went down some just drove full speed into their opposite number. Mental.<\/p><img src='images\\years\\2018\\2018_04_15-01-AldershotBangerRacing.jpg' class='diaryImage' alt='Aldershot Krew in the rain' \/><p class='diaryImageCaption'>Aldershot Krew in the rain<\/p>","images":false},"title":{"value":"Alton Bike Ride and Aldershot Bangers"},"version":1},{"date":{"d":14,"m":4,"y":2018},"datev":20180414,"first":{"value":null},"info":{"content":"<p>Parkrunned at Frimley as we had a match straight after against Yateley Pumas.<\/p>","images":false},"title":{"value":"parkrun and Football"},"version":0},{"date":{"d":11,"m":4,"y":2018},"datev":20180411,"first":{"value":null},"info":{"content":"<p>Daddy's glucose control isn't too good and he's taken it upon himself to improve his situation. To that end he's bought the Libre Freestyle sensors which is stuck in your arm and uses NFC comms with the phone to download the results. A pretty graph is drawn using the XDrip+ app. Time will tell if things improve.<\/p>","images":false},"title":{"value":"Continous Glucose Monitor"},"version":0},{"date":{"d":9,"m":4,"y":2018},"datev":20180409,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy did his usual DIY Passport photos<\/p><img src='images\\years\\2018\\2018_04_09-05-PassportPhotos.jpg' class='diaryImage' alt='Passport' \/><p class='diaryImageCaption'>Passport<\/p>","images":false},"title":{"value":"Passport Time"},"version":0},{"date":{"d":8,"m":4,"y":2018},"datev":20180408,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning we went with the Turners over to the Crowthorne section of Swinley Forest for a MTB run. Ben having been ill recently didn't have much in the legs. It was nice to do some parts of Swinley not previously tackled before. It was pretty muddy out there.\u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1496457631\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><img src='images\\years\\2018\\2018_04_08-02-Swinley.jpg' class='diaryImage' alt='Ben suffering in Swinley' \/><p class='diaryImageCaption'>Ben suffering in Swinley<\/p><p>In the afternoon we went over to Ma Ma and Pop Pops for a belated family Easter party. It was pretty manic with all the children there playing various party games.<\/p><img src='images\\years\\2018\\2018_04_08-03-EasterPartyAtMaMas.jpg' class='diaryImage' alt='Ma Ma's party' \/><p class='diaryImageCaption'>Ma Ma's party<\/p>","images":false},"title":{"value":"Swinley MTB, Ma Ma's Easter Family Party"},"version":1},{"date":{"d":7,"m":4,"y":2018},"datev":20180407,"first":{"value":null},"images":1,"info":{"content":"<p>Ben not feeling too well and no football, Daddy saw this as an opportunity to do another tourist parkrun. It was at Hazelwood, where London Irish train.<\/p><p>We headed off to do walk 100 over in Pangbourne. We thought it was walk 99 at the time, so no big celebration! It was a wet, wet day. Daddy and Ben only wore trainers and subsequently ended up with wet feet as they walked along the Thames. Katie and Jess played in one of the streams. On our way home we popped in to Steven's for a catch-up and a cup of tea. When we got home Daddy and Ben were happy to watch the Manchester derby.\u000a\u000a    \u000a    <a href=\"https:\/\/www.strava.com\/activities\/1495042469\" target=\"_blank\">Route\u000a        \u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><img src='images\\years\\2018\\2018_04_07-02-Walk99-Pangbourne.jpg' class='diaryImage' alt='River Thames, Pangbourne' \/><p class='diaryImageCaption'>River Thames, Pangbourne<\/p>","images":false},"title":{"value":"Hazelwood parkrun, Walk 100 - Pangbourne, Steve Tea"},"version":2},{"date":{"d":5,"m":4,"y":2018},"datev":20180405,"first":{"value":null},"info":{"content":"<p>Daddy had a two day training course in posh offices in Paddington. It was on becoming a Certified Scrum Master. The course was very interesting. Daddy passed the exam so he is now certified!<\/p>","images":false},"title":{"value":"Scrum Master Training course"},"version":0},{"date":{"d":4,"m":4,"y":2018},"datev":20180404,"first":{"value":null},"images":3,"info":{"content":"<p>Ben really wasn't feeling too good, so stayed at Ma Ma and Pop Pop's whilst the rest of us headed down to Lymington to catch the ferry over to the Island Of Wight as Jessica terms it. We were foot passengers and enjoyed the 45 minute journey across the murky Solent, playing Uno. Once arrived we caught the bus, where the driver was experiencing her first ever drive in her new job!<\/p><p>We reached base camp at the Needles. It was a series of shops and entertainments, like a mini holiday area. It was deserted, we guess due to the poor weather. We watched a 4D cinema film, then went on the scary chair lifts down the cliff to the water's edge. It was windy and rainy. Katie was pretty scared. The chairs do ascend\/descend across a fairly steep gradient.<\/p><img src='images\\years\\2018\\2018_04_04-15-NeedlesIOW.jpg' class='diaryImage' alt='The chair ride down' \/><p class='diaryImageCaption'>The chair ride down<\/p><p>We caught the tourist bus up to the Needles, but didn't explore around as the weather was appalling. We ended back at Yarmouth to grab lunch from the bakery. Skimmed stones on the mini beach before catching an early boat back to the main land again.<\/p><img src='images\\years\\2018\\2018_04_04-24-NeedlesIOW.jpg' class='diaryImage' alt='Needles in the background. Somewhere' \/><p class='diaryImageCaption'>Needles in the background. Somewhere<\/p><img src='images\\years\\2018\\2018_04_04-21-NeedlesIOW.jpg' class='diaryImage' alt='Making sand bottles' \/><p class='diaryImageCaption'>Making sand bottles<\/p>","images":false},"title":{"value":"Island Of Wight - Needles"},"version":1},{"date":{"d":3,"m":4,"y":2018},"datev":20180403,"first":{"value":null},"images":3,"info":{"content":"<p>Katie expressed a desire to go and see the shops owned by TOWIE stars (The Only Way Is Essex). We jumped at the chance, so headed around the M25 to Brentwood. We trawled the High Street and visited half a dozen shops and some of the hang out haunts used in the program. Katie was very self conscious of not looking sad when taking photos of her in front of these shops. One of the last we visited we actually went in and Katie bought some clothes.<\/p><img src='images\\years\\2018\\2018_04_03-06-BrentwoodTowieShopping.jpg' class='diaryImage' alt='Outside Chloes, Brentwood High Street' \/><p class='diaryImageCaption'>Outside Chloes, Brentwood High Street<\/p><p>Daddy decided that he was going to bike home and so got on his road bike and headed off towards London. He passed the Olympic Stadium, Bank, London Wall and the Houses Of Parliament. It took him 6 hours to get home!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1487802978\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_04_03-15-RideAcrossLondon.jpg' class='diaryImage' alt='London Wall' \/><p class='diaryImageCaption'>London Wall<\/p><img src='images\\years\\2018\\2018_04_03-07-RideAcrossLondon.jpg' class='diaryImage' alt='Olympic Swimming Centre' \/><p class='diaryImageCaption'>Olympic Swimming Centre<\/p>","images":false},"title":{"value":"Brentwood Towie Shopping - Cycle Home Through London"},"version":1},{"date":{"d":1,"m":4,"y":2018},"datev":20180401,"first":{"value":null},"images":2,"info":{"content":"<p>Jessica still not feeling too well today. However, after some medicine she lasts for a couple of hours in the land of living. We had a decorate your egg and handing over chocolate eggs to each other. Daddy didn't get mummy an egg this year, citing that there are too many in the house.<\/p><img src='images\\years\\2018\\2018_04_01-02-EasterSunday.jpg' class='diaryImage' alt='Eggselent Breakfast' \/><p class='diaryImageCaption'>Eggselent Breakfast<\/p><p>Daddy stayed behind to garden and look after Jessica whilst the rest of us went to church. Ben confidently made a reading in front of the congregation. People remarked how well he did. That boy does not suffer from nerves.<\/p><p>We had Susan and Graham and the Fars over for Sunday lunch. Mummy had slow boiled beef in a gravy. It was very nice. Jessica and Ben made pudding which consisted of taking the top off an Easter egg and filling it with chocolate ice cream, raspberries, blueberries and cream. Not one for the health enthusiasts. Charlotte, Loz and Lenny later popped by as well.<\/p><img src='images\\years\\2018\\2018_04_01-09-EasterSunday.jpg' class='diaryImage' alt='Easter lunch' \/><p class='diaryImageCaption'>Easter lunch<\/p>","images":false},"title":{"value":"Ben church reading, Easter Sunday with Gay's"},"version":0},{"date":{"d":31,"m":3,"y":2018},"datev":20180331,"first":{"value":null},"images":2,"info":{"content":"<p>Daddy on a bit of a mission of not repeating runs or bike ride routes at the moment. Therefore he decided to try a new parkrun, Osterley Park. Half of it was on proper paths the other half on grass and with all the rain it became a bit of a mud bath.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1481132219\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>After rushing home we all then went out to Reading town centre and met with the Sanders to go in the Compassion HGV lorry. There were separate rooms recreating the life of a Ugandan girl. Her home, school, hospital. It was there so you could potentially sponsor a child. It had little impact on the children I think, but we thought it important to go, to attempt to show how lucky the children should feel.<\/p><img src='images\\years\\2018\\2018_03_31-08-ReadingCompassionBusAndEggTrail.jpg' class='diaryImage' alt='Outside The Compassion Centre' \/><p class='diaryImageCaption'>Outside The Compassion Centre<\/p><p>After a photo and a face painting we headed off to Pinkney's Green and a National Trust egg hunt. We got there just in time as we hadn't noticed the 2pm closing time. It was a little disappointing as there were no clues to solve and turned out to be a 1km circular walk around a field! We collected our eggs and swapped Easter goodies between the families.<\/p><img src='images\\years\\2018\\2018_03_31-10-ReadingCompassionBusAndEggTrail.jpg' class='diaryImage' alt='Pinkney's Green Egg Hunt' \/><p class='diaryImageCaption'>Pinkney's Green Egg Hunt<\/p><a href=\"https:\/\/www.strava.com\/activities\/1482119998\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>After we scooted to Camberley as we had to get our eyes tested. Jessica had her done at the hospital and they were fine. Both Ben and Katie didn't need glasses, although Katie really wanted them so she could look intelligent, so she says.<\/p><p>Mummy and Daddy both needed reading glasses. Mummy embarrassed us all with her selection. Katie almost ran out of the shop in distress! Daddy couldn't find a pair that he and mummy liked.<\/p>","images":false},"title":{"value":"Osterley Park parkrun, Compassion Bus, Pinkney's Egg Hunt, Eye Test"},"version":0},{"date":{"d":30,"m":3,"y":2018},"datev":20180330,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning the Elders came over and joined us for the Easter workshop at St Andrews church. Ben ran the obstacle course game for the children. The children love him. There were arts, crafts and food making stalls. After there was a church service that even Daddy stayed for. The Elders popped back for a cuppa before parting ways. We went over to Sylvies for the annual egg hunt at her house.<\/p><img src='images\\years\\2018\\2018_03_30-01-EasterWorkshop.jpg' class='diaryImage' alt='Ben running the Children's obstacle course' \/><p class='diaryImageCaption'>Ben running the Children's obstacle course<\/p><p>After watching a couple of episodes of Prison Break Season 1, Daddy left us to motorbike to Reading. It was raining lots. Phil had a ticket for him which was most generous. It was a good game to watch with Reading 1-0 for most of it, despite going down to ten men and conceding a penalty in the 90th minute. The QPR fans weren't happy when it was saved. There were some coins being thrown between the fans.<\/p>","images":false},"title":{"value":"Good Friday Workshop, Sylvie's Egg Hunt, Reading v QPR"},"version":0},{"date":{"d":25,"m":3,"y":2018},"datev":20180325,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Ben went off to Thorpe Park with his friends: Oli, Kieran and Yuv. First of many this year it sounds. They went on all the big rides. They experienced the Derren Brown ghost train simulator ride for the first time.<\/p><img src='images\\years\\2018\\2018_03_25-02-ThorpeParkBen.jpg' class='diaryImage' alt='Thorpe Parkers' \/><p class='diaryImageCaption'>Thorpe Parkers<\/p><p>Daddy meanwhile has got a thing for filling in his running and biking heatmaps. Today there was a large hole in the Wokingham area so headed without a plan to that area. He found it tough going. After lunch we watch some more Prison Break season 1 which we like at the moment.<\/p><p>Mummy and Jessica went to church, whilst Katie was still recovering from her DoE exploits. In the afternoon Daddy went off to New Malden to pickup Jessica's new bike and collect the boys.<\/p>","images":false},"title":{"value":"Ben Thrope Park, Daddy Wokingham Ride, Katie Party"},"version":0},{"date":{"d":24,"m":3,"y":2018},"datev":20180324,"first":{"value":null},"images":1,"info":{"content":"<p>Katie Gay spent last night out in a two man tent with Georgia somewhere in the Surrey Hills.She had to walk 9 miles with a massive rucksack on her back and today she walked 15 miles. The tent she had unfortunately was a beach tent apparently, so was not waterproof. Of course it rained, so poor old Katie only managed to get to sleep at 4am!<\/p><p>Today she walked from Puttenham down to Farley Green, then back up to Newlands Corner. They got lost a bit, so re-traced their steps to get on the right track. Out of the 5 who started in their group, only 3 finished!<\/p><p>Meanwhile Ben had a game, without Daddy being there, against Cove Leopards who they beat 8-1 two weeks ago. Unfortunately we lost 1-0 to a dodgy penalty. Cove had some players back and looked a different team. The spirits were good, although we are having difficulties with the players commitment and one of the parents who thinks they know best.<\/p><p>Daddy was equally active in the morning. He motorbiked down to Salisbury and did their 4 lap parkrun. It was OK, not his favourite circuit. He then continued down to join the other Frimley Flyers for their Rio arranged brewery tour. Rio are owned by Hall and Woodhouse who brew Badger beer in Blandford Forum. So he spent a couple of hours on the tour as well as sampling a couple of the beers.<\/p><img src='images\\years\\2018\\2018_03_24-11-BlandfordBreweryTour.jpg' class='diaryImage' alt='Hall and Woodhouse Flyers' \/><p class='diaryImageCaption'>Hall and Woodhouse Flyers<\/p><p>After picking up Katie in the afternoon we had a nice treat Fish and Chip dinner and collapsed in front of the TV. Katie was asleep by 8:30pm!<\/p>","images":false},"title":{"value":"Duke Of Edinburgh, Football, Salisbury parkrun, Hall and Woodhouse Brewery tour"},"version":0},{"date":{"d":20,"m":3,"y":2018},"datev":20180320,"first":{"value":null},"info":{"content":"<p>We went to see Jessica's teacher for parents' evening. She had been doing badly in Maths and English.... Here results were below 10% in tests. The teacher did not understand why this should be so in Maths. She had been doing well. Jessica said she felt under time pressure in the tests. In English she is not great at spelling... and for the last test she hadn't realized there was more than one page of questions! Anyway we have arranged Jessica to have some tutoring with Ma Ma, once a week starting in the Easter holidays to try and get her back up to the mainstream. We are not too worried (worried nonetheless) as we don't think she's as bad as the results say.<\/p>","images":false},"title":{"value":"Jessica's Parents' Evening"},"version":0},{"date":{"d":18,"m":3,"y":2018},"datev":20180318,"first":{"value":null},"info":{"content":"<p>It was supposed to be a packed day today. However, because of the snow, the Fleet Half Marathon which Daddy was supposed to run and our afternoon over in Gillingham with Helen and Fiona had been cancelled. This meant we had a lazy day at home doing odd jobs, church and a marathon game of Trivial Pursuit which Ben eventually won. We all were within one cheese of winning.<\/p><p>In the evening Daddy went with Jessica and Ben onto the hill at the rec. They were the only ones there to go sledging. Brilliant.<\/p>","images":false},"title":{"value":"Snowed off"},"version":0},{"date":{"d":17,"m":3,"y":2018},"datev":20180317,"first":{"value":null},"images":4,"info":{"content":"<p>We started the day with snow threatening us. It was bitterly cold outside. Daddy started off with a trip to Frimley Lodge and parkrun. He took it particularly easy because of the impending Fleet Half marathon the day after..... which in fact later got called off!<\/p><img src='images\\years\\2018\\2018_03_17-02-parkrun.jpg' class='diaryImage' alt='parkrun' \/><p class='diaryImageCaption'>parkrun<\/p><p>The Falcons had an important game against Liss Cobras Blue. The losers were pretty certain not to get the remaining promotion spot.... and unfortunately we lost 5-2. It was possibly the coldest game ever, with snow being brushed off so we could see the lines. We had 4 subs as well which meant we had to rotate constantly otherwise they would have frozen to the ground! A mixture of weather, lack of effort and poor attitude probably led us to defeat having been in the lead at 2-1.<\/p><img src='images\\years\\2018\\2018_03_17-02-FalconsVLissCobras.jpg' class='diaryImage' alt='Falcons in the snow' \/><p class='diaryImageCaption'>Falcons in the snow<\/p><p>In the afternoon Daddy and Ben headed off to Cobham services. Daddy had bought a Bike Box from a person living in Ashford. He had hoped it was Ashford, Middlesex. But no it was of course Ashford, Kent! Luckily the man was travelling to Wimbledon which was lucky as we were going that way too. The chap even reduced the price of the bike box to £80. Bargain. Once collected the boys headed up to the Imperial War Museum as Ben had been pretty enthusiastic about wars (is that a good thing?). They parked around the corner at about 4:15pm so had just under 2 hours to explore the place.<\/p><p>They started at the bottom of the museum intending to make their way up. Ben was so interested they spent most of the time in the World War I section. It was very well laid out. The exhibits were interesting. Ben tried to justify his hours spent on the PlayStation by identifying all the guns. Again a bit of a worry. The boys vowed to return back in the summer after a London parkrun.<\/p><img src='images\\years\\2018\\2018_03_17-01-ImperialWarMuseum.jpg' class='diaryImage' alt='Imperial War Museum' \/><p class='diaryImageCaption'>Imperial War Museum<\/p><p>After, they headed down the cosmopolitan Walworth Road and a KFC beckoned. Ben's choice. And it was greasy. A bargain bucket with 6 chicken pieces. Daddy was almost sick after that. Ben couldn't munch his way through all that!<\/p><img src='images\\years\\2018\\2018_03_17-04-FeederBrixton.jpg' class='diaryImage' alt='About to enter the Academy a la Brixton' \/><p class='diaryImageCaption'>About to enter the Academy a la Brixton<\/p><p>Next stop was Brixton. They parked 5 minutes away from the O2 Academy and met with the Harvey's in the seating at the top. It was Ben's first proper gig. He thought it was very loud but was rocking away, especially to Buck Rogers! The boys had a great day.<\/p><p>It finished at 11pm. There was driving snow. They gave the Harvey's a lift home. Didn't get home until quatre to one.<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/MOi6fZKULx4\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"parkrun, Ben Football, Imperial War Museum, Feeder Gig, Lily sleepover"},"version":2},{"date":{"d":15,"m":3,"y":2018},"datev":20180315,"first":{"value":null},"info":{"content":"<p>After watching Evie's show last weekend, Jessica has become very enthusiastic to join in a play or production. So we joined her up with the group that Katie was with last year, and Katie's friend Catherine is still a member of.<\/p><p>Jessica came back after the two hour session having loved it. They played a mixture of games and she was introduced to the script, Romeo and Julliet. Jessica wondered who was going to play the role of the frog..... thinking it was Gnomeo and Julliet! She hadn't realized the Shakespearean aspect to the piece! She landed the role of one of the Capulet (Juliet's) family.<\/p>","images":false},"title":{"value":"Jessica starts Acting group"},"version":0},{"date":{"d":11,"m":3,"y":2018},"datev":20180311,"first":{"value":null},"images":2,"info":{"content":"<p>Mummy and Jessica went around to Ma Ma and Pop Pops to give Ma Ma her Mother's Day present. They snuck into the house and secretly made breakfast in bed for Ma Ma. Jessica pretended to be a burglar and shocked poor Ma Ma.<\/p><p>Daddy went to see Farmor. Mummy had presents from Jessica and Ben, but Katie lost her bank card so couldn't get anything!<\/p><p>Later in the afternoon we all went around to the Fars where we played games for an hour or so, before Katie and Ben went to Church Club.<\/p><img src='images\\years\\2018\\2018_03_11-01-BenMothersDayCad.jpg' class='diaryImage' alt='Ben's card' \/><p class='diaryImageCaption'>Ben's card<\/p><img src='images\\years\\2018\\2018_03_11-01-JessicaMothersDayCad.jpg' class='diaryImage' alt='Jessica's card' \/><p class='diaryImageCaption'>Jessica's card<\/p>","images":false},"title":{"value":"Mothers Day"},"version":0},{"date":{"d":10,"m":3,"y":2018},"datev":20180310,"first":{"value":null},"images":2,"info":{"content":"<p>A busy morning. First Katie went along with Georgia to school as a prep meeting for her Duke Of Edinburgh bronze, hike and camp weekend. She took in her rucksack fully packed with tent, sleeping bag, the works. We bought her new boots, leggings, plate, tent, etc. for it.<\/p><p>Meanwhile the rest of us went to Cove Football Club to watch Ben play against Theo's team. Unfortunately Theo was not well, but the team played well and won the game 9-1! Ben had an average game.<\/p><p>We all met up for lunch back at home, then we headed towards Fareham, and Fort Nelson. We weren't sure what to quite expect. However, it was a grand fort with a museum and a chance to look at some guns, cannons, tunnels, and the fort itself. We must have been a couple of hours exploring around. Of course, Daddy and Ben paid more attention to the exhibits than the girls. We stopped off at Port Solent for a spot of Fish and Chips overlooking Porchester Castle on the way home.<\/p><img src='images\\years\\2018\\2018_03_10-11-NelsonFort.jpg' class='diaryImage' alt='Down in the tunnels in Fort Nelson' \/><p class='diaryImageCaption'>Down in the tunnels in Fort Nelson<\/p><img src='images\\years\\2018\\2018_03_10-20-NelsonFort.jpg' class='diaryImage' alt='Eating Fish and Chips in Port Solent' \/><p class='diaryImageCaption'>Eating Fish and Chips in Port Solent<\/p><p>In the evening Evie and Richard were performing in a show over in the Princes Theatre, Aldershot, so the girls went over to watch. the boys stayed in and watched 4 episodes of World War 2 In Colour!<\/p>","images":false},"title":{"value":"9-1 Football, Katie DoE prep, Fort Nelson, Evie show"},"version":0},{"date":{"d":9,"m":3,"y":2018},"datev":20180309,"first":{"value":null},"info":{"content":"<p>Daddy decided to run home from work today. Farfar gave him a lift in to work. There were many well wishers, especially with the weather being dark and dismal. Daddy didn't mind this. People at work were so sweet asking for a text when he got in, and to check his sugar levels. Sugar levels were at 14, so he took 4m\/mols, to take the edge off. However, this was probably his downfall. After scaling the Hogs Back at Puttenham, Daddy began to feel a bit weary. Eventually after crossing the Ranges he called up mummy to collect him as he was struggling too much. His levels had dropped to 2.3! A challenge to re-try one feels.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1444314968\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/M7bbC5nOFfA\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Daddy run home from work"},"version":2},{"date":{"d":6,"m":3,"y":2018},"datev":20180306,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica went in as Alice in Wonderland<\/p><img src='images\\years\\2018\\2018_03_06-01-WorldBookDay.jpg' class='diaryImage' alt='Jessica in Wonderland' \/><p class='diaryImageCaption'>Jessica in Wonderland<\/p>","images":false},"title":{"value":"World Book Day"},"version":0},{"date":{"d":4,"m":3,"y":2018},"datev":20180304,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy motorbiked up to London to visit the Museum of London which was very interesting. Interested to see the Romans building it up, then it went into nothing because the Romans left in 400ad. Then the like of the plague killed the population growth, and the boundaries were set for a long time - the London Wall. It wasn't until after the Great Fire London things accelerated again. It was quite interesting for Daddy.<\/p><img src='images\\years\\2018\\2018_03_04-02-MuseumOfLondon.jpg' class='diaryImage' alt='Museum of London' \/><p class='diaryImageCaption'>Museum of London<\/p><p>Meanwhile the rest of us went over to Ma Ma and Pop Pop's.<\/p>","images":false},"title":{"value":"Museum of London, Ma Ma and Pop Pops"},"version":1},{"date":{"d":3,"m":3,"y":2018},"datev":20180303,"first":{"value":null},"images":4,"info":{"content":"<p>Ben slept over at Jonny's last night so we didn't see him in the morning.<\/p><p>The other 4 of us split in two. Daddy and Jessica went to do parkrun in the snow. Daddy pulled Jessica around the whole 3 mile course! Jessica enjoyed it!<\/p><img src='images\\years\\2018\\2018_03_03-06-parkrunSledge.jpg' class='diaryImage' alt='Only 400 metres done' \/><p class='diaryImageCaption'>Only 400 metres done<\/p><img src='images\\years\\2018\\2018_03_03-08-parkrunSledge.jpg' class='diaryImage' alt='Canal turn' \/><p class='diaryImageCaption'>Canal turn<\/p><img src='images\\years\\2018\\2018_03_03-07-parkrunSledge.jpg' class='diaryImage' alt='Flyers Lineup' \/><p class='diaryImageCaption'>Flyers Lineup<\/p><p>Meanwhile Daddy gave Mummy a tri down the hairdressers.... and Mummy treated Katie to a trip as well. So they went to Grayderz in Frimley Green to have their hair chopped and eyebrows done.<\/p><p>At lunchtime Mummy and Daddy went for their annual Marie Curie collecting stint, this time at the Meadows.<\/p><img src='images\\years\\2018\\2018_03_03-01-MarieCurieCollecting.jpg' class='diaryImage' alt='Marie Curie collection' \/><p class='diaryImageCaption'>Marie Curie collection<\/p>","images":false},"title":{"value":"parkrun Sledge, girls hairdressers, Marie Curie collecting, "},"version":1},{"date":{"d":1,"m":3,"y":2018},"datev":20180301,"first":{"value":null},"images":2,"info":{"content":"<p>It's been snowing on and off for the past 2 days. Today was the full day at home for us children as the schools were shut. Mummy and Daddy worked from home. We managed a number of trips up to the rec. There were loads of people there.<\/p><img src='images\\years\\2018\\2018_03_01-21-Sledging1.jpg' class='diaryImage' alt='Jessie!' \/><p class='diaryImageCaption'>Jessie!<\/p><img src='images\\years\\2018\\2018_03_01-06-Sledging1.jpg' class='diaryImage' alt='Jessica racing down Frimley Green rec' \/><p class='diaryImageCaption'>Jessica racing down Frimley Green rec<\/p>","images":false},"title":{"value":"Snow"},"version":0},{"date":{"d":25,"m":2,"y":2018},"datev":20180225,"first":{"value":null},"images":1,"info":{"content":"<p>It was exceptionally cold all day. Daddy went for another training run, trailing the streets of Camberley attempting new roads so it'll look more diverse on a heat running map. Don't ask! \u000a    \u000a    <a href=\"https:\/\/www.strava.com\/activities\/1425250238\" target=\"_blank\">Route\u000a        \u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><p>In the afternoon Ben went off to the cinema with Callum to watch Black Panther. The film got a thumbs up from him.<\/p><p>Daddy painted in the kitchen to freshen up some of the walls and did other DIY jobs. Mummy went to church and in the evening Ben and Katie went to a church session much to their dissatisfaction.<\/p><img src='images\\years\\2018\\2018_02_25-02-Painting.jpg' class='diaryImage' alt='Painter' \/><p class='diaryImageCaption'>Painter<\/p>","images":false},"title":{"value":"Long Run, Ben Cinema Black Panther"},"version":2},{"date":{"d":24,"m":2,"y":2018},"datev":20180224,"first":{"value":null},"images":3,"info":{"content":"<p>Football was going to be at Frimley Lodge Park. However, Daddy was the one to decide whether it should be played or not. It was a tough decision and one that was made as he was on his second lap of parkrun!<\/p><p>This left a free spot in the afternoon. Just right for another walk. A longer one this time. 4.5 miles on Reigate Hill. We got lost a bit in the first mile and walked on some private farmers land and eventually crossed a foot bridge to a disused farm! Very spooky. Us children didn't moan as much as usual. We were primed early enough. Anyway we completed the muddy walk in a couple of hours and came home to some sweet treats from the shops and a nice mug of hot chocolate.\u000a    \u000a    <a href=\"https:\/\/www.strava.com\/activities\/1423779503\" target=\"_blank\">Route\u000a        \u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><img src='images\\years\\2018\\2018_02_24-22-Walk98-ReigateHill.jpg' class='diaryImage' alt='Reigate Hill temple' \/><p class='diaryImageCaption'>Reigate Hill temple<\/p><img src='images\\years\\2018\\2018_02_24-18-Walk98-ReigateHill.jpg' class='diaryImage' alt='Reigate Hill walkers' \/><p class='diaryImageCaption'>Reigate Hill walkers<\/p><p>In the evening Mummy and Daddy went out to Dave Peddle's 50th Birthday party held at Camberley Cricket Club. It was a fun evening as first there was some food, then a music quiz, which we clubbed together with Lee and the Erskines. After that there was a Russian Trio who entertained us with songs. Great fun. The Fars came to babysit us.<\/p><img src='images\\years\\2018\\2018_02_24-02-DavePeddle50th.jpg' class='diaryImage' alt='Party go-ers' \/><p class='diaryImageCaption'>Party go-ers<\/p>","images":false},"title":{"value":"parkrun, Walk 99 Reigate Hill, Dave Peddle 50th Party"},"version":2},{"date":{"d":23,"m":2,"y":2018},"datev":20180223,"first":{"value":null},"info":{"content":"<p>Ben's starting to get really good friends with Johnny now. No.1 Friend? Ben, Johnny, Katie and Catherine went out to Camberley in the evening first to eat ice cream at Creams, then into the arcade to play some video games. All four returned for a sleepover at our house.<\/p>","images":false},"title":{"value":"Ben and Katie Creams and Arcades with Catherine and Johnny + Sleepover"},"version":0},{"date":{"d":18,"m":2,"y":2018},"datev":20180218,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning Daddy and Ben went out mountain biking with Oli and Jon in the Tunnel Hill area. \u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1413502116\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><img src='images\\years\\2018\\2018_02_18-02-MTBRide.jpg' class='diaryImage' alt='Ben deep in a puddle' \/><p class='diaryImageCaption'>Ben deep in a puddle<\/p><p>Mummy went to church, the rest of us lazy children stayed at home, objecting to keep Mummy company.<\/p><p>After a lovely Sunday lunch we headed off for a walk. Within a mile there was a problem with the brakes on the car, so we had to turn around and go back home. We flaked out in the afternoon and evening with a mix of card games, computer games and watching Winter Olympics.<\/p>","images":false},"title":{"value":"MTBing, church and failed car"},"version":1},{"date":{"d":17,"m":2,"y":2018},"datev":20180217,"first":{"value":null},"images":1,"info":{"content":"<p>We had an earlier than usual kick-off over on Ancells Park, Fleet. We were against Hart Tornados. They only had 10 men so we felt obliged to also only play with 10. We won the game 10-4.<\/p><p>After lunch we went over to Gravity Force to bounce up and down for an hour. After Daddy swapped his Valentines present for a couple of work shirts. We left him at the Meadows Roundabout as he wanted to run 11 miles home!\u000a<a href=\"https:\/\/www.strava.com\/activities\/1412326808\" target=\"_blank\">Route<img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><p>In the evening Mummy and Katie went to Prezzo in Camberley for a nice meal.<\/p><img src='images\\years\\2018\\2018_02_18-01-KatieAndPreSchoolFriendsMeal.jpg' class='diaryImage' alt='Pre School friends, Natasha, Nina and Grace' \/><p class='diaryImageCaption'>Pre School friends, Natasha, Nina and Grace<\/p>","images":false},"title":{"value":"Falcons Football, 11 mile run, Gravity Force, Meal with Katie Preschool friends"},"version":0},{"date":{"d":14,"m":2,"y":2018},"datev":20180214,"first":{"value":null},"images":2,"info":{"content":"<p>Daddy got mummy a haircut and a nice top, whilst mummy got daddy some trousers which were later swapped for a couple of smart work shirts from Next. They went to the Wheatsheaf in the evening for a meal.<\/p><img src='images\\years\\2018\\2018_02_14-01-Valentines.jpg' class='diaryImage' alt='Lovers' \/><p class='diaryImageCaption'>Lovers<\/p><img src='images\\years\\2018\\2018_02_14-04-Valentines.jpg' class='diaryImage' alt='Daddy's card to mummy' \/><p class='diaryImageCaption'>Daddy's card to mummy<\/p>","images":false},"title":{"value":"Valentines"},"version":0},{"date":{"d":11,"m":2,"y":2018},"datev":20180211,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Mummy ran Sunday school, whilst Daddy went out for a slow 10 mile run taking in Ash Ranges. \u000a\u000a    <a href=\"https:\/\/www.strava.com\/activities\/1402130713\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><\/p><p>After Sunday lunch we went out for walk 98. Tidmarsh, outside Reading was the destination. A nice wildlife walk spoiled slightly by the roar of the M4! We started in the sunshine and Daddy even contemplated not taking a coat. Half way round we were hit by a couple of hail storms. It made things interesting!<\/p><a href=\"https:\/\/www.strava.com\/activities\/1402834768\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_02_11-06-Walk97-Tidmarsh.jpg' class='diaryImage' alt='Monkies' \/><p class='diaryImageCaption'>Monkies<\/p><img src='images\\years\\2018\\2018_02_11-12-Walk97-Tidmarsh.jpg' class='diaryImage' alt='Before hail storm' \/><p class='diaryImageCaption'>Before hail storm<\/p>","images":false},"title":{"value":"Walk 98 Tidmarsh, 10 mile run"},"version":1},{"date":{"d":10,"m":2,"y":2018},"datev":20180210,"first":{"value":null},"images":2,"info":{"content":"<p>Football was again cancelled this week as the opposition could not field a team. Auntie Ellie and Mummy went off early to help Ma Ma and Pop Pop again at their car boot fair, whilst Daddy ran parkrun.<\/p><p>Later in the afternoon we picked up Ameret and Yuv and took them to Coral Reef. Steve and Matt had hired out the pool for an hour as a Christmas present. So there were 40 or 50 of us who had the pool and flumes all to ourselves. No one had been since they had done the place up. Other than the flumes it was difficult to see what they had done! The flumes were excellent. 3 requiring inflatable tyres and two quicker slides. We all had a great time.<\/p><img src='images\\years\\2018\\2018_02_10-09-CoralReef.jpg' class='diaryImage' alt='Spa Pool' \/><p class='diaryImageCaption'>Spa Pool<\/p><img src='images\\years\\2018\\2018_02_10-14-CoralReef.jpg' class='diaryImage' alt='Volcano' \/><p class='diaryImageCaption'>Volcano<\/p>","images":false},"title":{"value":"parkrun, Coral Reef"},"version":0},{"date":{"d":9,"m":2,"y":2018},"datev":20180209,"first":{"value":null},"images":1,"info":{"content":"<p>Karen had arranged a birthday get together at a bar in Fleet which Mummy and Auntie Ellie were invited too. Lily came for a sleepover. Ellie was determined to cross off her getting drunk and go clubbing tick boxes as part of her to do list for turning 40. They had 6 cocktails.<\/p><img src='images\\years\\2018\\2018_02_09-01-LauraEllie.jpg' class='diaryImage' alt='Party girls' \/><p class='diaryImageCaption'>Party girls<\/p>","images":false},"title":{"value":"Mummy and Ellie going out out. Lily sleepover"},"version":0},{"date":{"d":4,"m":2,"y":2018},"datev":20180204,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy went out early door for a 40 mile bike ride with the Rockets.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1391086223\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_02_04-04-RocketsRide.jpg' class='diaryImage' alt='Rockets Riders' \/><p class='diaryImageCaption'>Rockets Riders<\/p><p> In the afternoon we all went down to the Harvester for lunch with the Home Bible group that Mummy sees each Wednesday.<\/p>","images":false},"title":{"value":"Rockets Ride, Bible Group Lunch"},"version":1},{"date":{"d":3,"m":2,"y":2018},"datev":20180203,"first":{"value":null},"images":1,"info":{"content":"<p>At 6am we were awoken by Ma Ma and Pop Pop who were going to take Jessica and Katie to the car boot fair. They had a car boot-full of gear to sell. However, the girls were not very compliant. In the end mummy popped down to help out.<\/p><p>We had varied family support in the big match, Mytchett Falcons v Alton Huskies. It was a one sided affair to be honest. Joey playing in defence put in some solid tackles, whilst Ben in midfield played some nice passes. It ended with a home victory, 5-0. The Elders returned for some lunch before heading off in the afternoon to the Trampoline park in Basingstoke for Joey's 13th birthday party. They had an hours worth of fun before we all headed off to McD's for some nurishment! We parted ways with the Elders. Ben went to Alton for a sleepover, whilst Lily came home with us and played with Katie and Jessa. Ma Ma and Pop Pop also stayed the night.<\/p><img src='images\\years\\2018\\2018_02_03-02-Trampolining.jpg' class='diaryImage' alt='Pre Bounce Shot' \/><p class='diaryImageCaption'>Pre Bounce Shot<\/p>","images":false},"title":{"value":"parkrun, boot fair, Falcons v Huskies, Joey 13th party, Sleepovers"},"version":0},{"date":{"d":28,"m":1,"y":2018},"datev":20180128,"first":{"value":null},"images":2,"info":{"content":"<p>Jessica still not feeling too well so we didn't do too much more than play more Uno.<\/p><p>In the later afternoon, the Fars treated us to a couple of hours down the bowling alley. Daddy scored one of his best scores ever with 129. We of course had the guide rails up. It was good fun.<\/p><img src='images\\years\\2018\\2018_01_28-01-Uno.jpg' class='diaryImage' alt='Uno' \/><p class='diaryImageCaption'>Uno<\/p><img src='images\\years\\2018\\2018_01_28-00-BowlingWithFars.jpg' class='diaryImage' alt='Ten Pin Bowling at Farnborough' \/><p class='diaryImageCaption'>Ten Pin Bowling at Farnborough<\/p>","images":false},"title":{"value":"Fars Ten Pin Bowling"},"version":3},{"date":{"d":27,"m":1,"y":2018},"datev":20180127,"first":{"value":null},"info":{"content":"<p>Daddy parkrunned in the morning. The Falcons game was called off. It is very wet out there. Jessica was off school yesterday and wasn't feeling 100% today so we played some Uno.<\/p><p>In the evening Katie and Ben went on a sleepover to the same house (weird). Their friends Jonny and Catherine are siblings. They stayed up late and ate pizza.<\/p>","images":false},"title":{"value":"parkrun, Falcons, Jonny and Catherine sleepover"},"version":0},{"date":{"d":26,"m":1,"y":2018},"datev":20180126,"first":{"value":null},"images":1,"info":{"content":"<p>We got a message rom Eagle Radio to see if we wanted to par-take again the Family Faceoff game. Of course Mummy said yes. Jessica was her intended opponent, however Ben wanted to take a 2-0 lead. Here is a link to the video of the radio program!<\/p><a href=\"https:\/\/www.facebook.com\/eagleradio\/videos\/10155035922722181\/\"><img src='images\\years\\2018\\2018_01_26-01-EagleRadioFamilyFaceOff.jpg' class='diaryImage' alt='Eagle Radio studio when we were on' \/><p class='diaryImageCaption'>Eagle Radio studio when we were on<\/p><\/a>","images":false},"title":{"value":"Eagle Radio: Family face off"},"version":0},{"date":{"d":21,"m":1,"y":2018},"datev":20180121,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy and Ben woke to snow. As part of the Frimley Flyers league, Ben was running the Farnborough 5km with Daddy. As mummy was in Kent, the boys had to bike to the start by the airport. It was very cold. The boys arrived slightly late and missed the start. Fortunately times were recorded from a chip, so it didn't really matter too much. It did mean they started at the very back. They first overtook Dennis and ended up finishing in the top 10%! 25 minutes was the time, earning Ben maximum points in the league.<\/p><img src='images\\years\\2018\\2018_01_21-02-Farnborough5km.jpg' class='diaryImage' alt='Ben crossing the finishing line' \/><p class='diaryImageCaption'>Ben crossing the finishing line<\/p><p>On the cold cycle home the boys were talking about having a nice warm bath, a hot chocolate, having the fire going and snuggling up. Bliss.<\/p><p>The rest of the day was spent not doing a lot!<\/p>","images":false},"title":{"value":"Snowy Farnborough 5km"},"version":1},{"date":{"d":20,"m":1,"y":2018},"datev":20180120,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy went to parkrun in the morning and ran with Dave Peddle to get a time under 25 minutes which he was happy with.<\/p><p>Ben's football match was soon after at Heatherside. Badshot Lea were the opponents and it was a real knife-edge match. It could have gone either way. In the end it was 2-2 in the wet and muddy conditions.<\/p><p>We then rushed off to Ma Ma and Pop Pops as we were due to go around the cyclo park. However, the poor weather put pay to that, so we played board games instead.<\/p><p>Jessica stayed for a sleepover in Istead Rise, whilst we took Summer back home to stay the night. Unfortunately at about 4am in the morning Mummy and Katie took her back to Gravesend as she was not feeling too well.<\/p><img src='images\\years\\2018\\2018_01_20-03-IsteadRise.jpg' class='diaryImage' alt='Scoffing away' \/><p class='diaryImageCaption'>Scoffing away<\/p>","images":false},"title":{"value":"parkrun, football, Istead Rise, Jessica and Summer sleepovers"},"version":1},{"date":{"d":15,"m":1,"y":2018},"datev":20180115,"first":{"value":null},"info":{"content":"<p>We all weighed ourselves and recorded our heights:<\/p><ul><li>Daddy Pig: Height: 175.5cm Weight: 79.2kg<\/li><li>Mummy Pig: Height: 165cm  Weight:  66.3kg<\/li><li>Katie Pig: Height: 162.5cm  Weight:  48.5kg<\/li><li>Benny Pig: Height: 144cm  Weight:  33.8kg<\/li><li>Jessica Pig: Height: 133cm  Weight:  33.8kg<\/li><\/ul><p>Believe it or not, it was Daddy pig who had the worst BMI!<\/p>","images":false},"title":{"value":"Heights and Weights"},"version":0},{"date":{"d":14,"m":1,"y":2018},"datev":20180114,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning Daddy, Jessica and Ben joined the whole Stroud family, plus Barrie, Emma and Kieran came. They went up into the woods behind St Catherines Road. Jessica wanted mud and puddles. Unfortunately this was her undoing. She ended up in a deep puddle, got wet and cold very quickly and returned home. Fortunately Ben was looked after by the others so could do the jumps.<\/p><img src='images\\years\\2018\\2018_01_14-08-MTBing.jpg' class='diaryImage' alt='Ben at the jumps' \/><p class='diaryImageCaption'>Ben at the jumps<\/p><p>In the afternoon we took another leaf out of the Berkshire walk book. This time near Maidenhead and a 2 miler in Braywick Nature Reserve. Katie was very concerned that we would not make it back in time for her meal out with her friends which spoiled it for her a bit. We saw some archery, ran around the running track and visited 2 playgrounds en-route.<\/p><img src='images\\years\\2018\\2018_01_14-03-Walk96-BraywickNatureReserve.jpg' class='diaryImage' alt='' \/><p class='diaryImageCaption'><\/p><p>Katie went out to Camberley for a meal at Nandos. There was a bit of trouble when there was a disagreement and a couple of the guests walked out! Katie and her friend Catherine had a nice time though.<\/p>","images":false},"title":{"value":"MTBing, Walk 97 - Braywick Nature Reserve, Katie party meal in Camberley"},"version":1},{"date":{"d":13,"m":1,"y":2018},"datev":20180113,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy had to miss parkrun because football had a 9:30 kickoff time. The Falcons were away to Yateley Pumas u13s. Ben played mostly in central midfield and managed to score a goal. He should have headed in a second, but we were all pleased for Ben. The Falcons won 5-0.<\/p><p>\u000aIn the afternoon, The Elders, Ma Ma and Pop Pop joined us for the chutch new years party which Mummy helped run with a few games. It was the usual mix of food and quizes.<\/p><img src='images\\years\\2018\\2018_01_13-10-ChurchParty.jpg' class='diaryImage' alt='Prize time' \/><p class='diaryImageCaption'>Prize time<\/p><p>Lily stayed with us for a sleepover. She played with Jessica and Katie and watched films late on.<\/p>","images":false},"title":{"value":"Ben scores, New Years Church Party, Lily sleepover"},"version":2},{"date":{"d":7,"m":1,"y":2018},"datev":20180107,"first":{"value":null},"images":2,"info":{"content":"<p>Ben and Daddy got up early to bike to Wales and back again! It was icey, so we had to be careful. The route took them down some lovely country roads. the people were very friendly. The border was defined by the River Severn. They made it the 9 miles to a bridge by Crewegreen, stepped into Wales and returned back to base.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1344900628\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_01_07-05-Baschurch_Sunday.jpg' class='diaryImage' alt='Literally on the border between England and Wales' \/><p class='diaryImageCaption'>Literally on the border between England and Wales<\/p><p>In the afternoon the children stayed in, Mummy and Pop Pop went into the shops in Shrewsbury, whilst the others went for a walk  across some fields with the dogs. Daddy went on the bike and extended the trip out.<\/p><p>In the afternoon we were back in the pool for an hour or so.<\/p><img src='images\\years\\2018\\2018_01_07-14-Baschurch_Sunday.jpg' class='diaryImage' alt='Jump shot!' \/><p class='diaryImageCaption'>Jump shot!<\/p>","images":false},"title":{"value":"Bascurch Weekend - Bike to Wales, More pool action"},"version":1},{"date":{"d":6,"m":1,"y":2018},"datev":20180106,"first":{"value":null},"images":2,"info":{"content":"<p>In the morning daddy ran parkrun on his own in Shrewsbury. He ran his best time for over a year, so he was very pleased.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1343261308\" target=\"_blank\">Route\u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><p>In the late morning we split into two groups. One lot when to Shrewsbury Prison for an escape room experience. It involved dressing up as inmates and starting the game handcuffed and a bag tied over our heads! The girls team managed to get out within the hours, solving the riddles. The boys however did not fair so well.<\/p><img src='images\\years\\2018\\2018_01_06-23-Baschurch_Saturday.jpg' class='diaryImage' alt='Prisoners' \/><p class='diaryImageCaption'>Prisoners<\/p><p>The second group were supposed to enter the grounds of Shrewsbury Castle, however, it was shut! Instead we looked around the shops of Shrewsbury to get Ma Ma a swimming costume. It was very cold.<\/p><img src='images\\years\\2018\\2018_01_06-13-Baschurch_Saturday.jpg' class='diaryImage' alt='Daddy and Jessa at Shrewsbury Castle' \/><p class='diaryImageCaption'>Daddy and Jessa at Shrewsbury Castle<\/p><p>We reconvened back at the house for lunch. We were allowed the swimming pool complex from 2pm for 5 hours....... we spent all 5 hours in the pool and made the most of it. Daddy started a tournament up. First were swimming races, then a pool tournament. There was a hot tub, gym equipment, a sauna, plenty of pool toys and a dart board. It certainly kept us entertained.<\/p>","images":false},"title":{"value":"Bascurch Weekend - Escape Prison, parkrun, Shrewsbury, Pool"},"version":1},{"date":{"d":1,"m":1,"y":2018},"datev":20180101,"first":{"value":null},"images":3,"info":{"content":"<p>Double parkrun. First at Rushmoor, then a muddy Frimley Lodge. Dave was doing his 250th and Alex his 100th parkrun.<\/p><img src='images\\years\\2018\\2018_01_01-07-NewYearsDayParkrun.jpg' class='diaryImage' alt='Frimley Flyers' \/><p class='diaryImageCaption'>Frimley Flyers<\/p><p>In the afternoon we went out for a long walk around a Loddon Nature reserve near Twyford.\u000a It was very muddy and we got a bit lost. <\/p><a href=\"https:\/\/www.strava.com\/activities\/1336078713\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_01_01-06-Walk95-Loddon.jpg' class='diaryImage' alt='Kit Kat' \/><p class='diaryImageCaption'>Kit Kat<\/p><img src='images\\years\\2018\\2018_01_01-12-Walk95-Loddon.jpg' class='diaryImage' alt='Muddy Walkers' \/><p class='diaryImageCaption'>Muddy Walkers<\/p>","images":false},"title":{"value":"Walk 96 - Loddon Nature Reserve, Double parkrun"},"version":2}],"version":2096788478}