{"entries":[{"date":{"d":27,"m":10,"y":2019},"datev":20191027,"first":{"value":null},"images":1,"info":{"content":"<p>In the morning the boys watched a rather drab Semi Final in the rugby. We then headed to Tesco for breakfast in their cafe. Right next to the Pleasure Beach is the UK's large indoor Water Park, Sandcastles.<\/p><p>Mummy isn't into that sort of thing, so sat out and read her book. The rest of us went in and had a go on the big slides. There was a half pipe which was pretty steep. Also one of those slides where you are pushed up as well as down. We had a good 3 hours in there.<\/p><p>A stop at McDs for lunch and onward for our 5 hour trip home. Lucky we had Hunted to look forward to. We had a really nice weekend, and want to do more of these.<\/p><img src='images\\years\\2019\\2019_10_27-02-Blackpool_2-Sandcastles.jpeg' class='diaryImage' alt='Sancastles' \/><p class='diaryImageCaption'>Sancastles<\/p>","images":false},"title":{"value":"Blackpool 2 - Sandcastles swimming"},"version":1},{"date":{"d":26,"m":10,"y":2019},"datev":20191026,"first":{"value":null},"images":1,"info":{"content":"<p>Another Gay weekend away, this time to Blackpool over 1 night, due to the lack of holiday Daddy has from work. We travelled stupidly early, 4:30am just so we could get to Stanley Park, where Blackpool parkrun is held, for a 9am start.<\/p><p>Daddy ran the 5km course in the rain, listening to England beat New Zealand in the rugby World Cup Semi Final. The rest of us sat in the car and waited.<\/p><p>After we headed a couple of miles down the road to Blackpool Pleasure Beach\u000a where the famous fairground is situated. We looked a sorry site in the cold and rain when we went on the first ride, Flying Machines. The weather brightened up as we went on the Big Dipper, The Grand National, The Pepsi Max (Big One), ICON, Revolution and Infusion. Although some of the queues were long it was nice to be stuck together. We had a laugh taking the mick out of each other. It didn't get boring.<\/p><p>5:30pm came and it was time to move on to a very busy Fish and Chip shop. Jessica had a large portion of chips because she won an award at school last week. We ate them in the car as we trundled along the seafront see the illuminations. It was standard fare until we got past the Tower. There were statues and big old displays lit up as we headed north.<\/p><p>Our Travelodge hotel was located at Lancaster services on the M6. We chilled and watched TV, had a bath and fell asleep. It was so nice to spend time together and be in each others company.<\/p><img src='images\\years\\2019\\2019_10_26-14-Blackpool_1-PleasureBeach.jpg' class='diaryImage' alt='Queuing for Big Dipper' \/><p class='diaryImageCaption'>Queuing for Big Dipper<\/p>","images":false},"title":{"value":"Blackpool 1 - parkrun, Pleasure Beach"},"version":1},{"date":{"d":25,"m":10,"y":2019},"datev":20191025,"first":{"value":null},"images":1,"info":{"content":"<p>Jessica was in the Tomlinscote Newletter this week for winning a Kindness award as nominated by someone in her class. She can't remember who or what or when and is really not bothered by it.... as is her 'cool' attitude at the moment. Anyway we are all proud of you Jessa.<\/p><img src='images\\years\\2019\\2019_10_25-02-TomlinscoteNewletter-JessicaAward-Page11.jpg' class='diaryImage' alt='Tomlinscote Newsletter, page 11' \/><p class='diaryImageCaption'>Tomlinscote Newsletter, page 11<\/p>","images":false},"title":{"value":"Jessica gets Kindness Award"},"version":0},{"date":{"d":24,"m":10,"y":2019},"datev":20191024,"first":{"value":null},"images":1,"info":{"content":"<p>Katie went to Thorpe park with her friends.<\/p><img src='images\\years\\2019\\2019_10_24-02-KatieThorpePark.jpeg' class='diaryImage' alt='Katie and Catherine' \/><p class='diaryImageCaption'>Katie and Catherine<\/p>","images":false},"title":{"value":"Katie goes to Thorpe Park"},"version":1},{"date":{"d":23,"m":10,"y":2019},"datev":20191023,"first":{"value":null},"images":1,"info":{"content":"<p>Katie traveled up by train with friends from college. They went to the South Bank, Buckingham Palace, Strafford.<\/p><img src='images\\years\\2019\\2019_10_23-13-KatieToLondonWithMates.jpg' class='diaryImage' alt='Katie London Eye' \/><p class='diaryImageCaption'>Katie London Eye<\/p>","images":false},"title":{"value":"Katie up to London with friends"},"version":1},{"date":{"d":19,"m":10,"y":2019},"datev":20191019,"first":{"value":null},"images":1,"info":{"content":"<p>Katie started her new job at Jarman's the bakery in Frimley Green. This will be a regular Saturday morning job, earning about £20. She enjoyed it and came home with half a dozen or so different cakes. Think we're all going to become fat.<\/p><p>Meanwhile the mighty Falcons played over in Bramshill and disappointingly lost 5-2 having been 2-0 up and in control. Hook Blues were in the division above and one of their players ran the show.<\/p><p>Daddy bought a gravel bike on ebay so he can ride to work along the canal. It's a Specialized Diverge DSW 2017. It cost him £400.Trouble was it was in Sandbach so spent a good 7 hours on the motorway!<\/p><p>In the evening Katie went over to Catherine's for a fancy dress party. Her ex-boyfriend Dan was there and Catherine kissed him which didn't go down too well with Katie. Katie being Katie didn't let on she was upset with them. Catherine had crossed a line especially as she was saying things like he was a bad kisser!<\/p><img src='images\\years\\2019\\2019_10_19-02-KatieAtParty.jpg' class='diaryImage' alt='Party goers' \/><p class='diaryImageCaption'>Party goers<\/p><div class=\"youtube\"><iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/zaP1pemfA_k\" frameborder=\"0\" allowfullscreen=\"true\"><\/iframe><\/div>","images":false},"title":{"value":"Katie's new job at Bakery, Falcons lose, Daddy buys bike, Katie Party"},"version":1},{"date":{"d":17,"m":10,"y":2019},"datev":20191017,"first":{"value":null},"images":1,"info":{"content":"<p>Katie received her first report from Farnborough 6th Form. She's doing very well. She likes the courses and loves the social aspect of it all. She's eating too many McDonalds though!<\/p><img src='images\\years\\2019\\2019_10_17-01-Katie6thFormReport.JPG' class='diaryImage' alt='Katie's 6th Form Report' \/><p class='diaryImageCaption'>Katie's 6th Form Report<\/p>","images":false},"title":{"value":"Katie's Farnborough 6th Form Report"},"version":0},{"date":{"d":16,"m":10,"y":2019},"datev":20191016,"first":{"value":null},"info":{"content":"<p>Well the trip to see the doctor didn't go as planned. The first 5 minutes I was also mocked about how bad my control was. So I said what had happened in the previous meeting and she basically said there is no chance getting a pump with the graphs that I showed her. She said something like \"I wouldn't call that good control\" and laughed, showed the graph to the student who said \"Wow, that's bad\". She also intimated \"What's the point of having the Dexcom with control like that\". I responded by saying \"Do you think I shouldn't have it, because it's costing me a lot of money!\". I don't know, it was all true what she was saying, just the manner it was said made me feel I really wasn't doing well - which I guess I'm not, otherwise I wouldn't be there.<\/p><p>She did seem a little more clued up than the others I'd seen and she did apologies later for sounding harsh. With all these diabetes professionals they make it sound so easy. Just carb count, calculate the insulin and inject. Easy eh? Anyway she suggests I take Basal twice a day to dampen the graphs. She also pretty much laughed at my correction dosage of 1:1. She said that was too high - only fat people have it that high. I said if I lower it, then my levels won't reduce.<\/p><p>The more I speak to these professionals, the more I get bewildered. So inconsistent. It doesn't sound like a science, it sounds like pot-luck. There are enough diabetics in the country. I think you have to be a diabetic to become a diabetic professional. Overall I have to go back at the end of January and with the changes see how I've done. They want me to upload the info to Diasend. Anything you've heard of Andy? If I do badly enough, then they might consider a pump is what she ended up saying. The meeting lasted just over half and hour.<\/p>","images":false},"title":{"value":"Diabetic Pump Meeting"},"version":0},{"date":{"d":13,"m":10,"y":2019},"datev":20191013,"first":{"value":null},"info":{"content":"<p>In the morning Mummy went to the early church service. Daddy's back is still bad. Enough to not continue any exercise.<\/p><p>In the afternoon the girls went to Reading clothes shopping. Daddy went to the Tremear's to give Graham his birthday present.<\/p>","images":false},"title":{"value":"Church, Reading"},"version":1},{"date":{"d":12,"m":10,"y":2019},"datev":20191012,"first":{"value":null},"images":1,"info":{"content":"<p>Daddy's back was still very sore so he decided to give parkrun a miss.<\/p><p>The Falcons played fellow strugglers, Badshot Lea Ninjas. It wasn't a great game, but things turned ugly at the end of the match, resulting in a fight with one of the spectators.<\/p><p>This is to report at the unfortunate scenes at yesterdays fixture between Badshot Lea Ninja's v Mytchett Athletic Falcons u15s. It resulted in a Badshot spectator being abusive and violent towards one of our managers, Lawrence Chiswell.<\/p><p>The game was played in fairly good manner, no cautions, sin bins, bad tackles. Both teams had a respect steward. The spectators were behind the respect line on the far side of the pitch. All accept one. This individual was standing by the managers for the whole match. At first I thought he was part of the Badshot Lea management team. For most of the match he was vocal, but nothing exceptional. Later in the second half as the game progressed he became more and more vocal towards our linesman. Every time the linesman put his flag up in favour of Mytchett a volley of abuse was thrown his way. The rhetoric got stronger to the point where bad language and calls of \"cheat\" were alleged. During this period I told the spectator that they should be on the other side of the pitch in the allocated area. He refused to move, and we told our linesman not to continue and informed the referee. There must have been 5 or 10 minutes to go.<\/p><p>When the match ended (Badshot winning 4-2), this spectator was still swearing and was very aggressive and walked 30 yards over to the half way line where we were positioned. Lawrence asked the spectator to calm down and stop swearing. The spectator continued to walk to us and went face to face with Lawrence. The spectator started to fight by grappling with Lawrence. Some of our equipment was damaged (umbrella and mini tent) Fortunately Lawrence restrained him and pinned him to the floor. No punches were thrown.<\/p><p>The game had just finished so the players and parents were walking across to us where the troubles were. The Badshot Lea players, no 7. and no 14. then felt they should join in and started to hit Lawrence as he was restraining the spectator on the floor.<\/p><p>Wayde, the Badshot Lea manager, lead the spectator away. We suspect the spectator to have been drinking given the smell on his breathe and the pint of half drunk Guinness found nearby. The spectator got into his van and drove off.<\/p><p>The Police were called. We were concerned he may have been drink driving.<\/p><p>This unsavory incident was unfortunate and I feel sorry for Wayde, the Badshot Lea manager. This is a sad day for youth football. For me it underlines the importance of spectators standing behind the designated area. I feel sorry that all the kids had to witness this aggressive behaviour and listen to the foul and aggressive language of this individual.<\/p><p>In the afternoon we all went to over to the Chocolate Frog to meet with the Elders for a drink, and to hand Lily back! All went well until we went to go. The car wouldn't start. Nothing when the ignition was turned. We called the RAC eventually and they gavve us a lead time of 2.30 hours! So we decided to call out Pop Pop so we could camp at his house for a bit. Fortunately he brought along some jump leads which meant we could go again. Thank you Pop Pop.<\/p><p>In the evening Daddy went out with his Casuals friends to the Prince Of Wales pub. He had such a good time. He reckons he's never laughed to much.<\/p><img src='images\\years\\2019\\2019_10_12-02-DaddysBoysNightOut.jpg' class='diaryImage' alt='Boys night out' \/><p class='diaryImageCaption'>Boys night out<\/p>","images":false},"title":{"value":"Fight at football, Car breakdown, Boys night out, best laugh ever"},"version":2}],"version":-1814176782}