{"entries":[{"date":{"m":9,"y":1994},"datev":19940900,"images":1,"info":{"content":"<p>I had spent most of the summer in the garage building a radio controlled plane.<\/p><img src='images\/years\/1994_08_XX-01-RadioControlledPlane.jpg' class='diaryImage' alt='Plane before the crash' \/><p class='diaryImageCaption'>Plane before the crash<\/p><p>I saved up for ages, went to Sandown Park with Bazza to buy a kit and kind of struggled through building the plane. The build quality was pretty low.<\/p><p>Anyway it came to the grand launch day and Dad, Bazza and I ventured over to Pirbright, where others fly, to set my bird free!!! It was a disaster. We umm'ed and arrr'ed how to launch her. By throwing her, or with a proper take off. I decided to do a takeoff from the ground, because if it didn't fly from a throw, then it would just smash into pieces. The moment was set. I gave her some throttle, she began to move and then..... perdunkkk! The nose dived whilst taxiing, buried itself into the ground. The propeller hit the ground as well and ripped the nose clean off. Disaster. Dad was not impressed and was in no mood for laughing! Bazza was on the other hand was wetting himself, but trying to keep it in. I saw Bazza which made me laugh and cry at the same time. Dad just thought I was an idiot I think.<\/p>","images":false},"title":{"name":"5","value":"Plane Crash"},"version":1},{"date":{"m":4,"y":1996},"datev":19960400,"info":{"content":"<p>We were at home and I got into my car with Dad. I was chatting to him and without really concentrating I reversed up the drive way and CRASH. Straight into Gary's car. Gary needed the two front wings, a bonnet and a bumper replacing. Fortunately there was no damage to my car so I didn't have to pay any excess! Gary's Dad was not best pleased and rang me constantly pressuring me to pay up without going through the insurance.<\/p>","images":false},"title":{"name":"4","value":"Reversed into sister's boyfriend's car"},"version":1},{"date":{"d":5,"m":3,"y":1997},"datev":19970305,"images":1,"info":{"content":"<p>Whilst I was a student at Bournemouth Uni, I shared a house with 3 mates. Today I left the gas cooker on all day. Renaud (House mate) entered the house, but fortunately he didn't light up this time. I think he smelt it straight away. Could have been Danish Dynamite.<\/p><img src='images\/years\/1997\/1997_05_XX-GillRenMartinAndy.jpg' class='diaryImage' alt='The housemates who are still alive' \/><p class='diaryImageCaption'>The housemates who are still alive<\/p>","images":false},"title":{"name":"7","value":"Gassing, Blowing up House Mates"},"version":1},{"date":{"d":23,"m":5,"y":1997},"datev":19970523,"images":1,"info":{"content":"<p>We met at the Firefly and Firkin at 6pm... and then moved on to the Firestation I think.... All gets a bit blurry. I think Susan and Gary came down, and Laura played the part of frogger after exiting the nightclub! Still not sure how one of the cars had actually hit her.<\/p><p>I remember chasing her down into the town, but she was running completely scared. I didn't want her going around the centre of Bournemouth on her own at that time of night. However, I didn't want her to do something stupid like run in front of a car again. Eventually we caught up with each other.<\/p>","images":false},"title":{"name":"8","value":"Unbelievably Not Mown Down By Car"},"version":1},{"date":{"d":12,"m":7,"y":1997},"datev":19970712,"info":{"content":"<p>We borrowed a tent from Laura's parents. Camping overnight on our holiday the two man tent developed a little tear which overnight with the help of the wind, got bigger and bigger. By the morning we had no cover! Totally open to the elements. The morning after Laura pleaded with her parents to buy a new one because we thought we shouldn't have to and we were really strapped for cash.<\/p><p>Thinking back this was very cheeky of us.<\/p>","images":false},"title":{"name":"5","value":"Waking Up With No Tent Over Us"},"version":1},{"date":{"d":31,"m":10,"y":1997},"datev":19971031,"info":{"content":"<p>As we were travelling home I leant out of the moving car and threw up, which was a bit embarrassing seeing that I was in Laura's grandparents car. The sick splattered the back wing of the car! We stopped, I caught some fresh air, and sat on the other side of the car. Then.... it happened again as we travelled along Gole Road!<\/p><p>I was also sick during the night (but didn't remember it). Laura's granddad got the hose pipe out the morning after to slosh down any residue!<\/p>","images":false},"title":{"name":"6","value":"Sick in grandparents-in-law car twice"},"version":1},{"date":{"d":22,"m":11,"y":1997},"datev":19971122,"images":1,"info":{"content":"<p>Went to Cheltenham with Nick and Martin to the pre-rally show. I drove back to Oxford where we had a pub crawl. I almost knocked off an elderly gentleman off his 'old' mobility scooter thingy. It was dark, and he was cleaning his headlight as he was going along. This obscured his light. I didn't see the vehicle therefore until really late and swerved to miss it.<\/p><img src='images\/years\/1997\/1997_11_22-MobilityScooterHitAndRun.jpg' class='diaryImage' alt='Hit And Run?' \/><p class='diaryImageCaption'>Hit And Run?<\/p><p>Later that night, I also managed to tread in some dog poo and unkowingly walked it into the guest house we were staying in.<\/p>","images":false},"title":{"name":"8","value":"Almost Mowed Down An OAP"},"version":1},{"date":{"d":26,"m":6,"y":1998},"datev":19980626,"images":1,"info":{"content":"<p>We went to Wimbledon Tennis and planned to camp and queue on the pavement. Last year we forgot the tent poles so had to make the tent into a glorified large sleeping bag.<\/p><p>This year we forgot the tent all together, instead we slept in the car in a residential street in Wimbledon. When we woke it was tipping with rain, therefore rather than get out and queue we decided to drive home!<\/p><img src='images\/years\/1998\/1998_06_26-RainyWimbledon.jpg' class='diaryImage' alt='Wimbledon Rain' \/><p class='diaryImageCaption'>Wimbledon Rain<\/p>","images":false},"title":{"name":"5","value":"Forgot To Bring The Tent! Slept In Car. Then Abandoned Anyway"},"version":1},{"date":{"d":26,"m":8,"y":1998},"datev":19980826,"info":{"content":"<p>The weather was just about OK today. We were tipped to go to Polperro on the south coast. I managed to knock an old man over whilst driving really slowly in the narrow streets. I got out srtaight away. He was OK thankfully. Not sure how I managed it.<\/p>","images":false},"title":{"name":"8","value":"Knocked Over OAP In Car"},"version":1},{"date":{"d":13,"m":12,"y":1998},"datev":19981213,"info":{"content":"<p>I played football in the morning against Mytchett Centre Reserves. We comfortably won and I was taken off at half timed despite playing well, which was a shame because dad turned up at half time to watch me play. However, he almost got us into a fight.<\/p><p>We had a free kick and one of their players kicked the ball away. Dad made a sarcastic remark, to which their player bit back on. They eventually called dad and 'old c-word' and I replied 'That's better than being a fat c-word'.<\/p><p>At which a couple of their players started running towards to me. So I turned and begun to run 10 yards or so. They stopped. The rest of the match was very edgy and it had shaken me up. Me and dad left early from the game to avoid any trouble.<\/p>","images":false},"title":{"name":"7","value":"Almost In A Punch Up With Two Mad Glaswegian"},"version":1},{"date":{"d":26,"m":7,"y":1999},"datev":19990726,"images":1,"info":{"content":"<p>I made Laura get up early. 4am! The reason was Billingsgate Fish Market. I've always wanted to go there. Laura drove up there arriving at 5am only to find it's only open Tuesday to Sunday!<\/p><p>Oh dear. We made our way back, slept in the car before being let back in at 7am!<\/p><img src='images\/years\/1999\/1999_07_26-BillingsgateFishMarketClosed.jpg' class='diaryImage' alt='24th Birthday Meal in Englefield Green' \/><p class='diaryImageCaption'>24th Birthday Meal in Englefield Green<\/p>","images":false},"title":{"name":"3","value":"4am Getup Only To Find Market Shut"},"version":1},{"date":{"d":5,"m":8,"y":1999},"datev":19990805,"info":{"content":"<p>After taking 4.5 hours getting to Margate, with the leaking water tank, I had the pleasurable task of getting home! Having reached Detling, just outside Maidstone, I could see grey clouds bellowing from my exhaust, as I was stopping in a garage the car stalled. I feared the worst, and thought it was some sought of seizure. It didn't sound right as I turned the car over.<\/p><p>I phoned dad who was at the football club to come and rescue me. At about 11:30pm (3.5 hours after I left Margate) he arrived. We tied up some blue rope and I was in my own car, making sure bit bumping into Dad. The rope only gave a maximum of one car length between us, and guess what we pulled out and the first hill was saw had an 11% sign!! It wasn't a nice experience as the rope kept slackening and then yanking and because the servos on the brakes weren't as good as usual I was afraid of going into the back of the 'tank' (dads car).<\/p><p>However, we never came close. We stopped shortly afterwards. Dad was ready to set off again but I hadn't put the key in the ignition to unlock the steering wheel yet! So I slammed on the brakes whilst I frantically looked for the key. Dad was struggling to set off, revving up his car. Luckily I found it quickly in my pocket and we were off again.<\/p><p>Another big problem was that in order to preserve my battery, I switched off my lights in lit areas. This made it difficult at times to see 'the tank'. The rope finally snapped in Maidstone. We stopped and someone got us a proper tow rope, and off we went again.<\/p><p>The lights began to dim, and I was getting extremely tired. We eventually stopped in a garage in Riverhead, Sevenoaks and we got home at 3am! Unknown to us we dumped the car in a Hearse garage. A fitting end. I had managed to buckle the cylinders, but of course they were just about OK to be fixed and a week later I was back on the road.<\/p>","images":false},"title":{"name":"6","value":"Towed to a Hearse Garage at 3am!!"},"version":1},{"date":{"d":3,"m":12,"y":1999},"datev":19991203,"info":{"content":"<p>We went out with Nick and Martin, for a pub crawl around Wokingham. We walked to Nick's and then to Farnborough North where we popped in to the local there and had a quick pint, then caught a train. Our mission was to drink one pint every half an hour.<\/p><p>The first pub we walked to I saw Ian Wales in there, who had just been made redundant. I felt really sorry for him as there was no explanation for his departure. That kind of feeling that I'll never see him again as well. We carried on regardless. We visited another three or four pubs. One of them a guy had blood all over him and it seemed he'd only been punched 5 minutes before. We quickly got out of there.<\/p><p>We caught the train back and walked along the Hatches. Me and Lau walked on ahead. Nick and Martin tried to out flank us. However, they didn't realize there was a man with a bad boy limp in front of us. It was very dark. Suddenly Nick jumped out and shouted to scare us. However, he jumped out on the wrong person. Needless to say the bad boy limp man walked off fairly sharpish! It was very funny. One of those, you had to be there incidents.<\/p>","images":false},"title":{"name":"6","value":"Jumping Out On The Limp Man"},"version":1},{"date":{"d":17,"m":8,"y":1999},"datev":19990817,"info":{"content":"<p>I needed to move Laura's car which was parked in front of the garage. Being casual I used my left foot and subconsciously counted two pedals in from the left. However, because it is an automatic I hit the accelerator and not the brake! The car door was wide open and it smacked into the next door neighbours car! Luckily dad's car wasn't behind. There was no damage to Lau's car but I had made a big dent and scratch in Mike's car!<\/p>","images":false},"title":{"name":"7","value":"Hit Next Door Neighbours Car"},"version":1},{"date":{"d":17,"m":1,"y":2000},"datev":20000117,"images":1,"info":{"content":"<p>We had problems getting the cooker working, so I called an electrician who came round, only to find the West's had taken the plug off the cooker! £30 that cost us!.<\/p><img src='images\/years\/2000\/2000_01_17-PlugFitting.jpg' class='diaryImage' alt='£30 to fit a plug' \/><p class='diaryImageCaption'>£30 to fit a plug<\/p>","images":false},"title":{"name":"4","value":"Called An Electrician Out To Fit a Plug!"},"version":1},{"date":{"d":23,"m":1,"y":2000},"datev":20000123,"images":1,"info":{"content":"<p>We had booked our wedding with Laura's church, the vicar who she had known since childhood. There was confusion over the date of the wedding ultimately meaning him moving his family holiday in Bulgaria to another date!<\/p><img src='images\/years\/2000\/2000_01_23-CliffordVicar.jpg' class='diaryImage' alt='Clifford moves his family holiday for us' \/><p class='diaryImageCaption'>Clifford moves his family holiday for us<\/p>","images":false},"title":{"name":"5","value":"Vicar Forced To Re-Schedule his family, summer holiday"},"version":1},{"date":{"d":2,"m":6,"y":2000},"datev":20000602,"images":4,"info":{"content":"<p>We decided to get the fire going, but had little kindling. However, next door did! We sneaked off and stole a batch of wood which we put straight onto the fire.<\/p><p>Blimey didn't it get hold it. Flames were going right up the chimney. It was roaring and cracking away. Sparks were actually coming out of the top of the chimney as we stood outside and marvelled. Inside the house the flames were lapping over the fireplace. We got some water to calm it down a bit. It was huge.<\/p><img src='images\/years\/2000\/2000_06_XX-NormandyHoliday05.jpg' class='diaryImage' alt='Fire!' \/><p class='diaryImageCaption'>Fire!<\/p>","images":false},"title":{"name":"4","value":"Big Fire in French Farmhouse"},"version":1},{"date":{"d":19,"m":8,"y":2000},"datev":20000819,"images":1,"info":{"content":"<p>Laura and family were on the other hand away for a week's holiday up in a prison in Lincolnshire, taking the mentally handicapped out for a break. However, disaster struck when a caravan decided to pull out into their lane on the motorway causing the car to swerve to take evasive action. It swerved one way, then too much the other and ended going up a bank and spinning to a rest on the hard shoulder.<\/p><p>Thank goodness everyone was OK, even though Laura wasn't wearing a seat belt as she was tending to one of the clients at the time. This meant they spent the rest of the holiday with just the Crabs Nissan Micra. So everything was 2 trips all of the time. What a nightmare.<\/p>","images":false},"title":{"name":"9","value":"Motorway Accident!!"},"version":1},{"date":{"m":10,"y":2000},"datev":20001000,"images":2,"info":{"content":"<p>Helen and Nigel came over to stay for the weekend. The previous night we went down the pub and had a few drinks. We gave Helen and Nigel our bed and we slept in the spare room with the door open.<\/p><p>I remember waking in the morning to Laura groaning away and looking really unwell. Helen and Nigel thought we were up to no good! At this stage I believed I had a clear head. I decided to go and get Laura a sick bowl and a glass of water. As soon as I stood up, I collapsed onto the bed side table and was knocked unconscious for a short period of time. The big crash prompted Helen and Nigel to come in. Nigel had opened the windows suspecting a carbon monoxide leak. The ambulance was called.<\/p><img src='images\/years\/2000\/2000_10_XX-02-CarbonMonoxide.jpg' class='diaryImage' alt='Silent Killer' \/><p class='diaryImageCaption'>Silent Killer<\/p><p>When I came round, I couldn't speak properly and was concerned for Laura. The ambulance men I think suspected drugs, and I remember both Helen and Nigel kept saying they haven't taken drugs. At this stage we only suspected carbon monoxide poisoning. It wasn't until we got down the hospital that they confirmed our blood oxygen levels were dangerously low.<\/p><img src='images\/years\/2000\/2000_10_XX-01-BoilerOfDeath.jpg' class='diaryImage' alt='Boiler Of Death' \/><p class='diaryImageCaption'>Boiler Of Death<\/p><p>We ended up being taken by Ambulance to Haslar, Gosport hospital and put in the hyperbaric chamber. This is used to get the required oxygen levels back into the blood, commonly used to treat people with the 'bends'. Laura's family came down to see us in the chamber, where we had to put these space type helmets on. Anyway we stayed overnight in the hospital together for observation, which we both hated. Laura's grandparents came down a day later to pick us up and take us home. We felt fine.<\/p>","images":false},"title":{"name":"10","value":"A Bit Of Carbon Monoxide Poisoning"},"version":1},{"date":{"m":2,"y":2001},"datev":20010200,"images":2,"info":{"content":"<p>Drilling holes for a shelf about 10 cm away from the fuse box. BANG! This was of course during the evening when it was dark outside, so the whole house was shrouded in darkness. The electrician laughed when he came to re-wire. The had to take part of the wall away.<\/p><img src='images\/years\/2001\/2001_02_XX-01-Electrics.jpg' class='diaryImage' alt='What could have happened' \/><p class='diaryImageCaption'>What could have happened<\/p><img src='images\/years\/2001\/2001_02_XX-02-Electrics.jpg' class='diaryImage' alt='A blown fuse box' \/><p class='diaryImageCaption'>A blown fuse box<\/p>","images":false},"title":{"name":"9","value":"Electrocuted Myself And Blew The Electrics"},"version":1},{"date":{"y":2001},"datev":20010000,"info":{"content":"<p>Drilled a hole a couple of inches in diameter through our 160 year old house. Even had to buy special bits for the drill to do it. The wall was so thick I drilled from inside of the house outwards halfway, then from outside the house inwards. Of course the two holes did not match! In the end I got a scaffold pole and a big mallet and smashed my way through. When we came to selling the house I managed to get the bit of plaster that had flaked off and selotape over my handy work. This was all so I could run a thick electric cable up to the shed, which I had incidently extended!<\/p><p>Ended up knackering the drill in the process. Smoke was coming from the motor.<\/p>","images":false},"title":{"name":"6","value":"Tender care for old house"},"version":1},{"date":{"d":15,"m":2,"y":2002},"datev":20020215,"images":2,"info":{"content":"<p>I managed to spill yellow paint in the back seat, when I borrowed a whole pot of paint without realizing the lid wasn't securely on. I went around a roundabout and hadn't realize it had tipped onto its side. There was so much 'double yellow line' paint over the back seat and floor. I remember when I opened the door, it started flowing out onto the road. I didn't even attempt to clean it up, because I knew it was going to be no good. It eventually dried to a very thick crust. It was legendary.<\/p><img src='images\/years\/2002\/2002_01_19-02-PoppyDaisy.jpg' class='diaryImage' alt='Back seat - nice shade of yellow' \/><p class='diaryImageCaption'>Back seat - nice shade of yellow<\/p>","images":false},"title":{"name":"7","value":"Spill Yellow Paint Over The Car"},"version":1},{"date":{"d":20,"m":7,"y":2002},"datev":20020720,"images":2,"info":{"content":"<p>Went to Goodwood Festival of speed with the boys. I managed to kick the hull of one of the old F1 cars. Could hear it scrape across the floor. Moved on swiftly.<\/p><p>The day will also be remembered for the car chase down there. Pretty much bumper to bumper at 90mph on the A3!<\/p><img src='images\/years\/2002\/2002_07_20-51-GoodwoodFestivalOfSpeed.jpg' class='diaryImage' alt='F1 car kicked' \/><p class='diaryImageCaption'>F1 car kicked<\/p>","images":false},"title":{"name":"6","value":"Kicked vintage F1 car"},"version":1},{"date":{"d":22,"m":3,"y":2003},"datev":20030322,"images":1,"info":{"content":"<p>Apparently I was very close to getting my head panned in, by a mad Samurai sword owning Irish man called Fonzy.<\/p><p>Well the boys told me to call him that, but he hates it. He's actually called Alfonso. Anyway at one point he climbed over the sofa's to go and get a drink and pushed him onto the sofa, and laughed at him, as drunks do! The room fell silent, there was tension in the air, and he must have contemplated in giving me a smacking. Anyway he didn't, but a close thing.<\/p><img src='images\/years\/2003\/2003_03_22-01-CardNight.jpg' class='diaryImage' alt='Two bottles surely not me!' \/><p class='diaryImageCaption'>Two bottles surely not me!<\/p><p>I was havoc. John was just following me around making sure I didn't cause too much damage\/chaos. I collapsed by the front door. I finally slept on the first floor landing. One of Johns female housemates, rang from her room to John, to say I was sounding a bit ill. I think she was scared to pass me on the landing. I managed to hurl up, a number of times in Johns bathroom. I sprayed their bathroom. I tried very hard to clear it up. The floor the sink, the toilet. The carpet bit around the toilet was ruined where I didn't really aim right. I gave John a fiver in the morning to get a replacement.<\/p><p>Nick drove my car home the morning afterwards, as I was still drunk!!<\/p><p>\u000a          See a <a href=\"images\/years\/2003\/2003_03_22.MartinCardNight.wmv\">video<\/a> here of the night's proceedings.\u000a        <\/p>","images":false},"title":{"name":"7","value":"Two Bottles of Amarula = Samurai Sworded"},"version":1},{"date":{"d":7,"m":9,"y":2004},"datev":20040907,"images":2,"info":{"content":"<p>In the morning mummy decided to burn an iron mark into the living room carpet!!!! The carpet is ruined.<\/p><img src='images\/years\/2004\/2004_09_07-MummuysIroning-01-.JPG' class='diaryImage' alt='Mummy and her ironing!!' \/><p class='diaryImageCaption'>Mummy and her ironing!!<\/p>","images":false},"title":{"name":"8","value":"The Carpet Needs Ironing"},"version":1},{"date":{"d":2,"m":10,"y":2004},"datev":20041002,"images":2,"info":{"content":"<p>It was quite blustery, getting up to force 7 (over 30 knots). We decided to put the sail up. We were going for quite a while until Daddy took the tiller and within 20 seconds the boat was zig zagging and rolling violently from side to side. The boom unexpectedly came whipping across and knocked poor Uncle Michael on the head. It was lucky he wasn't knocked off the boat or anyone injured.<\/p><p>Daddy's stint at the tiller ended and Mummy's call for \"mota, mota\" were finally heeded, and we motored to Queenborough.<\/p><img src='images\/years\/2001\/2001_05_20-BarbarTrip07.jpg' class='diaryImage' alt='Captain 'Uncle Albert' Gay' \/><p class='diaryImageCaption'>Captain 'Uncle Albert' Gay<\/p>","images":false},"title":{"name":"8","value":"Family members almost went boom"},"version":1},{"date":{"d":22,"m":10,"y":2005},"datev":20051022,"images":2,"info":{"content":"<p>In the morning we went swimming at the Arena. We got changed and Daddy said he was going to the toilet, however, Mummy hadn't heard. She went in with Benjamin. Katie was unsupervised and had jumped into the swimming pool. Somehow her armbands had come off.<\/p><p>Daddy returned to the swimming pool and Mummy was screaming 'Where's Katie'. We looked around and she was lying on her back, no armbands, scrabbling to keep afloat. A man was over looking and said she was doing well. We just got her in time. Goodness knows how long Katie was like that for. What a scary incident though.<\/p><img src='images\\years\\2005\\2005_10_22-01-drowning.jpg' class='diaryImage' alt='Katie Drowning' \/><p class='diaryImageCaption'>Katie Drowning<\/p>","images":false},"title":{"name":"9","value":"Katie drowning"},"version":1},{"date":{"d":10,"m":11,"y":2005},"datev":20051110,"images":1,"info":{"content":"<p>We had a spot of bother with the washing machine. I tipped it up and the drive belt was lying on the floor. Fitted the belt back on after half an hour of putting the belt on blind. Came off.... came off again! Grrrr.<\/p><p>Needed easier access from the back, so got the angle grinder out. Making good progress, but then a spark hit my eye brow and thought better put some eye protection on. I had no glasses, so turned to my bike helmet. The grinder made a heck of a noise and woke Katie up. Laura brought her down, crying her eyes out, seeing me with an angle grinder, a load of mess and commotion and a bike helmet on! I think I may have given her nightmares that night.<\/p><img src='images\/years\/2005\/2005_11_10-WashingMachneDIY.JPG' class='diaryImage' alt='Holey Washing Machines!!' \/><p class='diaryImageCaption'>Holey Washing Machines!!<\/p><p>Anyway I had to quit the angle grinder and thought how I was going to cut the other two sides. Ended up retrieving the loppers from the garage and cutting my way through the rest. Finally had to make the hole bigger, and eventually fixed it right. The only problem now is that the washing machine doesn't fit flush because the metal bits stick out of the back!!!<\/p>","images":false},"title":{"name":"7","value":"Loppers and Angle Grinder to Fix Washing Machine"},"version":1},{"date":{"d":17,"m":1,"y":2006},"datev":20060117,"info":{"content":"<p>Mummy drove over to Ellie's today. As we left the A31, down the slip road the brakes failed to work. Heading towards a fast and busy t-junction, mummy managed to pull the handbrake and turn just before the give way area. We were in the back. Mummy was a bit shaken.<\/p>","images":false},"title":{"name":"8","value":"Brakes failed, needed handbrake turn to stop car"},"version":1},{"date":{"d":14,"m":8,"y":2006},"datev":20060814,"images":1,"info":{"content":"<p>On the bus coming back from the Zoo in the rush hour. Bus full of commuters and I'm sitting next to nice looking blonde! The stomach turned, apologized to the lady and rushed to the front of the bus about to ask the driver to stop..... but too late..... Weeerrrr, weeerrr, chunder, chunder.<\/p><p>I tried to catch the mashed nectarines so not to make too much mess in the bus. My head slumped over, I look across to the bus driver with my eyes pleading at him to stop and open the doors..... he blanked me and continued to throw up twice more.<\/p><p>Up the entrance doors of the bus, on the floor, all over my t-shirt and trousers. Nice! He eventually stopped, I hopped out, lent up against some house and continued what I obviously hadn't finished off. Katie was crying at the sight of me hurling. I'd woke Ben up, who now was also crying. The bus continued with the Lau and the screaming kids with people giving Laura evil looks.<\/p><p>The bus driver contacted 'control' and was told to return to the garage immediately. The 40 or so people on the bus had to all get out and catch the next bus which I had later got on! Thought in the interests of Danish\/Anglo relations I'd hop off!<\/p><img src='images\\years\\2006\\2006_08_14-01-bus.jpg' class='diaryImage' alt='Copenhagen Bus' \/><p class='diaryImageCaption'>Copenhagen Bus<\/p><p>Daddy ended up being sick 5 times in the end.... once at both ends at the same time.<\/p><p>Also Katie wasn't happy with the situation and wanted to go home.<\/p><ul><li><i>katie<\/i>I want to go home.\u000a    <\/li><li><i>mummy<\/i>We can't go home darling. All the pilots have gone to bed.\u000a    <\/li><li><i>katie<\/i>We go and wake the 'pirates' up.       \u000a    <\/li><\/ul>","images":false},"title":{"name":"7","value":"Evacuation of bus in rush-hour Copenhagen"},"version":1},{"date":{"d":8,"m":7,"y":2007},"datev":20070708,"images":2,"info":{"content":"<li><i>Tom Tom Smootied<\/i>Whilst winding the roads of Dingle, Kerry, my Pineapple flavoured smoothie decides to leak in my top box covering the shoes I am supposed to wear at the wedding and Howard's 'sat nav', which proceeds to no longer work!\u000a        <\/li><img src='images\/years\/2007\/2007_07_06-93-Kerry.jpg' class='diaryImage' alt='You've been smoothied' \/><p class='diaryImageCaption'>You've been smoothied<\/p><ul><li><i>Stoned<\/i>Heading out of the Dingle peninsula my back wheel flicks a stone out which hit and oncoming car on the driver’s door which dents it nicely, then bounces back and almost hits Howard who is following me on the rebound!\u000a          <\/li><li><i>Chain Smoker<\/i>Having completed a 1000 miles, the bike had held up well despite the pool of liquid found on the Sea Cat, the mirror that was loose and the chain which had about 4 inches of play! Passing Swindon at about 90mph all of a sudden my bike revved right up, and bits of metal were flying past Howards helmet! The chain had snapped and created sparks where it was being dragged along the tarmac. Anyway we both luckily returned home eventually unscathed.\u000a          <\/li><\/ul><img src='images\/years\/2007\/2007_07_08-10-M4Breakdown.jpg' class='diaryImage' alt='Broken Chain' \/><p class='diaryImageCaption'>Broken Chain<\/p>","images":false},"title":{"name":"7","value":"Who wants to go on a biking holiday with me?"},"version":1},{"date":{"d":8,"m":3,"y":2008},"datev":20080308,"images":1,"info":{"content":"<p>I went into having the 'snip' with a stiff upper lip and tried to be as ignorant as possible as to what the procedure entailed. Well after the bazillionth consultation, I entered the op theatre, or should I say a room at the doctor's surgery. The first thing that hit me was the electrical burning smell. Ah ha this must be the torture chamber!<\/p><p>The surgeon told me to lie down. He was first quite brutal in getting everything into position and then whilst casually chatting a needle was injected somewhere down below. It makes me wince just writing it now. Arrgghhh. The pain was pretty severe and I must admit I did make a groaning noise. I also immediately jerked my knee up as a natural reaction. The surgeon asked me to not to do that as it was \"jogging his steady hand\"! Probably the last person you would want to jog! I thought of saying you try and lie here and have someone inject your bits. I could feel whatever fluids being inserted entering my system which wasn't a pleasant feeling either.<\/p><p>The procedure continued. By this time I didn't know whether to be tense, as the slightest move brought some pain, or whether to relax to give my heart a chance to slow down! For 90% of the time I braced myself whilst trying to make polite conversation!  Anyway, I couldn't feel the actual fusing of the tubes. All I could hear was a buzz now and again, sounding like a loose electrical connection. This I presume was the burning\/fusing part.<\/p><p>Then all of a sudden. BAM. Another injection equally as painful as the first and totally unexpected. Another hit. I assume it was one for each testicle. I kept it together and saw out the ten minute operation.<\/p><img src='images\\years\\2008\\2008_03_08-01-Snip.jpg' class='diaryImage' alt='As it appears from my perspective' \/><p class='diaryImageCaption'>As it appears from my perspective<\/p><p>I put some tight swimming trunks on, had a coffee and went down to meet the family. They were pleased to see me. Ben came charging right for me. I think I almost gave him a forearm smash to stop him running into where nature didn't intend! Anyway I had to check if there was much blood coming from the wound, which there wasn't, so I was able to go home.<\/p>","images":false},"title":{"name":"8","value":"Jogged the 'Snip' surgeon"},"version":1},{"date":{"d":15,"m":4,"y":2008},"datev":20080415,"images":1,"info":{"content":"<p>On the way out of the packed commuter train, Mummy was holding Jessie around the tummy with one hand and Ben with the other. Jessie, then to Mummy's horror, was sick on this man's leg, all over his suit! He looked disgusted. Mummy had to apologise over and over and didn't know what to say - she didn't even have a tissue to offer and couldn't just run because there was a queue to get off the train!<\/p>","images":false},"title":{"name":"5","value":"Jessica throws up over commuter in train"},"version":1},{"date":{"d":22,"m":1,"y":2009},"datev":20090122,"info":{"content":"<p>On the way home from work, it's dark and a lot of traffic about. I'm on the main road travelling 30 or 35mph sitting behind a white van at a reasonable distance.<\/p><p>All of a sudden a car pulls out from a side turning after the van passes the junction. I have a split second to react, skid and slide into the door of the car which pulled out. I catch the car at an angle and bounce of the door and fall into a heap in the middle of the busy road. It all happened so quick.<\/p><p>Then the next bit was strange. I lay in the road, not hurt, but for some reason I didn't get up straight away. It took a couple of seconds. I remained so calm, I wondered if I lay on the road because it was nice to have a rest and a lie down! Mmm. Anyway as I say I'm not sure what happened in those few seconds.<\/p><p>Thankfully the car behind had stopped in time. The car I hit stopped and the 17 year old got out to check I was OK and apologised. I managed to pick the bike up and move it to the side of the road. The chap looked more shaken than myself. I told him not too worry and that it was just an accident. What I was most concerned about was the state of the bike. It was the front wheel that hit the car. It was hard to tell in the dark. I took the chaps details, and just rode home. There didn't seem to be anything of concern. Just the gear peg may have been damaged a bit as it was difficult to traverse through the gears.<\/p><p>I couldn't blame the chap. He didn't see me behind the van, and he would have to push himself out of the junction in order to join the busy road, otherwise he'd be there forever. I could easily do what he's done.<\/p>","images":false},"title":{"name":"7","value":"Motorbike Crash!"},"version":1},{"date":{"d":27,"m":1,"y":2009},"datev":20090127,"info":{"content":"<p>Daddy has been in Manchester for the past 2 days installing his new web application at Greater Manchester Police. Anyway he rode his motorbike and parked at Farnborough Main railway station on Monday morning. On the way home today, Daddy couldn't find his motorbike keys. Looked in pockets and bags, everywhere. Oh know he might have left them on the bike! Convinced that the bike would be stolen, the train pulled up back into Farnborough station and the bike was still there!!! First glanced at the top box, nothing there... the ignition, keys there!!! The motorbike had been sitting in the carpark for 36 hours with the keys in the ignition. Not exactly unnoticable. Daddy laughed.<\/p>","images":false},"title":{"name":"4","value":"Leave keys in motorbike ignition for 2 days at busy carpark!"},"version":1},{"date":{"d":28,"m":1,"y":2009},"datev":20090128,"info":{"content":"<p>For the second time in 6 days Daddy had another motorbike accident. This time it was his fault. He crash into a stationary car on he main Deepcut road. The car was waiting to turn right, and Daddy hadn't noticed he'd stopped and went into the back of him at 30mph!! Ouch. Daddy flung forward and crushed his bits against the petrol tank and ended up on the floor again, this time quite winded. Again shockingly there was next to no damage caused. The chap got out of his car and wasn't best pleased even though there was no damage. It took about 30 mins to get rid of the winding and a few days for the crushing pain to go away!<\/p>","images":false},"title":{"name":"6","value":"Slammed motorbike into a stationary car at 30mph"},"version":1},{"date":{"d":14,"m":3,"y":2009},"datev":20090314,"images":2,"info":{"content":"<p>The Itchen awaited us. Ben and Katie loved walking along, playing around near the bank, pretending to fish. About a mile or so into the walk all of a sudden we hear a splash. Ben has stumbled in and is up to his neck in water. Luckily we were able to drag him out, but he was soaked and muddy from neck to toe! He was not a happy bunny. We had to strip him and mummy and daddy gave up some clothes to stop him from getting cold. He had to sit in Jessica's seat where there was the cosi-toes to keep his legs warm. He looked every so grumpy in the pushchair. Like an old granny.<\/p>","images":false},"title":{"name":"6","value":"Ben falls into river"},"version":1},{"date":{"d":26,"m":3,"y":2009},"datev":20090326,"info":{"content":"<p>The Urban Rebound class included 25 or so others who all enjoyed bouncing up and down on a trampoline. For Daddy it was the first time..... and it showed. He concentrated so hard at keeping on the damm thing he didn't focus on the instructor who barked out the next moves.<\/p><p>Anyway Daddy fell off! The noise echoing around the sports hall and people looking around as they were still bouncing, with a look of disgust at him. All Daddy could do is laugh and get back on, this time with double concentration. He knows what it is like to have big feet!<\/p>","images":false},"title":{"name":"2","value":"Falling off trampoline"},"version":1},{"date":{"d":6,"m":4,"y":2009},"datev":20090406,"images":1,"info":{"content":"<p>Daddy's Great, Great, Great, Great Grandfather's, Cousin's, Great, Great Grandson's, Wife's, Mother's cousin's, great granddaughter is Mummy! Ok admitidly not a close tie, but a tie nonetheless. It would seem the chain of 24 people were all based in Surrey pretty much. The West side based near Midhurst and the Gray's from Chobham.<\/p><p>\u000a        I wonder how many people have managed to actually trace such a distant connection to their spouse? Not many. Please check out the full family tree from\u000a        <a href=\"http:\/\/trees.ancestry.co.uk\/pt\/pedigree.aspx?tid=10182680&amp;pid=-682921136#pedigree=-682919505\">\u000a          Ancestry.com\u000a        <\/a>\u000a        or from my tree\u000a        <a href=\"\/familytree.htm\">\u000a          page\u000a        <\/a>\u000a        .\u000a      <\/p><p>This inbreeeding might explain why our children are like they are!!<\/p><img src='images\/years\/2009\/2009_04_06-MartinLauraRelatedTree.jpg' class='diaryImage' alt='A slice of family tree' \/><p class='diaryImageCaption'>A slice of family tree<\/p>","images":false},"title":{"name":"7","value":"Mummy and Daddy just found out they're related"},"version":1},{"date":{"d":28,"m":6,"y":2009},"datev":20090628,"images":1,"info":{"content":"<p>Later I went for a bike ride up on Mytchett Ranges, where we had gone before for walks. Anyway about a couple of miles in and I coast down this hill which has a big mound at the bottom and to one side.<\/p><p>I cycle past and on the other side there are about 30 soldiers all crouched down with their guns ready to shoot at the target which is about 5 yeards to my right! Woops.<\/p><img src='images\/years\/2009\/2009_06_28-HenleyRanges.jpg' class='diaryImage' alt='I came down the path on the right' \/><p class='diaryImageCaption'>I came down the path on the right<\/p><p>There is just silence, and lots of intimidation. They just stare at me as I trundle past. Even 20 yards past, they say nothing, freeze their positions and just stare. Goodness knows what they must have thought. It dawned on me that they wouldn't be too happy. Anyway 50 yards further and I am out of sight, and a volley of gunfire rattles of into the targets!<\/p><p>Cycling back I noticed that the red danger flags were out.... which I kind of missed. Thinking about it, I now know why I didn't see anyone else on the ranges! Mmmm.<\/p>","images":false},"title":{"name":"8","value":"Faced with the Army at a shooting range, ready to shoot"},"version":1},{"date":{"d":3,"m":11,"y":2009},"datev":20091103,"info":{"content":"<p>Katie got up during the night to go to the toilet, she got to the bedroom door which was shut, and tried to open it. She pulled the handle down, however, the door would not open, she shouted and Mummy woke, Mummy shouted and Daddy woke. Poor Katie was getting in a right state, crying and stressing that she couldn't get out.<\/p><p>Daddy attempted barging the door down, to no avail, took the door handle off, to no avail. Mummy was insisting on getting the fire brigade, Katie insisted on employing the option of jumping from her bedroom window, and Daddy licking his lips at the prospect of getting the circular saw out to cut a hole in the door! 'Mummy I really need the toilet'. Katie calmed down, but Mummy and Daddy heard her whispering a little prayer to herself. 'Please God, let the door open' and some other mutterings. Mummy and Daddy's heart melted, because she was so scared, but had composed herself so well. Ben of course somehow slept through all the noise and commotion.<\/p><p>We ran out of options, so Daddy rang Farfar at 2:30am. Luckily he had not gone to bed yet! Eventually Katie could not hold on any longer. As to not wee on the carpet she had decided she would assemble a pile of clothes and wee'ed on them! Farfar turned up with tools and within 5 minutes had used screwdrivers to force the spring stopper open. The spring was no longer very springy. What a relief. Katie came in and slept with Mummy and Daddy. She had been very brave. However, now she does not like to be in a room where the door is locked. We are very proud of how she handled herself though.<\/p>","images":false},"title":{"name":"3","value":"Katie Locked In Her Bedroom Needing The Toilet"},"version":1},{"date":{"d":4,"m":4,"y":2010},"datev":20100404,"info":{"content":"<p>We played alot of football on the green behind the Elders house. There was one unfortunate incident where Daddy volleyed the ball, quite hard, into Katie's face, right where she had a bruise from the day before. Katie was very brave, didn't cry, just a bit shocked and carried on!<\/p><br \/><div class=\"youtube\"><object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/Wrv93A5108w&amp;hl=en_GB&amp;fs=1&amp;rel=0\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/Wrv93A5108w&amp;hl=en_GB&amp;fs=1&amp;rel=0\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"><\/embed><\/object><\/div><br \/>","images":false},"title":{"name":"5","value":"Football volleyed into Katie's face"},"version":1},{"date":{"d":11,"m":7,"y":2010},"datev":20100711,"images":1,"info":{"content":"<p>After, we went to the green where there was a fair, it was very busy. We all went on the big inflatable slide. Daddy told Ben to bounce his way down to get more of a thrill. He managed to bounce so much, he did a forwards sommersault during his descent. The 'man' told Ben off. Mummy told Daddy off!<\/p><div class=\"youtube\"><object width=\"500\" height=\"405\"><param name=\"movie\" value=\"http:\/\/www.youtube.com\/v\/6eI7J2ZSdiw&amp;amp;hl=en_GB&amp;amp;fs=1?border=1\"><\/param><param name=\"allowFullScreen\" value=\"true\"><\/param><param name=\"allowscriptaccess\" value=\"always\"><\/param><embed src=\"http:\/\/www.youtube.com\/v\/6eI7J2ZSdiw&amp;amp;hl=en_GB&amp;amp;fs=1?border=1\" type=\"application\/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"405\"><\/embed><\/object><\/div>","images":false},"title":{"name":"5","value":"Ben Landing On His Face"},"version":1},{"date":{"d":11,"m":9,"y":2010},"datev":20100911,"images":1,"info":{"content":"<p>Continuing playing football, a boy of about 10 and girl of 8 asked if they could join in. we of course said yes. This was getting to the end of the party and Great Grandma and Grandad were heading off home. They came around to say goodbye to everyone. They got a little confused, grandad gave a hug to the girl, which we thought was a bit friendly, then gave her a kiss goodbye and talked to her probably thinking she was Katie. Daddy and Uncle Michael were a little stunned. Grandma then doddered over and done exactly the same thing. The poor girl didn't know what had hit her. Surrounded by a load of strangers and two old people who they didn't know coming to give her a kiss goodbye. The girl sloped away 5 minutes later!<\/p>","images":false},"title":{"name":"6","value":"Both great grandparents kiss two random children instead of their great grandchildren!"},"version":1},{"date":{"d":29,"m":7,"y":2011},"datev":20110729,"info":{"content":"<p>On the way home from Kent one day, getting on the M25 at Swanley, mummy heard a clunk and something fly off the back of the car. She thought it was the car aerial. It was infact one of the roof bars! How that has not killed someone or caused an accident I don't know.<\/p>","images":false},"title":{"name":"4","value":"Roof bar dumped on M25"},"version":1},{"date":{"d":30,"m":7,"y":2011},"datev":20110730,"info":{"content":"<p>Daddy had planned to take us out on a bike ride down by the Canal at Frimley Lodge Park, cycle to the Mytchett Centre, go on the swings then return. What possibly could go wrong?<\/p><p>Enter, Laura Joy Gay, aka Mummy. As we were about to set off Mummy comes running out in her pyjamas saying she wants to come as well. We can't fit her bike onto the car so Daddy said he'd ride her bike down there, whilst Mummy drives down with all the other bikes on the rack. Daddy impressed on Mummy to be really careful because the bikes on the rack only just fit on, and Ben's bike is basically balancing preariously.<\/p><p>Daddy last 2 yards down the road when he fell off because Mummy had forgot to mention that her handle bars were loose, so that it did not affect the direction you travelled in. It was funny to see Daddy on the fllor. Anyway Daddy managed to tighten up the steering column and off he went. We soon caught up with him on Deepcut road. First speed hump approached, Mummy did not heed Daddy's warnings (apparently she forgot!) and the bikes all jumped in the air, how Ben's did not fall off I do not know! A lucky escape. Daddy couldn not believe his eyes.<\/p><p>When Daddy trundelled into Frimley Lodge park he saw a pile of bikes on the floor in the middle of the road leading into the car park. Mummy hadn't 'appreciated' the 2 metre height limit and the bike came crashing down! Fortunately there was not much other traffic about and not too many scratches. However, Katie's front wheel wouldn't go around anymore! Daddy re-attached the brakes and we were all good again.<\/p><p>We started heading towards Mytchett, Jessica was on the baby seat on the back of Daddy's bike and they followed Ben down some mountain bike trails as Ben called them. However, he stopped seemingly for no reason down a cutting leading daddy to stop abruptly, loosing his balance, causing Jessica to fall sideways into a prickle bush. With all those spots on her face anyway you could almost see the comic value of it all. She howled, Daddy unpricked all the prickles from her hands.<\/p><p>Stress levels also rose when ever we passed a dog off it's lead. Hysterics from Katie and Jessica, as Ben blindly went on up the Canal path, quite close the edge at times! We eventually got to Mytchett only to find the swivel bridge over to the playground had been turned so you couldn't cross. Instead we decided to head back to Frimley Lodge Park and go on their swings. This surprisingly went withough incident.<\/p><p>It was getting late and because of the rack capacity issue, Mummy was going to cycle home. Katie and Ben both also wanted to cycle back with her. Katie didn't want Ben cycling for some reason so tantrums ensued. Daddy and Jessica drove him and got talking to next door. Un be known to them, Katie's peddle had now fallen off her bike causing her to fall off, tears, the lot. Katie, Ben and Mummy walked to Grandma's and phoned for Daddy to pick them up. Daddy was fixing next door's strimmer at this point. It was going past 8pm now. Eventually Daddy got the call to come and collect us! What a trauma.<\/p>","images":false},"title":{"name":"7","value":"A 10 minute bike ride, so many disasters"},"version":1},{"date":{"d":31,"m":7,"y":2011},"datev":20110731,"images":1,"info":{"content":"<p>Daddy had to go to work as his machine had locked up. Having to show his security card he forgot to put it back in his wallet. Anyway after an hour or so he went to the toilet taking his wallet so he could get back in, so he thought. Oh dear. He was locked out of his office. Daddy could see his security card and motorbike keys through the window. There was nothing he could do other than jog the 7 miles home. Well jogging the whole way was a bit optimistic with jeans on in this heat. 5 miles down the line he began to feel pins and needles in his head and legs. Anyway thankfully he made it home just in time to go to Evie's birthday party.<\/p><img src='images\\years\\2011\\2011_07_31-01-CNLWorkLockout.JPG' class='diaryImage' alt='CNL House Lockout' \/><p class='diaryImageCaption'>CNL House Lockout<\/p>","images":false},"title":{"name":"5","value":"Work lockout"},"version":1},{"date":{"d":29,"m":10,"y":2011},"datev":20111029,"images":3,"info":{"content":"<p>Things did not get better when on the M4. We heard a car with a rythmic thumping noise overtake us in the fast lane. The rythmic thump was due to the puncture that the car had incurred but which the occupants did not have full knowledge of. Just as they passed, the car swerved violently in front of us, one way then the other, eventually ending up facing the wrong way on the hard shoulder. Goodness knows how they didn't hit anyone or even damage the car. Oh how we laughed.<\/p>","images":false},"title":{"name":"5","value":"Spinout at 75mph"},"version":1},{"date":{"d":2,"m":11,"y":2011},"datev":20111102,"info":{"content":"<p>Laura was following Martin who was on his motorbike to Pop Pop's 65th birthday meal. It was dark and raining. In Ripley, Martin stopped at a T-Junction a car was coming so waited. However, Laura had other ideas. She pounced and hadn't realized Martin was still waiting at the junction. She went straight into the back of the motorbike, hitting the exhaust quite hard. Fortunately Martin was only pushed into the side of the road and not into the oncoming car. The exhaust stayed firm. The car's body work did not. The exhaust went straight through where the fog lights go. As they parked 10 yards up the road, the car was making an almighty sound. It was the sound of the plastic housing for the fog light scraping along the road under the car. The wheel arch inners was also rubbing against the front wheel. Martin didn't even shout at Laura, instead had to fix the problems. After a bit of jiggery pokery they were off on their merry way again.<\/p>","images":false},"title":{"name":"7","value":"Laura crashes car into Daddy's motorbike"},"version":1},{"date":{"d":14,"m":7,"y":2012},"datev":20120714,"images":6,"info":{"content":"<p>Daddy woke early and was excited about the pending kayaking trip along the Thames. He'd rang the London Port Authority to check and report his plans and monitored when high tide was due and whether it was going to be too windy. It was close to 11am when we pushed Daddy off at the Woolwich Ferry terminal. He'd just received a smart phone from Auntie Susan which meant he could now track where he was and record his progress. Woo Hoo.<\/p><p>The weather was appalling but Daddy didn't mind too much in his new rain jacket and had everything else in waterproof bags. Progress was leisurely to begin with with the odd boat passing by. The water was quite choppy, especially when the container ships passed. The wash was bouncing off the stationary barges which made for a bumpy ride.<\/p><img src='images\/years\/2012\/2012_07_14-06-KayakWoolwich.jpg' class='diaryImage' alt='Setting off from Woolwich' \/><p class='diaryImageCaption'>Setting off from Woolwich<\/p><p>Daddy stayed mostly to the south side of the river which was a bit of luck as he quickly found that the back end of the boat was sinking which meant he had to get to shore quickly before he rolled the Kayak over. The nose of the kayak was riding quite high making balance difficult especially with the choppy conditions. However, the nearest bank was infact mud or silt at Thamemede just by the Crossness Sewage Treatment Works! Daddy managed to land the boat on the mud and got out, knee deep in mud, which as a side note was strangely warm and quite a nice feeling.<\/p><p>Having got out of the boat Daddy tried to empty the boat of water and lifted the pillow which weighed a tonne. Naughtily Daddy had to dump the pillow as he thought that was the reason for the sinking. By this point there were 6 or 7 people watching me struggle around in the mud. The water and pillow was out. A frantic amount of paddling was required to be set free from the bank. However, no change, the nose pointed right up and again Daddy almost rolled the boat. So a hasty return to the bank was made. One of the kids watching asked if I was OK and suggested to move the seat to the middle of the vessel. Good idea!<\/p><p>It took a while to unstrap everything as again Daddy sank into the mud up to his knees. Seat finally moved to the middle, rain still lashing down. Another ungainly entry to the boat which seemed real uncomfortable without the pillow and Daddy was off again successfully. This time balance was returned.<\/p><p>Daddy powered on but had strayed into the middle of the river. Soon the London Port Authority boat had spotted this and rounded on Daddy and basically told him to move to paddling near to the bank. It took quite an effort to get over that far and the manouvre was made under the watchfull eye of the LPA boat!<\/p><p>Soon the Dartford Crossing was upon Daddy. He decided to report into HQ, i.e. Mummy. Coasting on the south side of the river, whilst putting the phone back in the bag, Daddy took the oppotunity to keep his sugar levels up by taking a few Fruit Pastills. He was slowly being sucked into the wooden structs of a pier but didn't make too much effort on attempting to get away, thinking he'll just bounce off it.<\/p><p>Then as quick as anything the Kayak flipped over on its side turning the contents of the boat into the Thames. A wally, two bags and the paddle. Fortunately Daddy raised to the surface quickly and grabbed the kayak, bag and paddle. He saw the bag with phones and wallet and went under water to grab them. However he missed and that was the last we saw of that. Daddy was annoyed and took a few seconds to compose himself as the current was taking him towards the bridge where there would be increased danger with the swells of water. How easy was it going to be to attempt to flip the kayak over and get back in with all the equipment? A meak failed first attempt let Daddy know that it was at least possible. Unknown to Daddy the Kayak was filling with water. More of that in a moment.<\/p><img src='images\/years\/2012\/2012_07_14-08-QE2Bridge.jpg' class='diaryImage' alt='Where the incident happened' \/><p class='diaryImageCaption'>Where the incident happened<\/p><p>A successful roll of the Kayak meant Daddy could clamber back in and set himself to pass under the bridge safely. His goal of getting to Gravesend was now over even though he strangely felt stronger than ever. However, with the weather and having being soaked he knew it was important to quickly get back to shore. The London Port Authority boat mentioned there was a causeway at Greenhithe to get out. This was a 15 minute paddle from the incident.<\/p><p>Land at last. The weather was worse than ever, but it didn't mean too much as Daddy was soaked anyway. He tried to pull the Kayak out of the water as he would normally, but found it difficult. He thought he must have sapped alot of energy up with the previous 10 miles of adventure! After a short rest he tried again and found it pretty difficult to move. He managed to get it clear of water. The tide was lowering so was not too worried about it being swept away whilst he went to look for help.<\/p><img src='images\/years\/2012\/2012_07_14-07-Greenhithe.jpg' class='diaryImage' alt='Greenhithe Pier' \/><p class='diaryImageCaption'>Greenhithe Pier<\/p><img src='images\/years\/2012\/2012_07_14-09-Route.jpg' class='diaryImage' alt='The Route' \/><p class='diaryImageCaption'>The Route<\/p><p>No phone, no money and not many people about in the rain. Daddy wasn't really sure where he was. Fortunately there was a near by pub which Daddy tentatively went into dripping wet. He asked if he could borrow someones phone. He rang his Mum who was able to relay an SOS message to Mummy, who had only just got to Auntie Karens. The people in the pub even got Daddy a coffee.<\/p><p>Laura arrived within half an hour or so. When returning to the Kayak we found the reason for the earlier problems of the nose rising out of the water and the problems of dragging it out of the water. The plug at the back of the boat had fallen out which meant the kayak was steadily filling up with water. Just think of a container floating in the bath. Now fill that container with water, see what happens.<\/p><p>Daddy got a telling off from Mummy and a bigger telling off from his Dad.<\/p>","images":false},"title":{"name":"7","value":"Capsized Kayak at QE2 bridge"},"version":1},{"date":{"d":11,"m":1,"y":2014},"datev":20140111,"images":1,"info":{"content":"<p>The purchase of 162 Frimley Green Road has not gone without incident. After a month in the house we receive a letter from the SRA to say that Ashworth Law, the firm who dealt with our house transaction, had been stopped from trading due to dishonesty claims. We thought we'd be OK because our sale went through a month previously and surely the contracts would have not been exchanged or completed. WRONG! It would appear that the money obtained from our house and the mortgage was used to buy the new house, no problem, however the solicitors failed to get around to paying off 42 Swordsmans Road. As a result, the new occupiers could not register with the Land Registry as our mortgage was still unpaid. Furthermore, the Stamp Duty of £8250 had not been paid off via the Inland Revenue. So not only did the money not get paid, but the contracts were never completed it would appear on the day! What a joke of a conveyancey system this country has. So we have been left with paying off two mortgages, been fined a £100 for late Stamp Duty payment and lobbing out £175 per hour for a new set of solicitors to complete the sale and purchase of the respective houses we own!<\/p><p>An intervening agent is assigned who acts similar to an administrator. They are the ones who freeze the accounts. Nothing comes in or out. They said it will be at least up till the late summer before any sort of resolution can be expected. Even then nothing is guaranteed. In the meanwhile we have filed for compensation via the SRA. In total we are currently £87,000 down.<\/p><img src='images\\years\\2014\\2014_01_11-01-AshworthLawShutDown.JPG' class='diaryImage' alt='Ashworth Law Article' \/><p class='diaryImageCaption'>Ashworth Law Article<\/p>","images":false},"title":{"name":"8","value":"£87,000 down after Solicitor is stopped by SRA for dishonesty"},"version":4},{"date":{"d":26,"m":10,"y":2014},"datev":20141026,"images":2,"info":{"content":"<p>During the extension work, I've painted the new front, side and back of the house a nice Cornish Cream to match the rest of the house. Well so I thought, it matches fine at the front and side, but the rest of the back of the house is a Magnolia colour! Whoops. I painted the back when it was dark, so couldn't really so the difference until the morning.<\/p><img src='images\\years\\2014\\20141028_103518.jpg' class='diaryImage' alt='To the left Cornish Cream, to the right Magnolia' \/><p class='diaryImageCaption'>To the left Cornish Cream, to the right Magnolia<\/p>","images":false},"title":{"name":"4","value":"Paint House The Wrong Colour"},"version":1},{"date":{"d":20,"m":6,"y":2015},"datev":20150620,"images":1,"info":{"content":"<p>We went with mummy for our traditional journey to meet Ma Ma and Pop Pop at the airport from their big holiday. This year we had Auntie Ellie as well. We left in a bit of a rush as Mummy had noted that the plane from Vancouver was 20 minutes early. We rushed down to Gatwick. Jessica said that mummy broke the speed limit! Meanwhile, Daddy received a phone call from Auntie Ellie asking where Mummy was? Daddy said that she left a while a go, but had forgotten her phone. Mmmm.<\/p><img src='images\\years\\2015\\2015_06_20-01-gatwick_sign.jpg' class='diaryImage' alt='Gatwick Airport' \/><p class='diaryImageCaption'>Gatwick Airport<\/p><p>So we waited and waited, but no sign of the tourists! Then Mummy got chatting to this man. Q. What is the flight number? A. I don't know. Q. Where are they flying from? A. I don't really know. Q. What airline is it with. A. Usually BA or Virgin. Ahhhh. Neither of those airlines use Gatwick. They typically use Heathrow!! Then the penny dropped. So Mummy got to a pay phone and tried ringing Ma Ma, however, the one pound got swallowed before they spoke to one another. Meanwhile at Heathrow, the Elders had left for home, Ma Ma and Pop Pop, not knowing we were at Gatwick hung around for ages. Just what you want at the end of the holiday.... when all you want is to get home! Whoops<\/p>","images":false},"title":{"name":"2","value":"Went to wrong airport"},"version":1},{"date":{"d":28,"m":7,"y":2015},"datev":20150728,"images":5,"info":{"content":"<p>After over an hours driving we ended up in the jungle of villas to the east of Albuferia. We had a map, no road name. Portugal don't believe in road name signs or town signs. It is always difficult to know where you are. Every road looks to the same, there are no distinguishing features. We were going around in circles in the right area. Anyway after another U-turn in a side road, daddy unconsciously drove in 'English' mode. Was on the left hand side of the road. Turned out of the junction left, continued slow-ish for about 20 yards. All of a sudden, two oncoming cars appear. Ahhh. We're on the wrong side of the road. Without checking, daddy steered right (onto the correct side of the road), however, some woman was trying to overtake, so as we pulled across we cut her up. She slammed her brakes on, tyres squealing on her car, the smell of rubber masked the other smells which may have slipped out! The woman raised her arms in exasperation. Daddy, sheepishly pulled away. I would question why the woman was trying to overtake when she saw a daft foreigner on the wrong side of the road!<\/p><img src='images\\years\\2015\\2015_07_28-10-Portugal-Day1.jpg' class='diaryImage' alt='Driving wrong side of road' \/><p class='diaryImageCaption'>Driving wrong side of road<\/p><p>After Google Maps told us where we were, we quickly found the villa. First we saw a For Sale sign and then what appeared to be locked gates to the property. Phone calls back to England proved unfruitful. Our Portuguese contact did not answer the phone. Oh dear. We've been sold a pup.<\/p><p>Whilst we were climbing \/ playing \/ mucking around with the gate, Katie managed to 'unlock' it. The property from the outside was gorgeous. Next, the front door - locked. The key inside a mini-safe which we didn't have the paperwork for! Suspected that Daddy threw it away. A call back to Gemma and she gave a few numbers to try. BINGO. Key in the door.... still no entry! After a bit of stress and shaking the door (needed a technique) enter Ali Baba. What an ordeal to get to this point.<\/p>","images":false},"title":{"name":"6","value":"Driving on wrong side of road, two on coming cars and woman trying to undertake!"},"version":1},{"date":{"d":27,"m":2,"y":2016},"datev":20160227,"images":3,"info":{"content":"<p>We climbed the narrow stair wells of Carfax Tower. It was a bitterly cold day and quite windy at the top of the tower. All of the sudden we heard Mummy shriek and start feeling her hair. A pterodactyl had whoopsied on Mummy's head. How we all laughed, except for one person of course. We cleaned mummy up with an empty crisp packet. Credit mummy she allowed us to look at the Oxford views from the top of the tower before we had rush and clean her up.<\/p><img src='images\\years\\2016\\2016_02_27-18-Oxford.jpg' class='diaryImage' alt='Pooping Heck' \/><p class='diaryImageCaption'>Pooping Heck<\/p>","images":false},"title":{"name":"5","value":"Bird pooed on Mummies Head"},"version":2},{"date":{"d":16,"m":7,"y":2017},"datev":20170716,"images":6,"info":{"content":"<p>We went to meet with the boy Elders in Hartney Whitley for a spot of fruit picking. Katie waited in the car, with the keys left beside her.  She was tapping and swiping away on her phone.... not realizing the keys were next to her. In the previous car we had to lock the car from the inside, so she continued this habit..... locking the keys in the car!<\/p><p>Oh dear. Daddy tried ringing the Fars, to no avail. After the fruit pick, there was no other answer but Michael had to drive Daddy home. He got home, but the spare keys to get into the house were not left in the secret hiding place. So now locked out of the house as well! Fortunately (or not, depending on viewpoint), the upstairs bathroom window was ajar. The upstairs bathroom window however is directly above the conservatory. Yes, daddy got a ladder, carefully drop on the glass roof and slowly managed to crawl through the window! Got the spare set of car keys and rode his motorbike to rescue the fruit pickers!<\/p>","images":false},"title":{"name":"2","value":"Locked out of car and house"},"version":3},{"date":{"d":8,"m":7,"y":2018},"datev":20180708,"images":4,"info":{"content":"<p>We went to church as usual, Mummy was on Sunday school. She was running late, so entered the church service and sat in one of the pews. For Sunday School she needed a microphone so the children could be interviewed. The nearest we had was Ben's megaphone which was accidentally left on. This unknown to anyone played havoc with the church's sound system and basically provided feedback. The feedback was so loud, the congregation were blocking their ears. Unknown to anyone the megaphone was the cause of this problem. Some stand in engineers were up on ladders, fiddling around with cables attempting to fix the problem. They even switched off the sound system and yet the feedback was still reverberating around the church. It was then decided that the service could not continue inside, so it was decided that the service should be held outside.<\/p><p>As Mummy went to leave the church to go outside with the others, she picked up the bag and all of a sudden the noise stopped for a bit, and the pitch of the squeal changed. At that point she knew the cause of the problem. The Megaphone!<\/p><p>Instead of owning up or even just removing the bag, mummy panicked and just left the bag inside the church and joined the service outside.<\/p><p>After 10 minutes Mummy had to leave the service to do Sunday school and made Auntie Charlotte go and get the bag which was in church. However, the men who were busy attempting to find the source of the problem were still there. Mummy told Charlotte to grab the bag and quickly escape. Instead, once the bag was moved it became very obvious to everyone the source of the problem! As no one knew her, she just owned up and said it was her sister's and then sheepishly sloped off. After Sunday school we all ran home without talking to anyone.<\/p><p>The parishioners  later were gossiping about the silly girl who brought a megaphone into church. I mean who would do a thing like that.<\/p>","images":false},"title":{"name":"6","value":"Secret Megaphone Evacuates Church"},"version":9},{"date":{"d":29,"m":7,"y":2018},"datev":20180729,"images":8,"info":{"content":"<p>This is a bit of a sob story. Not sure whether to laugh or cry. Myself and Michael had entered the Prudential Ride 100. A 100 mile bike ride, starting and ending in London. As a back-drop to this, I had not done any distance training, and I had the Thursday and Friday off work due to feeling rundown, sore throat and a headache. So going into this I was concerned about my overall physical state.<\/p><p>We had to register on the Saturday at Excel. The traffic around to the opposite end of the M25 meant it was touch and go whether we'd make the 5pm deadline. The journey involved going in Michael's mobile gas chamber. There is a fault, such that exhaust fumes go into the car, so we had to roll the windows down. With just a few minutes to spare, we dumped the car in a pub car park close by, hoping we wouldn't get clamped. We got in just in time. Even managed to get some cheeky photos in.<\/p><img src='images\\years\\2018\\2018_07_29-03-PrudentialRide100.jpg' class='diaryImage' alt='At the show' \/><p class='diaryImageCaption'>At the show<\/p><p> We made our way to the hotel, 'rebuilt' our bikes and watched the Tour De France highlights. After, I went out to the supermarket to get some supplies from Tesco. Got on the bike went around a bend and almost fell off. Rear puncture! Great one of my two inner-tubes used up before I'd even started! Eventually rode the 1.5 mile trip past Excel to a Tesco Express. There were a lot of people shopping and milling about outside. I was a little nervous at leaving the bike right outside, so wheeled it down a barrier'ed slipway to a car park. I went in got yogurt, milk and some fruit. I was panicking a bit, so quickly went out to check. The bike was still there. I went back in again to pay for the shopping. Must have been 2 or 3 minutes. GONE. Bike was nicked.<\/p><img src='images\\years\\2018\\2018_07_29-29-PrudentialRide100.jpg' class='diaryImage' alt='Where has my bike gone. Site of crime!' \/><p class='diaryImageCaption'>Where has my bike gone. Site of crime!<\/p><p>I knew there was no chance finding it. It would have been long gone. I did look around, but nothing. I wasn't so worried about the bike so much, but it had my timing chip on it and the bracket \/ clips for my lights which are going to be hard to replace. Also, what was I going to tell Michael? I started the long trudge back to the hotel and was resigned to the face I wasn't going to do the ride. It was now 9:30pm, I entered the hotel and told Michael what had happened. After he stopped laughing, he hatched a plan which would involve driving 1h 45 minutes back to Alton to pick up his spare bike and drive all the way back again. So windows down in the car for a 3.5 hour round trip plus a bit extra as the bike had no pedals and needed a tweak here and there.<\/p><p>On returning back, I managed somehow to lose the hotel entry card. So we needed to call the receptionist, issue us a new card. We just needed our beds. As soon as we got in our room, I went to the toilet and pressed what I thought was the cord for the light switch. As it was a disabled toilet, it wasn't a cord for the light switch, instead it was the emergency cord! Oh dear. A mini-siren sounded, a flashing red light out the room and the receptionist running towards us. Again this is 2:30 in the morning! After apologising and setting the phone alarm for 2 hours 10 minutes time we finally went to sleep.<\/p><p>4:40am and the alarm went off. What were we doing? Gulped some breakfast down, managed to lose the second of our room cards, and took our stuff out to the car. Michael hid his car key on the tyre of the car, misjudged it and the keys clattered inside the wheel. We just left it for now as we were running behind schedule. The weather was a little nippy as we rode the 6 miles to the start line. The scale of the operation was vast. 29,000 riders all starting from the same area. Myself and Michael, not only had different start times, but also were starting at opposite ends of the Queen Elizabeth Park. So I decided to try and sneak in and start with the 'Greens' at the earlier time.<\/p><p>It was 7:05am and we were finally off. It was nice to get going finally. Within 15 minutes the heavens opened and for the next 8 hours it rained and rained. We hooked on to some fast trains as we snaked our way through London and finally out into the countryside. My 'new' bike was great. Loved it. The seat post needed adjusting, but otherwise the ride was much better than my Giant Defy.<\/p><img src='images\\years\\2018\\2018_07_29-12-PrudentialRide100.jpg' class='diaryImage' alt='To the Tower' \/><p class='diaryImageCaption'>To the Tower<\/p><p>Michael picked up a puncture around the Byfleet area. The stop and the rain made us a little cold so we stopped in for a coffee. We got to Newlands Corner and stopped for a bit, before heading down the fast descent down towards Gomshall. As I raced down, Pssstttt. A wobbly front wheel made me almost lost control as I had a blow out. Damm it, another puncture.<\/p><img src='images\\years\\2018\\2018_07_29-14-PrudentialRide100.jpg' class='diaryImage' alt='Puncture going down Newlands Corner' \/><p class='diaryImageCaption'>Puncture going down Newlands Corner<\/p><p>My turn. We must have spent over 30 minutes trying to sort this out. We had a problem. We changed the tube, pumped it up and as we unscrewed the pump, the valve unscrewed with, making the air come all out. We must have tried 2 or 3 times. It really is exhausting stuff trying to get enough pressure into the tubes. Michael ingenious idea was to tighten the valve to the inner-tube by trapping it in the rear axel with the use of the quick release. This worked a treat and finally we pumped the tyre again, and off we went. Better still there was a track pump just up the road to get me up to the ideal pressure. Also a chap sold his spare inner tube as we had none between us and we hadn't much luck so far. Then down the next hill again and Pssssttttt. Arrrrgghhhh. Another puncture in the same wheel. Something fishy going on now. The tyre sidewall had eroded a bit. We worked out that the brake block was set too low and was rubbing against the tyre, causing the punctures. We happened to fix the puncture at the bottom of the road leading to Netley House, my company's old premises. Again quite a time was spent re-enforcing the tyre with a gel and getting the tyre pumped up. It was still hammering down with rain. Again we were down to no spare inner-tubes between us and now I couldn't use the front brake. We were just entering the really hilly section now!<\/p><img src='images\\years\\2018\\2018_07_29-15-PrudentialRide100.jpg' class='diaryImage' alt='At this point, chucking the bike in the hedge was looking appealing' \/><p class='diaryImageCaption'>At this point, chucking the bike in the hedge was looking appealing<\/p><p>We were diverted past Leith Hill as someone had a heart attack and CPR was being administered by the paramedics. That explained the various ambulances and medical vehicles screaming passed us. I found a track pump, but rather than making things better it made them worse as all the air escaped. It was a rubbish pump. I managed to get back to 40 psi, but it was less than half inflated. It was slow going through Dorking due to the traffic. The organisers had shut Box Hill due to an accident. So we avoided both main hills and it meant we were only going to do 90 miles, not 100. At the next stop there was a bike shop. Yippee.. I managed to get full pressure again in my tyre, but they had sold out of inner tubes. With 25 miles to go we hit another blockage in the road at Leatherhead.<\/p><img src='images\\years\\2018\\2018_07_29-17-PrudentialRide100.jpg' class='diaryImage' alt='Held up in Leatherhead' \/><p class='diaryImageCaption'>Held up in Leatherhead<\/p><p>The rest of the journey back to London was quite pleasurable. The weather started to clear and as I hadn't actually felt we had started, I had plenty of energy to push some pace. We finished at goodness knows in what time. It was largely irrelevant.<\/p><img src='images\\years\\2018\\2018_07_29-22-PrudentialRide100.jpg' class='diaryImage' alt='Finishing down The Mall' \/><p class='diaryImageCaption'>Finishing down The Mall<\/p><img src='images\\years\\2018\\2018_07_29-27-PrudentialRide100.jpg' class='diaryImage' alt='The Medal shot' \/><p class='diaryImageCaption'>The Medal shot<\/p><p>We collected our medals, took some photo's and headed back to City Airport. However, we were determined to do 100 miles. Considering we had done 6 extra miles to get to the start line, we decided to ride back to Tower Hill and catch the DLR. I made it back home at 8pm. What a journey the past 28 hours were. Because my timing chip was stolen it hadn't counted officially, so that means I got to do it again another year. I'm chasing the London Classic medal.\u000a<\/p><a href=\"https:\/\/www.strava.com\/activities\/1739819086\" target=\"_blank\">Route\u000a    \u000a    <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a>","images":false},"title":{"name":"5","value":"Possibly worst bike ride ever"},"version":5},{"date":{"d":15,"m":8,"y":2018},"datev":20180815,"images":2,"info":{"content":"<p>Mummy had booked a 5 seater car as it clearly stated on the email. We arrived at our car and it was a Fiat 500. A small, four seater car. Oh dear. Houston we have a problem. So Daddy went back to the airport terminal to get a 5 seater car. The Europcar lady behind the counter basically wasn't having any of it and said that's the type of car provided for that booking. Daddy pointed out that the sales said we should get a 5 seater car and it would be illegal for the 5 of us to go in the Fiat as it only had 4 seat belts. The Europcar lady replied when asked Daddy said there were only 4 people. Daddy called her a liar, because he hadn't said that. The voices were raised and anger displayed from both parties. At the 'liar' accusation the lady threatened to call the police. Daddy welcomed, this and invited her to do so. Daddy wasn't going away! The lady turned to her next customer, who was listening to this and served them for the next 10 minutes. Daddy waited patiently. After dealing with the customer, Daddy asked where the police were, so the matter could be dealt with...... she hadn't called them. Daddy said she had therefore lied again! Eventually she allowed the use of her phone (which was not available) so Daddy could speak to customer services. They agreed straight away and after a 10 minute heated discussion between the Europcar Lady and Europcar Customer Services, we were granted a 5 seater, Renault Clio! The Europcar Lady still wouldn't have it, and expressed that we should pay more for a 5 seater car. Daddy responded that you shouldn't falsely advertise. The whole getting the car thing took an hour out of our holiday.<\/p><img src='images\\years\\2018\\2018_08_15-05-Tenerife_1-Arrival.jpg' class='diaryImage' alt='Fiat 500 anyone?' \/><p class='diaryImageCaption'>Fiat 500 anyone?<\/p>","images":false},"title":{"name":"3","value":"Within 30 minutes of landing the police were threatened to be called"},"version":3},{"date":{"d":30,"m":9,"y":2018},"datev":20180930,"images":2,"info":{"content":"<p>Daddy was waiting for the Russian to turn up for him to be told he can't take the bike away! Daddy put his motorbike on Autotrader at £750, listing all the problems with it. The most severe was an oil leak. On Thursday he got a phone call from a Russian chap (Russian 1) wanting to come down from Leicester to see it. He arrived after football training in the dark. He could barely speak English. So bad, Daddy had to send the house postcode by text. The Russian brought his friend along (spoke equally as badly) who almost drove it through next door's front window. They were obviously concerned about the oil leak, but they really didn't have a clue about motorbikes. They liked the bike and offered £700 which Daddy accepted. They paid a £300 deposit and said he'll be back on Sunday morning (today) to collect it.<\/p><p>Friday came along and a short email message came through from a chap called Dimitri asking if I knew where the oil leak was. Daddy replied no, and the chap asked to see the bike that evening. Daddy thought it was Russian 1, given the name 'Dimitri' just wanting a closer look at that oil leak. Dimitri emailed to say he's had a job cancelled in Watford and he come down. Bearing in mind this was Friday night rush hour, he must have spent an hour and a half getting from Watford. He arrived and Daddy soon realized Dimitri was not the same person as Russian 1. Massive dilemma. Does he tell this new chap that there is a mistake in identity. Daddy couldn't do this so explicitly seeing he had traveled so far. Daddy's tactic was to exaggerate the oil leak and all the other faults. He did such a bad job that Dimitri offered the full amount and could pay for it all right now! Arrrgghhh. Daddy couldn't say no - what excuse could he have given? So the paper work was done, the only proviso was that he couldn't take the bike away till Monday, during the daytime. So Daddy gave him the keys to the motorbike so he could just ride off.<\/p><p>Daddy then frantically tried to get hold of Russian 1 to say the deal was off. Citing a problem in Daddy's new bike, therefore needing his old bike. Over a dozen calls and texts were sent during the Saturday and Sunday and no reply.<\/p><p>Daddy was very nervous. What if Russian 1 just turned up, having not read any of the messages, seeing the motorbike in driveway and wondering why he couldn't drive it away. Fortunately, he didn't turn up. Not a peep. Perhaps he'd forgotten.<\/p><p>In the end Russian 1 contacted Daddy a few days later, and was ok about the situation. It then took another week for the deposit money to be returned as there was an issue with receiving SMS texts from him. Daddy feels he got away with that one.<\/p><img src='images\\years\\2018\\2018_09_17-14-SellingMotorbike.jpg' class='diaryImage' alt='The silver bullet has got to go' \/><p class='diaryImageCaption'>The silver bullet has got to go<\/p>","images":false},"title":{"name":"4","value":"Sold motorbike to two different Russians"},"version":8},{"date":{"d":10,"m":11,"y":2018},"datev":20181110,"images":5,"info":{"content":"<p>Reaching the cable cars by the volcano took a lot longer than expected. Five and half hours predominantly in first gear (28 cassette). The final 3 miles had quite an ascent. Daddy was still going up hill after the cable cars. Dusk was forming. The views were amazing. Some sand dunes, strange rock formations and a dried lava river. Fantastic. The light was drawing in quick and as the sun descended and the shadows grew, the temperature dropped as Daddy started his descent down the north side. Cars had there lights on, Daddy unfortunately had no front light and the back had run out of battery. However, not a problem in the semi light, Daddy descended at a steady pace. Within the next mile or two, close to Portillo Alto, the skies were clear and the moon could be seen clearly. Still enough to descend. Now the rocky landscape changed to pine trees lining the roads. This meant what little light there was had now gone. Daddy was freezing, especially on the hands. He was shivering so much it slowed him down as his bike wobbled down the hill. With no light Daddy chose to use the maps on his phone to know when a bend was coming up. Fortunately most of the traffic had gone, but there was still the odd car coming down the mountain. Whenever car lights were seen from behind, Daddy thought it best to stop and go into the side of the road. Daddy had managed to descend about 1000 metres like this. <\/p><img src='images\\years\\2018\\2018_11_10-14-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='It's getting darker. I can see the moon' \/><p class='diaryImageCaption'>It's getting darker. I can see the moon<\/p><p>Another car came from behind quite quick and Daddy went to the side of the road on a bend. However, he couldn't see the side of the road and misjudged it. He rode into the gutter \\ ditch. He fell off into the gutter, his bike ended on the road, on the bend. Fortunately the car behind swerved around it, the car following also managed to somehow miss it! Daddy picked himself up, brushed himself down. He sustained a bruised elbow and a small cut to the knee. The bike however had a buckled wheel and was un-rideable.<\/p><p>As there was no place to stop, the two cars went 50 yards down the road and then stopped. Both drivers spoke to each other in English. Daddy could hear that they were saying I was stupid for riding down a mountain with no lights.The second was accusing the first of hitting Daddy! Daddy assured them it was his fault and apologised profusely. They both offered to take Daddy down the mountain in the car. Daddy had already international rescue, aka Michael to pick him up. The first driver who was a German tourist offered to take Daddy back to the villa with the bike. A little taken aback from his generosity, Daddy politely refused and urged him to continue on his travels. Michael was an hour away. The German tourist insisted in staying until Michael arrived. He left his car lights on so Michael could see where we were. After conversations about WWII, Brexit and the car industry, he noticed that the car lights dimmed. He tried starting his car, but all that was heard was tick, tick, tick! Oh no. His battery was now flat.<\/p><p>The obvious solution was to push start the car, but both were unsure. What happens if that was not the problem and the car was pushed down the mountain in the pitch black, little on the brakes (servos no power) and no place to rest up if it didn't work. With Daddy's luck he envisaged pushing the German off the mountain to his death!<\/p><p>Michael arrived and with some convincing the car was bump started and all was good. The adventure was over. Goodbyes were said. Michael laughed at Daddy.<\/p><a href=\"https:\/\/www.strava.com\/activities\/1957848159\" target=\"_blank\">Route\u000a        <img class=\"image-icon\" src=\"\/Scripts\/components\/navigation\/images\/strava.png\" \/><\/a><img src='images\\years\\2018\\2018_11_10-15-TeneriffeCycling_2-TiedeAllTheWay.jpg' class='diaryImage' alt='Corner I crashed at on the right, but in the pitch black' \/><p class='diaryImageCaption'>Corner I crashed at on the right, but in the pitch black<\/p>","images":false},"title":{"name":"8","value":"Riding down Spain's highest mountain with no lights in pitch dark. Crashed. Car almost hits me, tourist gets flat car battery"},"version":1},{"date":{"d":23,"m":3,"y":2019},"datev":20190323,"images":1,"info":{"content":"<p>Daddy motorbiked home from Ben's Sky Diving experience along the M3. A week previous Daddy managed to sustain a puncture and got it plugged. Daddy raced home at 80mph along the motorway. He felt the handling a little strange, but put it down to having a hypo. By the time he got to Hook he lost confidence a bit and slowed down. It felt like the handlebars and the rest of the bike were attached via string or Sellotape. Steering seemed weird. Just as he was coming off at junction 4, he noticed a group of lads staring at the bike. Suspicious he stopped on the hard shoulder, felt the back tyre. Completely flat and scorching hot. No wonder people were looking. How did he manage to go at 60mph on a flat down the motorway? He managed to nurse the bike back home at 15mph. The sidewall had been damaged. After taking the bike in for a new tyre, Barry said the original puncture had re-appeared as well as a new one. Lucky to stay upright!<\/p><img src='images\\years\\2019\\2019_03_23-01-Puncture.jpg' class='diaryImage' alt='Tyre off the rim' \/><p class='diaryImageCaption'>Tyre off the rim<\/p>","images":false},"title":{"name":"4","value":"Puncture on motorbike at 80mph"},"version":5}],"version":-1211819525}